{
  "id": "topic_5411426",
  "title": "348Judah",
  "author": "348Judah",
  "created_time": "August 27, 2022, 02:02:06 PM",
  "content": "Cryptocurrency Operations has been laid to halt in Afghanistan and the usage forbidden in the region as it is believed to have been the root in perpetrating fraud and the new regime of the Afghan leaders, the \"Taliban\" have directed everyone in the country to desist from it acceptance, usage and transactions involving cryptocurrency for making payments while it has banned the commercial banks from it either, many have been arrested for contributing to the use of cryptocurrency by engaging in trading crypto tokens and other related activities that supports the engagement of cryptocurrency within the rule of the Taliban regions in Afghanistan.The Taliban leadership believed cryptocurrency as an aid in denying them have access over the control of the people's asset as cryptocurrency is believed to be a decentralized digital network whereby anyone can independently secure his financial assets without the rule of the Taliban, this is what they believed as against their ethics in the country and further places engaging cryptocurrency or uses attracts a purnishable act.Quote“The central bank gave us an order to stop all money changers, individuals, and businesspeople from trading fraudulent digital currencies like what is commonly referred to as Bitcoin,”https://www.bloomberg.com/news/articles/2022-08-26/taliban-ban-crypto-in-afghanistan-arrest-digital-coin-dealersOver 20 businesses associated with cryptocurrency had been shut down in Afghanistan and the whole engagement of it has been banned just as in the case of China, hasn't this been an end to cryptocurrency in Afghanistan? or p2p can be use to circumvent the ban but if caught it's a purnishable offense.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411426",
  "comments": [
    {
      "author": "goaldigger",
      "created_time": "August 27, 2022, 02:12:19 PM",
      "body": "Quote from: 348Judah on August 27, 2022, 02:02:06 PMOver 20 businesses associated with cryptocurrency had been shut down in Afghanistan and the whole engagement of it has been banned just as in the case of China, hasn't this been an end to cryptocurrency in Afghanistan? or p2p can be use to circumvent the ban but if caught it's a purnishable offense. Probably an end for now, but sooner or later for sure they will accept it again just like what happened on many countries where they ban and unbanned Bitcoin. P2P might still be the option  but of course, if you get caught that you'll face consequences. You can choose to travel abroad but I think it's not worth it if you are just holding small crypto, you just need to hold for now and secure that wallet. The market in Afghanistan is not that big, and they are experience a lot of problem since Taliban takes over their country, for now crypto user there should take cautious and avoid being caught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 27, 2022, 03:08:24 PM",
      "body": "Afghanistan is like a newly independent country that has to start everything by approaching and exploring in such a way with great care and firmness. Don't know their new system of government yet but a bit like China, that's the way if they want to control the whole flow of finances while most of the population is still not accepting with the new rulers or maybe there are some rebels from them who are still under suspicion thus giving birth to this policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 27, 2022, 07:05:24 PM",
      "body": "Let's think about why they need it?It is impossible to ban cryptocurrency if the Internet is not blocked.The first thought is to prevent the withdrawal of savings to other countries. If so, then over time the bans should be lifted.Another thought is that it is not possible for opponents of the government to receive funding from other countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptock",
      "created_time": "August 27, 2022, 07:13:20 PM",
      "body": "Quote from: zasad@ on August 27, 2022, 07:05:24 PMLet's think about why they need it?It is impossible to ban cryptocurrency if the Internet is not blocked.The first thought is to prevent the withdrawal of savings to other countries. If so, then over time the bans should be lifted.Another thought is that it is not possible for opponents of the government to receive funding from other countries.Taliban has their way working and they don't listen to anyone. They have different mind set - and its not an easy task to mould their minds. So what they decided will stay there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "August 27, 2022, 07:33:29 PM",
      "body": "Quote from: Cryptock on August 27, 2022, 07:13:20 PMQuote from: zasad@ on August 27, 2022, 07:05:24 PMLet's think about why they need it?It is impossible to ban cryptocurrency if the Internet is not blocked.The first thought is to prevent the withdrawal of savings to other countries. If so, then over time the bans should be lifted.Another thought is that it is not possible for opponents of the government to receive funding from other countries.Taliban has their way working and they don't listen to anyone. They have different mind set - and its not an easy task to mould their minds. So what they decided will stay there. There is many things going wrong now in the world and I still don't get it why the taliban would have to ban crypto when it is a way for people that are not so financially bouyant or have better things during can get into crypto and find a greenerpasture. How I hope the taliban would understand the benefits of Bitcoin and Cryptocurrency at large. Bitcoin had made many investors to be millionaires and more people are going to be financially stable by the time the crypto market becomes stable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "August 27, 2022, 07:54:04 PM",
      "body": "Quote from: noorman0 on August 27, 2022, 03:08:24 PMAfghanistan is like a newly independent country that has to start everything by approaching and exploring in such a way with great care and firmness. Lol,,, such a funny start but it does make a point. They are a young government and it was only a matter of time before they exercise policies such as these that tries to undermine and limit the rights of citizens in a bid to ensure complete control over its populace and finances.Like many other nations before them, crypto would continue to be used through p2p systems and even in a more radical way too as, it is not just a means to transacting but a source of livelihood to most. The laws and restrictions would be there and the people would still try out there rights to own properties or assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 27, 2022, 08:19:56 PM",
      "body": "Most of the Taliban's policies seem to 'keep' their own ways and their own things on their own without having to rely much from the West in a lot of things. Probably a good thing for Afghanistan for it to retain its identity but it won't hurt for them to try some of freedom on their laws and how they do things. Cryptocurrency will still most certainly be used on a lot of things there, with it just being discreet. There isn't anything that can stop crypto to spread even if there are already written laws against it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 27, 2022, 09:29:35 PM",
      "body": "Quote from: Cryptock on August 27, 2022, 07:13:20 PMQuote from: zasad@ on August 27, 2022, 07:05:24 PMLet's think about why they need it?It is impossible to ban cryptocurrency if the Internet is not blocked.The first thought is to prevent the withdrawal of savings to other countries. If so, then over time the bans should be lifted.Another thought is that it is not possible for opponents of the government to receive funding from other countries.Taliban has their way working and they don't listen to anyone. They have different mind set - and its not an easy task to mould their minds. So what they decided will stay there. What is interesting in this example is that the Taliban is classified as a religious extremist organization that is classified as a terrorist by many countries. When I find that he adopts a position on new technology, this in itself is a cause for surprise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AjithBtc",
      "created_time": "August 27, 2022, 10:53:38 PM",
      "body": "Quote from: noorman0 on August 27, 2022, 03:08:24 PMAfghanistan is like a newly independent country that has to start everything by approaching and exploring in such a way with great care and firmness. Don't know their new system of government yet but a bit like China, that's the way if they want to control the whole flow of finances while most of the population is still not accepting with the new rulers or maybe there are some rebels from them who are still under suspicion thus giving birth to this policy.Yes, from their announcement it is something close to China. As a country they always try to stay away from the rest of the nations developing each and everything separately. This can be good, but the same won't help everytime. Afghanistan goes one step above China in some important needs like education, where women and men are allocated with different timings on schools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "August 27, 2022, 11:27:54 PM",
      "body": "Quote from: 348Judah on August 27, 2022, 02:02:06 PM~Over 20 businesses associated with cryptocurrency had been shut down in Afghanistan and the whole engagement of it has been banned just as in the case of China, hasn't this been an end to cryptocurrency in Afghanistan? or p2p can be use to circumvent the ban but if caught it's a purnishable offense. If the Taliban regime imposed a ban on cryptocurrency trading even in a hypothetical situation if i was living their, i would not conduct any P2P transaction even if everyone convinces me that it is a safe proof method because you never know what kind of punishment you will receive in the unfortunate situation someone from the government try to infiltrate the P2P transactions to catch users making these transactions .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "August 28, 2022, 01:34:56 AM",
      "body": "Taliban is the illegitimate fascist government of Afghanistan. This is akin to North Korea banning crypto currency. Has no effect on the crypto economy, and I would have already made the presumption that cryptocurrency was banned the moment they took over.Quote from: goaldigger on August 27, 2022, 02:12:19 PMYou can choose to travel abroad but I think it's not worth it if you are just holding small crypto, you just need to hold for now and secure that wallet. The market in Afghanistan is not that big, and they are experience a lot of problem since Taliban takes over their country, for now crypto user there should take cautious and avoid being caught. I would highly advise against this, as the Taliban are known to execute innocent Afghan citizens on a whim. Getting caught with crypto currency sounds like the death penalty. Is it worth it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 28, 2022, 05:41:17 AM",
      "body": "I used to think that cryptocurrency is actually advantageous rather than disadvantageous to the Taliban because they are importing illegal drugs around the world. The Taliban has been earning hundreds of millions of dollars a year from narcotics. It's probably one of their main sources of income. Well, perhaps they don't need crypto for this kind of transactions. Fiat and the banks are probably the more convenient options for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 28, 2022, 11:44:14 AM",
      "body": "Just watch all the prohibitions that the Taliban have imposed. Are there reasonable restrictions? Should this be surprising? Anything related to freedom is not allowed. The government thinks that it can only govern Afghanistan by force. Sometimes it works. In addition, many residents of Afghanistan have a very low level of education. And it is for them that owning a bitcoin can be a difficult science. Therefore, it is hoped that the government will be able to improve the standard of living and literacy of its people. And after that, they will think about revising the ban on cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 28, 2022, 01:37:54 PM",
      "body": "Quote from: Darker45 on August 28, 2022, 05:41:17 AMI used to think that cryptocurrency is actually advantageous rather than disadvantageous to the Taliban because they are importing illegal drugs around the world. The Taliban has been earning hundreds of millions of dollars a year from narcotics. It's probably one of their main sources of income. Well, perhaps they don't need crypto for this kind of transactions. Fiat and the banks are probably the more convenient options for them.From September 2021 there is a big problem in the banking sector.Taliban bans drug cultivation, including lucrative opiumhttps://www.reuters.com/world/asia-pacific/taliban-bans-drug-cultivation-including-lucrative-opium-2022-04-03/It was when the Americans controlled Afghanistan that drug production grew there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "August 28, 2022, 01:41:21 PM",
      "body": "Quote from: 348Judah on August 27, 2022, 02:02:06 PMOver 20 businesses associated with cryptocurrency had been shut down in Afghanistan and the whole engagement of it has been banned just as in the case of China, hasn't this been an end to cryptocurrency in Afghanistan? or p2p can be use to circumvent the ban but if caught it's a purnishable offense. It seems the Taliban forgot that when they fought against governments in the past, it was also a fact that to finance their wealth they used crypto transactions to avoid risk. Now the funny thing is that after controlling the government, the leader made a policy towards the people to ban the use of crypto. It sounds ridiculous but from an economic point of view, we see the Taliban getting support from China in building infrastructure. Restoring the devastated territory was China's offer at the time. Now there is a policy that reverses direction. This means that they cannot control financial control if they legalize cryptocurrencies in areas that are still under development. They forget that the guns they buy come from money laundering. maybe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 28, 2022, 01:57:57 PM",
      "body": "Quote from: naira on August 28, 2022, 01:41:21 PMQuote from: 348Judah on August 27, 2022, 02:02:06 PMOver 20 businesses associated with cryptocurrency had been shut down in Afghanistan and the whole engagement of it has been banned just as in the case of China, hasn't this been an end to cryptocurrency in Afghanistan? or p2p can be use to circumvent the ban but if caught it's a purnishable offense. It seems the Taliban forgot that when they fought against governments in the past, it was also a fact that to finance their wealth they used crypto transactions to avoid risk. Now the funny thing is that after controlling the government, the leader made a policy towards the people to ban the use of crypto. It sounds ridiculous but from an economic point of view, we see the Taliban getting support from China in building infrastructure. Restoring the devastated territory was China's offer at the time. Now there is a policy that reverses direction. This means that they cannot control financial control if they legalize cryptocurrencies in areas that are still under development. They forget that the guns they buy come from money laundering. maybe  Not very surprising. They used to be using cryptocurrency and now they are banning it. They now know the burdens of governing a country where they have no control over the people's wealth.But most government are up for control so there is nothing to be surprised of.  They could really issue CBDC, this way they can also survey everyone. Since they are legitimized by China, then they can ask support from China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "August 28, 2022, 02:04:51 PM",
      "body": "Quote from: lovesmayfamilis on August 28, 2022, 11:44:14 AMJust watch all the prohibitions that the Taliban have imposed. Are there reasonable restrictions? Should this be surprising? Anything related to freedom is not allowed. The government thinks that it can only govern Afghanistan by force. Sometimes it works. In addition, many residents of Afghanistan have a very low level of education. And it is for them that owning a bitcoin can be a difficult science. Therefore, it is hoped that the government will be able to improve the standard of living and literacy of its people. And after that, they will think about revising the ban on cryptocurrencies.Well, I'm not surprised! They have some crazy laws in my opinion, but I am open-minded! Education opens up one's mind, and that's not working for the Taliban government, so I don't think they will try to improve their educational system in the right way, they will probably work on spreading their \"way of seeing the world\" among Afghanistan people! Those who think differently from the government can only run away from there, otherwise, they can only have problems if they are open about it! It's not like Afghanistan is not the only example, sadly there are similar countries...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "August 28, 2022, 03:00:36 PM",
      "body": "Quote from: cabron on August 28, 2022, 01:57:57 PMNot very surprising. They used to be using cryptocurrency and now they are banning it. They now know the burdens of governing a country where they have no control over the people's wealth.But most government are up for control so there is nothing to be surprised of.  They could really issue CBDC, this way they can also survey everyone. Since they are legitimized by China, then they can ask support from China.It all makes sense, boosting the Afghan economy and wanting to be recognized as a country they have to adapt to but still not bow to the US. As their consistent resistance. We know that the realm of Afghanistan cannot be touched by the US, therefore China has the opportunity to negotiate as a form of achieving the same goal. The agreement provides China with a high-speed rail line and expands the coverage sector. Once again doing business with China is the path taken by the current Afghan government.Including the policy that China will continue to intervene, as a strong ally of China to take risks and open loans as long as it benefits them in building the One Belt One Road route or now known as the Silk Road Economic Belt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 28, 2022, 03:13:42 PM",
      "body": "Quote from: naira on August 28, 2022, 03:00:36 PMQuote from: cabron on August 28, 2022, 01:57:57 PMNot very surprising. They used to be using cryptocurrency and now they are banning it. They now know the burdens of governing a country where they have no control over the people's wealth.But most government are up for control so there is nothing to be surprised of.  They could really issue CBDC, this way they can also survey everyone. Since they are legitimized by China, then they can ask support from China.It all makes sense, boosting the Afghan economy and wanting to be recognized as a country they have to adapt to but still not bow to the US. As their consistent resistance. We know that the realm of Afghanistan cannot be touched by the US, therefore China has the opportunity to negotiate as a form of achieving the same goal. The agreement provides China with a high-speed rail line and expands the coverage sector. Once again doing business with China is the path taken by the current Afghan government.Including the policy that China will continue to intervene, as a strong ally of China to take risks and open loans as long as it benefits them in building the One Belt One Road route or now known as the Silk Road Economic Belt.But they shouldn't be too confident that China will not intervene politically.  China will also work like how US did. As for now they will just say the Chinese will deploy their own military to protect their investments in the country like the railways and businesses thru the BRI. They already started in Sri Lanka where they deploy their spy ship in the guise of protecting the port they've rent for like a hundred years. Sooner a military base is possible.What  Afghanistan need is to also improve their military not just in terms of economic, that they are capable of fighting back and preventing invasion. Its why they have to become rich as well through having their own CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}