{
  "id": "topic_5430551",
  "title": "fennic",
  "author": "fennic",
  "created_time": "December 20, 2022, 02:35:31 PM",
  "content": "Today I was wondering that if I am correct than Bitcointalk was created in 2009, and mostly Satoshi was the owner and than he or his organization has been Ghosted and it's account is offline. So I was wondering that who pays Domain Name service fee per year. And it could not be free. And still how this website is running?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430551",
  "comments": [
    {
      "author": "Mr.right85",
      "created_time": "December 20, 2022, 02:49:33 PM",
      "body": "The website or forum works on an Simple Machine Forum (SMF) software, providing messaging services for the bulk of forum users.Although Satoshi Nakamoto might have ghost out on the forum as we hope to believe or perhaps he or she or group is here with us with another name, one thing we know for sure is that, the forum still has its management that runs it in the person of Theymos. We've also got Cyrus to help, along with a host of other admins.The forum has a way of generating income and so, running itself or having funds to run the forum is a no question. It has a good enough traffic on it too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 20, 2022, 02:52:38 PM",
      "body": "Either Theymos or Cyrus pays the fees. Not really sure which one of them. Not that it matters though because 1) they have hundreds of Bitcoin to pay it off with and 2) the domain is likely paid for several years in advance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 20, 2022, 11:25:30 PM",
      "body": "The forum doesn't host itself too, it's hosted by aws (amazon Web services) afaik and also has protection from cloud flare. Both of these being run on the forum will make the fees paid for domain renewals seem extremely tiny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 20, 2022, 11:47:40 PM",
      "body": "In addition to the posts above the expenses for the domain and hosting of this forum came from donations and ads. Quote from: Mr.right85 on December 20, 2022, 02:49:33 PMAlthough Satoshi Nakamoto might have ghost out on the forum as we hope to believe or perhaps he or she or group is here with us with another name, one thing we know for sure is that, the forum still has its management that runs it in the person of Theymos. We've also got Cyrus to help, along with a host of other admins.I guess Cyrus might be Satoshi since he is the co-admin here or maybe another forum name that not actively posting here but is always online to monitor the forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "December 21, 2022, 06:46:22 AMLast edit: December 21, 2022, 08:44:45 AM by shahzadafzal",
      "body": "Quote from: fennic on December 20, 2022, 02:35:31 PMToday I was wondering that if I am correct than Bitcointalk was created in 2009, and mostly Satoshi was the owner and than he or his organization has been Ghosted and it's account is offline. So I was wondering that who pays Domain Name service fee per year. And it could not be free. And still how this website is running?Regarding the Bitcointalk.rog ownership theymos clarified many times2017:Quote from: theymos on October 08, 2017, 08:37:14 PMWrong. bitcoin.org is ultimately controlled by Cobra, who was given it by Sirius, who was given it by Satoshi. The bitcointalk.org domain name is similarly controlled by Cobra, while I administrate the site.2018:Quote from: theymos on April 08, 2018, 09:41:45 PM Bitcoin.org: - Cobra has ultimate control over the domain name. I have access to the domain name settings. - Cobra runs the server. - Will Binns holds the BTC. Bitcointalk.org: - Cobra has ultimate control over the domain name. I have access to the domain name settings. - I run the server. Cobra has no access to the database or server. - The BTC is held by myself and the treasurers. Cobra has no access. I am not Cobra. What would even be the point of that? 2019:Quote from: theymos on April 09, 2019, 05:05:22 AMIt's surprising how well-documented history can become totally forgotten... Satoshi created the forum on Nov 22, 2009, and was head administrator until almost 2011. Then Sirius was head administrator until 2012, which is when I took over.Cobra also owns the bitcointalk.org domain name. I consider the forum to be basically owned by or at least dedicated to the Bitcoin community, though; I don't call anyone an owner of the forum.So regarding the question, who pays for the bitcointalk.org domain? Of course the owner and that means Cobra should be paying for the domain name fee.Next question who's paying for the hosting, SSL and cloudflare etc then answer is theymos, since theymos is the ultimate administrator of the forum then he should be paying all the expense and remember forum have enough funds in BTC to support the forum until 2140.Just to give you an idea, not a single bitcoin satoshi has been spent from this stash of 1250 BTC since 2013 https://bitcointalk.org/index.php?topic=155000.0 now imagine and be proud of how rich our forum is.After 2140 Satoshi will take over everything.Edit: Thanks to @tranthidung2020:Quote from: theymos on April 17, 2020, 07:13:47 PMCøbra no longer has any access to the bitcointalk.org domain name. Conclusion: Everything (finance/administration etc) related to bitcointalk.org is under theymos, he doin it on behalf of the Bitcoin Community If theymos disappears?Quote from: theymos on May 26, 2019, 12:07:11 AMShould I disappear, Cyrus and/or others-I've-established will take over day-to-day operations and decision-making. You and the non-profit organization would act as checks upon them and each other to ensure that the forum doesn't just turn into some business, but would continue to have a \"soul\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 21, 2022, 08:25:31 AM",
      "body": "Quote from: shahzadafzal on December 21, 2022, 06:46:22 AMRegarding the Bitcointalk.rog ownership theymos clarified many timesYou missed this one  Domain name update. Next times, when you need to find Bitcointalk's important historical changes, you can start with my topic. If you find something I missed, please let me know for updates.QuoteSo regarding the question, who pays for the bitcointalk.org domain? Of course the owner and that means Cobra should be paying for the domain name fee.Should be theymos since 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "December 21, 2022, 08:35:40 AM",
      "body": "Quote from: tranthidung on December 21, 2022, 08:25:31 AMYou missed this one  Domain name update. Next times, when you need to find Bitcointalk's important historical changes, you can start with my topic. If you find something I missed, please let me know for updates.QuoteSo regarding the question, who pays for the bitcointalk.org domain? Of course the owner and that means Cobra should be paying for the domain name fee.Should be theymos since 2020.  You got me, sorry I'm one year late.Your thread is a treasure and will keep it on my watch list. I will update my post for my own reference, thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 21, 2022, 11:08:04 AM",
      "body": "Quote from: fennic on December 20, 2022, 02:35:31 PMSo I was wondering that who pays Domain Name service fee per year. And it could not be free. And still how this website is running?There are many mods/admins on the site, didn't you wonder how they were chosen, how are they paid? And who appointed them?Hosting fees is more than Domain Name service fee, BTT has many signature campaigns that pay more than a thousand dollars per week means that the cost of the site is much higher than the domain renewal fee.The site also serves a paid service (copper account,) which is greater than the domain fee.Also, the site can ask for donations, which I am sure will be higher than the domain renewal fee.So it is not a problem.The problem is hosting fees, website development, keeping spam low, taxes etc, and the forum has enough coins to cover that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "December 21, 2022, 11:38:44 AM",
      "body": "Quote from: jackg on December 20, 2022, 11:25:30 PMThe forum doesn't host itself too, it's hosted by aws (amazon Web services) afaik and also has protection from cloud flare. Both of these being run on the forum will make the fees paid for domain renewals seem extremely tiny. The forum is currently registered on Namecheap and was last paid in 2019 and extension of the domain is up to 2029Domain:bitcointalk.orgRegistrar:NameCheap, Inc.Registered On:2011-06-24Expires On:2029-06-24Updated On:2019-11-24Namecheap usually charges $12 to $15 and could go as high as $30 depending on the add ons the safety seal certificate is not included in the domain and should be renewed every year but I guess the owners pay it one time so there will be no interruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 21, 2022, 11:50:52 AM",
      "body": "Quote from: BitMaxz on December 20, 2022, 11:47:40 PMI guess Cyrus might be Satoshi since he is the co-admin here or maybe another forum name that not actively posting here but is always online to monitor the forum?This means that Satoshi could be anyone, not necessarily someone who is an administrator and spends a lot of time online. Actually, it doesn't matter who Satoshi is, there are good reasons why it should remain a secret. However, it is fascinating how people conclude that it could be this or that person, often without any evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "December 21, 2022, 12:06:54 PM",
      "body": "Quote from: Saisher on December 21, 2022, 11:38:44 AMNamecheap usually charges $12 to $15 and could go as high as $30 depending on the add ons the safety seal certificate is not included in the domain and should be renewed every year but I guess the owners pay it one time so there will be no interruption.There is the auto-renew feature so no worries on letting it expire. Hosting meanwhile, costs way more than renting the domain name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "December 21, 2022, 01:36:50 PM",
      "body": "Quote from: fennic on December 20, 2022, 02:35:31 PMToday I was wondering that if I am correct than Bitcointalk was created in 2009, and mostly Satoshi was the owner and than he or his organization has been Ghosted and it's account is offline. So I was wondering that who pays Domain Name service fee per year. And it could not be free. And still how this website is running?You just raised an important question that I had never imagined before. But, if my calculations are correct, the forum's statistics and the traffic generated by campaigns advertising here make purchasing a domain easy. Even if it costs 1BTC per year to renew the domain, I don't think it will be difficult to get a raise from management, especially since I'm sure there are employees here who are compensated for their efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "December 21, 2022, 01:38:23 PM",
      "body": "Whoever buys the domain is surely not bought for a year . Probably the domain has been bought for a long period, and it is clear that the mods who are controlling the forum has access to the admin panel or developer panel, where they can run the site and take care of all the website-related activity needed to run the site. Satoshi is not ghosted. He planned everything so well that after 13 years, the site is running like butter. The group of people who are running the site is taking care of the domain and hosting renewal too, and one thing I can say is that Theymos himself is the leader of that group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 21, 2022, 03:18:40 PM",
      "body": "Quote from: NdaMk on December 21, 2022, 01:36:50 PMQuote from: fennic on December 20, 2022, 02:35:31 PMToday I was wondering that if I am correct than Bitcointalk was created in 2009, and mostly Satoshi was the owner and than he or his organization has been Ghosted and it's account is offline. So I was wondering that who pays Domain Name service fee per year. And it could not be free. And still how this website is running?You just raised an important question that I had never imagined before. But, if my calculations are correct, the forum's statistics and the traffic generated by campaigns advertising here make purchasing a domain easy. Even if it costs 1BTC per year to renew the domain, I don't think it will be difficult to get a raise from management, especially since I'm sure there are employees here who are compensated for their efforts.It not going to cost that high I have renews a lot of my domains some on auto and Namecheap charge me $12 to $16 but right now it's hard to buy a domain with the word Bitcoin on it and if even you find out that sometimes it costs a lot up to $5k but renewing is cheap, I'm glad that domain will expire on 2029 and hosting is also taken care of the admin team.Bitcointalk.org is one of a kind there will be no Cryptocurrency forum like Bitcointalk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 21, 2022, 09:24:34 PM",
      "body": "I am not sure of how much it will cost for the owner to pay the domain fee per year or even pay in advance to avoid interruptions. Let's put that aside since there's a reply or post about who will pay the domain fee per year which is already obvious who will pay for it either the owner, co-owner or both of them will/might pay for the domain fee per year. The question is, who is/are the owner of the said domain name as of now?. The answer is what shahzadafzal posted and also what tranthidung posted. My opinion is that the money that will be use to pay may came from what the forum received when a forum user buy copper membership status. According to what Saisher provided that the domain will expire on 2029 so, it is possible not to pay domain fee for years due to expiry on year 2029.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}