{
  "id": "topic_5418894",
  "title": "AmbroseLEE",
  "author": "AmbroseLEE",
  "created_time": "October 31, 2022, 05:51:51 AM",
  "content": "Cratos decided to hold a special event in November because they want to express their gratitude to users who use the Cratos app.This event, along with communication with users on social media, will also spur the Cratos DAO project.Please keep an eye on our progress in the future, and they ask for a lot of participation from users in the November event.EVENT 1. Retweet CRATOSEvent Period : November 1st ~ November 15thEvent Details : Quote Tweet from Cratos official account 'cratostoken' on Twitter to earn extra CRTS!How to Join : First, follow us on Twitter 'cratostoken'. After clicking the Like button on Cratos’ pinned tweet with your account, Quote tweet with the hashtag #CRTS to complete your participation! If you upload some sincere messages to support Cratos with a quote tweet, you can get additional CRTS through selection! You need to submit the form below which is also available on www.cratostoken.com (You can find a ‘REWARD FORM’ button on the menu)Reward Details : 500CRTS to 20 participants eachReward Payment Date : After 09:00 AM on November 18th (UTC)Google Form link : https://docs.google.com/forms/d/e/1FAIpQLSfL-5eXjh9RJJe3Wq98zEbJv-6-m1rpuBk3_7r10_GN2ID01g/viewformNoticeIt won't be qualified if you use multiple accounts such as fake/friends/family accounts on Twitter to obtain abnormal rewards.Be very careful of impersonated accounts. We have only one official account, 'cratostoken'.EVENT 2. DAO VotingEvent Period : During the November Snapshot Voting PeriodEvent Details : Please participate in the November Snapshot Vote. After voting on Snapshot, we will send 1,000 CRTS directly to your wallet. Please vote carefully on Snapshot!Reward Details : 1,000 CRTS per participantReward Payment Date : 1 week after voting endsCratos Snapshot website link : https://snapshot.org/#/cratos.eth(The link is also available at https://www.cratostoken.com)NoticeYou can only participate once.Related links:Cratos DAO https://snapshot.org/#/cratos.ethTelegram https://t.me/CratosOfficialTwitter https://twitter.com/cratostokenWebsite https://www.cratostoken.com/CoinMarketCap https://coinmarketcap.com/currencies/cratos/Cratos Global https://cratosglobal.page.link/medium",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418894",
  "comments": []
}