{
  "id": "topic_5466350",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "September 10, 2023, 08:48:18 PM",
  "content": "The bitcoin fees market is getting out of control. Someone must've been really in a hurry as they paid BTC19.82 (~$511,000) fee just to send $2k worth.Jokes aside, probably a very painful mistake. I wonder how's it going to unfold and whether the miner will return it to the unlucky sender.Source: Explorers: https://twitter.com/whale_alert/status/1700920065934213256Blockstream: https://blockstream.info/tx/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd?expandBlockchain.com: https://www.blockchain.com/explorer/transactions/btc/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466350",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "September 10, 2023, 08:57:15 PM",
      "body": "Quote from: pawel7777 on September 10, 2023, 08:48:18 PMThe bitcoin fees market is getting out of control. Someone must've been really in a hurry as they paid BTC19.82 (~$511,000) fee just to send $2k worth.Jokes aside, probably a very painful mistake. I wonder how's it going to unfold and whether the miner will return it to the unlucky sender.Source: Explorers: https://twitter.com/whale_alert/status/1700920065934213256Blockstream: https://blockstream.info/tx/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd?expandBlockchain.com: https://www.blockchain.com/explorer/transactions/btc/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fdAssuming its a legit mistake only a major pool would fix this. A small pool would likely keep it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zenp",
      "created_time": "September 10, 2023, 09:02:23 PM",
      "body": "Quote from: pawel7777 on September 10, 2023, 08:48:18 PMThe bitcoin fees market is getting out of control. Someone must've been really in a hurry as they paid BTC19.82 (~$511,000) fee just to send $2k worth.Jokes aside, probably a very painful mistake. I wonder how's it going to unfold and whether the miner will return it to the unlucky sender.Source: Explorers: https://twitter.com/whale_alert/status/1700920065934213256Blockstream: https://blockstream.info/tx/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd?expandBlockchain.com: https://www.blockchain.com/explorer/transactions/btc/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fdI doubt it's an act of carelessness, anyone with that kind of a balance would at least know how and where to input the appropriate fees. It could be a way to donate a large sum to the bitcoin miners.Here's a tx from 2016 that paid a 291.24 btc fee: https://www.blockchain.com/explorer/transactions/btc/cc455ae816e6cdafdb58d54e35d4f46d860047458eacf1c7405dc634631c570d this fee was worth 130k USD at that time as the BTC price was close to $441. Looking back now, this fee is worth 7.5m USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 10, 2023, 09:06:53 PM",
      "body": "Quote from: philipma1957 on September 10, 2023, 08:57:15 PMAssuming its a legit mistake only a major pool would fix this. A small pool would likely keep it.It was mined by F2PoolSeems like an human errror but i don't know what to think.According to the mempool.space page the block match with the expected, that means that the TX was public broadcasted.The weird thing is that the TX is using the same source address as one of the outputs that means that it is the change wallet, so they may forgot to add the balance to that address or some faulty software/script did that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "September 10, 2023, 09:13:23 PM",
      "body": "Quote from: Zenp on September 10, 2023, 09:02:23 PMI doubt it's an act of carelessness, anyone with that kind of a balance would at least know how and where to input the appropriate fees. It could be a way to donate a large sum to the bitcoin miners.Here's a tx from 2016 that paid a 291.24 btc fee: https://www.blockchain.com/explorer/transactions/btc/cc455ae816e6cdafdb58d54e35d4f46d860047458eacf1c7405dc634631c570d this fee was worth 130k USD at that time as the BTC price was close to $441. Looking back now, this fee is worth 7.5m USD.Thanks, the one from 2016, although much greater in BTC terms, was around 4 times lower in USD terms than today's one.The 2016 transaction was widely reported as a sender's error, so not sure why would you dismiss the possibility of someone making a similar mistake today. I can't imagine anyone willing to send a \"donation\" to a random mining pool this way. Just sounds way less probable than a human error.And if my memory serves me well, I think in 2016 the pool agreed to return the fee (but I may be thinking about yet another situation).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 10, 2023, 09:14:40 PM",
      "body": "Quote from: pawel7777 on September 10, 2023, 08:48:18 PMThe bitcoin fees market is getting out of control. Someone must've been really in a hurry as they paid BTC19.82 (~$511,000) fee just to send $2k worth.Jokes aside, probably a very painful mistake. I wonder how's it going to unfold and whether the miner will return it to the unlucky sender.Source: Explorers: https://twitter.com/whale_alert/status/1700920065934213256Blockstream: https://blockstream.info/tx/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd?expandBlockchain.com: https://www.blockchain.com/explorer/transactions/btc/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fdThis was like tipping a waiter a Lambo for a glass of water. It must be painful for that sender but some miners claim a jackpot. In crypto sometimes your carelessness can bring embarrassment to you like having the wrong tattoo on your butt which will never go.If these were from a traditional banking sector many things could be done to recover that fund. But in crypto, this can be tricky because it is not a regulated territory where police will knock on the door and tell you to return the funds mistakenly sent by you. If the miner is generous enough he might return the fund but this was a lesson for all of us and it will be for rest of the year that we should check multiple times before clicking the send button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "September 10, 2023, 09:16:51 PM",
      "body": "Quote from: philipma1957 on September 10, 2023, 08:57:15 PMAssuming its a legit mistake only a major pool would fix this. A small pool would likely keep it.If it was a pool, returning the fee could bring in some legal issues, as all fees/block rewards should be split between pool participants, and I can't imagine all of them would be happy to give up an unexpected extra income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RocketSingh",
      "created_time": "September 10, 2023, 09:20:36 PM",
      "body": "Quote from: Zenp on September 10, 2023, 09:02:23 PMQuote from: pawel7777 on September 10, 2023, 08:48:18 PMThe bitcoin fees market is getting out of control. Someone must've been really in a hurry as they paid BTC19.82 (~$511,000) fee just to send $2k worth.Jokes aside, probably a very painful mistake. I wonder how's it going to unfold and whether the miner will return it to the unlucky sender.Source: Explorers: https://twitter.com/whale_alert/status/1700920065934213256Blockstream: https://blockstream.info/tx/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd?expandBlockchain.com: https://www.blockchain.com/explorer/transactions/btc/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fdI doubt it's an act of carelessness, anyone with that kind of a balance would at least know how and where to input the appropriate fees. It could be a way to donate a large sum to the bitcoin miners.Here's a tx from 2016 that paid a 291.24 btc fee: https://www.blockchain.com/explorer/transactions/btc/cc455ae816e6cdafdb58d54e35d4f46d860047458eacf1c7405dc634631c570d this fee was worth 130k USD at that time as the BTC price was close to $441. Looking back now, this fee is worth 7.5m USD.There are actually many such stories...In 2013, Friedcat refunded 200 BTC.In 2014, BTC Guild refunded 30 BTC.Details @ https://news.bitcoin.com/mining-pool-btc-com-80-btc-fee-refund/Its thrilling to watch & verify all these on chain. The beauty of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "September 10, 2023, 09:47:13 PM",
      "body": "Good luck having f2pool return the money, i hope the affected person knows Chinese...Can you imagine if this was found by a solo miner? lol, talk about winning the lottery: 26 bitcoins... above the reward given in 2013...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "September 10, 2023, 09:52:46 PM",
      "body": "Confirmed to be a human mistake. Publicly broadcasted, most likely since this is mined from F2Pool the money could be returned to the user since that is a huge amount of money, and it's a huge mining pool to boot. it's either the money's going to be returned, or the money won't be. Either way the user already paid for it, but something that presses me so much about this is why didn't the guy who made this transaction kept his mouth shut about it? Why is it that he decided to not tell anyone, not even F2Pool if I'm not mistaken, about this stuff? Smelling some money laundering shit going in here, I know i sound like a fucking conspiracy theorist but at the same time the lines meet and if he kept his mouth shut about it it might just mean that he's not really keen about keeping the money one way or another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "September 10, 2023, 10:19:55 PM",
      "body": "Quote from: Zenp on September 10, 2023, 09:02:23 PMI doubt it's an act of carelessness, anyone with that kind of a balance would at least know how and where to input the appropriate fees.You assume that all mistakes come from the lack of knowledge or experience. But there's a wide variety of other reasons that can force someone to make a mistake, like being tired, sleep-deprived, distracted, etc. I don't see anything strange about a supposedly experienced a wealthy user making such mistake. If anything, it shows how dangerous Bitcoin can be, because it allows such things to happen. So this should be a reminder that with Bitcoin you are your own bank, meaning you are responsible for checking your transactions and no one else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 10, 2023, 10:39:59 PM",
      "body": "Quote from: pawel7777 on September 10, 2023, 09:13:23 PMQuote from: Zenp on September 10, 2023, 09:02:23 PMI doubt it's an act of carelessness, anyone with that kind of a balance would at least know how and where to input the appropriate fees. It could be a way to donate a large sum to the bitcoin miners.Here's a tx from 2016 that paid a 291.24 btc fee: https://www.blockchain.com/explorer/transactions/btc/cc455ae816e6cdafdb58d54e35d4f46d860047458eacf1c7405dc634631c570d this fee was worth 130k USD at that time as the BTC price was close to $441. Looking back now, this fee is worth 7.5m USD.Thanks, the one from 2016, although much greater in BTC terms, was around 4 times lower in USD terms than today's one.The 2016 transaction was widely reported as a sender's error, so not sure why would you dismiss the possibility of someone making a similar mistake today. I can't imagine anyone willing to send a \"donation\" to a random mining pool this way. Just sounds way less probable than a human error.And if my memory serves me well, I think in 2016 the pool agreed to return the fee (but I may be thinking about yet another situation).I remember ant pool returning a large mistake maybe 99 btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 10, 2023, 11:29:41 PM",
      "body": "I think it was not a human mistake if it was mined from F2pool maybe the transaction was made by someone who mines in F2pool and withdraws his mined BTC.Since F2pool withdrawal is free I believe that the transaction was created by them and included in the block to mine. F2pool can manually choose transactions so there is no problem if they create a transaction with a large fee they can just include the transaction later in the block they mine.Because people nowadays are smart it's impossible that he didn't double-check the transaction fee before the transaction was broadcasted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "September 10, 2023, 11:47:41 PM",
      "body": "Ouch, that's a lot.Code:Amount0.07405440BTC • $1,912.94Fee1,982,108,632SATS • $512,008Well, hopefully that F2Pool will return but if they don't, they'll just justify that it's not their fault in the first place to put that kind of fee for a few thousand of transaction. Maybe, whoever the owner is can just have some dialogue and give a part of it back to F2Pool while returning some hefty amount of the fee, lol just some negotiation by having this mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 10, 2023, 11:57:51 PM",
      "body": "Unfortunately, if the doubt above was right, miners are not obligated to return the fee from a technical or protocol perspective.So there's no assurance of being refunded. IMO, this was what I was thinking of, it might be because of the miners themselves.Some miners, including mining pools, might create transactions to send cryptocurrency from one of their own addresses to another.  Maybe by attaching a high fee to this transaction, they ensure it's included in the next block they mine, effectively paying themselves a higher fee but that's only my assumption.Whatever it is, it's a huge amount of fee, looking for an update of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 11, 2023, 01:27:25 AM",
      "body": "People are talking about this and speculating a lot on social media. It seems there isn't any word from the one who made the transaction himself/herself. Some are saying this is a way to donate to the miners. I don't think that's really what happened. It's probably an error. I read of a possibility that he/she might have typed the amount to send in the space intended for fees and the fees in the space intended for amount to send. Either way, Bitcoin's system exhorts us to double, even triple, check transaction details before confirming it. Finders keepers, losers weepers couldn't be more true in such a system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 11, 2023, 02:37:39 AM",
      "body": "Yeah I was on Jochen earlier trying to find what is the optimal fee to use to send a transaction and noticed the huge spike which skewed the entire chart,https://jochen-hoenicke.de/queue/#BTC,24h,feeSee that high peak, yeah that was the transaction.I think this person instead of using a wallet, they probably wrote out the transaction by hand and got the miner fee mixed up with the transaction fee. This is the only way I can see this happening since its most likely not laundering funds since it was mined by a large pool and not an unknown miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 11, 2023, 03:15:28 AM",
      "body": "Quote from: BitMaxz on September 10, 2023, 11:29:41 PMI think it was not a human mistake if it was mined from F2pool maybe the transaction was made by someone who mines in F2pool and withdraws his mined BTC.But in this case the transaction was broadcasted publicly and any miner would have been able to claim the block rewad. If anyone was looking to send money this way they will have only limited the transaction to their miner or directly minednit themselves but this was open for everyone.Quote from: BitMaxz on September 10, 2023, 11:29:41 PMBecause people nowadays are smart it's impossible that he didn't double-check the transaction fee before the transaction was broadcasted.People nowadays are far from smart and it is improbable (considering the amount) but not impossible that they didn't double check before sending.One theory on Twitter, sorry X, is that the user mixed up the amount to send and transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 11, 2023, 03:28:45 AM",
      "body": "Such a huge loss. It happens every near bull market. It seem like every bull market there is a newcomer in crypto who is very rich and doesn't know how to send with the minimum transaction fee. I Wouldn't want to laugh at someone's misery but someone somewhere is going to be like the miners in F2pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 11, 2023, 03:32:24 AM",
      "body": "Quote from: pawel7777 on September 10, 2023, 08:48:18 PMThe bitcoin fees market is getting out of control. Someone must've been really in a hurry as they paid BTC19.82 (~$511,000) fee just to send $2k worth.Jokes aside, probably a very painful mistake. I wonder how's it going to unfold and whether the miner will return it to the unlucky sender.Source: Explorers: https://twitter.com/whale_alert/status/1700920065934213256Blockstream: https://blockstream.info/tx/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fd?expandBlockchain.com: https://www.blockchain.com/explorer/transactions/btc/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fdI just don't know what to think in this case. Was the owner drunk or having some health issues? Maybe the wallet and funds were inherited by someone who has little knowledge about Bitcoin and was trying to make his first transaction. It could also be a human error from someone knowledgeable. I think is ethical for the F2Pool to refund the funds after deducting some expenses, doing that will make their reputation rise in the industry. As the story unfolds I just hope it has a good ending and that the funds are returned to the owner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}