{
  "id": "topic_5432493",
  "title": "SatoPrincess",
  "author": "SatoPrincess",
  "created_time": "December 31, 2022, 11:26:00 AM",
  "content": "I have been motivated by every person here who has in one way or another promoted bitcoin in their locality. This year, there’s been more bitcointalk members teaching bitcoin outside the forum and accepting bitcoin payment in their businesses. I’m happy I am ending the year trying something new and unique in my business. We are a beauty, cosmetic and personal care shop ( pedicure and manicure, lashes extension, facials, micro blading) in Nigeria. To be honest, I was hesitant to do this because I thought it wouldn’t work in my profession. But there’s no downside to trying, so I did. After browsing the internet for a good bitcoin sign, I settle for this one. The sign is on my Secretary/cashier’s desk next to the card that has my bank account details. Placing the two together was deliberate because I put a discount on bitcoin making payments in bitcoin cheaper to attract people. The only challenge I face right now is 99% of our customers are female, and most do not have any prior knowledge of bitcoin or cryptocurrency, the ones who do either heard about bitcoin from their partner or social media campaigns but they haven’t given it much thought. It’s popular among the male folk here, I am yet to have a customer pay in bitcoin but it’s good enough to start the conversation. I placed a 10% discount for those who pay in bitcoin and that I think that move prompt my clients to begin asking how they can do so. I’ve had clients ask me to explain to them how Bitcoin works which I am always glad to do. Even my neighbor is curious and is likely to join the crypto fam soon. Though I haven’t had a bitcoin sales, this new addition to my business has added value and a closeness to my relationship with my clients. Happy new year guys. See you in 2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432493",
  "comments": [
    {
      "author": "Rruchi man",
      "created_time": "December 31, 2022, 11:58:36 AM",
      "body": "Quote from: SatoPrincess on December 31, 2022, 11:26:00 AMI have been motivated by every person here who has in one way or another promoted bitcoin in their locality. This year, there’s been more bitcointalk members teaching bitcoin outside the forum and accepting bitcoin payment in their businesses. I’m happy I am ending the year trying something new and unique in my business. A good way to end the year, and to kick off next year. I am really proud of the number of persons from this forum who have adopted and implemented payment in bitcoins into their business. More persons will follow this track by next year. You are a quality member of this forum @OP, I am confident in your ability to be able to manage this new development. I am sure that other forum members like myself will be interested to read about the outcome of this new inclusion in some months and how it is has affected your business, plus the challenges you will handle. Best of luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 31, 2022, 12:05:15 PM",
      "body": "We BTC users want merchants in our locality to start accepting BTC payment, while we forget that so many of us in this commuinity are merchants ourselves, so i believe if you are a merchant here, and if BTC is legal in your country and you would not get into any trouble with your government or police, then you should consider accepting BTC in your business. It is easier if one is already a bitcoiner, you would know the best way to accept your money and how to educate your customers.Despite the fact that your customers are predominantly female, and like you said BTC knowledge is not common amongst them, it might get some of them interested and learn about BTC from here; and from what i know women like going to the beauty and cosmetic shop with their lovers, and we know who usually pays , so male Bitcoiners might use the option of BTC to pay for their partners in your shop. Good Luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "December 31, 2022, 12:17:16 PM",
      "body": "Quote from: SatoPrincess on December 31, 2022, 11:26:00 AMThe only challenge I face right now is 99% of our customers are female, and most do not have any prior knowledge of bitcoin or cryptocurrency, the ones who do either heard about bitcoin from their partner or social media campaigns but they haven’t given it much thought. It’s popular among the male folk here, I am yet to have a customer pay in bitcoin but it’s good enough to start the conversation.With time, they will come around it and may likely embrace the option more than fiat. The concept behind the workings of Bitcoin is one enough to fascinate anyone. However, my worry in all these payment with Bitcoin thing is how likely are those who aren't Bitcoin hodlers going to continue to get Bitcoin for the sole purposes of making just payment without using it for basic trading and other stuff. I say this because of the volatility of Bitcoin and how $50 could easily become $20 within hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "December 31, 2022, 12:35:48 PM",
      "body": "Quote from: Mpamaegbu on December 31, 2022, 12:17:16 PMQuote from: SatoPrincess on December 31, 2022, 11:26:00 AMThe only challenge I face right now is 99% of our customers are female, and most do not have any prior knowledge of bitcoin or cryptocurrency, the ones who do either heard about bitcoin from their partner or social media campaigns but they haven’t given it much thought. It’s popular among the male folk here, I am yet to have a customer pay in bitcoin but it’s good enough to start the conversation.With time, they will come around it and may likely embrace the option more than fiat. The concept behind the workings of Bitcoin is one enough to fascinate anyone. However, my worry in all these payment with Bitcoin thing is how likely are those who aren't Bitcoin hodlers going to continue to get Bitcoin for the sole purposes of making just payment without using it for basic trading and other stuff. I say this because of the volatility of Bitcoin and how $50 could easily become $20 within hours. With daily transaction? and with volatility being present? I doubt. Ofcourse there would be more people to choose fiat especially those who are just not into investments and online payments. There's more of a tendency that these two would coexist with one another as alternative mode of payments. Using Bitcoin on a daily basis like with purchasing market goods will just make it more complicated. I guess it would be more of a better option if the transaction is something \"special\" or is needing to avoid taxes from the government. Indeed every transaction has taxes, but imagine buying an onion with BTC than with fiat. But services as such with what OP is offering, I guess is different and would be a better thing to use crypto as mode of payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "December 31, 2022, 12:40:28 PM",
      "body": "Quote from: Yatsan on December 31, 2022, 12:35:48 PMWith daily transaction? and with volatility being present? I doubt. Ofcourse there would be more people to choose fiat especially those who are just not into investments and online payments. There's more of a tendency that these two would coexist with one another as alternative mode of payments. Using Bitcoin on a daily basis like with purchasing market goods will just make it more complicated. I guess it would be more of a better option if the transaction is something \"special\" or is needing to avoid taxes from the government. Indeed every transaction has taxes, but imagine buying an onion with BTC than with fiat. But services as such with what OP is offering, I guess is different and would be a better thing to use crypto as mode of payment.Bitcoin adoption must be done from two sides. Buyers and sellers are two sides of Bitcoin adoption.If you are using a service, you are a buyer and the seller must accept your bitcoins. Seller also must accept risk of having bitcoins in their balance. The best is a seller must consider bitcoin received from buyers as investment for their business. It is not problem now because not all buyers will use bitcoins as their payment method so a part of bitcoin in a business balance sheet is small and less risky.In future, if bitcoin adoption is bigger, buyers use bitcoins for payments more regularly and bitcoins become bigger in a business balance sheet, risk can be higher. Fortunately, in future I believe that Bitcoin volatility would be smaller and it makes risk for sellers smaller too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "December 31, 2022, 12:40:49 PM",
      "body": "This is a good start.There are some points that I would like to draw OP's attention to.Make/order a beautiful frame for the text \"Bitcoin is accepted here\" with an attractive design and appearance and hang it on the wall in a conspicuous place so that buyers of your services can see it in front of them at the time of payment.Create (or use ready-made) guides explaining what bitcoin is, how to use it and make transactions. Order from the nearest printing house and distribute to your customers so that they learn how to use btc at least at the initial level. Why else would they need a discount for btc they can't take advantage of. The next time your clients come to you to be prettier, they will already be prepared to pay for the services with bitcoin.I wish you success in your beauty shop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 31, 2022, 12:48:16 PM",
      "body": "Quote from: Mpamaegbu on December 31, 2022, 12:17:16 PMWith time, they will come around it and may likely embrace the option more than fiat.I don't believe so, BTC payment option is more of a second choice, i don't think there is anywhere that BTC payment would be embraced more than fiat. The expectation in my humble opinion shouldn't be for BTC to be the first choice, but for BTC to be a second choice option globally, i think that is the way to go for mass adoption.Quote from: Mpamaegbu on December 31, 2022, 12:17:16 PMHowever, my worry in all these payment with Bitcoin thing is how likely are those who aren't Bitcoin hodlers going to continue to get Bitcoin for the sole purposes of making just payment without using it for basic trading and other stuff.One has to first be a bitcoiner before they can spend BTC, but they do not technically have to be holders, as long as they use BTC for any other purpose, even if it is trading, then can surely spend any amount out of what they have to pay for stuffs, it is a matter of choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 31, 2022, 12:48:36 PM",
      "body": "Congrats on trying that out. It's believed that in Nigeria there is a high rate of BTC adoption so it's still good. I wonder why you only have decided by this year end when you could have done it a few years ago. Every woman has a male benefactor either thier father or a boyfriend willing to spend top dollar for the beauty of thier girl. Who knows women have thier BTC wallet installed on thier phones already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "December 31, 2022, 01:02:40 PM",
      "body": "Through the year 2022 we had good level of cryptocurrency acceptance into businesses. In particular we were able to see good number of Bitcointalk community members started to accept bitcoin and other cryptocurrencies into their businesses. This could've given good exposure to bitcoin and other cryptocurrencies. Through our forum members more people knowing about bitcoin is really good and a must one. Over the year more users have taught people about bitcoin to people who doesn't had knowledge about bitcoin. More good things have happened through our forum and happy one more person adding cryptocurrency as payment into his business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "December 31, 2022, 01:07:54 PM",
      "body": "it was a great decision and idea and deserves appreciation, bitcoin needs a lot of adoption so that bitcoin can be used as a means of payment besides using cash, to be honest in my country it is forbidden to use any payment except using official currency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 31, 2022, 01:14:25 PM",
      "body": "This is awesome to end the year. And today is the last day of the year. As a cosmetic shop which is not general to everyone but specific to women, and women who use bitcoin are not much in Nigeria compare to the male counterparts. But one thing I will also advise you to do is to place advertisement banners in social media and billboards around the cities close to you. There are some females that are using bitcoin are unknown but with your advertisement they will be informed to come to your shop. This is how the process will begin and work for you. Congratulations for kick starting bitcoin shop in you local area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "December 31, 2022, 01:30:49 PM",
      "body": "Quote from: piebeyb on December 31, 2022, 01:07:54 PMit was a great decision and idea and deserves appreciation, bitcoin needs a lot of adoption so that bitcoin can be used as a means of payment besides using cash, to be honest in my country it is forbidden to use any payment except using official currency  The people living in places where the government are not very strict against bitcoin are making use of the great opportunity to propagate the message of bitcoin. Anyone that has the opportunity to teach or learn bitcoin should do because the future is very bright with bitcoin. Congratulations SatoPrincess for accepting bitcoin in your business, the customers might not embrace it immediately but it will surely be a success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "December 31, 2022, 02:50:05 PM",
      "body": "I wish you the best of luck in working with your business's creative thoughts. According to your commentary, women have no experience about Bitcoin. They are also very keen to gain experience from you. I thank you very much for the many interests you and them have expressed. If you can work with such thoughts like yours, Bitcoin will surely move to a much better stage in the future and there will be Bitcoin's reign. Now if there is no improvement in your business, if you can educate them in Bitcoin education, of course you will be able to be succesful at one time. You keep working hard will never give you a waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "December 31, 2022, 03:09:13 PM",
      "body": "Quote from: Z-tight on December 31, 2022, 12:48:16 PMQuote from: Mpamaegbu on December 31, 2022, 12:17:16 PMWith time, they will come around it and may likely embrace the option more than fiat.I don't believe so, BTC payment option is more of a second choice, i don't think there is anywhere that BTC payment would be embraced more than fiat.Don't cross your heart or make an oath on that. You never can tell how people react to the invention of things and that's why on the hindsight we tend to regret actions we didn't take. A few years (over a decade, anyway) I can recollect making a suggestion to a paper company I worked for to also have a hard copy version of what it ran online, owing to how Nigerians reacted to online stuff then towards newspapers. There was low patronage for stuff like that then. Now fast forward to date, we know how voracious Nigerians have become towards online news and gists. How many people buy hard copy newspapers this day in Nigeria? Most people now get their news and gists online, on soft copy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "December 31, 2022, 03:24:05 PM",
      "body": "For sure their husbands know about bitcoin if not then I think they already researching about it online. Whats the best with having bitcoin as a payment method is it will attract other people like I will try to go to this beauty shop and have my nails done and then ill ask about bitcoin. So what I suggest is that don't get stressed with the people who don't know it since I am sure one of your customer know it also your existing customer will really try to learn about it since it has a discount lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "December 31, 2022, 03:34:29 PM",
      "body": "There is hope for bitcoin. It doesn't go unnoticed. Your clients will be curious to know about bitcoin sooner than later because you are indirectly programming their subconscious mind to think about bitcoin. I'd advice you do a pamphlet that explains the basics of bitcoin, what it is all about and how to use it. Teach your staff about bitcoin so that they can also educate the clients when they ask a question about bitcoin. This is a step in the right direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "December 31, 2022, 03:46:59 PM",
      "body": "I think there’s no harm in trying to inculcate bitcoin as among the payment methods in your business. I think it’s a plus and always great to have various methods in which a customer could pay for services rendered. I also love the fact that you’re giving out a 10% discount on services if payment is made in bitcoin.If I could get any form of discount to pay with bitcoin, I know I would jump at that opportunity. I think the discount given would also help stimulate peoples interest in bitcoin even if it’s a little. You assume a lot of your clientele, which are females, aren’t familiar with bitcoin. Your assumptions may very well be wrong. It’s a good thing you’ve put up a sign saying you now accept bitcoin. Now watch how many of your clients will indicate some sort of interest. I’m sure it would amaze you. Good luck in your business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "December 31, 2022, 03:55:06 PM",
      "body": "Quote from: SatoPrincess on December 31, 2022, 11:26:00 AMI placed a 10% discount for those who pay in bitcoin and that I think that move prompt my clients to begin asking how they can do so.This is a good marketing strategy, in my opinion. But don't you get another 10% extra if you accept fiat? So what's the benefit of you adopting bitcoin when in fact you will lose 10% every time your customer pays you in bitcoin?I hope the discount will be limited, say your first 10 - 20 customers since adopting bitcoin as a means of payment. I'm so curious, what are your advantages of adopting bitcoin as a means of payment instead of fiat?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 31, 2022, 05:05:05 PM",
      "body": "Congratulations! You did it right in giving 10% discount to customers paying for your services in bitcoin. That will surely increase awareness and interest from the community for btc. Hopefully you will be the responsible channel for introducing many women to crypto universe through your beauty shop business in Nigeria. I advise you placing a \"step by step\" banner on your shop teaching people how they can acquire bitcoin and send transactions. That 2023 may be the year of bitcoin adoption in your community and the year of bitcoin profits in your business!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}