{
  "id": "topic_5439413",
  "title": "LCSTOKEN",
  "author": "LCSTOKEN",
  "created_time": "February 11, 2023, 02:50:48 AMLast edit: February 11, 2023, 03:06:20 PM by LCSTOKEN",
  "content": "Thanks for the thread to announce our #LCSTOKENPreamble: Please always do your own research, the success of ANY cryptocurrency coin can go down in value as fast as it goes up.View Token / Coin On Nomics Index: https://nomics.com/assets/lcstoken-learn-crypto-secretsThere was no pre-sale or ICO because I wanted to be fair to all. I am not just a developer hoping to get rich, I actually bought my OWN creation after launching it, with intentions of helping others and building a very powerful community in mind.I do have many years online marketing experience from days gone by and learned one of the most important values from all that knowledge. \"Your followers, members and investors are your family.\"Let's do this shall we?Tokenomics page: https://learncryptosecrets.com/learn-crypto-secrets-coin/You can view the 'rug pull' status on ape space, there is none possible. https://apespace.io/bsc/0xe5086ef5e4bc6b7ce5606cdec5524e8ea407d50e?ref=honeycOnly 500 million ever to be minted with zero wallet, buy or sell taxes ever. (locked, can not be changed)You can buy the coin here on pancakeswap: https://pancakeswap.finance/swap?outputCurrency=0xE5086eF5e4Bc6b7CE5606CdEC5524E8ea407D50eJoin us in the telegram group https://t.me/lcs_c or Twitter https://twitter.com/LearnCSecrets or view the tokenomics here: https://learncryptosecrets.com/learn-crypto-secrets-coinLCSTOKEN is NOT a Meme Coin. A meme coin is a cryptocurrency term for popular currencies, sometimes depicted with comical or animated memes, that are supported by enthusiastic online traders and followers.LCSTOKEN IS a Utility Coin. A utility coin / token is a type of token that has a specific use case, such as inhouse economy, gaming coins and such. For instance, you can buy merch from our ‘inhouse’ online store using various utility coins including our own LCSTOKEN.Please do ask any and all questions and I will personally answer each and everyone of you.Coin Reviews Page: https://nomics.com/assets/lcstoken-learn-crypto-secrets/reviewsAlternatively, you can also follow and DM me on Twitter @LearnCSecrets or tap here: https://twitter.com/LearnCSecretsAgain, for live answers with a moderator visit the Telegram group here: https://t.me/lcs_cThank you for your time!Glen Persson PS! Volunteer MODS wanted!Currently our Telegram group has investors who are moderators already.We need Reddit and Facebook mods who ARE investors (hold some LCSTOKEN coins large or small amount) and who will seek others by all means none spammy, to join the groups.This coin will be grown by and for the community of Learn Crypto Secrets, the mother network. NOT buy greedy whales that sell off in an ICO's and then cash out as mentioned above.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439413",
  "comments": [
    {
      "author": "LCSTOKEN",
      "created_time": "February 13, 2023, 10:13:35 PM",
      "body": "#LCSTOKEN Questions and Answers tonight at 6PM EST in the Telegram group. Pop on in! https://t.me/lcs_c",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}