{
  "id": "topic_5475935",
  "title": "xSkylarx",
  "author": "xSkylarx",
  "created_time": "November 29, 2023, 02:03:14 PMLast edit: December 05, 2023, 07:01:30 AM by xSkylarx",
  "content": "Has anyone ever tried wearing a Bitcoin clothing in public? I wore mine to an event earlier this week and noticed that most of the young age people were looking at it. One person even asked me if I owned a Bitcoin(which I've answered him ). It just popped into my mind that is it making myself vulnerable to bad people? We are aware that we should keep quiet if we own Bitcoin because of the risk that someone will hurt us or target us so that they could get our Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475935",
  "comments": [
    {
      "author": "Cointxz",
      "created_time": "November 29, 2023, 02:09:02 PM",
      "body": "Not a good idea for me because you are just removing your privacy for having Bitcoin holdings and you might be target by scammer since they already have an idea that you are a holder.Adding Bitcoin as mode of payment on my business is the best that I can do to promote Bitcoin in neighborhood since some people is already aware on it but not to the point that I will t-shirt and walk in the street that full of potential threat to my safety. I admire your courage for doing that.What’s the initial feedback of people that saw your t-shirt print?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 29, 2023, 02:11:41 PMLast edit: November 29, 2023, 02:22:52 PM by Mia Chloe",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public? I wore mine to an event earlier this week and noticed that most of the young age people were looking at it. One person even asked me if I owned a Bitcoin(which I've answered him ). It just popped into my mind that is it making myself vulnerable to bad people? We are aware that we should keep quiet if we own Bitcoin because of the risk that someone will hurt us or target us so that they could get our BitcoinWearing Bitcoin clothes in public is a wrong move because it puts you at risk.this because a lot of persons including scammers and hackers will assume you are an investor of which in this case I believe they would be Right.Losing ones hodlings is a nightmare worth avoiding therefore I think not wearing clothes that will draw attention is worth it. Here are a couple of post that would give you more insight on your privacyWhy it’s important to avoid telling everyone about your crypto holdingsWhy beginners should pay attention to their privacyDon't forget to keep your keys safe 😁",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 29, 2023, 02:17:11 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public?If Bitcoin is well known in your country, it is not strange if you wear a T-shirt with Bitcoin on it.QuoteI wore mine to an event earlier this week and noticed that most of the young age people were looking at it. One person even asked me if I owned a Bitcoin(which I've answered him ).I see it is kind of risk. When you wear a T-shirt with Bitcoin logo on it, you are saying with other people like I am a Bitcoin investor, I have bitcoin.The question you received from that person is like a warning for you. You can become a target of bad people so if you don't want to have that risk, don't do something like this again.Known physical Bitcoin attacks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "November 29, 2023, 02:20:28 PM",
      "body": "$5 wrench attack is what came to my mind when I see people that wears t-shirt that has bitcoin or any crypto printed on it. While it's good that you're giving some help to market or give exposure to Bitcoin in public places. But just as what's been asked to you if you own Bitcoin, that only gives the bad people the idea if you own one and you might be their next target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 29, 2023, 02:31:50 PM",
      "body": "Yeah it's good to increase Bitcoin visibility and I like when someone promote Bitcoin to public, but I make sure it was not me. It's not worth to trade my life to increase Bitcoin adoption, just let it by nature, sooner or later when someone is already learn about financial and technology, they will realize if Bitcoin is important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "humanvelocity",
      "created_time": "November 29, 2023, 02:49:55 PM",
      "body": "Its just a piece of clothing so i personally don’t think you are putting yourself in risk lol, I once saw a kid in streets selling something wearing bitcoin tshirt (It was a nice tshirt NGL). Anyways wear whatever you feel comfortable wearing and whatever makes you feel comfortable and confident. I personally wouldn’t wear them because it looks cringe but you do you bro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "strunberg",
      "created_time": "November 29, 2023, 02:57:04 PM",
      "body": "I think that would be very risky. Some people in my country still think that bitcoin owners are rich young people because they hear the price of 1 btc reaches tens of thousands of dollars without knowing that we can only have 0.0005 btc in our wallet. Then of course this will become the center of public attention and believe me it will be very uncomfortable when people who don't learn about bitcoin ask you how to get 1 bitcoin quickly.I prefer to promote bitcoin in other ways. For example, by telling my friends that bitcoin is a good investment asset and I have also collected several bitcoin dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "November 29, 2023, 03:02:00 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public? I wore mine to an event earlier this week and noticed that most of the young age people were looking at it. One person even asked me if I owned a Bitcoin(which I've answered him ). It just popped into my mind that is it making myself vulnerable to bad people. We are aware that we should keep quiet if we own Bitcoin because of the risk that someone will hurt us or target us so that they can get our Bitcoin.Someone said a decade before that every picture has two sides, one that we are seeing and the other that is transparent or hidden, and the interesting thing is to find that. In your case similar thing is present and a lot of members suggested that wearing Bitcoin clothes in public is not good because some bad people will target you and my give harm you or steal your Bitcoin or valuable things and this is true but has anyone tried to see that other side of picture. Well, I don't think that someone will identify that and that is a positive message to the public. Yes, you read the right thing, we know a lot of people did not know even in 2023 because of the fewer advertisements of Bitcoin, and wearing Bitcoin clothes will spread Bitcoin to larger people when someone looking at your shirt and sees the logo of Bitcoin they will surely check it on Google once they reach to their house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 29, 2023, 03:03:35 PM",
      "body": "what i have seen to promote bitcoin more then a T-shirt without risking harm to yourself.. is postershere is a mock-up of something i seen, that i found cute on more then one levelit was laminated and zip tied to the branches within the hedge",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "November 29, 2023, 03:05:49 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public?Your enjoyment of wearing clothes with the Bitcoin logo reminds me of the topic below.* Topic: ⭐ !! The Bitcoin Wardrobe | The Most Crypto Friendly Store !! ⭐* Topic: Would you buy Bitcoin rings? Bracelet and other jewelry?OP, I'm very sure that almost 99% of the members here have Bitcoin logo shirts, including me, it's just that I don't show it here, I only use it for myself personally in public places, unfortunately I never show it here.I have 5 t-shirts with the Bitcoin logo, maybe someday I will display them here, honestly I'm happy to see you still care and are proud to use the Bitcoin logo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "November 29, 2023, 03:09:56 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public? You can't think of anything more stupid than this.Quote from: xSkylarx on November 29, 2023, 02:03:14 PMI wore mine to an event earlier this week and noticed that most of the young age people were looking at it. You're lucky that their curiosity was limited to just their glances.Quote from: xSkylarx on November 29, 2023, 02:03:14 PMOne person even asked me if I owned a Bitcoin(which I've answered him ). The next step one person would suggest is to show them. It will be very difficult for you to refuse.Quote from: xSkylarx on November 29, 2023, 02:03:14 PMIt just popped into my mind that is it making myself vulnerable to bad people?Bingo!Quote from: xSkylarx on November 29, 2023, 02:03:14 PMWe are aware that we should keep quiet if we own Bitcoin because of the risk that someone will hurt us or target us so that they could get our Bitcoin.You don't have to remain silent, but then you will probably stop owning bitcoin.The circle around the BTC-logo should have been made red and several smaller circles at equal intervals towards the center of the logo. To make it look more like an aim and to make sure they don’t make a mistake about who will be the target for everyone here. vires in numberis stupidity lies in publicity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "November 29, 2023, 03:10:34 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public? I wore mine to an event earlier this week and noticed that most of the young age people were looking at it. One person even asked me if I owned a Bitcoin(which I've answered him ). OP, I was expecting you tell us what your response was instead of only saying you did answered him.Quote from: xSkylarx on November 29, 2023, 02:03:14 PMIt just popped into my mind that is it making myself vulnerable to bad people? We are aware that we should keep quiet if we own Bitcoin because of the risk that someone will hurt us or target us so that they could get our Bitcoin.OP, the vital reasons of Bitcoin investors staying anonymous is not a term and condition in the Bitcoin marketing industry rather the decentralization of Bitcoin with the Blockchains which has the potentials system to keep the Bitcoin investors anonymous is to help protect individuals from public awareness about there source of incomes and also a keen to keep its Investors net Worth unreasonable to the societies else other Investors such as the stocks and other conventional investors has also wanted to keep their worths and sources of income anonymous.However, it is always wise enough keeping your financial Indulgence anonymously from the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 29, 2023, 03:10:54 PM",
      "body": "I don't know why I feel that wearing clothes with the bitcoin logo is quite uncomfortable, because I don't know who will approach me and talk to me about bitcoin and what if he is a criminal who is ready to drain my bitcoin? especially in my city where the crime rate is quite high, I don't want to endanger myself by wearing these clothes in public places. Maybe I'm too paranoid, but everyone has a different view on this and in my opinion I don't really like wearing clothes like that in public places for security reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "November 29, 2023, 03:20:38 PM",
      "body": "Exposing Bitcoin to the general public could help in Bitcoin adoption, but exposing your yourself for this purpose is not a smart idea. People nowadays are familiar with Bitcoin but have no idea what it is. Scammers are everywhere looking for a chance to victimize people, and you wearing a Bitcoin shirt in public could catch their attention. The worst part is, you might be mistaken that you have Bitcoin and the syndicates might get interest in you putting your life in danger. For your safety, better not to wear a bitcoin shirt in public, there are many ways to contribute in the Bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kasabus",
      "created_time": "November 29, 2023, 03:21:02 PM",
      "body": "I have never seen anyone wearing bitcoin clothing in the public, and I have no plans either. Although it's a good way of spreading promotion about bitcoin, but it could also be a threat to anyone wearing that as there are bad people waiting in every corner eyeing for their new victim. For you, it could be nothing as you just like to wear your favorite shirt, but for bad people out there, it could create a hint and make a plan to attack you.However, what I'm saying is just only from my own point of view. Others may have different interpretation about that but for one's safety and security, just avoid doing exposure like that. Keep your privacy and never let anyone know that you're actually a bitcoin enthusiast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoWODL",
      "created_time": "November 29, 2023, 03:22:40 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public? Like you, I have a few t-shirts that have the Bitcoin logo on them.But I use them in my home not in public places because Bitcoin is still illegal in our country so I don't use it in public places with caution.An interesting fact is that there was an incident in our country a few months ago where a man was zombied and demanded bitcoins as ransom.Since then I've been more cautious and avoided wearing t-shirts with the Bitcoin logo.Because I don't want anyone to suspect that I have bitcoins or that I'm investing in bitcoins.No one can see the good these days.Maybe for our own safety we should hide them from people so people don't realize we have bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 29, 2023, 03:24:33 PM",
      "body": "i once wore mine inside a mall. and it's the kids that are pretty much looking at me as its design was the Bitcoin King (Burger King). but that was in 2017 when only a few people recognized BTC. but i wouldn't wait for criminals bold enough to commit crimes in public. doing this today is like wearing a bullseye target. better safe than regret the next day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "November 29, 2023, 03:26:08 PM",
      "body": "Quote from: xSkylarx on November 29, 2023, 02:03:14 PMHas anyone ever tried wearing a Bitcoin clothing in public? I wore mine to an event earlier this week and noticed that most of the young age people were looking at it. One person even asked me if I owned a Bitcoin(which I've answered him ). It just popped into my mind that is it making myself vulnerable to bad people? We are aware that we should keep quiet if we own Bitcoin because of the risk that someone will hurt us or target us so that they could get our Bitcoin.I have yet to wear any clothing marked Bitcoin. But a few days ago I saw a young guy wearing a t-shirt marked Bitcoin and it suddenly occurred to me that this person might work in Bitcoin. Because I work, such thoughts will work in me and this is normal. Here you've read Bitcoin Marked Clothing Everyone Asks You Because All The Boys And Girls Who Ask You Are Probably All Into Bitcoin. That's why they had a question that asked you. But there is nothing to be nervous about wearing such clothes, you can feel free to wear bitcoin marked clothes, it will make you more friendly to people who are involved with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "November 29, 2023, 03:26:36 PM",
      "body": "Op resize your image to Code:[img width=200]keep image here[/img]Wearing Bitcoin Polo or T-shirt is nothing and it is normal printed clothes. I have seen a lot of people wore Bitcoin printed clothes in my residence. And when I asked some bought it in the market. So it is not a new thing for it. And if someone approach you because of the Bitcoin printed clothe your are wearing then you can simply tell the person you bought it like that in the market. This is also happened to those who wear Army clothes and when the Army approach them, they would told them that they got it from the market. Though Army own is depends on the printed colour. If is very light and does not really looks like their colour they can consider you and ask you to remove the clothe but if it is their real color then you have to face some punishment. As for me wearing Bitcoin printed clothe is not dangerous as you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}