{
  "id": "topic_5456706",
  "title": "Anon08yr",
  "author": "Anon08yr",
  "created_time": "June 18, 2023, 12:06:21 AM",
  "content": "Achei um notebook antigo com arquivos de 2009, nesse notebook há uma pasta nomeada como crypto, e dentro dessa pasta há 3 pastas, DSS, Keys, RSA; dentro da pasta Keys há um aquivo nomeado com um código gigante, e em seu ícone há um cadeado. Gostaria de saber se possivelmente achei alguma criptomoeda.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456706",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "June 18, 2023, 07:04:30 AM",
      "body": "Bem vindo ao forum.Essa informação acaba por ser um pouco vaga.Existe algum ficheiro com o nome \"wallet.dat\"?Se é de 2019, provavelmente era só a carteira Bitcoin Core que existia. Então, instala e verifica que ele usa os mesmos ficheiros. Caso estejam lá, tente substituir para ver o que dá.Não esqueças de fazer backup de tudo antes de começar a mexer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 18, 2023, 05:10:04 PM",
      "body": "Pela descrição acho que a pasta tem mais chance de ser relacionada a um software de criptografia. Talvez um software para criptografar arquivos. O primeiro bloco foi minerado em janeiro de 2009 então pela data não seria impossível se tratar de algo relacionado a BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "June 18, 2023, 08:48:44 PM",
      "body": "Dificilmente isso possa ser algo relacionado a criptomoedas. Parece mais arquivos relacionados a softwares de criptografia, assim como escreveu o @tg88. Já vi esse tipo de material em arquivos relacionados a gateways e controle de computadores a distancia. Não sei o que se trata.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 08, 2023, 10:35:36 AM",
      "body": "Quote from: tg88 on June 18, 2023, 05:10:04 PMPela descrição acho que a pasta tem mais chance de ser relacionada a um software de criptografia. Talvez um software para criptografar arquivos. O primeiro bloco foi minerado em janeiro de 2009 então pela data não seria impossível se tratar de algo relacionado a BTC.Pois é, se tivesse alguma coisa teria pelo menos 50 BTC que era a recompensa do bloco da época.O bitcoin não era usado para transações entre pessoas nessa época e não existiam exchanges, era apenas minerado e usado como curiosidade... a primeira transação ocorreu entre Satoshi e Hal Finney em 12 de janeiro de 2009. Dificilmente esse seu notebook teve relação com as primeiras transações. Única transação do bloco:https://mempool.space/block/00000000d1145790a8694403d4063f323d499e655c83426834d4ce2f8dd4a2eeE foi em 2010 que compraram uma pizza com 10.000  BTC.https://bitcointalk.org/index.php?topic=137.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}