{
  "id": "topic_5475521",
  "title": "QQ COISA SG",
  "author": "QQ COISA SG",
  "created_time": "November 25, 2023, 11:02:05 PM",
  "content": "Boa noite amigos, tudo bem ? Sou profissional liberal (MEI mas já passei do limite anual de ganho) e, mesmo podendo emitir as NFs normalmente, a maioria dos meus clientes não as quer. Sendo assim, fico receoso de a minha evolução patrimonial acabar caindo na malha fina da RF. Por esse motivo, estou escrevendo aqui para perguntar sobre alternativas dentro do mundo das criptos para poder ocultar esse dinheiro e não ser pego pela RF. Há algum método seguro para fazer isso ? Caso não haja, e alguém saiba de alguma maneira (mesmo fora do mundo das criptos),de não cair na malha fina, favor me ajudar. Há alguma maneira de declarar parte do que eu ganho e não ser pego por não declarar totalmente ? O que posso estudar para aprender a pagar menos imposto de renda possível ? Muito obrigado desde já. Toda ajuda é bem vinda. Forte abraço a todos.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475521",
  "comments": [
    {
      "author": "criptoevangelista",
      "created_time": "November 26, 2023, 03:13:13 AMLast edit: November 26, 2023, 09:46:47 PM by criptoevangelista",
      "body": "Evolução patrimonial em cripto ninguém pode te obrigar a nada, mas se quiser comprar coisas com este dinheiro vai precisar pagar imposto, porque o dinheiro virá de algum lugar né? não há como as coisas aparecerem do nada... É melhor ter um contador competente e de confiança para te orientar a respeito dessas NF q os clientes não querem o q fazer nessa diferença de $, é até interessante você se informar para depois não ter problemas e ter que pagar mais impostos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "November 26, 2023, 06:01:24 PM",
      "body": "Quote from: QQ COISA SG on November 25, 2023, 11:02:05 PMBoa noite amigos, tudo bem ? Sou profissional liberal (MEI mas já passei do limite anual de ganho) e, mesmo podendo emitir as NFs normalmente, a maioria dos meus clientes não as quer. Sendo assim, fico receoso de a minha evolução patrimonial acabar caindo na malha fina da RF. Por esse motivo, estou escrevendo aqui para perguntar sobre alternativas dentro do mundo das criptos para poder ocultar esse dinheiro e não ser pego pela RF. Há algum método seguro para fazer isso ? Caso não haja, e alguém saiba de alguma maneira (mesmo fora do mundo das criptos),de não cair na malha fina, favor me ajudar. Há alguma maneira de declarar parte do que eu ganho e não ser pego por não declarar totalmente ? O que posso estudar para aprender a pagar menos imposto de renda possível ? Duvida, porque seus clientes não querem? E eles te pagam direto via wallet?Assim, cripto pode ser ''uma alternativa para ocultar'' patriomonio, mas sempre que você precisar ir pro mundo real você vai ter um problema. Se tu ganha por um serviço via cripto, não emite nota, o dinheiro NÃO ENTRA NO SEU BANCO e vai direto pra sua wallet, você pode estar ''protegido'', mas quando você quiser converter esse dinheiro pro mundo real, tirando se for pra usar numa pizzaria, pra comprar coisas triviais, você vai precisar justificiar de onde veio o dinheiro pra adquirir determinado patrimonio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "November 26, 2023, 06:58:47 PM",
      "body": "Quote from: QQ COISA SG on November 25, 2023, 11:02:05 PMSou profissional liberal (MEI mas já passei do limite anual de ganho) e, mesmo podendo emitir as NFs normalmente, a maioria dos meus clientes não as quer. Sendo assim, fico receoso de a minha evolução patrimonial acabar caindo na malha fina da RF. Por esse motivo, estou escrevendo aqui para perguntar sobre alternativas dentro do mundo das criptos para poder ocultar esse dinheiro e não ser pego pela RF. Há algum método seguro para fazer isso ?Tu vem aqui pedir sobre um \"método seguro\" para sonegar imposto ao governo!? Sinto muito meu caro, mas você veio ao lugar errado!O que me deixa mais sentido ainda é ver uma pessoa registrando uma conta aqui no fórum não porque quer trocar ideias ou tirar dúvidas sobre o Bitcoin de uma forma legal, mas sim com o intuito de ainda querer utilizar ele de forma errada.Felizmente, hoje em dia o Bitcoin não é mais aquela moeda que as pessoas usavam quando queriam ocultar sua identidade em atos ilícitos, e não gostaria que você também utilizasse (ou tentasse utilizar) ele para esse fim.Você deveria estar estar pensando bem o contrário... deveria estar feliz por estar saindo do limite de um MEI, deveria estar buscando meios de como adequar seu pequeno negócio ao Simples, já fazendo planos em expandir ainda mais seus negócios, pois se ele está indo bem então daqui a pouco você poderia estar contratando gente, abrindo filiais, aumentando faturamento, ser uma empresa grande e respeitável em alguns anos que começou como MEI.Pense grande cara, vá pelo caminho certo.Só estou achando estranho seus clientes não quererem NF, por acaso você trabalho com algo não muito \"usual\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 26, 2023, 07:33:13 PM",
      "body": "Quote from: alegotardo on November 26, 2023, 06:58:47 PMTu vem aqui pedir sobre um \"método seguro\" para sonegar imposto ao governo!? Sinto muito meu caro, mas você veio ao lugar errado!O que me deixa mais sentido ainda é ver uma pessoa registrando uma conta aqui no fórum não porque quer trocar ideias ou tirar dúvidas sobre o Bitcoin de uma forma legal, mas sim com o intuito de ainda querer utilizar ele de forma errada.Felizmente, hoje em dia o Bitcoin não é mais aquela moeda que as pessoas usavam quando queriam ocultar sua identidade em atos ilícitos, e não gostaria que você também utilizasse (ou tentasse utilizar) ele para esse fim.Você deveria estar estar pensando bem o contrário... deveria estar feliz por estar saindo do limite de um MEI, deveria estar buscando meios de como adequar seu pequeno negócio ao Simples, já fazendo planos em expandir ainda mais seus negócios, pois se ele está indo bem então daqui a pouco você poderia estar contratando gente, abrindo filiais, aumentando faturamento, ser uma empresa grande e respeitável em alguns anos que começou como MEI.Pense grande cara, vá pelo caminho certo.Só estou achando estranho seus clientes não quererem NF, por acaso você trabalho com algo não muito \"usual\"?Também não entendi muito bem o motivo da pergunta dele. Vai ver que ele tem em mente que criptomoedas é uma maneira de sonegar impostos. É aquela bobagem que os Ancaps espalharam por ai para que as pessoas fujam do \"Estado Malvadão\" usando criptomoedas. Daí criou-se uma fama bem ruim para o ecossistema.Se o cara já estourou o limite anual do MEI(81 mil reais de faturamento), sinal que o negócio está indo muito bem. Até agora, não sei qual a \"fortuna\" que ele acha que pagará de imposto de renda. Existe várias deduções que o MEI tem como Benefícios.Quanto a nota fiscal, isso não tem muito a ver com evolução patrimonial. Mesmo ele não emitindo nota, a MEI, pela legislação, não é obrigada a emitir nota fiscal para Pessoa Física(caso a mesma não o peça). Só é obrigada a emitir nota para venda ou prestação de serviços para outra PJ.Quanto ao ramo de atividade, o cara pode ser Cabelereiro, Pedreiro, Encanador, dentre outras atividades que raramente o cliente pede nota fiscal.Pra finalizar, me parece mais um caso onde a pessoa não quer pagar absolutamente nada de imposto e nem procurar um contador. O Contador, infelizmente, é uma classe profissional mal compreendida no Brasil. Triste isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 26, 2023, 08:05:10 PM",
      "body": "Bitcoin não é um mecanismo para ocultação de patrimônio e sonegação fiscal. O blockchain é um livro público e aberto.Qualquer pessoa pode ver todo o saldo de qualquer carteira de bitcoin,  e o histórico de transação. É aberto e transparente.Triste que as pessoas procurem o bitcoin inicialmente com esse objetivo ou de enriquecimento rápido e fácil...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 28, 2023, 02:02:15 PM",
      "body": "Pessoal, esse forum não está aqui pra isso.Sonegação e elisão fiscal são crimes e não tem nada bonito nisso.Cuidado ao escreverem esse tipo de bobagem, esse forum é lido por muita gente (inclusive por autoridades do governo). E não adianta deletar ou editar os posts depois, pq existem diversos crawlers em atuação que já replicam todo o conteúdo publicado aqui para outros servidores. Temos privacidade zero nesse forum. Esse espaço é dedicado ao Bitcoin e suas aplicações. Aqui não é um espaço para incentivar a prática de atividades ilegais  nem para discursos de ódio e racismo (como tenho visto em outros tópicos por aqui, não nesse).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "November 28, 2023, 02:05:54 PM",
      "body": "Quote from: bitmover on November 28, 2023, 02:02:15 PMPessoal, esse forum não está aqui pra isso.Sonegação e elisão fiscal são crimes e não tem nada bonito nisso.Cuidado ao escreverem esse tipo de bobagem, esse forum é lido por muita gente (inclusive por autoridades do governo). E não adianta deletar ou editar os posts depois, pq existem diversos crawlers em atuação que já replicam todo o conteúdo publicado aqui para outros servidores. Temos privacidade zero nesse forum. Esse espaço é dedicado ao Bitcoin e suas aplicações. Aqui não é um espaço para incentivar a prática de atividades ilegais  nem para discursos de ódio e racismo (como tenho visto em outros tópicos por aqui, não nesse). Crimes sem vítimas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "November 28, 2023, 02:50:55 PM",
      "body": "Sonegação e elisão fiscal são duas coisas diferentes. Até onde sei elisão fiscal não é crime @bitmoverO contador libertário fala justamente sobre isso no youtube, abertamente, sem anonimizaçãoAcho impressionante algumas das respostas aqui supondo que o negócio do OP vai bem pelo faturamento estar maior (e simplesmente por isso)O aumento de carga tributária na passagem do MEI pra simples nacional é absurdamente alto e é um momento bem difícil, não é “só ir lá e fazer”, tem que ter planejamento e pode quebrar um negócioAlém disso a tabela do MEI já deveria estar em mais de 130 mil reais mas não é reajustada faz anos (diferente do salário dos políticos)Acredito que deveriamos poder conversar sobre tudo aqui no forum, com a consciência sim de que é um espaço publico, não completamente privado, mas a camada de anonimização tras até algum aspecto de TAZ (zona autonoma temporaria) pro nosso espaço aquiAssim como outros ja mencionaram também acho curiosa essa combinação de gostar de crypto e bitcoin e ao mesmo tempo ter uma alta propensão para confiar e desejar colaborar com o estado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 28, 2023, 03:51:17 PM",
      "body": "Quote from: Lucasgabd on November 28, 2023, 02:50:55 PMSonegação e elisão fiscal são duas coisas diferentes. Até onde sei elisão fiscal não é crime @bitmoverVoce esta certo, elisao fiscal nao é crime. erro meu. Era tanta baboseira nos posts q eu fico ate perdido lendo tanta bobagem.Quote from: Lucasgabd on November 28, 2023, 02:50:55 PMAcredito que deveriamos poder conversar sobre tudo aqui no forum, com a consciência sim de que é um espaço publico, não completamente privado, mas a camada de anonimização tras até algum aspecto de TAZ (zona autonoma temporaria) pro nosso espaço aquiVoce realmente acha que deveríamos poder falar sobre esses assuntos aqui?Isso esta no OP.\"não ser pego por não declarar totalmente\"ou então\"eu sonego o maximo que posso\"\"Crimes sem vítimas.'Depois não reclame se der alguma merda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 28, 2023, 08:08:51 PM",
      "body": "Quote from: bitmover on November 28, 2023, 03:51:17 PMVoce realmente acha que deveríamos poder falar sobre esses assuntos aqui?Isso esta no OP.\"não ser pego por não declarar totalmente\"ou então\"eu sonego o maximo que posso\"\"Crimes sem vítimas.'Depois não reclame se der alguma merda  Também não entendo @bitmover o que esse tipo de postagem tem a ver com o Bitcoin e criptomoedas em geral. Isso só acirra os Governos a quererem fiscalizar e taxar mais quem opera com esse ramo de atividade. Em vez de lutarei por melhores leis e normas para as criptomoedas, eles simplesmente querem chutar o balde e acabar com o Estado, como se isso fosse possível. Enquanto isso, a propaganda negativa sobre o Bitcoin só vai crescendo. Muitos acham que ser Ancap eé lindo e maravilhoso. Daí crescem, saem do condomínio onde vivem e se deparam com o mundo real. É muito triste essa juventude que vem por ai.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 28, 2023, 08:49:51 PM",
      "body": "Quote from: Paredao on November 28, 2023, 08:08:51 PMQuote from: bitmover on November 28, 2023, 03:51:17 PMVoce realmente acha que deveríamos poder falar sobre esses assuntos aqui?Isso esta no OP.\"não ser pego por não declarar totalmente\"ou então\"eu sonego o maximo que posso\"\"Crimes sem vítimas.'Depois não reclame se der alguma merda  Também não entendo @bitmover o que esse tipo de postagem tem a ver com o Bitcoin e criptomoedas em geral. Isso só acirra os Governos a quererem fiscalizar e taxar mais quem opera com esse ramo de atividade. Em vez de lutarei por melhores leis e normas para as criptomoedas, eles simplesmente querem chutar o balde e acabar com o Estado, como se isso fosse possível. Enquanto isso, a propaganda negativa sobre o Bitcoin só vai crescendo. Muitos acham que ser Ancap eé lindo e maravilhoso. Daí crescem, saem do condomínio onde vivem e se deparam com o mundo real. É muito triste essa juventude que vem por ai.Pois é, uma total falta de compreensão das coisas.É aquela pessoa que joga o lixo na lixeira e acha que ele magicamente desaparece, sem nenhum intervenção do Estado. Ou que anda por ruas bonitas e belas calçadas, e acha que temos direito natural a essas coisas.Enfim, da pra falar tanta coisa que nem vale a pena...Ninguém gosta de pagar impostos, mas esse é o ordenamento das coisas hoje. Se nao fosse imposto, seria algo similar com outro nome. Não existe uma sociedade sem impostos. E quanto ao \"crime sem vitimas\", a vitima mais imediata vai acabar sendo o proprio sonegador. Principalmente esse que avisa na internet que tem orgulho de sonegar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 28, 2023, 08:51:07 PM",
      "body": "Quote from: QQ COISA SG on November 25, 2023, 11:02:05 PMSou profissional liberal (MEI mas já passei do limite anual de ganho) e, mesmo podendo emitir as NFs normalmente, a maioria dos meus clientes não as quer.Já muito foi dito sobre o assunto, por isso apenas acrescento esta nota:Não é pelo facto de um cliente não querer NF que o dinheiro recebido, numa troca comercial, não tenha de ser declarado. Principalmente se no acumulado, você já tiver de pagar algum imposto. Por isso, não siga esse caminho, e se o seu negocio esta a crescer, cresça com ele e torna-se um profissional ainda melhor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "November 29, 2023, 02:01:47 PM",
      "body": "Quote from: bitmover on November 28, 2023, 03:51:17 PMQuote from: Lucasgabd on November 28, 2023, 02:50:55 PMSonegação e elisão fiscal são duas coisas diferentes. Até onde sei elisão fiscal não é crime @bitmoverVoce esta certo, elisao fiscal nao é crime. erro meu. Era tanta baboseira nos posts q eu fico ate perdido lendo tanta bobagem.Quote from: Lucasgabd on November 28, 2023, 02:50:55 PMAcredito que deveriamos poder conversar sobre tudo aqui no forum, com a consciência sim de que é um espaço publico, não completamente privado, mas a camada de anonimização tras até algum aspecto de TAZ (zona autonoma temporaria) pro nosso espaço aquiVoce realmente acha que deveríamos poder falar sobre esses assuntos aqui?Isso esta no OP.\"não ser pego por não declarar totalmente\"ou então\"eu sonego o maximo que posso\"\"Crimes sem vítimas.'Depois não reclame se der alguma merda  acho que a gente deveria poder falar sobre tudo em todos os lugares. mas não falo tudo que penso aqui justamente pelo meu perfil não ser anônimo.só por desencargo de consciência:QuoteEm caso de investigação policial, eu oficialmente declaro que não tenho envolvimento com este grupo e não sei como estou no mesmo, provavelmente fui inserido por terceiros, declaro que estou disposto a colaborar com as investigações e estou disposto a me apresentar a depoimento se necessário, declaro que sou completamente inocente e não tenho envolvimento nenhum com este caso mostrado neste grupo específico. Quote from: Paredao on November 28, 2023, 08:08:51 PMQuote from: bitmover on November 28, 2023, 03:51:17 PMVoce realmente acha que deveríamos poder falar sobre esses assuntos aqui?Isso esta no OP.\"não ser pego por não declarar totalmente\"ou então\"eu sonego o maximo que posso\"\"Crimes sem vítimas.'Depois não reclame se der alguma merda  Também não entendo @bitmover o que esse tipo de postagem tem a ver com o Bitcoin e criptomoedas em geral. Isso só acirra os Governos a quererem fiscalizar e taxar mais quem opera com esse ramo de atividade. Em vez de lutarei por melhores leis e normas para as criptomoedas, eles simplesmente querem chutar o balde e acabar com o Estado, como se isso fosse possível. Enquanto isso, a propaganda negativa sobre o Bitcoin só vai crescendo. Muitos acham que ser Ancap eé lindo e maravilhoso. Daí crescem, saem do condomínio onde vivem e se deparam com o mundo real. É muito triste essa juventude que vem por ai.como você vê o bitcoin @Paredao ?por esse comentário me parece que você vê o bitcoin como uma classe de ativos criada para enriquecer quem compra, não sei...mas parece ignorar sua história... quando satoshi criou crypto ele justamente falou sobre \"um novo território de liberdade\", longe da possibilidade de controle do estado.Quote from: joker_josue on November 28, 2023, 08:51:07 PMQuote from: QQ COISA SG on November 25, 2023, 11:02:05 PMSou profissional liberal (MEI mas já passei do limite anual de ganho) e, mesmo podendo emitir as NFs normalmente, a maioria dos meus clientes não as quer.Já muito foi dito sobre o assunto, por isso apenas acrescento esta nota:Não é pelo facto de um cliente não querer NF que o dinheiro recebido, numa troca comercial, não tenha de ser declarado. Principalmente se no acumulado, você já tiver de pagar algum imposto. Por isso, não siga esse caminho, e se o seu negocio esta a crescer, cresça com ele e torna-se um profissional ainda melhor.   não sei se você está por dentro da legislação específica no Brasil joker (eu não faço ideia da de Portugal, por exemplo), mas aqui se você tem um MEI é desobrigado de emitir nota fiscal para pessoa física que não peça, o MEI só é obrigado a emitir nota fiscal para PJ.sobre explicar origem dos fundos, etc... é outra históriamas vocês acham mesmo que todo mundo declara tudo o que recebe 100% sem erros?coisa rara hoje em dia né...ainda mais com o imposto de renda crescendo adoidado ao longo das últimas décadas, já estamos bem acima dos 10% originalmente propostos pra combater Napoleão.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 29, 2023, 07:59:20 PM",
      "body": "Quote from: Lucasgabd on November 29, 2023, 02:01:47 PMnão sei se você está por dentro da legislação específica no Brasil joker (eu não faço ideia da de Portugal, por exemplo), mas aqui se você tem um MEI é desobrigado de emitir nota fiscal para pessoa física que não peça, o MEI só é obrigado a emitir nota fiscal para PJ.sobre explicar origem dos fundos, etc... é outra históriamas vocês acham mesmo que todo mundo declara tudo o que recebe 100% sem erros?coisa rara hoje em dia né...ainda mais com o imposto de renda crescendo adoidado ao longo das últimas décadas, já estamos bem acima dos 10% originalmente propostos pra combater Napoleão.Mas fui isso que eu quis dizer. Não pelo o facto que a pessoa física não peça essa nota, que o profissional não tenha de declarar.Logicamente, a maioria não declarar 100%, principalmente os profissionais liberais. Mas, a pessoa deve no mínimo declarar algo que mais ou menos represente o \"nível de vida\" que tem, caso contrario vai poder vir a ter problemas no futuro. Ou seja, se você tem vida de luxo, e declara o mínimo possível, algo não irá estar a bater certo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 29, 2023, 08:15:09 PM",
      "body": "Quote from: Lucasgabd on November 29, 2023, 02:01:47 PMcomo você vê o bitcoin @Paredao ?por esse comentário me parece que você vê o bitcoin como uma classe de ativos criada para enriquecer quem compra, não sei...mas parece ignorar sua história... quando satoshi criou crypto ele justamente falou sobre \"um novo território de liberdade\", longe da possibilidade de controle do estado.Já falei em outros comentários como vejo o Bitcoin. Para mim, o Bitcoin foi criado em 2008 por causa da quebradeira causada por Bancos PRIVADOS, onde muitos fecharam e ficaram com o dinheiro dos clientes. Eu vejo o Bitcoin como uma moeda de troca e também para abolição do uso dos Bancos PRIVADOS multibilionários no dia a dia.Talvez o meu pensamento seja mais utópico do que o da maioria, pois uma sociedade sem Bancos PRIVADOS é algo praticamente impossível de acontecer. Já estão enraizados na sociedade desde o século XV. Então, já são mais de 600 anos que eles existem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 29, 2023, 09:00:28 PM",
      "body": "Quote from: Paredao on November 29, 2023, 08:15:09 PMQuote from: Lucasgabd on November 29, 2023, 02:01:47 PMcomo você vê o bitcoin @Paredao ?por esse comentário me parece que você vê o bitcoin como uma classe de ativos criada para enriquecer quem compra, não sei...mas parece ignorar sua história... quando satoshi criou crypto ele justamente falou sobre \"um novo território de liberdade\", longe da possibilidade de controle do estado.Já falei em outros comentários como vejo o Bitcoin. Para mim, o Bitcoin foi criado em 2008 por causa da quebradeira causada por Bancos PRIVADOS, onde muitos fecharam e ficaram com o dinheiro dos clientes. Eu vejo o Bitcoin como uma moeda de troca e também para abolição do uso dos Bancos PRIVADOS multibilionários no dia a dia.Talvez o meu pensamento seja mais utópico do que o da maioria, pois uma sociedade sem Bancos PRIVADOS é algo praticamente impossível de acontecer. Já estão enraizados na sociedade desde o século XV. Então, já são mais de 600 anos que eles existem.  Lembrando que na mensagem do satoshi do bloco genesis, ele criticou não apenas os bancos privados, mas o estado que correu em seu socorro com bilhões de dólares..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 30, 2023, 12:07:36 AM",
      "body": "Quote from: Paredao on November 29, 2023, 08:15:09 PMQuote from: Lucasgabd on November 29, 2023, 02:01:47 PMcomo você vê o bitcoin @Paredao ?por esse comentário me parece que você vê o bitcoin como uma classe de ativos criada para enriquecer quem compra, não sei...mas parece ignorar sua história... quando satoshi criou crypto ele justamente falou sobre \"um novo território de liberdade\", longe da possibilidade de controle do estado.Já falei em outros comentários como vejo o Bitcoin. Para mim, o Bitcoin foi criado em 2008 por causa da quebradeira causada por Bancos PRIVADOS, onde muitos fecharam e ficaram com o dinheiro dos clientes. Eu vejo o Bitcoin como uma moeda de troca e também para abolição do uso dos Bancos PRIVADOS multibilionários no dia a dia.Talvez o meu pensamento seja mais utópico do que o da maioria, pois uma sociedade sem Bancos PRIVADOS é algo praticamente impossível de acontecer. Já estão enraizados na sociedade desde o século XV. Então, já são mais de 600 anos que eles existem.  Não é o único. Também acho que o Bitcoin deve ser visto como moeda de troca, e não apenas um meio de alcançar muito fiat. Fazer isso é continuar esse lobby que já existe há 600 anos.Infelizmente, vejo mais pessoas a olharem para o Bitcoin como apenas uma ferramenta para alcançar milhões, do que a usarem como era suposto originalmente, moeda de troca.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 30, 2023, 01:14:23 AM",
      "body": "Quote from: Paredao on November 29, 2023, 08:15:09 PMQuote from: Lucasgabd on November 29, 2023, 02:01:47 PMcomo você vê o bitcoin @Paredao ?por esse comentário me parece que você vê o bitcoin como uma classe de ativos criada para enriquecer quem compra, não sei...mas parece ignorar sua história... quando satoshi criou crypto ele justamente falou sobre \"um novo território de liberdade\", longe da possibilidade de controle do estado.Já falei em outros comentários como vejo o Bitcoin. Para mim, o Bitcoin foi criado em 2008 por causa da quebradeira causada por Bancos PRIVADOS, onde muitos fecharam e ficaram com o dinheiro dos clientes. Eu vejo o Bitcoin como uma moeda de troca e também para abolição do uso dos Bancos PRIVADOS multibilionários no dia a dia.Talvez o meu pensamento seja mais utópico do que o da maioria, pois uma sociedade sem Bancos PRIVADOS é algo praticamente impossível de acontecer. Já estão enraizados na sociedade desde o século XV. Então, já são mais de 600 anos que eles existem.  Olha, ver o Bitcoin apenas como uma alternativa a quebradeira de bancos é simplesmente ignorar todos os seus fundamentos e tecnologias revolucionárias, é ignorar a escalabilidade social que ele executa com perfeição, é raro colocar duas pessoas ou classes que se odeiam a trabalhar por um bem em comum, colocar um desonesto a trabalhar num local aonde ele tem que ser honesto pq não vale a pena trapacear... é ignorar completamente a revolução criada com a escassez digital, imaginaria algo digital que não pode ser copiado ou replicado? hoje em dia é fácil quando as coisas já existem, mas aonde não existia nada algo se fez ali é incrível e fantástico... é ignorar completamente um dinheiro perfeito, que corrige todos os problemas dos demais, sem fronteiras, sem intermediários, é enviar valores através de meios de comunicação para o outro lado do planeta rapidamente e sem burocracias. É ignorar todos os avanços tecnológicos que ele inspirou e que hoje nós vemos sendo criados... É simplesmente não reconhecer que o bitcoin é a maior invenção da humanidade após a internet, muitos os vêem apenas como um dinheiro, mas o que há por trás é muito maior.... é o verdadeiro imperativo moral... É a liberdade em sua pura e verdadeira essência.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 30, 2023, 02:08:30 PM",
      "body": "Quote from: criptoevangelista on November 30, 2023, 01:14:23 AMOlha, ver o Bitcoin apenas como uma alternativa a quebradeira de bancos é simplesmente ignorar todos os seus fundamentos e tecnologias revolucionárias....................Faltou combinar com o satoshihttps://mempool.space/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26fQuote from: satoshi genesis_block\u0004\u001d\u0001\u0004EThe Times 03/Jan/2009 Chancellor on brink of second bailout for banksBitcoin é isso. Não apenas isso, mas é isso também.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}