{
  "id": "topic_5497122",
  "title": "bythesea",
  "author": "bythesea",
  "created_time": "May 20, 2024, 12:07:18 PM",
  "content": "Ok like the title says I have some old wallet that belonged to my late friend.He died in 2021 from Corona and his parents asked me to check his computers and mails and such.It took them some time since they were still grieving or not ready to face the truth.Now there were no apps related to crypto, no search history for any know exchange or anything about crypto mining, no mails for anything that i could though of ( at least in the email I had access to )....The only thing I found was old btc wallet from 2013.I tried looking for address/pools inside it but failed - i didn't load it into any wallet like Electrum so i have no idea if there are any coins there.I explained to his parents what it is and told them it could have insane value or basically be worthless - there was no password file or any private keys in that folder where wallet was or anywhere on his drives ( SSDs, HDDs, Flash drives ).So now I am not sure what to do, should I just keep it or try to open and see ( i really doubt there is anything there ).If there are coins inside i won't be able to use/transfer them without pass and bruteforce wont probably work.So does anyone have any suggestion?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5497122",
  "comments": [
    {
      "author": "peter0425",
      "created_time": "May 20, 2024, 12:26:21 PM",
      "body": "Quote from: bythesea on May 20, 2024, 12:07:18 PMOk like the title says I have some old wallet that belonged to my late friend.First of all, I am deeply sorry for the passing of your friend.QuoteHe died in 2021 from Corona and his parents asked me to check his computers and mails and such.Was it only his parents who asked you to check his belongings? Did your friend ever ask you to do it? Or did he have any chance to tell you about bitcoin? This might be personal questions but I think before you decide how to open the wallet you should also consider what might have been the decision of your friend. If he didn’t tell anyone I doubt he wanted to leave those coins to someone, if there were any.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bythesea",
      "created_time": "May 20, 2024, 12:37:00 PM",
      "body": "His parents asked me, they were basically looking if there any of his photos because he didn't like to take phots so they don't have many.They didn't even turn on his computer until then. I was the 1st one to turn it on in almost 3 years.There was no will or anything so everything he had went to his parents.I don't know if he would mind but i am sure that he would like his parents to get it if there are some coins inside.So not here asking for any personal gain or anything, just if someone has idea what to do or should i just tell them i tried and forget about it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 20, 2024, 12:49:45 PM",
      "body": "Quote from: bythesea on May 20, 2024, 12:07:18 PMSo now I am not sure what to do, should I just keep it or try to open and see ( i really doubt there is anything there ).The matter is quite clear, you got access to the computer, and now you just need to get permission to load that file and see what's in it - of course, do it in the presence of his parents.Quote from: bythesea on May 20, 2024, 12:07:18 PMIf there are coins inside i won't be able to use/transfer them without pass and bruteforce wont probably work.Maybe you found an empty wallet, and maybe the wallet doesn't have any protection - even if it does, maybe you'll find the password somewhere in his personal belongings or on the computer. In any case, whatever you do, be careful not to download a fake wallet - and if you want to try Electrum, I advise you to read -> [GUIDE] How to Safely Download and Verify Electrum [Guide]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "May 20, 2024, 12:55:36 PM",
      "body": "What wallet file format do you have from parent's of your friend?[overview] Recover Bitcoin from any old storage formatIf you can tell us about the wallet format, forum members can help you. Don't send wallet file to any forum member who sends you PM and ask you to do this.There is a wallet recovery service too.Bitcoin Wallet Recovery Services - for forgotten wallet passwordMake some copies of wallet file before you try recover it by yourself or use any wallet recovery service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skfox",
      "created_time": "May 20, 2024, 01:18:12 PM",
      "body": "Quote from: peter0425 on May 20, 2024, 12:26:21 PMWas it only his parents who asked you to check his belongings? Did your friend ever ask you to do it? Or did he have any chance to tell you about bitcoin? This might be personal questions but I think before you decide how to open the wallet you should also consider what might have been the decision of your friend. If he didn’t tell anyone I doubt he wanted to leave those coins to someone, if there were any.You may not be far from the truth, if op's friend wanted someone to know about his bitcoin wallet he would have related it either to his parents or someone else.These questions need to be considered so as not to go against a friend's wish.But if it's with the consent of his parents you can go ahead, they still have the right to take decision for their son but the unlocking should be done in their presence (the parents) also following the legit way of unlocking the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "May 20, 2024, 01:22:09 PM",
      "body": "Quote from: bythesea on May 20, 2024, 12:07:18 PMOk like the title says I have some old wallet that belonged to my late friend.He died in 2021 from Corona and his parents asked me to check his computers and mails and such.It took them some time since they were still grieving or not ready to face the truth.Now there were no apps related to crypto, no search history for any know exchange or anything about crypto mining, no mails for anything that i could though of ( at least in the email I had access to )....The only thing I found was old btc wallet from 2013.I tried looking for address/pools inside it but failed - i didn't load it into any wallet like Electrum so i have no idea if there are any coins there.I explained to his parents what it is and told them it could have insane value or basically be worthless - there was no password file or any private keys in that folder where wallet was or anywhere on his drives ( SSDs, HDDs, Flash drives ).So now I am not sure what to do, should I just keep it or try to open and see ( i really doubt there is anything there ).If there are coins inside i won't be able to use/transfer them without pass and bruteforce wont probably work.So does anyone have any suggestion?First of all did your friend tell you he owns some amount of Bitcoin Before he died? or in any way tell his parents and siblings about his Bitcoin holdings, This way you will be able know where to begin with because these are things you have to be certain about so you don't end up wasting a whole lot of time seeking nothing. When this is ascertained, now this gives you the courage to do whatever you can and it will take to try to recover or get access to the wallet. His parents should also help you in checking some of his files, if by chance he wrote down his key phrases somewhere on a paper and this will make the whole process even easier for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bythesea",
      "created_time": "May 20, 2024, 02:23:08 PMLast edit: May 20, 2024, 11:29:32 PM by Mr. Big",
      "body": "Quote from: Lucius on May 20, 2024, 12:49:45 PMQuote from: bythesea on May 20, 2024, 12:07:18 PMSo now I am not sure what to do, should I just keep it or try to open and see ( i really doubt there is anything there ).The matter is quite clear, you got access to the computer, and now you just need to get permission to load that file and see what's in it - of course, do it in the presence of his parents.Quote from: bythesea on May 20, 2024, 12:07:18 PMIf there are coins inside i won't be able to use/transfer them without pass and bruteforce wont probably work.Maybe you found an empty wallet, and maybe the wallet doesn't have any protection - even if it does, maybe you'll find the password somewhere in his personal belongings or on the computer. In any case, whatever you do, be careful not to download a fake wallet - and if you want to try Electrum, I advise you to read -> [GUIDE] How to Safely Download and Verify Electrum [Guide]I'm really not sure. I will ask parents during weekend to check again, perhaps there are some hidden files for which I didn't looked for.Thanks for the link. Quote from: Catenaccio on May 20, 2024, 12:55:36 PMWhat wallet file format do you have from parent's of your friend?[overview] Recover Bitcoin from any old storage formatIf you can tell us about the wallet format, forum members can help you. Don't send wallet file to any forum member who sends you PM and ask you to do this.There is a wallet recovery service too.Bitcoin Wallet Recovery Services - for forgotten wallet passwordMake some copies of wallet file before you try recover it by yourself or use any wallet recovery service.It is wallet.dat for early 2013..not really big file, some 70-80kb of I remember correctly. Will have to check when I get back home.I don't plan the send it, unless it proves to be empty, perhaps someone could use old wallet.Thanks for that. I will check that link as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "May 20, 2024, 02:37:19 PM",
      "body": "Quote from: bythesea on May 20, 2024, 12:07:18 PMSo does anyone have any suggestion?I'm really sorry about your friend, i know how hard it is.About the wallet, maybe you could get the password from the web browser on his computer, as you know some people save their passwords on the web browsers (which is a damn terrible practice, but a lot of users do it), and maybe one of those passwords were used for the wallet too. That's what i would do, at least is a way to try to recover that wallet. I hope this information helps and i wish you good luck with the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bythesea",
      "created_time": "May 20, 2024, 02:46:22 PM",
      "body": "Quote from: Franctoshi on May 20, 2024, 01:22:09 PMQuote from: bythesea on May 20, 2024, 12:07:18 PMOk like the title says I have some old wallet that belonged to my late friend.He died in 2021 from Corona and his parents asked me to check his computers and mails and such.It took them some time since they were still grieving or not ready to face the truth.Now there were no apps related to crypto, no search history for any know exchange or anything about crypto mining, no mails for anything that i could though of ( at least in the email I had access to )....The only thing I found was old btc wallet from 2013.I tried looking for address/pools inside it but failed - i didn't load it into any wallet like Electrum so i have no idea if there are any coins there.I explained to his parents what it is and told them it could have insane value or basically be worthless - there was no password file or any private keys in that folder where wallet was or anywhere on his drives ( SSDs, HDDs, Flash drives ).So now I am not sure what to do, should I just keep it or try to open and see ( i really doubt there is anything there ).If there are coins inside i won't be able to use/transfer them without pass and bruteforce wont probably work.So does anyone have any suggestion?First of all did your friend tell you he owns some amount of Bitcoin Before he died? or in any way tell his parents and siblings about his Bitcoin holdings, This way you will be able know where to begin with because these are things you have to be certain about so you don't end up wasting a whole lot of time seeking nothing. When this is ascertained, now this gives you the courage to do whatever you can and it will take to try to recover or get access to the wallet. His parents should also help you in checking some of his files, if by chance he wrote down his key phrases somewhere on a paper and this will make the whole process even easier for you. No sadly ne never talked about it or mentioned anything in regard to crypto. That is what it makes it strange. His parents are in late 70s and not really technically \"educated\" so until I told them what it was they never actually heard about Bitcoin.Unfortunately he was the only child, never  married, no kids, and last girlfriend he had was late 10.years ago.At the moment it is just a project if I get access great if not well I won't lose my sleep over it.I just wanted to know if anyone had any idea what do to because it kinda hit me hard even though friend was never really a talkative person and kept to himself so that could be the reason if he did had some coins he never mentioned it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "May 20, 2024, 03:46:50 PM",
      "body": "Quote from: bythesea on May 20, 2024, 02:26:14 PMQuote from: Catenaccio on May 20, 2024, 12:55:36 PMWhat wallet file format do you have from parent's of your friend?[overview] Recover Bitcoin from any old storage formatIf you can tell us about the wallet format, forum members can help you. Don't send wallet file to any forum member who sends you PM and ask you to do this.There is a wallet recovery service too.Bitcoin Wallet Recovery Services - for forgotten wallet passwordMake some copies of wallet file before you try recover it by yourself or use any wallet recovery service.It is wallet.dat for early 2013..not really big file, some 70-80kb of I remember correctly. Will have to check when I get back home.I don't plan the send it, unless it proves to be empty, perhaps someone could use old wallet.Thanks for that. I will check that link as well. Even if the wallet is an empty wallet then what is the harm in checking in it ?If there are some coins in it then you can just intimate his parents about it, they will just be more than happy about it.Even if it is empty then just consider it as your duty that you are doing for your friend.What would you have wanted if you were in the same situation i.e. would you have wanted your friend to check out your wallet ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 20, 2024, 03:51:43 PM",
      "body": "Quote from: bythesea on May 20, 2024, 02:46:22 PMNo sadly ne never talked about it or mentioned anything in regard to crypto. That is what it makes it strange. ~snip~This is nothing strange, considering that the wallet is from 2013, it is possible that your friend invested some money in BTC then and completely forgot about it. Besides, it is not advisable to talk about such things, and maybe he was aware of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 21, 2024, 07:10:04 AM",
      "body": "Quote from: bythesea on May 20, 2024, 02:46:22 PMAt the moment it is just a project if I get access great if not well I won't lose my sleep over it.I just wanted to know if anyone had any idea what do to because it kinda hit me hard even though friend was never really a talkative person and kept to himself so that could be the reason if he did had some coins he never mentioned it. He was silent. But maybe it was just an introduction to Bitcoin, and that’s why, after 8 years, you haven’t heard any stories from him? However, I just thought, What could I do in this situation? If you are not competent in the matter of file recovery, do not rush; try to be careful and act carefully. If his parents trust you to look at your friend's computer, then they trust his personal story, and therefore you should not spoil their opinion of you. However, I would not reassure parents in advance that you can find some amount of bitcoins in a friend’s wallet, since older people can think a lot if the result is negative, deciding on their own that you want to deceive them. But if you find it, it would be a very decent thing to cash out and give away what rightfully belongs to your parents. I don’t think any normal person wouldn’t want to do this for their loved ones in case of an accident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "May 21, 2024, 08:17:12 AM",
      "body": "My condolences for your friend, COVID really hits the best of us in the worst way possible. Regards to your dilemma, I think that you're probably better off with just keeping it for yourself but make some form of condition with your friend's parents that if you ever find something from it or you've found a way to access that wallet, they're entitled to the contents depending on how you were able to get it, that's the thing that will matter the most, it's not weird that your friend doesn't have the access for that wallet on the computer, it would be somewhere that's not in that computer, of that I'm sure of, maybe try to look for other stuff that might be a potential hiding place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "May 21, 2024, 10:15:46 AM",
      "body": "Quote from: Skfox on May 20, 2024, 01:18:12 PMBut if it's with the consent of his parents you can go ahead, they still have the right to take decision for their son but the unlocking should be done in their presence (the parents) also following the legit way of unlocking the wallet.I guess you are right and it was mentioned that op had explained to his friend’s parents what it was and what could it hold. I hope they understood it properly so that it doesn’t fireback towards op in the end.They could be totally clueless about it and lose everything their son had worked up for. That would not only be a shame but also disrespect to the deceased, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angrybirdy",
      "created_time": "May 21, 2024, 10:31:53 AM",
      "body": "Quote from: Lucius on May 20, 2024, 03:51:43 PMQuote from: bythesea on May 20, 2024, 02:46:22 PMNo sadly ne never talked about it or mentioned anything in regard to crypto. That is what it makes it strange. ~snip~This is nothing strange, considering that the wallet is from 2013, it is possible that your friend invested some money in BTC then and completely forgot about it. Besides, it is not advisable to talk about such things, and maybe he was aware of that.this is also the first thing that came to my mind, keeping the old wallet in his desktop, it means OP's friend is holding something, it's possible that he has an investment held there. When it comes to our investments, we usually don't even inform family members because they are considered as confidential things for me. The situation is difficult if the sudden disappearance of a person and then the investments or properties are not left to the families, it is quite difficult to recover especially since there is no other lead and there is no consent from the owner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 21, 2024, 10:42:48 AM",
      "body": "Quote from: angrybirdy on May 21, 2024, 10:31:53 AMthis is also the first thing that came to my mind, keeping the old wallet in his desktop, it means OP's friend is holding something, it's possible that he has an investment held there. ~snip~We can guess as much as we want, but in the end it may just be a wallet that contains nothing. The man was curious and downloaded the BTC wallet, after some time he apparently deleted it and the wallet file remained. It was a very different time than today with a lot of doubt in BTC, and about seventy times less price than today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "May 21, 2024, 11:20:58 AM",
      "body": "Quote from: bythesea on May 20, 2024, 12:07:18 PMSo now I am not sure what to do, should I just keep it or try to open and see ( i really doubt there is anything there ).If there are coins inside i won't be able to use/transfer them without pass and bruteforce wont probably work.So does anyone have any suggestion?With all the stress you've explained which you passed through just to get access to the wallet is believed to be that you needed to help the parents get reached to their sons assets which is stored in the wallet before his demise.So why don't you do what you can to get access to the wallet as to know if there was coin inside Instead of coming to ask the public here.I don't also know the kind of suggestion you needed again when your late friends parent has called on you to asiste them recover their sons funds. Or do you mean technically guidelines on how you can maneuver to get access to the wallet so that you can transact with the assets?Honestly, I worry why the parents would call on you on such case because this is a sensitive view thing if I may say. Does the parent knew your friend was a bitcoin investor? And how do they think you're best convenience to do that task knowing that bitcoin has wallets involving passwords and private keys so how'd the parent think you could have access to such privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 21, 2024, 02:56:07 PM",
      "body": "Quote from: Skfox on May 20, 2024, 01:18:12 PMQuote from: peter0425 on May 20, 2024, 12:26:21 PMWas it only his parents who asked you to check his belongings? Did your friend ever ask you to do it? Or did he have any chance to tell you about bitcoin? This might be personal questions but I think before you decide how to open the wallet you should also consider what might have been the decision of your friend. If he didn’t tell anyone I doubt he wanted to leave those coins to someone, if there were any.You may not be far from the truth, if op's friend wanted someone to know about his bitcoin wallet he would have related it either to his parents or someone else.These questions need to be considered so as not to go against a friend's wish.But if it's with the consent of his parents you can go ahead, they still have the right to take decision for their son but the unlocking should be done in their presence (the parents) also following the legit way of unlocking the wallet.I am thinking if this might be one of the consequences of decentralization. Not that I think decentralization is a bad thing but in times like this, it makes me think how could one hand over his or her coins to someone without giving them explicitly the wallet before death. At least with banks it’s all automatic. You tell them the account should be accessed by this and that but with crypto, it gets a little more complicated than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 22, 2024, 06:35:05 PM",
      "body": "First of all, I'm sorry for loss of your friend. It's really hard to forget the ones whom we lost in that Covid 19 times but at least we could wish best for their next life. The wallet file from 2013 could contain some Bitcoin in it and who knows your friend might be someone who believed in the concept of HODL.I suggest you to look for all folders of his hard drives, SSD's, and also look for all hidden folders. Then you may manually check each text file, image file, video file, and audio file to see if you can find any clue about the seed phrase or private keys. I know it can be a time consuming task but if you do it with pure heart then you may get success.If you don't find anything in those folders and files then you may try to use some recovery software and a safe external hard drive or SSD to recover all lost files that were deleted. There's chance that you may find some clue in those recovered files.You may also try to check his browser history, saved passwords, and each possible crypto exchange which he might have visited when he was alive. Some people prefer to keep their Bitcoin at exchanges, I personally don't recommend that approach but still there are some people who do that.After going through all of those procedures you might get some clue about the wallet but there's possibility that you may not find any clue. You may try your best and then post in this thread to let us know the results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}