{
  "id": "topic_5407076",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "July 20, 2022, 11:03:08 PM",
  "content": "With the crypto winter and BTC prices looking bearish, Tesla CEO and Space X founder, Elon Musk has shipped off 75% of his shares in Bitcoin. This news comes as a surprise after his proclamation in March where he was adamant on selling his coins.Tesla had about 42,000 bitcoins at the start of Q2 but had to sell off the majority of its coins at $29,000 From the 2nd quarter report gathered by the company, it was revealed that the coins were sold for $963m and still has a reserve \" digital asset\" left of about $218m should he see the need to sell off. In February last year, Tesla purchased a whooping $1.5m worth of crypto and this move helped to push the value of BTC and enthusiasts labeled him the de facto  \"crypto leader\" but that status quickly changed the moment he renounced the acceptance of BTC as payment for his goods.  Its believed that the steep decline in BTC price was what fuelled the rush to sell off. What do we make of this move? Is there a plan to bounce back when the market becomes favorable, or is the beginning of the end for Elon and crypto? https://techcrunch.com/2022/07/20/tesla-dumped-75-of-its-bitcoin-holdings/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407076",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 20, 2022, 11:09:53 PM",
      "body": "Haven't you be expecting this for long? Though it was longer than I was expecting. Elon Musk only has ambition to support doge. He bought bitcoin, he let Tesla to accept bitcoin. People were thinking he is bitcoin enthusiast but not. He later let Tesla not to accept bitcoin, all his plans from the beginning before Tesla was even accepting bitcoin, he just want people to know more about doge. Musk later let Tesla accept doge, not only the coin using less power for miner, but just his favourite and manipulation. We all know that Elon Musk is not after another thing than doge.Instead to hold bitcoin for long, he sold now. But I know he will be planing to manipulate the market again in another massive bull market. I was expecting this, not a surprise for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 20, 2022, 11:13:56 PM",
      "body": "Pretty easy decision for him and I think maybe some of us had so this coming. Obviously, it has something to do with the current state of the market and maybe he knows that he is going to lose money short term. So as a businessman, he has to shift and keep moving his money around so that it will still grow despite the current recession that we are having. So I'm not surprised, but I don't think this is an attack to bitcoin coming from him, just a business move, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 21, 2022, 12:03:09 AM",
      "body": "It's nothing that weird, if we remove the fact that Elon/Tesla had a huge amount of coins, it's just a matter of an investor cutting his losses, especially if we consider how his (public) opinion has been pretty negative in the past months. He may convert again later on but I doubt he'd be able to bring that much hype compared to the first time he did it. I also wouldn't put it much past him not entering Bitcoin again when the market recovers, as I said, he's an investor/Businessman. If he sees the market as profitable again, then he'd probably come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 21, 2022, 02:08:54 AM",
      "body": "Having the power and the voice of someone who is the number #1 guy in the world (in terms of riches and net worth), it's going to hear some banging. His words are powerful. That's why some government agencies want to regulate and prevent this manipulation. He can manage to get some money quickly with one tweet etc. He is that strong.With the current news, I think it can be a requirement for them to do that, and they probably need to sell some assets to save themselves the hassle or something. Or maybe it's another influential move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 21, 2022, 02:20:38 AM",
      "body": "Quote from: Majestic-milf on July 20, 2022, 11:03:08 PM With the crypto winter and BTC prices looking bearish, Tesla CEO and Space X founder, Elon Musk has shipped off 75% of his shares in Bitcoin. This news comes as a surprise after his proclamation in March where he was adamant on selling his coins.Tesla had about 42,000 bitcoins at the start of Q2 but had to sell off the majority of its coins at $29,000 From the 2nd quarter report gathered by the company, it was revealed that the coins were sold for $963m and still has a reserve \" digital asset\" left of about $218m should he see the need to sell off. In February last year, Tesla purchased a whooping $1.5m worth of crypto and this move helped to push the value of BTC and enthusiasts labeled him the de facto  \"crypto leader\" but that status quickly changed the moment he renounced the acceptance of BTC as payment for his goods.  Its believed that the steep decline in BTC price was what fuelled the rush to sell off. What do we make of this move? Is there a plan to bounce back when the market becomes favorable, or is the beginning of the end for Elon and crypto? https://techcrunch.com/2022/07/20/tesla-dumped-75-of-its-bitcoin-holdings/I think his motivations are more related to make a good relationship with American government.He received about 7billions USD from government subsidies, tax breaks and loans. As American government isn't really a bitcoin fan, as they see bitcoin as \"bad for enviroment\", I believe those are the main Musk motivations.Quotehttps://www.grid.news/story/technology/2022/04/30/elon-musk-hates-the-government-his-companies-love-it/#:~:text=Tesla%20and%20SpaceX%20have%20received,electric%20vehicle%20credits%2C%20Grid%20found.Tesla and SpaceX have received more than $7 billion in government contracts alone and billions more in tax breaks, loans and other subsidies, an analysis by Grid found. In recent years, Tesla has sold at least $6 billion worth of government-backed electric vehicle credits, Grid found",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 21, 2022, 02:30:23 AM",
      "body": "Quote from: Baofeng on July 20, 2022, 11:13:56 PMPretty easy decision for him and I think maybe some of us had so this coming. Obviously, it has something to do with the current state of the market and maybe he knows that he is going to lose money short term. So as a businessman, he has to shift and keep moving his money around so that it will still grow despite the current recession that we are having. So I'm not surprised, but I don't think this is an attack to bitcoin coming from him, just a business move, in my opinion.I do not really think that many people are surprised with what we're seeing, Elon is not really very enthusiastic about this market, meaning that he was only invested in bitcoin because he hoped to make some impressive profits, and now that the market is going through difficult times it is not really surprising that he is not going to hold his coins for long, and if anything I'm a little bit surprised that he has not sold his coins way sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 21, 2022, 03:11:30 AM",
      "body": "Bad example, then. This cycle became known as the institutional adoption cycle, with Tesla's purchase having the biggest impact on the market. I wonder if there have been more companies that have sold their bitcoins recently without it coming to light as in this case. It seems that the discourse that it is better to have bitcoin for your reserves than to have cash does not work because of volatility, which can be downward, as has happened this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 21, 2022, 04:04:50 AM",
      "body": "I don’t think it was his idea to sell the coins but most likely the decision of the board. What is going on with the economy right now and how Bitcoin looked like it might break $20K (which it did after they sold) they figured it was best to liquidate their position at close to break even as possible and face as loss.From what I remember they bought at $30K and sold 10% at $60K. So selling 75% at $29K is more or less break even. They needed to raise cash and with the stock going down due to his share selling and Twitter buying. They decided it was in the best interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 21, 2022, 05:53:04 AM",
      "body": "Eventually he slowly gave up on something (bear market pressure maybe), I expected this. At least a large number of bitcoins are no longer owned by an influencer and hope to be more distributed although for now I'm more convinced that bitcoin is still under the ownership of the p2p company where he cashed the bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 21, 2022, 05:56:21 AM",
      "body": "Musk's actions with bitcoin, dogecoin, and Twitter are perplexing to me--it's as if he's showcasing what would happen if you gave a malicious internet troll billions of dollars and told him to have at it.  But unfortunately there are a lot of people who hang on his ever word.  Just look at all the people who bought dogecoin because he tweeted about it; I've see quite a few YT vids related to that, and I'm sure for every one of those there are a hundred other people who never made it public they bought doge on the Musk hype.As for what he's doing or is going to do with bitcoin, I say who cares.  He'd be better off if he'd concentrate his time and effort on his space projects, green energy, and whatever real things he's doing that could benefit the world.  I wouldn't even care if he never mentioned crypto again.  He's got enough money and influence and brains that he could actually move humanity forward just a little bit, and I'm not sure why he's playing these stupid games with the media.  Ugh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "July 21, 2022, 06:33:31 AM",
      "body": "Quote from: The Pharmacist on July 21, 2022, 05:56:21 AMAs for what he's doing or is going to do with bitcoin, I say who cares.  He'd be better off if he'd concentrate his time and effort on his space projects, green energy, and whatever real things he's doing that could benefit the world.  I wouldn't even care if he never mentioned crypto again.  He's got enough money and influence and brains that he could actually move humanity forward just a little bit, and I'm not sure why he's playing these stupid games with the media.  Ugh.I think the reason why he is playing these stupid games with the media is because he loves the spotlight, attention-seeking. Because why else would someone with so much act so manipulatively in a space where he wields so much influence. Not good at all. I agree that Telsa selling off a huge chunk of their bitcoin is purely business related but for Pete's sake can Musk just be silent for a while on any crypto-related subject matter? Bitcoin is going to fine with or without Musk because now most people are more enlightened and can see through his tweets and comments about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 21, 2022, 06:40:42 AM",
      "body": "Not surprised by the steps he took because this action is almost the same as the steps of everyone who has a lot of bitcoins, namely taking profits, he should even do it when the price is still higher than he sells these bitcoins, especially as an entrepreneur he will be profit-oriented and maybe cash becomes the reason he ended up selling bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "July 21, 2022, 06:59:37 AM",
      "body": "Quote from: The Pharmacist on July 21, 2022, 05:56:21 AMMusk's actions with bitcoin, dogecoin, and Twitter are perplexing to me--it's as if he's showcasing what would happen if you gave a malicious internet troll billions of dollars and told him to have at it.  But unfortunately there are a lot of people who hang on his ever word.  Just look at all the people who bought dogecoin because he tweeted about it; I've see quite a few YT vids related to that, and I'm sure for every one of those there are a hundred other people who never made it public they bought doge on the Musk hype.As for what he's doing or is going to do with bitcoin, I say who cares.  He'd be better off if he'd concentrate his time and effort on his space projects, green energy, and whatever real things he's doing that could benefit the world.  I wouldn't even care if he never mentioned crypto again.  He's got enough money and influence and brains that he could actually move humanity forward just a little bit, and I'm not sure why he's playing these stupid games with the media.  Ugh. Frankly, I see his initial interest in Bitcoin as just means to prove that the asset is a viable alternate to fiat, but then why buy such an amount only to ship it off with the lame excuse of energy concerns? I really don't get though. I won't be surprised to read on the news later on that he's gone ahead to purchase times two of what he did in Q1. Such a media King 😏😏😏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 21, 2022, 07:33:05 AM",
      "body": "The only meme that I recall from this is: We all know how this works in the world of multiple business stream. The guy has to sell when its time to sell and hold when its time hold. Elon ain't doing any charity here to push the bitcoin to all new levels. All he is doing is making his money multiply or at least try to manipulate the market with his wealth. You never know, what's on his mind, but as I stated above, \"This is Business\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marine4u",
      "created_time": "July 21, 2022, 08:06:33 AM",
      "body": "humm, in the end for Musk vs Tesla actions, they get fattened selling 75% of their bitcoin holdings and continue to be the thorn that continues to dominate the ridiculousness from them. I don't think their plan is going well. In fact, I no longer care about Musk's motives )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 21, 2022, 08:10:51 AM",
      "body": "Quote from: Davidvictorson on July 21, 2022, 06:33:31 AMI think the reason why he is playing these stupid games with the media is because he loves the spotlight, attention-seeking. Because why else would someone with so much act so manipulatively in a space where he wields so much influence. Not good at all. I agree that Telsa selling off a huge chunk of their bitcoin is purely business related but for Pete's sake can Musk just be silent for a while on any crypto-related subject matter? Bitcoin is going to fine with or without Musk because now most people are more enlightened and can see through his tweets and comments about bitcoin.I mean, why should he keep silent though. The reason why Tesla doesn't need to spend money on marketing is that Elon Musk himself is giving the company the publicity it needs. Milking all the publicity is simply just the smarter move in a business sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "July 21, 2022, 10:37:38 AM",
      "body": "Believe me, some folks must have been moved by what Elon musk's did already selling some huge % of Bitcoin. They are too lazed to go about doing some basic check why he sold those coins. He has been a big influence even before purchasing twitter. I still ponder what are the reasons for the sale, could it be that he wants to influence the market negatively ? Hopefully everyone gets to do their own research and don't sell foolishly from thr influence of their mentor or idol. No matter the amount of Bitcoin he has, he can't hide the fact that he wants 🐕 Doge coins competing. If using Bitcoin makes you a psychopath, then, so be it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "July 21, 2022, 03:34:35 PM",
      "body": "Most questions casual investors have about markets and bitcoin were answered years ago. It has long been known that more than 80% of US stock market trends since the economic crisis of 2008 are attributable to a single demographic. The same can be said of bitcoin's latest decline. Neither Elon Musk nor tesla have the investment liquidity to save crypto in the face of those numbers. Pulling out was their only option.Elon Musk and many others in tech and science have always been big fans of crypto. The founder of virgin galactic planned to sell tickets to spaceflights in bitcoin. There were discussions on whether bitcoin or another crypto token might be used as a native currency on mars. Apple co founder Steve Wozniak always had many interesting points to make on crypto. Now it seems things are changing. The amount of intelligent and honest commentary available on the internet is diminishing significantly. But I think the underlying sentiment remains the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "July 21, 2022, 03:42:29 PM",
      "body": "Quote from: noorman0 on July 21, 2022, 05:53:04 AMEventually he slowly gave up on something (bear market pressure maybe), I expected this. At least a large number of bitcoins are no longer owned by an influencer and hope to be more distributed although for now I'm more convinced that bitcoin is still under the ownership of the p2p company where he cashed the bitcoins.He said Tesla did this to get more cash for these terrible market conditions. When others increase their portfolio size they sell it off. I think this is good for a better future in the crypto space. It will be good to have 1k BTC in 1k people's hands than having all this BTC in a single hand. They will not be able to manipulate the market that much if the coin is distributed widely rather than sitting into a small group of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}