{
  "id": "topic_5416419",
  "title": "ajanwalker",
  "author": "ajanwalker",
  "created_time": "October 08, 2022, 04:41:06 PM",
  "content": "Twitter da görgü kuralları diye bir hesap garsona yardım edilmez diye paylaşım yapmış. Ben şimdiye kadar her zaman garson masayı toplarken uzanamadığı tabak çatal neyse toplarken yardım ettim ama bu yazıyı görünce şaşırdım.Hatta şef garson olan birisi yardım edilirse bunu hakaret sayarız demiş ( tabi şef garson mu bilinmez ama)Forumdaşlarımın görüşünü merak ettim. Saygılarımla...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416419",
  "comments": [
    {
      "author": "mandown",
      "created_time": "October 08, 2022, 05:14:54 PM",
      "body": "Onun görgü kuralımı olur insandır karşındaki varsada yemişim görgü kuralını. Olabildiğince yadım eden biriyimdir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "October 08, 2022, 06:12:38 PM",
      "body": "Soruyu soran bunu garsonun işi olarak düşünmüş olabilir ama yardımdan zarar gelmez. Burada yardımın boyutu nedir belki ona bakmak lazım. Tüm masayı toplamanız beklenmiyor herhalde. Dediğiniz gibi çalışanın uzanamadığı bir şey olabilir, daha çabuk toplanmasına yardım etmek olur yapılabilir bir şey. Buna kesin biçimde görgü kuralı var yardım edilmez demek doğru değil bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "October 08, 2022, 08:35:32 PM",
      "body": "Ya bu fransız ingiliz soylularından gelen bir sofra adabı kuralları olabilir onlar için ama bizim buradaki bir kebapçıda dönercide ya da big chefs gibi bir restaurantta garsona kesinlikle yardım edilmez diye bir kural olabilir mi. Yardım ediverelim ne olacak? Yukarıda yazıldığı gibi adamla tabakları paylaşıp mutfağa taşıyacak değiliz. Çatal bıçağı tabağın içine koyabiliriz ya da uzanamadığı bir şeyi uzatabiliriz. Olay o değil de ben öğrenciyken cuma ve cumartesi geceleri taksim'de bir pub'da ekstra garsonluk/barmenlik yapıyordum. Şimdi hesapladım, o zamana göre 30-35 dolar civarı gibi ücret alıyormuşum günlük. Merak ediyorum böyle günlük çalışan ekstra garsonlar günlük yaklaşık 500-600 alıyorlar mı? Ben bu işimden aldığım parayla öğrenci evi kiramı ödüyordum ve üstüne yemek param çıkıyordu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 08, 2022, 08:59:25 PM",
      "body": "Cok üst düzey bir ortamda birseyi veya birilerini temsilen bulunuluyorsa yardım edilmez ancak orta ve alt segmentte yardım edilmesi munasiptir. Üç kuruşa yemek yediği için mekanı satın almışcasina onu yap bunu getir bunu götür triplwrine girilmemeli yani.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "October 08, 2022, 09:08:16 PM",
      "body": "Garson tabağı ya da masada ne varsa kendi taşıyabileceği şekilde kafasında planı yapabilir o yüzden de masadaki kişilerin şunu da al şunu ben koyayım gibisinden davranış sergilemesini istemez. Olayın altında yatan sebep bu diye biliyorum. Şöyle de olabilir, garson masaya gelmeden eğer yapılmak istenirse masa hafiften toplanmalı, eğer garson gelmişse iş işten geçmiş gibi düşünüp bir şeye karışılmamalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 08, 2022, 09:54:12 PM",
      "body": "En büyük derdimiz bu olsunEtmesek de olur aslında bizim alçak gönüllülüğümüzden...Bi de bazısı var iyi davranıyor sona doğru suratı ekşiyor, ulan diyor insan bişi mi yaptık  Amaan neyse siz yine de kötü davranmayın, yemeğe tükürür getirir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "October 09, 2022, 06:07:48 AM",
      "body": "Bende hep yardım ederim ama süper lüks mekanlarda işinin ehli garsonlar çalıştığı için muhtemelen onlar yardım edilmemesini istiyorlardır diğer ortamlarda hep memnun olduklarını gördüm ben garsonların ben de bir süre çook eskiden garsonluk yapmıştım kısa bir süre olsa da insanların bir şeyleri toparlamaya yardımcı olmaları güzel oluyordu yani kim neden demiş bunu anlayamadım",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 09, 2022, 07:00:30 AM",
      "body": "Quote from: wolwoo on October 08, 2022, 09:54:12 PMEn büyük derdimiz bu olsunEtmesek de olur aslında bizim alçak gönüllülüğümüzden...Bi de bazısı var iyi davranıyor sona doğru suratı ekşiyor, ulan diyor insan bişi mi yaptık  Amaan neyse siz yine de kötü davranmayın, yemeğe tükürür getirir Aynen öyle, bizim alçak gönüllüğümüzden dolayı yardım ediyoruz, halbuki o onun işi yani bıraksak belki kendine göre bir düzende toplayacak, iyilik yapalım derken kötülük yapıyoruz belki de, bu yüzden garsonlar istemiyor olabilir yardım edilmesini, yemeğe tükürmesin de",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 10, 2022, 07:26:37 PM",
      "body": "Basit bir soru cevabı ise karışık. Kişiye göre değişir. Gittiğimiz yer esnaf lokantasıysa git bulaşıkları yıka teşekkür ederler de, böyle sosyetik bir mekana gidiyorsanız garsona karışmayın. Zaten o garson orada bir düzen üzere eğitilmiştir. Adamın işini zorlaştırırız bile. Görgü kurallarını bilmem de bence duruma göre hareket edilebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "October 10, 2022, 07:29:50 PM",
      "body": "Çokta büyük bir olay değil edip etmemek, edilir edilmez o anlık duruma kalmıştır. Gerçekten zorlanıyorsa, uzanamıyorsa yardım ederim uzatırım buda problem değil. Zaten anlaşılır bazısı da gerçekten rahatsızda olabilir söylediğim gibi duruma göre reaksiyon verilir. Direk yardım edilmez demekte yanlış olur, her bir şeyi kalıp haline sokmamak lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 10, 2022, 07:31:58 PM",
      "body": "Quote from: Balmain on October 10, 2022, 07:29:50 PMÇokta büyük bir olay değil edip etmemek, edilir edilmez o anlık duruma kalmıştır. Gerçekten zorlanıyorsa, uzanamıyorsa yardım ederim uzatırım buda problem değil. Zaten anlaşılır bazısı da gerçekten rahatsızda olabilir söylediğim gibi duruma göre reaksiyon verilir. Direk yardım edilmez demekte yanlış olur, her bir şeyi kalıp haline sokmamak lazım.İşte aynen böyle hocam, belirli bir kalıba sokulacak bir şey değil bu, istersen edersin istemezsen etmezsin, ettik diyelim garson rahatsız olsa da bize söylemez ki garibim, zaten işinden olmamak için ses etmiyorlar, Allah bu çalışanların yardımcısı olsun işleri gerçekten zor, hizmet sektörü gerçekten çok sabır ve güç isteyen bir sektör,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "October 11, 2022, 06:40:03 AM",
      "body": "Ben ediyorum ve şimdiye kadar ters bir tepki ile karşılaşmadım. İnsani bir içgüdüsel yardım yani. Fazla büyütmemek lazım bence. İsteyen eder isteyen etmez. Garsonlar da birer insan yani düşünsenize adamın ulaşamayacağı mesafede bir bardak var alıp versen ne olur neden işime karıştın diyecek hali yok ya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "October 11, 2022, 10:30:21 AM",
      "body": "Edilir,niye edilmesin?Yetiştirilme adabına bakıyor bu işler. Yardım etmek bir suç değil tam aksine bir teşekkür bile alma şansınız yüksek garson tarafından. Ben bir lokantaya gittiğimde yeme işlemini bitirdikten sonra çatalı,kaşığı,bardağı vs toplayıp bir yere koyarım. Garson da gelir alır götürür. Bu kadar basit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 11, 2022, 02:53:38 PM",
      "body": "Quote from: execijutiere on October 11, 2022, 10:30:21 AMEdilir,niye edilmesin?Yetiştirilme adabına bakıyor bu işler. Yardım etmek bir suç değil tam aksine bir teşekkür bile alma şansınız yüksek garson tarafından. Ben bir lokantaya gittiğimde yeme işlemini bitirdikten sonra çatalı,kaşığı,bardağı vs toplayıp bir yere koyarım. Garson da gelir alır götürür. Bu kadar basit.Öyle tamamen ailenin bireyi nasıl yetiştirdiğine bakıyor. Sizlerde dışarıda denk geliyorsunuzdur, çalışan kesimden kendini üstün gören bir de kötü davranan insanları neyse konumuz bu değil. Yemek bittikten sonra çatal,bıçak yemeğin içine koyulmalı garson o zaman yemeğinizi bitirdiğinizi anlayabilsin ayrıca işte yardımda etmiş olursunuz bu kadar basit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "October 11, 2022, 03:02:40 PM",
      "body": "Quote from: execijutiere on October 11, 2022, 10:30:21 AMEdilir,niye edilmesin?Yetiştirilme adabına bakıyor bu işler. Yardım etmek bir suç değil tam aksine bir teşekkür bile alma şansınız yüksek garson tarafından. Ben bir lokantaya gittiğimde yeme işlemini bitirdikten sonra çatalı,kaşığı,bardağı vs toplayıp bir yere koyarım. Garson da gelir alır götürür. Bu kadar basit.Ne güzel yapıyorsunuz hocam sizi takdir ettim. garson arkadaşımızın yerinde bizler de olabilirdik biraz empati yaparsak aslında hoş davranışları bulabiliriz. garson işini yapsın diye herşeyi bir yere atmaya gerek yok. karakter meselesi kimisi yapar kimisi yapmaz. nasıl yetişirsek öyle davranırız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "October 11, 2022, 03:18:56 PM",
      "body": "Quote from: Red Pie on October 11, 2022, 03:02:40 PMQuote from: execijutiere on October 11, 2022, 10:30:21 AMEdilir,niye edilmesin?Yetiştirilme adabına bakıyor bu işler. Yardım etmek bir suç değil tam aksine bir teşekkür bile alma şansınız yüksek garson tarafından. Ben bir lokantaya gittiğimde yeme işlemini bitirdikten sonra çatalı,kaşığı,bardağı vs toplayıp bir yere koyarım. Garson da gelir alır götürür. Bu kadar basit.Ne güzel yapıyorsunuz hocam sizi takdir ettim. garson arkadaşımızın yerinde bizler de olabilirdik biraz empati yaparsak aslında hoş davranışları bulabiliriz. garson işini yapsın diye herşeyi bir yere atmaya gerek yok. karakter meselesi kimisi yapar kimisi yapmaz. nasıl yetişirsek öyle davranırız. Teşekkürler,ama bunlar olması gerekenler. Sonuçta karşımızdaki de insan ve bir gelir için çalışıyor. Kimseyi küçük gören birisi değilim. Her işe saygım var. Garsonun uzanamadığı noktalar oluyor. Hâl böyle olunca ben de hepsini bir yere toplayıp alabileceği rahat bir yere bırakıyorum. Hem o memnun oluyor hem ben memnun. Daha samimiyetle yaklaşım alıyorum bu sefer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 11, 2022, 03:39:32 PM",
      "body": "Avrupai bakış açısı, işinin gereğini yapan birine neden yardım edelim ki, zaten bunun için maaş veya ücret alıyor kafasidir genelde ama bence yardım etmekte bir sakınca yok, hiçbir şey yapmayacak bile en azından kırıcı olmamak bile yeterlidir hatta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "October 18, 2022, 10:01:48 AM",
      "body": "Quote from: ajanwalker on October 08, 2022, 04:41:06 PMTwitter da görgü kuralları diye bir hesap garsona yardım edilmez diye paylaşım yapmış. Ben şimdiye kadar her zaman garson masayı toplarken uzanamadığı tabak çatal neyse toplarken yardım ettim ama bu yazıyı görünce şaşırdım.Hatta şef garson olan birisi yardım edilirse bunu hakaret sayarız demiş ( tabi şef garson mu bilinmez ama)Forumdaşlarımın görüşünü merak ettim. Saygılarımla...Lüks restoranlarda eğitim almış garsonlar kurallara göre hareket ediyor. Onlara yardım edince işini karıştırmış oluyoruz. Garsona yardım edilmez kuralının en önemli sebebi karışıklık yaratmamak. Çok detaylı profesyonelce hazırlanmış kuralları var garsonların. Ayrıca bazı garsonlar çok para kazanıyor. Garson deyip geçmeyin. Sizin kazandığınız paraların kaç katını kazanıyorlar işlek yerlerde. Alt sınıf kalite yerlerde yardım ederseniz sorun olmaz. Ama lüks sınıf yerlerde hoş olmaz davranışınız. İyilik edeyim derken işini yapan emekçiye kötülük yaparsınız. Bırakın o işini yapsın. Siz de iyi hizmet karşılığında bahşiş bırakın. Ona vereceğiniz bahşiş en büyük yardım olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 18, 2022, 11:58:14 PM",
      "body": "konu sanırım biraz farklı bir şey ama ben olayı kendimce şöyle yorumluyorum: işyerinde yemekhanede çalışan insanlara yardımcı olmak için tabaklarımı ya da tabldotumu hep en iyi şekilde sıyırırım (bazen yiyerek, bazen onları çöp kutusuna iyice dökerek/süzerek çünkü bulaşık makinasına koymadan önce bir ön temizleme vs. yapıyorlar), çatal ve kaşığımı da bazen kullandığım peçete ile silerim, eğer varsa tepsimi de mümkün olduğunca temiz tutarım. mesela bu konuda çok net bir örneğe daha sahibim. dışarıda ya da işyerinde yediğim zamanlar, menüde ambalajlanmış ayran varsa onun boş ambalajının içine yediğim meyvelerin çekirdeklerini atarım ya da ambalajlanmış 200 ml'lik küçük su şişelerini veya kullandığım peçete kağıdını onun içine koyarım/istiflerim. biraz fazla abartıyorum ama bana göre zor bir iş yaptıklarını düşündüğüm için ya da benim kolay kolay yapabileceğim bir iş olmadığı için onlara \"yemek boşumu\" mümkün olan en temiz hali ile iade etmeye çalışıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}