{
  "id": "topic_5458005",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "June 29, 2023, 01:15:56 PM",
  "content": "According to a June 27 report by local news outlet Foresight News, Web3 firms in Hong Kong are spending anywhere between 20 million and 200 million Hong Kong dollars ($2.55 million and $25.5 million) for the acquisition of a Virtual Asset Service Provider (VASP) licenses. Sources explained:“Since traditional financial institutions have no relevant prior infrastructure, and have gone from zero to one in various aspects such as products and teams, the cost [associated with VASPs] has been very high. However, even for an experienced cryptocurrency institution, the cost of obtaining a license is not cheap.”https://cointelegraph.com/news/web3-firms-are-spending-up-to-25m-on-hk-crypto-licenses",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458005",
  "comments": [
    {
      "author": "dansus021",
      "created_time": "June 30, 2023, 05:50:43 AM",
      "body": "I didnt get it so a web3 company spend 25 Million to buy a license   that is expensive right   but to be honest Hongkong is maybe become a crypto friendly country but why the china doesnt like crypto even banning it meanwhile the hongkong seems love about crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 30, 2023, 09:21:52 AM",
      "body": "Quote from: dansus021 on June 30, 2023, 05:50:43 AMI didnt get it so a web3 company spend 25 Million to buy a license   that is expensive right  From what I can understand from the Google Translated version of the original article, \"buying\" is probably not the right choice for this[1]. The requirement to obtain the license is basically strict so exchanges and other firms need to fill that depending on what they lack. One of them is the RO position. I'm not sure if this is accurate or not, but this RO position is mandatory for the license, and finding a suitable individual is difficult, hence why most businesses entice people with high salaries. They also need to have offices, a certain amount of registered users, and so on. This is where the spending comes from. The Web3 firm mentioned here is basically an exchange. CMIIW.[1] https://foresightnews.pro/article/detail/36091",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 30, 2023, 12:29:58 PM",
      "body": "Quote from: dansus021 on June 30, 2023, 05:50:43 AMI didnt get it so a web3 company spend 25 Million to buy a license   that is expensive right   but to be honest Hongkong is maybe become a crypto friendly country but why the china doesnt like crypto even banning it meanwhile the hongkong seems love about cryptoI myself have not yet understood how these crypto companies will work and whether they will earn the money they spend, but there is always a risk that the laws will change when so many companies from around the world come to this market and business becomes as complicated as it is in the United States",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 01, 2023, 02:03:50 AM",
      "body": "Quote from: joniboini on June 30, 2023, 09:21:52 AMFrom what I can understand from the Google Translated version of the original article, \"buying\" is probably not the right choice for this[1]. The requirement to obtain the license is basically strict so exchanges and other firms need to fill that depending on what they lack. One of them is the RO position. I'm not sure if this is accurate or not, but this RO position is mandatory for the license, and finding a suitable individual is difficult, hence why most businesses entice people with high salaries. They also need to have offices, a certain amount of registered users, and so on. This is where the spending comes from. The Web3 firm mentioned here is basically an exchange. CMIIW.Thanks for the info  Quote from: zasad@ on June 30, 2023, 12:29:58 PMI myself have not yet understood how these crypto companies will work and whether they will earn the money they spend, but there is always a risk that the laws will change when so many companies from around the world come to this market and business becomes as complicated as it is in the United States Yeah united states have a problem with crypto basically SEC doesn't have the rule about the crypto industry and out of nowhere sues Binance.US , and Coinbase that basically a legal entity there. Meanwhile, Hongkong Dubai and even my country Indonesia has rule about crypto. If the US doesn't solve this problem the crypto industry will likely going move out from the US",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 01, 2023, 02:15:57 PM",
      "body": "Quote from: dansus021 on July 01, 2023, 02:03:50 AMQuote from: zasad@ on June 30, 2023, 12:29:58 PMI myself have not yet understood how these crypto companies will work and whether they will earn the money they spend, but there is always a risk that the laws will change when so many companies from around the world come to this market and business becomes as complicated as it is in the United States Yeah united states have a problem with crypto basically SEC doesn't have the rule about the crypto industry and out of nowhere sues Binance.US , and Coinbase that basically a legal entity there. Meanwhile, Hongkong Dubai and even my country Indonesia has rule about crypto. If the US doesn't solve this problem the crypto industry will likely going move out from the US Do you really think that the US regulator wants to kick all crypto companies to Singapore, Hong Kong, Europe or Indonesia?Maybe they know that there will be a massive collapse of the crypto market, which they can easily provoke by starting new litigation with companies that mimic stablecoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 02, 2023, 02:16:34 AM",
      "body": "Quote from: zasad@ on July 01, 2023, 02:15:57 PMDo you really think that the US regulator wants to kick all crypto companies to Singapore, Hong Kong, Europe or Indonesia?That is not actually my opinion there is a podcast in youtube short that said Gary might drive the industry outside the united states there is actually bunch of videos about it from different people https://www.youtube.com/shorts/X9qw4fSz6mEhttps://www.youtube.com/shorts/ef_gCDc_Rdchttps://www.youtube.com/shorts/YvC8nU3282Aand this https://www.youtube.com/watch?v=6vs7vquMlLI&t=271s a video",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 02, 2023, 02:36:26 AM",
      "body": "Quote from: dansus021 on July 02, 2023, 02:16:34 AMThat is not actually my opinion there is a podcast in youtube short that said Gary might drive the industry outside the united states there is actually bunch of videos about it from different people Yeah, I see similar arguments from those who disagree with how Gary runs the SEC. I would not be surprised if this is just another step to introduce their own regulatory framework in the near future. Maybe with the same cost or even cheaper compared to other countries to attract more business. I doubt they want to kill crypto or something similar. Capitalizing on it and earning more money from retail sounds like a better idea to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 02, 2023, 10:44:45 AM",
      "body": "Quote from: joniboini on July 02, 2023, 02:36:26 AMQuote from: dansus021 on July 02, 2023, 02:16:34 AMThat is not actually my opinion there is a podcast in youtube short that said Gary might drive the industry outside the united states there is actually bunch of videos about it from different people Yeah, I see similar arguments from those who disagree with how Gary runs the SEC. I would not be surprised if this is just another step to introduce their own regulatory framework in the near future. Maybe with the same cost or even cheaper compared to other countries to attract more business. I doubt they want to kill crypto or something similar. Capitalizing on it and earning more money from retail sounds like a better idea to me.I don't understand what the SEC wants to achieve. From the fact that some crypto companies leave the United States, nothing will change in the industry.The SEC is either playing the role of a manipulator or a useful idiot.One of the vapriants. The price of bitcoin rises to 40-45 thousand dollars, there is euphoria in the market, there is news about the approval of the ETF, Gary is fired from the SEC. Hamsters buy bitcoin and then the price drops to 15-20 thousand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "July 02, 2023, 11:16:20 AM",
      "body": "Quote from: zasad@ on July 01, 2023, 02:15:57 PMDo you really think that the US regulator wants to kick all crypto companies to Singapore, Hong Kong, Europe or Indonesia?Maybe they know that there will be a massive collapse of the crypto market, which they can easily provoke by starting new litigation with companies that mimic stablecoins.I don't think the SEC wants to force all crypto firms out of the US. They are basically targeting to fully control it. They will keep attacking crypto businesses that have international influence and register new ones they can easily influence or manipulate. I don't also think that starting litigation with crypto companies will make the market collapse. The litigation against Coinbase and Binance affected the market, but it recovered immediately.  I also think that the crypto industry has grown above any country. No nation can claim to be the bedrock of the industry. Even if the US bans cryptocurrencies, the market will still recover, an example is the case of China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 02, 2023, 12:25:07 PM",
      "body": "That is how much important that thing is to them. The legality and maintenance of their possible business and knowing that it's legal in Hong Kong and not in other countries. I think that goes to show how much is going on in the industry and how many people have that capacity to buy and procure licenses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 05, 2023, 02:23:28 PM",
      "body": "Quote from: Fiatless on July 02, 2023, 11:16:20 AMQuote from: zasad@ on July 01, 2023, 02:15:57 PMDo you really think that the US regulator wants to kick all crypto companies to Singapore, Hong Kong, Europe or Indonesia?Maybe they know that there will be a massive collapse of the crypto market, which they can easily provoke by starting new litigation with companies that mimic stablecoins.I don't think the SEC wants to force all crypto firms out of the US. They are basically targeting to fully control it. They will keep attacking crypto businesses that have international influence and register new ones they can easily influence or manipulate. I don't also think that starting litigation with crypto companies will make the market collapse. The litigation against Coinbase and Binance affected the market, but it recovered immediately.  I also think that the crypto industry has grown above any country. No nation can claim to be the bedrock of the industry. Even if the US bans cryptocurrencies, the market will still recover, an example is the case of China. I don't think Coinbase will have problems in the US with the world's largest investment fund BlackRock behind them.https://decrypt.co/147177/blackrock-spot-bitcoin-etf-filing-sec-coinbase-surveillanceFor now, it looks like a redistribution of the market. When superfluous competitors are kicked out of the market, then regulation rules for all participants will immediately appear. And for new participants, entering this market will be difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 06, 2023, 06:34:59 PM",
      "body": "Quote from: zasad@ on June 29, 2023, 01:15:56 PMAccording to a June 27 report by local news outlet Foresight News, Web3 firms in Hong Kong are spending anywhere between 20 million and 200 million Hong Kong dollars ($2.55 million and $25.5 million) for the acquisition of a Virtual Asset Service Provider (VASP) licenses. Sources explained:“Since traditional financial institutions have no relevant prior infrastructure, and have gone from zero to one in various aspects such as products and teams, the cost [associated with VASPs] has been very high. However, even for an experienced cryptocurrency institution, the cost of obtaining a license is not cheap.”https://cointelegraph.com/news/web3-firms-are-spending-up-to-25m-on-hk-crypto-licensesWeb3 is a failed experiment. So I am not getting the point of spending so much money just for license. But I am sure the companies will have their own reasons to spend that much money. One best part of doing business in countries like HK or SG, is their infrastructure and less regulatory burden. Also web3 has all potential to become another money laundering playground just like the NFT. So probably these companies are smelling opportunities there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 08, 2023, 04:07:37 AM",
      "body": "Quote from: avikz on July 06, 2023, 06:34:59 PMWeb3 is a failed experiment. So I am not getting the point of spending so much money just for license. But I am sure the companies will have their own reasons to spend that much money. What they mean by web3 is basically exchange/broker service. The headline is probably using the web3 terms to attract more visits, but most of the discussion revolves around exchanges getting their licenses. The goal is obviously to retain users in HK so that they can keep making profits. Asia is a huge market, it is easy to understand why they want to spend money if it means keeping or increasing their profits for the foreseeable future. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 08, 2023, 04:56:09 PM",
      "body": "Quote from: avikz on July 06, 2023, 06:34:59 PMQuote from: zasad@ on June 29, 2023, 01:15:56 PMAccording to a June 27 report by local news outlet Foresight News, Web3 firms in Hong Kong are spending anywhere between 20 million and 200 million Hong Kong dollars ($2.55 million and $25.5 million) for the acquisition of a Virtual Asset Service Provider (VASP) licenses. Sources explained:“Since traditional financial institutions have no relevant prior infrastructure, and have gone from zero to one in various aspects such as products and teams, the cost [associated with VASPs] has been very high. However, even for an experienced cryptocurrency institution, the cost of obtaining a license is not cheap.”https://cointelegraph.com/news/web3-firms-are-spending-up-to-25m-on-hk-crypto-licensesWeb3 is a failed experiment. So I am not getting the point of spending so much money just for license. But I am sure the companies will have their own reasons to spend that much money. One best part of doing business in countries like HK or SG, is their infrastructure and less regulatory burden. Also web3 has all potential to become another money laundering playground just like the NFT. So probably these companies are smelling opportunities there. Web3 technology in cryptocurrency is still in development. The technology for investors can and will be interesting, because the investor has the tokens on his wallet, and he can connect to various projects and it is enough to pass verification once with one of the licensed partners. But in such a situation, the trend is more important than the result",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}