{
  "id": "topic_5418223",
  "title": "adaseb",
  "author": "adaseb",
  "created_time": "October 25, 2022, 02:20:55 AM",
  "content": "Right now we are at a difficult level.Stocks are rallying. Bonds are selling off. So either the bond traders are right and this is nothing but a bounce and we will head lower after the midterms. Or the equity traders are right and we bottomed and the bond traders are wrong.In my experience you should pay attention to what the bond markets are doing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418223",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 25, 2022, 06:54:13 AMLast edit: October 25, 2022, 07:56:15 AM by Tytanowy Janusz",
      "body": "Quote from: adaseb on October 25, 2022, 02:20:55 AMStocks are rallying. Bonds are selling off. I don't see a stock rally. ~6% from the bottom is not a rally in my opinion. If I was forced to judge who is right I would say that bonds investors. Mostly because US bond market is much bigger - worth ~$50 trillion while stock market only ~$25 trillion but... from the other hand its common to see a smaller market to act like an indicator for bigger market because its much easier to move it and its easier, for a whale, to dump less liquid asset when whole market is pumping. For instance BTC ATH was 2 months before SP500 ATH.But to my knowledge bonds and stocks are mostly moving in different directions. For instance in 2008, when stocks were hitting bottom, bonds spiked to ATH. So its not about who is right.SP500 and TLT(ISHARES 20+ YEAR TREASURY BOND ETF) on monthly charts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 26, 2022, 05:12:18 PM",
      "body": "Now there is some chatter about US Fed of supplying for smaller duration T-bills. The Canadian fed rate hike was lower than expected. We got some type of QE in Japan and Britian. Combined with how the longer bonds had a wick. Maybe it means we bottomed?However I remember back in 2008, when we assumed we bottomed in late 2008 because we had nice rallies followed by an even bigger dump before finally bottoming out in March 2009. So this can be nothing but a dead cat bounce and we might head lower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 26, 2022, 05:40:07 PM",
      "body": "Quote from: adaseb on October 25, 2022, 02:20:55 AMRight now we are at a difficult level.Stocks are rallying. Bonds are selling off. So either the bond traders are right and this is nothing but a bounce and we will head lower after the midterms. Or the equity traders are right and we bottomed and the bond traders are wrong.In my experience you should pay attention to what the bond markets are doing. I think they are both right to a point. Bonds haven’t been keeping up with inflation so investors have mostly stripped them from their portfolios while stocks are expected to rise with inflation acting as a rising tide lifting all boats. The big difference between now and 2008 is that we’re being held up by massive inflation that isn’t just sustained to homes and gas this time. In fact, home prices have been falling recently, showing just how different it is this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 27, 2022, 11:15:28 AM",
      "body": "Although what happened from the rise is not true, but why not consider it an attempt to collect some hot money.The Fed's upcoming decision may result in some correction in prices and from them, so raising the price now with the repurchase process will bring more liquidity to the market, which can be absorbed by the next correction.In general, some governments started complaining about the Fed's decisions, so let's see how long the pace of interest rate hikes will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 28, 2022, 03:02:49 AM",
      "body": "So it seems that bonds are taking a bid, a very small one but they are rallying and 10 year is below the 4%. There was some report about the next fed statement being very dovish and fed saying there is going to be a pivot.No idea if the source is legit but Blackrock is saying to clients that the fed will ease the pace of the hikes after next weeks 75 bps hike. Most likely the remaining 2 hikes will only be 25 bps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 28, 2022, 03:25:38 PM",
      "body": "Quote from: adaseb on October 28, 2022, 03:02:49 AMSo it seems that bonds are taking a bid, a very small one but they are rallying and 10 year is below the 4%. There was some report about the next fed statement being very dovish and fed saying there is going to be a pivot.No idea if the source is legit but Blackrock is saying to clients that the fed will ease the pace of the hikes after next weeks 75 bps hike. Most likely the remaining 2 hikes will only be 25 bps.Yep. Its possible that we will see some printing soon. Many economists warns about bullwhip effect. I expect that high inflation will stay with us at least for decade but it will not be a constant price grow. I expect to see something symilar to 1980 and 1940. Inflation, disinflation, even more inflation, disinflation and so on. Both in 1980 and 1940 we had 3 inflation waves. Each consecutive one was stronger then previous one:So if economists are right about bullwhip effect and history is about to repeat itself than we should very soon see a inflation dump and FED pivot to \"help with rising unemployment\". what happend in 1980 after first wave of inflation? Stock pumped to new ATH (just to dump to new lowest low after inflation second wave hit the economy). Would be nice to see BTC back at 60k blue - inflationorange - sp500",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 28, 2022, 07:23:50 PM",
      "body": "Today was also a confusing day. We got the SPX500 at +3% day, very bullish. You would think the Bond yields would crash? However that is not the case.  The 10Y and 2Y finished about 2%, 3.4% respectivately. So something is not adding up here. Next week is a very big week. Not with earnings but with the Fed rate and unemployment numbers. Seems that stock traders think fed will mention the word \"pivot\" and the bond traders are calling bluff on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 28, 2022, 08:21:15 PM",
      "body": "Quote from: adaseb on October 28, 2022, 07:23:50 PMSeems that stock traders think fed will mention the word \"pivot\" and the bond traders are calling bluff on that.I don't think they will call \"pivot\" so soon. \"Fear game\" also helps fighting inflation. Calling the end of tightening means stock pump and \"wealth effect\" which lead to increased consumer spending that boost inflation. I think they will act hawkish as long as possible.Check this - Janet Yellen may have an evil plan trading treasuries behind Jerome Powell back- https://www.youtube.com/watch?v=VgCRj5d4Sqs&ab_channel=GeorgeGammon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "October 28, 2022, 11:50:59 PM",
      "body": "Quotepay attention to what the bond markets are doing.FOREX > Bonds > shares is the order of importance apparently and size.    Im not sure where commodities fits into that because out of all them we need the various commodities  most of all.   Bonds are manipulated, lets state the obvious that QE is a fake creating bad pricing that ultimately cannot justify itself.    Shares I actually trust more but you do have to worry about if your company can handle the waves oncoming if bonds and plain currency decline as badly as possible and in the end what I expect.   The bank of Japan is broke far as I can tell but do I think Japan is finished no, nor the companies or people but the central bank has broken the bonds and probably currency unless they can default and leave it intact somehow; no idea how that plays out but just how long can they keep juggling.  Without any doubt the demographics finishes off Japanese bonds as the population average is so old, time runs out as it will everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 31, 2022, 04:01:00 AM",
      "body": "Quote from: adaseb on October 25, 2022, 02:20:55 AMRight now we are at a difficult level.Stocks are rallying. Bonds are selling off. So either the bond traders are right and this is nothing but a bounce and we will head lower after the midterms. Or the equity traders are right and we bottomed and the bond traders are wrong.In my experience you should pay attention to what the bond markets are doing. There is also presently a pump on treasuries and bonds. However, this is very much similar to gambling on your favorite sports hehehe. The traders and investors in the cryptospace and equities markets have placed their bets and gambled on uncle Jerome's next decision. It appears that they are optimistic that the uncle's next announcement might be positive for markets hehehe. I am not very optimistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 01, 2022, 01:21:05 PM",
      "body": "Quote from: bbc.reporter on October 31, 2022, 04:01:00 AMQuote from: adaseb on October 25, 2022, 02:20:55 AMRight now we are at a difficult level.Stocks are rallying. Bonds are selling off. So either the bond traders are right and this is nothing but a bounce and we will head lower after the midterms. Or the equity traders are right and we bottomed and the bond traders are wrong.In my experience you should pay attention to what the bond markets are doing. There is also presently a pump on treasuries and bonds. However, this is very much similar to gambling on your favorite sports hehehe. The traders and investors in the cryptospace and equities markets have placed their bets and gambled on uncle Jerome's next decision. It appears that they are optimistic that the uncle's next announcement might be positive for markets hehehe. I am not very optimistic.I am not optimistic earlier because I don't think anything was fixed with the rate hikes. Stuff is still expensive even if it shows that inflation is slowing. You go to a mall you got people spending left and right on stuff they don't need. Same with the high gas prices. People are still driving.The bond traders are basically calling bluff pretty much, the bonds markets are still relatively low. Just because other banks have kind of acted dovish doesn't mean the fed will also. This could be all a nasty bull trap. We will see tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 01, 2022, 10:32:12 PM",
      "body": "This could be because of the rumors about increasing interest rates. So that's why we see some dumps on the bonds. But I disagree with @Tytanowy Janusz because the pump is a pump, that ~6% is already huge if you are in the stock market, and the volume there is massive versus in cryptocurrency market cap. For me, this is healthy pump because we also saw that cryptocurrency market experienced it too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 03, 2022, 03:37:27 AM",
      "body": "So the FOMC is done and it looks like you would of been right if you looked at the bond markets. The bond traders were calling JPow bluff and they were right.He was very hawkish and no mention of any pivot until they get inflation to 2%. Most likely the rates won’t come down until late 2023.Crypto and stocks all took a dive due to this news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "November 03, 2022, 04:25:09 AM",
      "body": "Happens every time really, the market has to cover the idea we can relief rally on a more positive outcome.   They guess too soon but some of the buys are closed short positions which is why this pretty much will often occur, nobody wants too much to be negative into a possible positive event.  Now we've confirmed the worst or at least the ongoing negative as just that with no alteration traders will go back to the negative narrative and only a few will buy during this time while waiting for 'the low'.  Wave dynamics coming from the market trying to second guess itself, invariably we over shoot to the downside as much as we had done for the peaks imo.   BTC is people just as much any other price so similarly we act in line with this process I guess.   USD doesnt really deserve to be called strong when it definitely has inflation and so lost value, this percentage loss is worse then BTC has been registering so too much weakness in BTC is not really my view but we are subject to the same weight and fear factor as any other asset, 'lots' of borrowed money within BTC still I guess",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}