{
  "id": "topic_5441630",
  "title": "Mate2237",
  "author": "Mate2237",
  "created_time": "February 28, 2023, 11:09:47 PM",
  "content": "On the 25th of February 2023, Nigeria held her Presidential and National House of Assembly Election, and before the election took place, the Independent National Electoral Commission (INEC) promised the citizens that, the voting will be very much transparent, there will be a device call B-VAS which will be used to transmit results from the very first polling unit straight to the commission (INEC) server. But when the election has finally started, INEC didn't upload the results again for the transparency and the commission started Collation of Results at the National Level, so this raised a question, and the opposition parties agents asked the commission to project the uploaded results so that they can make a comparism but the commission refused, so they stage out from collation center and organized a Press Briefing to cancel the areas that the B-VAS didn't work.And on the briefing a lame citizen said, he told the commission (INEC) to use Blockchain to transmit the results so that nobody can temper the results again.Now I want to know, is it possible to transmit Election Results to Blockchain? Because I thought blockchain is only meant for Cryptocurrencies.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441630",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "March 01, 2023, 01:27:06 PM",
      "body": "Yes, of course it is possible to archive information on the blockchain.Transactions after all, are just that: information and once they are in the blockchain they cannot be tampered with.However, if you want my opinion, the ideal voting scenario to get rid of widespread fraud forever would be for each voter to transmit their vote through a transaction on the blockchain, using their own personal and individual wallet/key. Depending on the blockchain it could case some congestion for a couple of days, but it would be worth it, for the sake of democracy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "March 01, 2023, 02:17:29 PM",
      "body": "Why not, blockchain isn't meant for bitcoin alone, other companies and organizations including government can make use of blockchain for their secured means of storage that is immutable and decentralized, we already have many brands names hat have their original products listed on the blockchain, services and commodities with their respective prices as well, they uses blockchain because they believed it's a technology that cannot accept any form of alterations on the data it comprises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 01, 2023, 04:45:03 PM",
      "body": "Quote from: 348Judah on March 01, 2023, 02:17:29 PMWhy not, blockchain isn't meant for bitcoin alone, other companies and organizations including government can make use of blockchain for their secured means of storage that is immutable and decentralized, we already have many brands names hat have their original products listed on the blockchain, services and commodities with their respective prices as well, they uses blockchain because they believed it's a technology that cannot accept any form of alterations on the data it comprises. Good idea. Many have expressed this before. The problem is that the voting machines are interfered with through the Internet. And this is done on purpose by governing officials who set up the technical part of the election.What this means is that the connections between the voting machines and the election control center are the problem. The vote by any citizen can be diverted from going to the control center, and replaced by an impulse that looks like the vote but isn't. The whole control center could be corrupted to make it look like a good vote.In the US, the voting machines are open to hacking and corruption because they are on the Internet. This hacking was part of the way that Trump and Kari Lake lost their elections. However, blockchain would be a start, and would make it more difficult for crooks to hack elections.The real thing that needs to be done is to get the corrupt election people out of there, and replace them with honest people. What Stalin said still holds true, \"The people who cast the votes decide nothing. The people who count the votes decide everything.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "March 01, 2023, 11:59:51 PM",
      "body": "I have been hearing so many news about the Nigeria election seeing people lamenting and complaining about the result makes me ask what is really wrong. Blockchain is here to stay so we need to give it a trier for we to know to what extent it can help us. Transmission of election result to Blockchain is good and will make sense but how do you think a country like Nigeria that is still having problem of transmitting election results digital will be the first country that would try and give a room for the use of Blockchain for election results. Maybe that can happen in years coming when everywhere has developed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 02, 2023, 06:18:03 AM",
      "body": "Quote from: Mate2237 on February 28, 2023, 11:09:47 PMOn the 25th of February 2023, Nigeria held her Presidential and National House of Assembly Election, and before the election took place, the Independent National Electoral Commission (INEC) promised the citizens that, the voting will be very much transparent, there will be a device call B-VAS which will be used to transmit results from the very first polling unit straight to the commission (INEC) server. But when the election has finally started, INEC didn't upload the results again for the transparency and the commission started Collation of Results at the National Level, so this raised a question, and the opposition parties agents asked the commission to project the uploaded results so that they can make a comparism but the commission refused, so they stage out from collation center and organized a Press Briefing to cancel the areas that the B-VAS didn't work.And on the briefing a lame citizen said, he told the commission (INEC) to use Blockchain to transmit the results so that nobody can temper the results again.Now I want to know, is it possible to transmit Election Results to Blockchain? Because I thought blockchain is only meant for Cryptocurrencies. Nigerian politicians are crafty and well-tutored in fraud. Nigeria has good laws but they are never implemented. Blockchain technology for the transmission of data is okay but the average corrupt Nigerian politician will look for a way to make that technology fail. They might go as far as cutting all electric lines ensuring that these blockchain servers will be down. They can even cut all telecommunication networks in the country. The B-VAS machine was a wonderful technology but the APC government knew that if it was a free and fair election, Peter Obi will win that's why they rigged the elections. Except there is a change, Nigerians have lost confidence in the electoral process of Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "March 02, 2023, 06:35:48 AM",
      "body": "There is nothing what could be done If someone still has not learned.Federal Republic of Nigeria\" Democracy is two wolves and a lamb voting on what to have for lunch. Liberty is a well-armed lamb.\" -- Benjamin Franklin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "March 02, 2023, 04:47:19 PM",
      "body": "Quote from: Die_empty on March 02, 2023, 06:18:03 AMNigerian politicians are crafty and well-tutored in fraud. Nigeria has good laws but they are never implemented. Blockchain technology for the transmission of data is okay but the average corrupt Nigerian politician will look for a way to make that technology fail. They might go as far as cutting all-electric lines ensuring that these blockchain servers will be down. They can even cut all telecommunication networks in the country. The B-VAS machine was a wonderful technology but the APC government knew that if it was a free and fair election, Peter Obi will win that's why they rigged the elections. Except there is a change, Nigerians have lost confidence in the electoral process of Nigeria.Well if the votes are registered and harshed by a miner then there is no way the politician can manipulate it, and at that blockchain technology can not have two transaction harsh so at that there is no room for manipulation, but this requires a lot of development and must be based on decentralized blockchain and on proof of work POW algorithm and not proof of stake POS that give room for centralization and control in the hand of whales with the highest liquidity. -Inec can do better and easier if they can adopt the electronic voting system, and if we can fully implement this in our electrical system and process, it will help to eradicate a lot of things such as. 1: invalid votes 2: multiple voting 3: underage voting",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 02, 2023, 05:11:23 PM",
      "body": "Quote from: montaga on March 02, 2023, 06:35:48 AMThere is nothing what could be done If someone still has not learned.Federal Republic of Nigeria\" Democracy is two wolves and a lamb voting on what to have for lunch. Liberty is a well-armed lamb.\" -- Benjamin FranklinThis is exactly why the US was founded as a republic rather than a democracy... even though the standard government in DC is a democracy.How is the US a republic? By the way that Amendments 6 and 7 in the Bill of Rights allow for a jury in any contention. Any US law can be neutralized by a 12-person jury. But the people need to bring the case to court when they have been harmed by government, or when they don't like a particular law or operation of government. And they need to bring it to court in the right way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "March 02, 2023, 05:47:54 PM",
      "body": "Nigeria Electoral voting system basically the body (INEC) is so currept that they will tend Tamper, currupt any transparent voting system that is introduced, look at the B-VAS for example,  upon all the promise made by INEC, on the election they still failed in allowing Ad-hoc staffs upload results directly to their server.Talking about transmitting of elections using Blockchain, Currently there is a ban on crypto transaction in Nigeria and I think Nigeria will be the very last country to adopt such transparent system due to their level of curruption and slowness in the adoption of new evolving technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 02, 2023, 06:16:46 PM",
      "body": "Quote from: Franctoshi on March 02, 2023, 05:47:54 PMNigeria Electoral voting system basically the body (INEC) is so currept that they will tend Tamper, currupt any transparent voting system that is introduced, look at the B-VAS for example,  upon all the promise made by INEC, on the election they still failed in allowing Ad-hoc staffs upload results directly to their server.Talking about transmitting of elections using Blockchain, Currently there is a ban on crypto transaction in Nigeria and I think Nigeria will be the very last country to adopt such transparent system due to their level of curruption and slowness in the adoption of new evolving technology. Everybody who wants Internet and World Wide Web freedom needs to consider NOSTR. The only way to block NOSTR is to shut down the Internet. It could be used to implement a corruption-proof voting operation.What is NOSTR? It's a super-basic form of social media. And all kinds of applications can be built on it. This means that cryptocurrencies can bypass government censors. The only way government can stop NOSTR is to shut down the Internet.NOSTR is in its beginning stages. Not many platforms are built on it, yet. Those of you who are developers should start now.https://bitcoinnews.com/what-is-nostr/https://www.nostr.net/https://usenostr.org/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}