{
  "id": "topic_5420413",
  "title": "surfmasterr",
  "author": "surfmasterr",
  "created_time": "November 10, 2022, 04:20:37 PM",
  "content": "Arkadaşlar az önce enpara uygulamasına girdim ve benden vergi mükellefi gibi birşey doldurmam istendi neden böyle birşey istenmiş olabilir? ben işletme sahibi değilim normal evde oyun oynayıp çalışmayan birisiyim",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420413",
  "comments": [
    {
      "author": "meser#",
      "created_time": "November 10, 2022, 05:50:05 PM",
      "body": "Bu konuyu gördükten sonra bende enpara mobil şubeme giriş yaptım ancak karşıma böyle bir şey çıkmadı. Enpara müşteri temsilcisine 1 dk'dan kısa sürede bağlanabiliyorsunuz arayıp bağlanmanızı tavsiye ederim en iyi cevabı kendileri verecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "November 10, 2022, 07:15:30 PM",
      "body": "Vergi mükellefi, vergi usul kanununun 8. maddesinde yer alan bilgilere göre üzerine vergi borcu yüklenen gerçek ve tüzel kişiler vergi mükellefi olurlar. Hocam en iyisi e-devletten borcunuz olabileceğini düşündüğünüz kurumları tek tek kontrol edin. Sgk, gençlik bakanlığı kyk, mtv vs.. benim aklıma gelen bunlar. En sağlıklısı yine banka müşteri hizmetlerini aramak olacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "surfmasterr",
      "created_time": "November 11, 2022, 05:36:04 AM",
      "body": "Çözüm merkezine sorduğumda şunu yazdılarBu bilginin istenmesinin nedeni:Yabancı Hesaplar Vergi Mevzuatına Uyum Yasasıgereği ve Vergi Usul Kanunu\"nun Bilgi Toplamamaddesine istinaden müşterilerimizin hesapaçılışları ve mevcut hesaplarla işlemlere devamedebilmesi için Türkiye dışında herhangi bir ülkedevergi amaçları bakımından mukim olupolmadıklarınıza ilişkin kişisel beyanlarının alınmasıgerekmektedir.dediklerini tam olarak anlamadım sizce ne olabilir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "November 11, 2022, 12:37:38 PM",
      "body": "Türkiye dışında bir ülkede vergi mükellefi misin diye soruyor.Bir başka ülkede kurulu şirketin, çalışma veya oturma iznin, vatandaşlığın varsa vergi mükellefiyetin de vardır.Yoksa, yok diye beyan vermen gerekiyor (Örn. Cepteteb'den hesap açmak isterseniz, bu soruları hesap açılışında sorarlar)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "November 11, 2022, 07:29:06 PM",
      "body": "Vergi mükellefi olup olmadığınızı sormuşlar işte. Arkadaşlar gereken bilgileri vermiş. Eğer vergi mükellefiyseniz bu durumları paylaşmanız gerekecek. Eğer paylaşmazsanız ve bu tespit edilirse size yüklü bir ceza kesilebilir. O yüzden vergi mükellefiyseniz doldurun değilseniz doldurmayın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}