{
  "id": "topic_5472027",
  "title": "lombok",
  "author": "lombok",
  "created_time": "October 28, 2023, 04:19:14 PM",
  "content": "https://tradingeconomics.com/country-list/inflation-rate-*I took the data from tradingeconomics.comAlmost all countries in the world experience inflation. From the data that I have seen, the largest inflation was occupied by Venezuela at 318%, followed by Lebanon. As we can see for ourselves in the table above or visit the tradingeconomics.com website to find out the details. This is really worrying, in essence all countries are threatened and have the opportunity that their currency will become increasingly worthless due to this inflation.Is there a way to deal with this if the financial system remains like this? Is it too late to change? Or has this already caught up?If we look here, El Salvador has a relatively small inflation rate, namely 3.02 percent. We know that the country is starting to stockpile Bitcoin and mine Bitcoin at the same time.Maybe at this time we cannot conclude that Bitcoin plays a role in suppressing inflation in this country. It takes several years of data and country consistency in adopting Bitcoin.Just to the point, I want to hear your opinions on this.Whether Bitcoin is able to help countries overcome inflation, at least it provides options for growing a country's investment value.Of course, I also know that there will be several policies or efforts to reduce inflation in a country.However, if possible, are there opportunities such as hoarding gold and Bitcoin that can provide economic stability and reduce the inflation rate?On average, countries that experience low inflation rates have large gold reserves.https://wisevoter.com/country-rankings/gold-reserves-by-country/#argentinaCheers, let's discuss..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472027",
  "comments": [
    {
      "author": "Ultegra134",
      "created_time": "October 28, 2023, 04:48:42 PM",
      "body": "I don't believe there's much correlation between El Salvador's Bitcoin adoption and the relatively low inflation rate. There are plenty of other countries that are in a similar position without having adopted Bitcoin; see Kosovo, Belarus, and a few other countries on the Asian or African continent. On top of that, I remember reading an article a few months ago that said Bitcoin transactions are still not that common and its usage is pretty low. So far, El Salvador's experiment has little to show, as a large number of people only took advantage of the early signup incentives and gave up after a short time period, while it cost El Salvador millions in infrastructure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 28, 2023, 04:52:44 PM",
      "body": "Of course, we all know everything advantageous if you were to use Bitcoin and HODL it. It's going to be different for every country but the important thing to see if it has really an effect is that there would be more countries to adopt it. We cannot really quantify if we have so little data. If there would be somewhat of a Bitcoin standard, that would be interesting as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 28, 2023, 04:56:49 PM",
      "body": "Perhaps the op was unaware or didn't factor that in, but El Salvador's fiat currency is the USD. The USD is pretty good at managing inflation, and that has a major impact, so I think El Salvador's inflation rate is probably due to that rather than due to Bitcoin. Clearly, it's not just that, as the inflation rate for the USA is different, but I just think it probably has a much higher impact than Bitcoin does, as much as we'd like Bitcoin to have a high positive impact. El Salvador's actually only keeping a fraction of its budget in Bitcoin, as even they, with all of that pro-Bitcoin stuff, understand the risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "October 28, 2023, 05:24:40 PM",
      "body": "If you spend your money, you lose it. If you save it, due to inflation, you also lose it. It is sad, but that's reality nowadays. In a country with a not so high inflation (not even in the list), a friend of mine is saving to buy a house, at a slower pace than the rise of prices, and the clock keeps ticking. I don't want to even think how Venezuelan and Argentinian citizens must feel.Investing in crypto in general is high risk, and Bitcoin is not much different (it is safer, but still high risk), so I wouldn't recommend to do it as a way to make sure money. But with such high interest rates, the alternative of doing nothing is proven to be much riskier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 28, 2023, 05:29:31 PM",
      "body": "You started a great topic dear, I did not come to think to compare the countries that adopted BTC legal tender with the countries that did not. That's a good comparison but your statement that High Gold or BTC (more assets) are the sole reason for the decrement in inflation is wrong. Because we (Pakistan) don't have high reserves of Gold, and we don't even accept BTC instead we have banned it. But our inflation rate decreased from 31.44 to 27.38. That's quite the opposite of what you are trying to imply here. But I got your point.Bitcoin no doubt is the best hedge against inflation and we can store our money in it for a longer period of time without losing any penny. And it has been proved. But, talking about El-Salvador, they bought BTC and accepted it as a legal tender when BTC was around $50k means, they entered the market when it was already high. They are already at a loss but as for now market is going up so the comparison looks odd because they are to get some good improvements that are obvious.And BTC doesn't have to care about countries' inflation, BTC doesn't need the attention of countries or entities (technically it does but hypothetically speaking) it doesn't, instead we need BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 28, 2023, 06:05:54 PMLast edit: October 28, 2023, 06:50:03 PM by DVlog",
      "body": "Most of these countries are having some political or economic crisis which is a reason for the inflation. The central bank has the ability to control the circulating supply of fiat currencies but in all these countries the government is using the central bank to print more money so that they can buy dollars from the market with their newly printed money and pay interest. If the central bank could work as an independent organization without any influence from the government the situation wouldn't be that bad.Sometimes inflation isn't all bad as it encourages people to spend their money which increases a country's GDP. Also there is no point in holding fiat currencies which are losing their value gradually but that doesn't mean everybody will buy bitcoin with their fiat currencies. However i don't think bitcoin needs an opportunity to be recognized globally and its real utility will come from its adoption which is not happening as it is supposed to. Nevertheless we are getting more people onboard but bitcoin's only use case right now is as a store of value which is good but we need a real utility in our society for bitcoin to be a world currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 28, 2023, 06:39:18 PM",
      "body": "Quote from: lombok on October 28, 2023, 04:19:14 PMIf we look here, El Salvador has a relatively small inflation rate, namely 3.02 percent. We know that the country is starting to stockpile Bitcoin and mine Bitcoin at the same time.Maybe at this time we cannot conclude that Bitcoin plays a role in suppressing inflation in this country. It takes several years of data and country consistency in adopting Bitcoin.Absolutely nothing to do with Bitcoin!This is SalvadorThis is neighboring GuatemalaThis is far better faring PanamaNow, why don't you do other countries that were supposed to have high adoption rates and see if there is any correlation?Like you know, Turkey for example, with about 45% of its population owning crypto?  I wish people would start to understand that what's good for your personal finances is not immediately good at a country level maybe actually worse!Example:a) You exchange 10 000 Turkish lira to Bitcoin, you get your coins, and nothing extraordinary happensb) 100 million people exchange 10,000 Turkish lira to Bitcoin, and suddenly there is a sell order of $33 billion worth of turkish lira on the market that nobody wants, what do you think that will do to the value of the currency? Drop it like a stone, making the previous buys impossible and turning the lira into dust! Weimar Republic? Sounds a bell?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 28, 2023, 07:48:14 PM",
      "body": "Quote from: crwth on October 28, 2023, 04:52:44 PMOf course, we all know everything advantageous if you were to use Bitcoin and HODL it. It's going to be different for every country but the important thing to see if it has really an effect is that there would be more countries to adopt it. We cannot really quantify if we have so little data. If there would be somewhat of a Bitcoin standard, that would be interesting as well. You raise a good point because the inflation of some countries does not depend only on the funds they are keeping in their reserves. There is no doubt that one having more gold in reserves will face less inflation than one having less gold in reserves, but that's applicable only in the context of gold. Talking about BTC, we cannot surely say that BTC is the main reason behind El Salvador's inflation rate.Inflation rates depend on many other things, like the imports and exports of the country, the product level, and the disasters that occur in the country. A country also faces huge inflation if the government is corrupt, like in the recent thread created where the OP was showing that Nigeria's inflation is increasing, and in that thread, many locals said the main reason is the corrupt leaders. And I very much agree with this reason.We are also facing the same problem of corrupt leaders, but we can't do anything about it openly. Besides this, I will say the current war does have some impact on the BTC price because people who have time to think about their money in war might think to covert it in some form where it can be preserved from the destruction of the war. And they will put money in BTC, but they can put money in gold too. But if you invest in BTC, the price will increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "October 28, 2023, 07:49:47 PM",
      "body": "Am looking at these figures and spotted Zimbabwe who have a fairly good inflation rate than most**surprisingly*... yet we all know these guys are in deep trouble to the point of their local currency being declared redundant and sanctions aren't  doing them any favours at the moment which makes them the perfect candidate to adopt crypto.And in as much as inflation negatively affects economies, not all counties have been brought to their knees for the same reason, some its war, others natural disasters etc And for those  affected financially I believe Bitcoin can fill that void to allow the continuity in running the affairs of country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 28, 2023, 10:36:55 PM",
      "body": "I am not great in economics but just likes to watched videos related to how these countries are experiencing inflation. With I believe for these hyperinflation and countries that are experiencing it, it seems that they're on the peak and there's like no exit on it if the government won't do better. It's not going to take a few years for them to get out of it and policies done by them should be favorable to the new money coming in to them. It's not just all about the financial system that they have but also the government policies that's being implemented that affects wholly their economy. As for these countries that have already been broken, doing something new could be their hope. Investing in Bitcoin is one as it seems their reserve won't be enough anymore but the question is, do they have enough funds to do that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "October 28, 2023, 11:35:34 PM",
      "body": "Quote from: crwth on October 28, 2023, 04:52:44 PMOf course, we all know everything advantageous if you were to use Bitcoin and HODL it. It's going to be different for every country but the important thing to see if it has really an effect is that there would be more countries to adopt it. We cannot really quantify if we have so little data. If there would be somewhat of a Bitcoin standard, that would be interesting as well. Just because the market have bounced the inflation rate could've been seen better with the countries. Just think of a situation whether there is no big movement in market value of bitcoin. In that situation surely the inflation rate will be worse than what every country is experiencing at the present. For people it is an opportunity to be on the safer side. I don't think governments could be more beneficial out of bitcoin. To my understanding governments can consider bitcoin reserve same as gold and there are few countries that already have bitcoin reserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "October 28, 2023, 11:54:08 PM",
      "body": "It is true that all countries are affected by the inflation rate; in fact, all people are facing a crisis like this when it comes to the issue of inflation. And there is also the fact that as the inflation rate increases, we have the opportunity to earn Bitcoin and other cryptocurrencies that have potential in the market as well.I'm not an economist expert, but I really feel the inflation rate problem. If the leader of the country is good, he will be able to control it so that the people who are under him will not suffer much in a crisis like this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "October 29, 2023, 02:43:35 AM",
      "body": "Quote from: kingvirtus09 on October 28, 2023, 11:54:08 PMIt is true that all countries are affected by the inflation rate; in fact, all people are facing a crisis like this when it comes to the issue of inflation. And there is also the fact that as the inflation rate increases, we have the opportunity to earn Bitcoin and other cryptocurrencies that have potential in the market as well.I'm not an economist expert, but I really feel the inflation rate problem. If the leader of the country is good, he will be able to control it so that the people who are under him will not suffer much in a crisis like this one.But governments are the main responsible party for the increase on inflation, and while there are different reasons for inflation to go up, the most powerful of all is an increase on the money supply, and the money supply is completely controlled by governments.So we cannot hope for governments to solve this problem as they are the ones responsible for creating it, and this means that if people want to protect themselves from the negative effects of inflation then they need to find a way to do this on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 29, 2023, 03:46:11 AM",
      "body": "There are so many economic factors that contribute to the inflation rate of a country and the solutions are also multidimensional. Bitcoin can help individuals overcome the effects of inflation but for now, there is no evidence that it has led to the reduction of inflation in any country. It is possible that it can be one of the economic solutions to a country's inflation problems. I don't think that there is a strong correlation between gold reserves and inflation because there are some countries that didn't make the list of countries with the highest good reserves yet they have a relatively low inflation rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "October 29, 2023, 03:49:52 AM",
      "body": "Quote from: wxa7115 on October 29, 2023, 02:43:35 AMQuote from: kingvirtus09 on October 28, 2023, 11:54:08 PMIt is true that all countries are affected by the inflation rate; in fact, all people are facing a crisis like this when it comes to the issue of inflation. And there is also the fact that as the inflation rate increases, we have the opportunity to earn Bitcoin and other cryptocurrencies that have potential in the market as well.I'm not an economist expert, but I really feel the inflation rate problem. If the leader of the country is good, he will be able to control it so that the people who are under him will not suffer much in a crisis like this one.But governments are the main responsible party for the increase on inflation, and while there are different reasons for inflation to go up, the most powerful of all is an increase on the money supply, and the money supply is completely controlled by governments.So we cannot hope for governments to solve this problem as they are the ones responsible for creating it, and this means that if people want to protect themselves from the negative effects of inflation then they need to find a way to do this on their own.If we look, Many bankers and other parties around the world are whispering negative feelings towards the digital world and you are right, they (Governments) will do everything in their power to close down markets that threaten their control even on the other hand there will always be inflation control policies, such as controlling interest rates, controlling the money supply, etc. so that the public is not too exposed. But, as you said, independent efforts must also come from the community.Bitcoin may be an additional option and El Salvador will be the answer to whether Bitcoin can play a role or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 29, 2023, 04:30:01 AM",
      "body": "Quote from: kryptqnick on October 28, 2023, 04:56:49 PMPerhaps the op was unaware or didn't factor that in, but El Salvador's fiat currency is the USD. The USD is pretty good at managing inflation, and that has a major impact, so I think El Salvador's inflation rate is probably due to that rather than due to Bitcoin. Clearly, it's not just that, as the inflation rate for the USA is different, but I just think it probably has a much higher impact than Bitcoin does, as much as we'd like Bitcoin to have a high positive impact. El Salvador's actually only keeping a fraction of its budget in Bitcoin, as even they, with all of that pro-Bitcoin stuff, understand the risks.If a country like El Salvador use USD, there will be no inflation but there will be no jobs too and it is because there won’t be enough USD in circulation… There isn’t enough USD because the country isn’t exporting enough goods… In these situations inflation is actually a good choice, a lesser evil because the other choice brings massive unemployment and unemployed people do stupid things. A smart government know that they should keep people busy with jobs no matter how little the pay is. An employed person gets tired after work and tired people don’t create trouble. They just want a peaceful sleep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 29, 2023, 05:39:25 AM",
      "body": "Quote from: lombok on October 28, 2023, 04:19:14 PMIs there a way to deal with this if the financial system remains like this? Is it too late to change? Or has this already caught up?Comparing economies with only one factor (inflation) is not the most accurate. But as for the change, we should start by trying to prevent governments from wildly printing money. That alone would significantly slow down inflation.Although a lot of other \"structures\" have to change depending on the country since it is vastly different depending on the countries we are looking at.QuoteIf we look here, El Salvador has a relatively small inflation rate, namely 3.02 percent. We know that the country is starting to stockpile Bitcoin and mine Bitcoin at the same time.Unlike majority of countries, El Salvador does not have a fiat currency of its own! They use US dollar. That means the government can not print money like others do hence the lower inflation rate!The economy of El Salvador is small and weak though, hence why I say analyzing economies by looking at one factor is misleading.QuoteWhether Bitcoin is able to help countries overcome inflation, at least it provides options for growing a country's investment value.I don't think so. There are a lot of reasons why inflation grows, one of which is uncapped fiat, not to mention that bitcoin itself is too small and too volatile to help battle inflation.QuoteOn average, countries that experience low inflation rates have large gold reserves.Again you need to expand your view when trying to analyze a complex thing such as economy.For example take the biggest inflation rate in that list. Venezuela has printed far less amount of fiat compared to a lot of other countries including US in that list. However, they have much higher inflation rate. One of the reasons is because unlike a country like US, the Venezuelan government can not export its inflation to the rest of the world or they can't produce and sell garbage bonds to other countries to cover the government budget deficit, etc. ergo all the inflation of every printed bolivar is felt domestically. That also means even if Venezuela had all the gold and bitcoin in the world, they still would have had the same inflation rate!Of course, this is only one reason. As I said this is a very complex topic and I'm not an economy expert to get into all the details.Another reason for inflation is where the money they print goes. For example when Turkey prints money, it goes into the massive budget deficit and the negative foreign reserves they have hence the 100%+ inflation rate. Or when Iran prints money it goes into covering the budget deficit the government has because of how huge it has gotten over the years hence the 40%+ inflation rate.However if these printed moneyz went directly into the economy building it up (eg. building new industries or expanding existing ones), not only it wouldn't have increased the inflation, it could significantly decrease it even into negative inflation rate.This is what I mean by \"structures\" that need to change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 29, 2023, 06:31:16 AM",
      "body": "The American government has long believed in its gold reserves, it didn't just start now because should the dollar fail or anything worse happens to the economy, the gold standard will have to come in.  War fought from way back in its history books taught us this. Bitcoin is like an alternative to the fiat, just like gold, should they be considered as a legal tender for transactions and payments.As it is though, having a personal investment in these three aforementioned kinds of money, will ensure one has wealth and remain fluid during economic downturns of inflation, war or natural disasters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 29, 2023, 07:43:32 AM",
      "body": "Bitcoin only solve microeconomic problems which is me, you and anyone who want to invest in Bitcoin. But not every people will interested to invest in Bitcoin, hence it's only micro.Quote from: pooya87 on October 29, 2023, 05:39:25 AMUnlike majority of countries, El Salvador does not have a fiat currency of its own! They use US dollar. That means the government can not print money like others do hence the lower inflation rate!The economy of El Salvador is small and weak though, hence why I say analyzing economies by looking at one factor is misleading.Using US dollar as their main currency is good since it's more controlled, having own fiat currency need a good management.If El Salvador's economy is small and weak, inflation rate should be high. El Salvador was a high crime rate and high unemployment rate, but in this year both of the crime rate and unemployment rate are keep decrease. So there's a big change by Nayib Bukele, but it's not only because of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}