{
  "id": "topic_5458093",
  "title": "megaminer2017",
  "author": "megaminer2017",
  "created_time": "June 30, 2023, 06:48:23 AM",
  "content": "Hello, dear forum users, today I discovered that all my coins stored on the poloniex exchange were blocked due to delisting. as it turned out later, the exchange posted a notice on the site https://support.poloniex.com/hc/en-us/articles/15295055557911-Announcement-about-the-delisting-of-NXT-RND-PERX-MESH-NU-RFUEL-ZAP-PRINTS-POL-KEEP-B20-MIST-SWRV-MEME-VALUE-ZLOT-on-June-23-2023but there was no official notification to the my e-mail, and therefore I did not know about this news and did not have time to withdraw funds from the exchange ...Now I am trying to file a protest against such actions of the poloniex.com exchange, if one of the owners of NXT coins also kept funds on this exchange and lost them, then write in this forum thread, the more victims there are, the more likely you are to receive compensation for violating the delisting procedure. ..QuoteAnnouncement about the delisting of NXT, RND, PERX, MESH, NU, RFUEL, ZAP, PRINTS, POL, KEEP, B20, MIST, SWRV, MEME, VALUE, ZLOT on June 23, 2023Dear Poloniex Users, As part of the Poloniex team’s continuous efforts to improve the performance of the exchange and to better serve our customers, we may delist certain assets from time to time. We delist assets as part of our mission to provide customers with access to the most innovative projects that fuel the industry and to ensure the assets meet the high standards of our customers. From time to time we may delist an asset if the project no longer satisfies certain important criteria that we look for in our listed assets. These criteria are outlined in our Delisting Policy. Based on our most recent review, we have decided to move forward with delisting the following assets from Poloniex:Nxt (NXT)The RandomDAO (RND)PeerEx Network (PERX)Meshswap Protocol (MESH)NuCypher (NU)RioDeFi (RFUEL)Zap (ZAP)FingerprintsDAO (PRINTS)Proof Of Liquidity (POL)Keep Network (KEEP)B20 (B20)Alchemist (MIST)Swerve (SWRV)Meme (MEME)Value Liquidity (VALUE)zLOT (ZLOT) Important dates:Deposits of all currencies will be halted from June 19, 2023 10:00 UTC. Any deposits made after this time will not be credited to your account.Trading for all currencies mentioned will be halted from June 21, 2023 10:00 UTC.Withdrawals for all currencies are currently enabled and will be disabled on June 23, 2023 at 10:00 UTC. To withdraw your assets, visit your Poloniex wallet, select the asset you want to withdraw, and provide a crypto address associated with the coin you are attempting to withdraw. You must have a balance greater than the minimum network fee of this asset to withdraw. You can find the latest withdrawal fees in your Poloniex Wallet. Please note:All trade orders will be automatically removed after trading ceases in each respective trading pair.Deposits of these tokens after June 19, 2023 10:00 (UTC) will not be credited to your account.Withdrawals of these coins and tokens from Poloniex will continue to be supported until June 23, 2023 at 10:00 UTC. Thanks for your support!Poloniex TeamJune 15, 2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458093",
  "comments": [
    {
      "author": "alterra57",
      "created_time": "June 30, 2023, 08:28:29 AM",
      "body": "Have you tried to contact support?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nm300492",
      "created_time": "June 30, 2023, 01:44:47 PM",
      "body": "i am also a victim here for the same delisting notice...although coins i hold is not nxt....they havent sent any email to me also...this is sheer robbing their users... again this is a centralized exchange scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 01, 2023, 10:53:13 PM",
      "body": "Most importantly, why do you keep coins in a centralized exchange if you are not going to trade for a long time? This is the very exact reason you have been advised against the practice so many times.The time limit given for the traders to withdraw the funds is very short, though. Maybe they have to extend it. I am not surprised this is happening in an exchange owned by the scammer called Justin Sun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "July 09, 2023, 02:31:53 PM",
      "body": "Umm what???They announced this on the 15th of June and permanently disabled withdrawals on 23rd the same month? that's only 8 days! Lmao an email notice wouldn't make this any less sleazy. Any exchange which has a bit of respect to their users would not give such a short time frame. After all, this is a situation where it's highly likely people would not be able to recover their coins unless... they want more people to miss it 😏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}