{
  "id": "topic_5408679",
  "title": "Zarfund",
  "author": "Zarfund",
  "created_time": "August 04, 2022, 09:17:25 AM",
  "content": "Is it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408679",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 04, 2022, 09:43:33 AM",
      "body": "Running household expenses with gambling? That should be considered foolish. Gambling should not be taken as a means of earning money, you have to depend on job or personal work. When things are not in order, the family may later be in finance problem and likely the the marriage can break up after not being a good father. To be a good spouse and father, get yourself a job or have something that is not risky that you are doing, gambling should just be taken for fun and entertainment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "August 04, 2022, 09:55:59 AM",
      "body": "Quote from: Oshosondy on August 04, 2022, 09:43:33 AM^That's right. Gambling is entertainment and to expect that you can constantly win and live on this money is a delusion. I don't even understand where people get that idea from. There are a huge number of articles on the Internet about the probability of winning a game why do some people think they can cheat the mathematical expectation I do not understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 04, 2022, 10:06:04 AM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?You've completely misunderstood what gambling means.You've read this or that and thought you've found the goose with golden eggs. No, you didn't. Most of those writing earning scenarios want you to play under their ref link so they can earn.So, if you have some money you want to throw in and try your luck now and then, that's perfectly fine. That's gambling.If you want to earn by gambling you can easily lose money you didn't afford to lose and get into troubles/drama. That's a big no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "August 04, 2022, 10:24:13 AM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?Ohh you mean professional gamblers? Those who's earning to do gambling activities? Or those people who owns a small gambling space?I believe if you own one, it is very much possible that you can earn enough for your daily necessities. However, if you do gambling to sustain your daily needs, 99% of the time it will never work. You'll definitely end up broke. Proven and tested. There are only rare people who can do this and they're not actually asking if this works, coz they it would work for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 04, 2022, 10:29:31 AM",
      "body": "Quote from: Jawhead999 on August 04, 2022, 10:14:05 AMI believe only less than 0.001% gamblers who actually running household expenses with gambling since they're a professional gamblers who studied one particular game for long time enough.There's no way for ordinary gamblers who only bet on their favorited club/player or playing slots, since they're not professional and house edge will always on house side. I think you're not an experienced gambler, so I will say it's impossible to run household expense with gambling.If that is true, that means some people out of the 0.001x gamblers that have money before will be declared gone poor after being rich before. There can be professional gamblings but they should not depend on gambling for family expenses.Everybody are ordinary, only betting companies are the ones that are making the money, not gamblers. Gamblers that make most money are not even gambling often, but if they start to be gambling often, they will start losing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "August 04, 2022, 10:30:39 AM",
      "body": "Bruh! If people depend their expenses on some form of luck -- they probably need an immediate checking. Plus, saying that you don't have a skill in any niche is just an excuse.But seriously, how can someone gamble when in the first place they do not have a job? i mean the risk obviously outweighs the reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 04, 2022, 10:42:39 AM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?perhaps if you won a life-changing jackpot then yeah, but if not, then, no. even professional gamblers have jobs that would support their daily expenses. only a moron would try to live through gambling. Quote from: Zarfund on August 04, 2022, 09:17:25 AMI am asking for those people who don't have any skill or job ?sooner or later they'll need to find a job or acquire a skill if they want to support themselves, fully relying on gambling is a disaster waiting to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "August 04, 2022, 10:59:32 AM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?That is the worst idea mate, household expense is like everyday and maybe every two weeks or a month. So how can you sustain it if you solely rely on gambling? It will not work in my opinion as obviously gambling is risk and it is not 100% guarantee that you can have money in the time frame that I have describe. Better get a job, a decent one, a regular job so that you can pay all the expenses without having issues and then if you have still some extra money then you can either save it (good advise), or if you are a casual gambler, then play with it. At least you will not have any problems at the end with those expenses piles up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "August 04, 2022, 11:03:54 AM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?Possible, it is not an assurance, so this is an idiotic idea. I don't think there is some successful gambler here who do this right? Because we all know that this is not the right thing to do. We should get us a 9-5 job to bring food in the table and then have some money for our living expenses.Quote from: Zarfund on August 04, 2022, 09:17:25 AMI am asking for those people who don't have any skill or job ?Then look for one. Plan, save, anticipate. Do not pin one's hope to gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "August 04, 2022, 11:10:29 AM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?I've never seen such a thing exist because most of the time when someone is gambler inside the home, he won't tell his families about it. I don't know in some parts of the world if they have such a culture but things like this are blameworthy and no one really gonna give it a try because imagine if they lose the money for their essential needs, who would they blame? of course they will turn against each other until they can no longer live with each other. It's not every day for you someday are against you and this is why you need to refrain from such kind of thing because the ending is not good no matter how you look at it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "August 04, 2022, 11:28:58 AM",
      "body": "Gambling using household expenses in my opinion is a very stupid act, even more so than an addict, because there are still many addicts or active gamblers who prioritize household needs, the rest is used for gambling.Would you like to see your family starve or suffer if you lose everything?Such gamblers are more stupid than stupid gamblers, gambling is not a good way to make or double money because most gamblers will accept more lose than win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 04, 2022, 12:50:05 PM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?Unless you have decided to live constantly with high blood pressure that comes with thinking of how to meet up with your expenses through an unreliable means such as gambling. In my opinion I will advise you against such that is making a dependence on gambling as it could lead to desperation and depression that may provoke suicidal thoughts associated with not being able to meet up with one's duties. Gambling is not a steady source of income and should never be considered as one, if you mist make money from gambling or you want to turn it into a source of income, get an operational license from a sports betting or gambling casino if possible and run your own branch with their name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rieeir",
      "created_time": "August 04, 2022, 12:52:51 PM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?You live in some kind of pink fantasies, apparently. You should understand before you quit your main job for gambling - very few people REALLY win such large sums that they can live in peace for the rest of their lives, not work anywhere and not deny themselves anything. Gambling is not a stable source of income, and everyone who claims otherwise is lying. This is, first of all, a hobby, a challenge for a cold reason, and self-control skills. Nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 04, 2022, 01:36:34 PM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?Totally I'm not encouraging that for someone without a job or skill depending on gambling to run house hold expenses no! no!, infact the only way you could succeed and be able to run your house hold expenses successfully with gambling is if only you're a professional gambler that knows what your doing , if not you will get recked on the process and can even lead you to more worsening condition than you find yourself. I advice you find other ways to take care of your family rather than gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "August 04, 2022, 02:14:41 PM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?From my understanding into gambling, gambling is not a show way of making constant flow of money because it is a game of prediction and a game of luck not everybody who play a game win a game so the possibility of maintaining household or spending in a household with the gambling I think it will not to be a constant something and it cannot work for one year or two years. Because the way I am seeing gambling nobody will tell me that they do gambling every time if any person inform you that I think is a capital Iies. Gambling is not what somebody Caroline on it capital or it's funds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "August 04, 2022, 03:58:15 PM",
      "body": "You can win in gambling mostly by luck so how are you going to sustain your household necessities and expenses if you won't get lucky all the time? It will be wiser if you have your permanent job and have gambling as your past time because you can't have it as your main source of income because of its risk. There's a chance that you can lose all of your funds so it's not advisable to expect income from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "August 04, 2022, 08:06:32 PM",
      "body": "The ideal of running household expenses with gambling is really bad, gambling is not really guaranteed, your winning is not really assured, what if you keep on losing in gambling and you are having lot's of things to take care of how are you going to make money to do that, I believe nobody should rely on only gambling because you making money is not assured. The best thing is to get a job then you can still gamble and make extra cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "August 04, 2022, 09:15:05 PM",
      "body": "Are people familiar with the term insider trading? Where industry insiders know ahead of time which announcements will be made. And invest to profit from the inside information.There is a similar insider gambling trend that is real. Coaches. Athletic trainers. Athletes. Industry insiders. People who know people. They have access to inside information that is valuable in gambling, that the general public does not have.One example of inside gambling was when Francis Ngannou fought Ciryl Gane. Industry insiders knew Ngannou went into that fight with a knee injury. Which is why the betting line was slanted in Ciryl Gane's favor. Ngannou won the fight, despite his injury. Which goes to show insider gambling isn't always profitable.Another example of inside gambling was when Amanda Nunes fought Julianna Pena the 1st time. Lots of industry people came out and predicted Pena would win the fight. Due to inside information about Nunes being in a poor state of preparation leading into it.There are definitely consistent winners in gambling. Having inside sources might help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "August 04, 2022, 09:18:41 PM",
      "body": "Quote from: Zarfund on August 04, 2022, 09:17:25 AMIs it possible that we can run our household expenses with gambling ?I am asking for those people who don't have any skill or job ?Income... income can come from some skill or a job, or it can come from something else (legal/illegal), but without income don't even think about spending money you have on gambling! It's a disaster in advance... sooner or later!For gambling, you need a bankroll for gambling and other sources of income, that can fill the loopholes from time to time! It's gambling, you can't count that you will win all the time whatever game you choose to play! So if you don't have enough for \"household expenses\" don't even think about gambling and making some money in the long run! Gamble responsible and good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}