{
  "id": "topic_5472530",
  "title": "bluebit25",
  "author": "bluebit25",
  "created_time": "November 02, 2023, 03:36:31 AMLast edit: November 02, 2023, 04:25:00 AM by bluebit25",
  "content": "It is possible that many people have also heard about it and are looking for the opportunity to receive airdrops from this project, and I want to do some analysis for those who are interested in their airdrops.Details project: https://www.memecoin.org/https://www.memeland.com/First this project brought some major hype when they announced they would implement Lauchpool on Binance, detail: https://www.binance.com/en/support/announcement/introducing-memecoin-meme-on-binance-launchpool-farm-meme-by-staking-bnb-tusd-and-fdusd-90ccca2c5d6946ef9439dae41a517578I think many people will probably think that it is similar to the memecoins that have appeared in this space, so if you have ever known 9GAG, perhaps it will be easier for us to understand the project's intentions. And I don't want to analyze too much but just want to focus on the main issue of the opportunity to receive an airdrop from the project.This part will mainly belong to the owners of NFT collections in memeland.As far as I know, this is the part that many people are misunderstanding and have been quite concerned about recently with the mission on https://www.memecoin.org/farmingAlthough there is no official announcement yet, the listing time will be soon(Nov 3, 2023), so I think we will soon see an announcement on how to claim as well as other specific criteria. And this is just information that I researched and speculated about Memeland. If there are any mistakes, I hope to receive feedback from everyone.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472530",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "November 02, 2023, 09:07:35 AM",
      "body": "There have been alot of related projects in this same format and all they could do at the end is to suffer all those that have worked for them by rewarding them with nothing, though i want to believe that your own case will not be thesame as that, you will be people that will maintain their words and keep promise, people are definitely interested in airdrops they scared of being scammed through the means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 02, 2023, 12:45:48 PM",
      "body": "Quote from: Dunamisx on November 02, 2023, 09:07:35 AMThere have been alot of related projects in this same format and all they could do at the end is to suffer all those that have worked for them by rewarding them with nothing, though i want to believe that your own case will not be thesame as that, you will be people that will maintain their words and keep promise, people are definitely interested in airdrops they scared of being scammed through the means. - I am not someone who encourages airdrops, although there are projects where I have also received a large amount of money. But in general, most of them are scam projects, and in the content I shared above, as a personal analysis, I speculate that these are the ways that many people can receive the project.- If you don't research and just post things that you think are obvious then this project will be a mistake, I'm pretty sure people will receive a big airdrop tomorrow based on the announcements TGE from the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "November 02, 2023, 06:27:03 PM",
      "body": "I am looking forward to their listing time which will be tomorrow(Nov 3, 2023). Please keep us informed about how to claim it. I don't usually participate in airdrops, but because you felt it would be a good idea to post this on the forum so people might try their luck with memecoins, let me see if I can. Who knows? Maybe this is another Arbitrum but in her own shape.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 03, 2023, 01:17:31 AM",
      "body": "Quote from: bluebit25 on November 02, 2023, 03:36:31 AM... I want to do some analysis for those who are interested in their airdrops...To participate in the sale, it was necessary to hold an NFT, the cost of which reached 5 ETH, depending on the rarity. And this did not guarantee the opportunity to buy coins, since a lottery was held among those who had the right to do so. For those who participated in social programs from Memeland, it is unlikely to get at least some profit due to the large number of participants. So the only real opportunity to get $MEME is to participate in launchpool on the Binance, which will be active until November 26, 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 03, 2023, 06:49:45 AM",
      "body": "$MEME very hyped up right now, listing at Binance at 8am UTC (in about 1 hour)OTC at 20x, Bitmex futures already trading at 30x Fire Sale price (https://www.bitmex.com/app/trade/MEMEUSDTX23). Pick your poison;airdrops are heavily vested, fire sale unlocks slightly better...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "November 03, 2023, 07:44:57 AM",
      "body": "This could be easily worth it if you have some stables lying around. Risks just the yield you would get when staking on something else.And yeah, so much hype behind it right now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 03, 2023, 11:04:41 AM",
      "body": "Update...QuoteMEMELAND NFT HOLDERSEACH MEMELAND NFT IS ELIGIBLE FOR THE FOLLOWING:1. MVP HOLDER: 8229798.230792167776562956 MEME PER NFT.    CAPTAINZ HOLDER: AMOUNT VARIES DEPENDING ON CAPTAINZ TRAITS.2. HUMAN OR UNREVEALED: 685816.519232680648046913 MEME PER NFT    SHARK OR KRAKEN: 1371633.038465361296093826 MEME PER NFT3. KONG OR KAIJU: 2057449.557698041944140739 MEME PER NFT    ALIEN: 6858165.192326806480469130 MEME PER NFT    POTATOZ HOLDER: 228605.506410893549348971 MEME PER NFT.MAPS OR VALUABLES HOLDERS1. MAPS: AMOUNT VARIES DEPENDING ON TRAIT    SPECIAL: 1526.987850487972204395 MEME PER MAP    EXTRAORDINARY: 6107.951401951888817580 MEME PER MAP    MAGICAL: 12215.902803903777635160 MEME PER MAP    EPIC: 27485.781308783499679110 MEME PER MAP    MYTHICAL: 105362.161683670082103255 MEME PER MAP2. VALUABLES: AMOUNT VARIES DEPENDING ON TRAIT    SAND: 208.290505484832375951 MEME PER VALUABLE    KIWI: 833.162021939329503804 MEME PER VALUABLE    CHERRY: 1666.324043878659007608 MEME PER VALUABLE    IVORY: 3749.229098726982767118 MEME PER VALUABLE    DARK: 14372.044878453433940619 MEME PER VALUABLESo NFT holders can claim MEMECOIN, and according to the current price, this is a big airdrop. I have seen through some media that qualified people receive a large amount of money if they sell MEMECOIN. And even presale and firesale programs also bring a large profit rate to those who participate.However, there is still no official announcement about the airdrop to the community of people who are performing tasks on https://www.memecoin.org/farmingAlthough I did not participate in this event because the number of connections was too large, in my opinion there will be related announcements soon. And congratulations again to everyone who received an airdrop from Memecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "November 03, 2023, 02:51:55 PM",
      "body": "I've just seen this coin that some of my friends posted that it's listed on four different exchanges. Now I see why is it that there's hype on it.I honestly don't like such coins before but can't argue about the money that's flowing on it. Anyway, I wouldn't ride on the hype especially when it seems that there's much hype on it already and I think I'm kinda late for such projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "November 03, 2023, 06:15:20 PM",
      "body": "Quote from: edmundduke on November 03, 2023, 07:44:57 AMThis could be easily worth it if you have some stables lying around. Risks just the yield you would get when staking on something else.And yeah, so much hype behind it right nowMaybe it's true that it is worth it because it is said to be launched in Binance, and we all know the effect it can bring to a project even if that project isn't that good at all. I know stable coins are also valuable but they are only stable while these new projects can still be inflicted by the hypes which results for their value to rise dramatically.I wouldn't say risk the yield that they would get because I'm sure they will be greedy and want more yields so that means they can also risk a lot of stable coin then? I think the correct advice would be is they should invest only what they can afford to lose because that also means they will only invest smaller amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 03, 2023, 06:46:48 PM",
      "body": "Quote from: bluebit25 on November 03, 2023, 11:04:41 AM...However, there is still no official announcement about the airdrop to the community of people who are performing tasks on https://www.memecoin.org/farmingAlthough I did not participate in this event because the number of connections was too large, in my opinion there will be related announcements soon. ..I think that the farming of points will continue until the Launchpool on the Binance ends. And according to the announcement, Binance Launchpool will continue until November 26. But it is not worth expecting that farming will bring significant profit, since more than 2 million people take part there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 03, 2023, 06:54:37 PM",
      "body": "Quote from: batang_bitcoin on November 03, 2023, 02:51:55 PMI've just seen this coin that some of my friends posted that it's listed on four different exchanges. Now I see why is it that there's hype on it.I honestly don't like such coins before but can't argue about the money that's flowing on it. Anyway, I wouldn't ride on the hype especially when it seems that there's much hype on it already and I think I'm kinda late for such projects.Anyway, it would be good for you not to FOMO over it, but of course this is merely a topic about airdrops related to this project. I also recently accessed the project's social channels and saw some negative feedback from people farming through social media interaction. It seems like from the beginning many people were hyped about the fact that listing on Binance would bring them an airdrop, but as I speculated from the beginning, it is now only NFT holders, and participating in the presale firesale, they can claim. Furthermore, I also know that the Dev holding the majority of NFT, so it's quite risky that they can pump/dump based on what they are getting, but still this is one of the few large airdrops recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "November 03, 2023, 08:25:35 PM",
      "body": "Quote from: tvplus006 on November 03, 2023, 06:46:48 PMQuote from: bluebit25 on November 03, 2023, 11:04:41 AM...However, there is still no official announcement about the airdrop to the community of people who are performing tasks on https://www.memecoin.org/farmingAlthough I did not participate in this event because the number of connections was too large, in my opinion there will be related announcements soon. ..I think that the farming of points will continue until the Launchpool on the Binance ends. And according to the announcement, Binance Launchpool will continue until November 26. But it is not worth expecting that farming will bring significant profit, since more than 2 million people take part there.One of the things i dont really that consider on joining an airdrop on which it is really that something that too much on hype and there are tons or huge numbers when it comes to involvement specially if you do see the number of those airdrop hunters is really that huge then it would really be that safe to assume that rewards would really be that much lesser. I have joined a TG group on which they've been really  that talking about $MEME and to those who are involved on airdrop which they arent still receiving yet but its better not to anticipate much so that you wont really be that expecting that something big. If it does then lucky for those who had able to hunt but if its not then making or racking up those points is useless.The airdrop that i do really just that simply like is something that like with Arkham and Arbtirum. It isnt really just that making up so much noise on which only a few people did really get those huge rewards on which i could say that it is really worth for that AD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 03, 2023, 09:19:08 PM",
      "body": "I wonder why Binance list them probably having some connections was the main reason or was just the community wanting it? So, now it has 8B in circulation but the total supply was 69B probably this price right now might go lower if it happens there are still huge unlocks in the future. I wonder what are those 60B tokens for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 04, 2023, 02:22:47 PM",
      "body": "Quote from: tvplus006 on November 03, 2023, 06:46:48 PMQuote from: bluebit25 on November 03, 2023, 11:04:41 AM...However, there is still no official announcement about the airdrop to the community of people who are performing tasks on https://www.memecoin.org/farmingAlthough I did not participate in this event because the number of connections was too large, in my opinion there will be related announcements soon. ..I think that the farming of points will continue until the Launchpool on the Binance ends. And according to the announcement, Binance Launchpool will continue until November 26. But it is not worth expecting that farming will bring significant profit, since more than 2 million people take part there.I agree with your speculation about this activity, but I also don't think it brings much value to the participants when the number of participants is too large. On average, the number of tokens that participants receive will only be a few $, and memecoin operating on Ethereum will require GAS fees, so this is really a discouraged activity.But I also have some speculations that if the project wants to have more control over the number of people responding, it will have to have accompanying expenses. The easiest way is the way they are calculating points.Ignoring the ongoing activity, this is also an airdrop that brings a lot of profits to those who own NFTs and buy presales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 04, 2023, 04:42:48 PM",
      "body": "Quote from: rhomelmabini on November 03, 2023, 09:19:08 PM... So, now it has 8B in circulation but the total supply was 69B probably this price right now might go lower if it happens there are still huge unlocks in the future. I wonder what are those 60B tokens for.You will not be able to find the answer to this question, because we cannot know what the developers were guided by when choosing the maximum size of the supply, especially for the coin meme. The only thing I understand is when the maximum volume of the offer is chosen, equal to 21 million, because everyone wants to be a bit like bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 04, 2023, 08:07:39 PMLast edit: November 04, 2023, 08:18:40 PM by rhomelmabini",
      "body": "Quote from: tvplus006 on November 04, 2023, 04:42:48 PMQuote from: rhomelmabini on November 03, 2023, 09:19:08 PM... So, now it has 8B in circulation but the total supply was 69B probably this price right now might go lower if it happens there are still huge unlocks in the future. I wonder what are those 60B tokens for.You will not be able to find the answer to this question, because we cannot know what the developers were guided by when choosing the maximum size of the supply, especially for the coin meme. The only thing I understand is when the maximum volume of the offer is chosen, equal to 21 million, because everyone wants to be a bit like bitcoin.Exactly, people are still mesmerized by this thing and the only thing they're keeping rich are the developers and in the end the retail suffers. I hope they have distributed it in a way that it's more like the Dogecoin. Well, it's just a meme and these recent meme products are just for hype and most of them just want to be hyped by huge influencers across social media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 05, 2023, 05:19:57 AM",
      "body": "I saw several big projects listing this token or participating with it (Pyth network adding it's price feed, Pika protocol listing it). Pretty huge deal for token that has no use whatsoever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 05, 2023, 08:09:18 AM",
      "body": "Quote from: libert19 on November 05, 2023, 05:19:57 AMI saw several big projects listing this token or participating with it (Pyth network adding it's price feed, Pika protocol listing it). Pretty huge deal for token that has no use whatsoever. It can be considered that there is a hype going on around it, but I actually don't invest in these things so I don't bother too much with research specifically. With Memeland, the related airdrop information is something that has attracted a lot of attention from the community in recent days. Although it may not be fair for everyone, those who were able to claim and sell it are enjoying it. The profits are quite good, currently TGE accounts for about %10 of the supply so I believe there will still be some opportunities for those interested in the next possible airdop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "November 06, 2023, 12:20:10 AM",
      "body": "Quote from: bluebit25 on November 05, 2023, 08:09:18 AMQuote from: libert19 on November 05, 2023, 05:19:57 AMI saw several big projects listing this token or participating with it (Pyth network adding it's price feed, Pika protocol listing it). Pretty huge deal for token that has no use whatsoever. It can be considered that there is a hype going on around it, but I actually don't invest in these things so I don't bother too much with research specifically. With Memeland, the related airdrop information is something that has attracted a lot of attention from the community in recent days. Although it may not be fair for everyone, those who were able to claim and sell it are enjoying it. The profits are quite good, currently TGE accounts for about %10 of the supply so I believe there will still be some opportunities for those interested in the next possible airdop.I have heard that if memecoin.org/farming is only for rewarding the users who have been contributing to the project. I can't even sure if this is related to the airdrop but the developed said it's TBA. All of people who have been farming through memecoinorg was feeling quite disappointing caused by they were thinking it's related to the airdrop. Im still waiting what kind of announcement will be released by the team in the future. I hope that will be something good for the all of farmers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}