{
  "id": "topic_5425896",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "December 05, 2022, 10:15:18 PM",
  "content": "على حسب ظني ان بسبب ما حدث للعملات الرقمية فهذا العام وجدت الحكومات فرصة كبيرة لوضع حدود اكثر وفرض ضرائب اكبر على سوق وكل ما يتعلق بالعملات الرقمية ورأينا هذا الامر على العديد من الدولوالآن قد ياتي الدور على ايطاليا التي تضمن على مشروع قوانينهم للسنة القادمة 2023 قانونا جديدا يفرض على جميع المستخدمين دفع 26% من ارباح تداول او تعامل العملات الرقمية للمبالغ المالية التي تتعدى ال 2000 اورو كما على كل المستخدمين الاعلان عن كل ما يمتلكونه من العملات الرقمية بحلول 2023 الامر مزعج كثيرا للمستخدمين بطبيعة الحال ولكن الاستفسار الان هل على المستخدمين ان يقوموا بالاعلان عن ممتلكاتهم الرقمية وهل يمكن للحكومة ان تعرف ذلك اذا قمت بالاخفاء كيف ذلك مصادر المعلومات هنا 1 [ https://www.bloomberg.com/news/articles/2022-11-30/italy-plans-to-tax-crypto-trading-gains-expand-disclosure ]2 [https://cryptoarabia.org/news/latest/إيطاليا-تفرض-ضريبة-تشفير-بنسبة-26%D9%AA/]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425896",
  "comments": [
    {
      "author": "Ulven",
      "created_time": "December 05, 2022, 11:32:00 PM",
      "body": "نعم صدفت أيضاً مقالا على النت يتحدث عن فرض الضريبة عن الأصول الرقمية بداية من السنة الجديدة، و أيضاً البرتغال في طريقها للمصادقة على مشروع فرض الضريبة للأصول الرقمية بعدما شهدنا الكثير من المستخدمين يتوجهون نحو البرتغال لتفادي الرسوم الضريبية المفروضة في بلدانهم.أعتذر لم أتذكر رابط المدونة، لا أعتقد أن المستخدمين سيعلنون عن ممتلكاتهم إلا حالة وجود ضمانات تساعد على الإعلان أما إذا كان هناك يقلق المستخدم أعتقد أنه سيكتم على ذلك و نسبة التعرف عليه ليست عالية إذا كان يملك المفتاح الخاص للمحفظة و الأصول مخزنة في الشبكة البلوكتشين لا أعتقد أن السلطة الإلكترونية ستكون قادرة رؤيتهم.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 06, 2022, 01:51:11 AM",
      "body": "للأسف كلامك صحيح، أتوقع أن هذا من تأثير حادثة منصة FTX والحوادث التي سبقتها وتلتها ومن المؤكد سنشهد ذلك في مزيد من الدول. نسبة 26% من الأرباح هي نسبة كبيرة لذلك أتوقع أن معظم المستخدمين سيلجأون للتهرب من إعلان ألقيمة الحقيقية لأصولهم أو أرباحهم. بطبيعة الحال إذا كان المستثمرون يمتلكون بيتكوين مخزن في المحفظات فلن تتمكن الحكومة من معرفة أي شيء عن صاحب المحفظة ما لم يقم هو بالإعلان عن ذلك بنفسه. أما بالنسبة للمنصات المركزية أو اللامركزية التي تفرض KYC فسوف تتمكن الحكومة من مراقبة كل تحركات المستثمرين بسهولة وتجبرهم على دفع الضريبة. لذلك أفضل حل للمستخدمين الإيطاليين الذين لا ينوون دفع الضريبة تحويل عملاتهم إلى بيتكوين ونقلها إلى محفظات بيتكوين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 06, 2022, 11:30:53 PM",
      "body": "كان هذا متوقعا ان يساهم ما حصل اما في تأكيد اجراءات حضر كان قد تم اطلاقها سابقا او في اصدار قرارات حضر جديدة و تشديد الرقابة على المستخدمين.في دول تكون فيها الرقابة مشددة على حركة الاموال، سوف لن يكون من السهل على المستخدمين صرف مدخراتهم من الكريبتو و الاستفادة بها في الحياة اليومية لان جميع المبالغ يتم التصريح بها بمجرد ايداعها او سحبها. 2000 دولار قد يبدو رقما كبيرا لكن لن يكون بالامكان صرفه بشكل دوري على اساس يومي او اسبوعي مثلا. قرار مثل هذا سيضطر المستخدمين الى ايجاد طريقة لتبييض اموالهم التي جنوها من مدخرات الكريبتو كي لا يضطروا الى دفع اكثر من ربعها في شكل اداءات و ضرائب.هذه النسبة تشبه كثيرا تلك النسب التي يتم اقتطاعها عن الأرباح من انشطة القمار و الرهانات المختلفة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "December 07, 2022, 01:02:10 AM",
      "body": "اعتقد ان هدا الامر جيد فهوا اعتراف ضمني من تلك الدول ان العملات المشفرة هي \"عملات\" ذات قيمة, ففرض الضريبة عليها يجعلها مثل الدهب او الفضة, القانون في ايطاليا واغلب دول العالم يقتضي التصريح بممتلاكاتك, وايضا التصريح بالمكاسب التي تحصلت عليها من التجارة.بالنسبة لامكانية ان تعرف الحكومة ماتملكه من كريبتو فالامر ممكن جدا وليس مستحيل, البلوك تشين يعتبر كتاب مفتوح للجميع وقد طورت الشركات والدول برامج تتبع متقدمة جدا, طبعا في حال عدم استخدام المنصات التي تطلب تعريف الهوية وغيرها, واتباع بعض خطوات الخصوصية سيكون الامر صعب جدا, ويمكن ان تخفي ماتملكه وتبيعه وتشتري غيره لعشرات السنوات دون علم السلطات, ولكن المسئلة هنا هي مسئلة ثقافة شعوب, تلك الشعوب تخاف من عواقب القانون, وفي العادة التهرب الضريبي يعتبر جريمة, لا احد يريد المخاطرة ب 10 سنوات من حياته في السجن ليخفي 5 قطع ايثيريوم يمتلكها عن الحكومة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 07, 2022, 03:36:20 PM",
      "body": "لم اقرأ تفاصيل القانون ولكن اذا كانت الضرائب علي التداول وعلي التعامل بالعملات الررقمية فهي ليست بالمشكلة, فمثلا اذا كنت تقوم بشراء البيتكوين كالاتي:DCA:اغلبنا يفعل ذلك حيث نقوم بشراء مبالغ صغيرة كل شهر, وبالتالي فلا يوجد ضرائب عليهاالمتاجر: المتاجر لا تقوم بطلبيات باكثر من 2000 يورو في المعاملة الواحدة.الاحتفاظ بالبيتكوين: لا توجد ضريبة, يبدوا ان الضرائب عندما تقوم بالبيع او الشراء.التداول: لا توجد صفقات تداول للمستخدم العادي خصوصا التداول اليومي باكثر من 2000 يورواذن ستدفع الضريبة مره واحدة اذا احتفظت بالبيتكون لمده 5 سنوات, وقمت ببيعها وعندها اتوقع ان يكون ارباحك اكثر من الخسائر التي ستدفعها مقابل الضرائباعتقد ان الرقم سينخفض مستقبلا اذا رأينا ما يحدث في السوق والاوضاع الصعبة للاقتصاد مع الركود والمشكلات الاقتصاديةالسؤال الان هل هناك ضريبة سابقه وتمت زيادتها؟ ام انها ضريبة جديدة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 07, 2022, 10:14:28 PM",
      "body": "Quote from: Husires on December 07, 2022, 03:36:20 PMلم اقرأ تفاصيل القانون ولكن اذا كانت الضرائب علي التداول وعلي التعامل بالعملات الررقمية فهي ليست بالمشكلة, فمثلا اذا كنت تقوم بشراء البيتكوين كالاتي:DCA:اغلبنا يفعل ذلك حيث نقوم بشراء مبالغ صغيرة كل شهر, وبالتالي فلا يوجد ضرائب عليهاالمتاجر: المتاجر لا تقوم بطلبيات باكثر من 2000 يورو في المعاملة الواحدة.الاحتفاظ بالبيتكوين: لا توجد ضريبة, يبدوا ان الضرائب عندما تقوم بالبيع او الشراء.التداول: لا توجد صفقات تداول للمستخدم العادي خصوصا التداول اليومي باكثر من 2000 يورواذن ستدفع الضريبة مره واحدة اذا احتفظت بالبيتكون لمده 5 سنوات, وقمت ببيعها وعندها اتوقع ان يكون ارباحك اكثر من الخسائر التي ستدفعها مقابل الضرائباعتقد ان الرقم سينخفض مستقبلا اذا رأينا ما يحدث في السوق والاوضاع الصعبة للاقتصاد مع الركود والمشكلات الاقتصاديةالسؤال الان هل هناك ضريبة سابقه وتمت زيادتها؟ ام انها ضريبة جديدة.حسب ما وجدت بعد بحثي حول الامر تفاجئت بوجود ضرائب تقريبا بنفس النسبة لكن حسب هذا المقال الذي قرأته ان الضرائب على الربح فقط للمبالغ التي تتعدي 51 الف يورو فقط وبقيت في حسابك لمدة سبعة ايام متواصلةوايضا حسب القانون الجديد ان كل من قام بالاعلان عن ممتلكاته من العملات المشفرة سوف يدفع ضريبة اقل تقدر ب13% من الربحالمقال https://coinpanda.io/guides/crypto-taxes-italy/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 07, 2022, 10:28:14 PM",
      "body": "Quote from: Husires on December 07, 2022, 03:36:20 PMلم اقرأ تفاصيل القانون ولكن اذا كانت الضرائب علي التداول وعلي التعامل بالعملات الررقمية فهي ليست بالمشكلة, فمثلا اذا كنت تقوم بشراء البيتكوين كالاتي:DCA:اغلبنا يفعل ذلك حيث نقوم بشراء مبالغ صغيرة كل شهر, وبالتالي فلا يوجد ضرائب عليهاالمتاجر: المتاجر لا تقوم بطلبيات باكثر من 2000 يورو في المعاملة الواحدة.الاحتفاظ بالبيتكوين: لا توجد ضريبة, يبدوا ان الضرائب عندما تقوم بالبيع او الشراء.التداول: لا توجد صفقات تداول للمستخدم العادي خصوصا التداول اليومي باكثر من 2000 يورويبدو و كأن الحكومة الايطالية التجأت الى قطاع التشفير للحصول على ايرادات اكثر و ليس للتضييق على المستخدمين. الدولة لا يبدو انها تتخذ ما يشبه الاجراءات الحمائية لمقاومة انشطة مشبوهة او غسيل اموال او تمويل نشاطات مشبوهة. و بالنظر الى نسبة الاقتطاع فان الدولة تبدو في موقف انتهازي تماما خصوصا بالنظر الى ان اصدار هذه القوانين سبقته سلسلة الكوارث التي حصلت من سقوط لمنصات كبيرة و كان ذلك ربما اكبر دليل على حجم النشاط المالي للمستخدمين في هذا المجال الذي بقي خارج اطار الدولة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 08, 2022, 02:27:19 AMLast edit: May 16, 2023, 04:20:44 AM by yhiaali3",
      "body": "Quote from: GxSTxV on December 07, 2022, 10:14:28 PMحسب ما وجدت بعد بحثي حول الامر تفاجئت بوجود ضرائب تقريبا بنفس النسبة لكن حسب هذا المقال الذي قرأته ان الضرائب على الربح فقط للمبالغ التي تتعدي 51 الف يورو فقط وبقيت في حسابك لمدة سبعة ايام متواصلةوايضا حسب القانون الجديد ان كل من قام بالاعلان عن ممتلكاته من العملات المشفرة سوف يدفع ضريبة اقل تقدر ب13% من الربحالمقال https://coinpanda.io/guides/crypto-taxes-italy/قرأت المقال الذي أشرت إليه أخي، لكن وجدت أنه بالنظر إلى الضريبة المفروضة على القطاعات الأخرى غير كريبتو تعتبر الضريبة المفروضة على كريبتو منخفضة نوعا ما. هذا الاقتباس من المقالة المذكورة والجدول يوضح أن الضريبة تتراوح بين 23% إلى 43% للدخل الذي يتراوح بين 15 ألف إلى فوق 50 ألف يورو:QuoteThe national income tax makes up the majority of the total tax that Italian taxpayers need to pay. The tax rates are progressive and vary between 23% and 43% depending on the taxable income amount. The more you earn, the more you pay in taxes – much similar to other European countries today.أيضا من خلال المقالة تبين لي أنه لا يتم فرض ضريبة عند شراء العملات المشفرة باليورو أو الدولار بينما يتم فرض الضريبة عند شراء عملة مشفرة باستخدام عملة مشفرة أخرى، لم أفهم لماذا صراحة؟ لكن بشكل عام أرى أن هذه القوانين مشجعة للعملات المشفرة في إيطاليا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "December 08, 2022, 11:38:36 AM",
      "body": "Quote from: yhiaali3 on December 08, 2022, 02:27:19 AMأيضا من خلال المقالة تبين لي أنه لا يتم فرض ضريبة عند شراء العملات المشفرة باليورو أو الدولار بينما يتم فرض الضريبة عند شراء عملة مشفرة باستخدام عملة مشفرة أخرى، لم أفهم لماذا صراحة؟ لكن بشكل عام أرى أن هذه القوانين مشجعة للعملات المشفرة في إيطاليا. هل تقصد أن دفع رسوم الضريبية يتم بإستخدام التشفير و ليس الأموال الحقيقية، هذا يعني إعتراف كبير من طرف الحكومة الإيطالية للتشفير هذا سيشجع أكثر على بناء أسواق ضخمة في الدولة تتعامل بالتشفير.في النهاية فرض الضريبة على الأصول الرقمية تعتبر خطوة مهمة للنمو أسواق التشفير خلال الفترات القادمة بمثل هذا التأييد سيساهم بشكل من الأشكال  في عودة السوق إلى إنطباعه الطبيعي في الفترات القادمة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 08, 2022, 04:40:55 PM",
      "body": "Quote from: Ulven on December 08, 2022, 11:38:36 AMهل تقصد أن دفع رسوم الضريبية يتم بإستخدام التشفير و ليس الأموال الحقيقية، هذا يعني إعتراف كبير من طرف الحكومة الإيطالية للتشفير هذا سيشجع أكثر على بناء أسواق ضخمة في الدولة تتعامل بالتشفير.لا أخي دفع الرسوم الضريبية يتم بواسطة اليورو أو الدولار ، لكن هناك حالتين: 1 -  عندما يشتري مواطن إيطالي عملة مشفرة باستخدام اليورو أو الدولار لا يتم أخذ ضريبة منه. 2 -  عندما يقوم مواطن إيطالي بشراء عملة مشفرة بواسطة عملة مشفرة أخرى مثلا يقوم بشراء بيتكوين بواسطة USDT فيتم أخذ الضريبة منه باليورو أو الدولار. ربما يكون هذا التشجيع للشراء بواسطة اليورو مقصود من طرف الحكومة الإيطالية، لأنه عندما يقوم شخص ما بالشراء عن طريق اليورو فمن المؤكد ستكون الحكومة قادرة على معرفة بيانات هذا الشخص وتتبع تحويلاته سواء عن طريق الفيزا كارت أو التحويل البنكي أو غيرها. أما في حالة شراء عملة مشفرة بعملة مشفرة أخرى فمن الصعب على الحكومة معرفة أي شيء إلا إذا قام هذا الشخص بالإعلان عن ذلك. طبعا هذا استنتاج شخصي مني وربما يكون صحيح وربما يكون خطأ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 09, 2022, 07:36:35 AM",
      "body": "Quote from: yhiaali3 on December 08, 2022, 04:40:55 PMQuote from: Ulven on December 08, 2022, 11:38:36 AMهل تقصد أن دفع رسوم الضريبية يتم بإستخدام التشفير و ليس الأموال الحقيقية، هذا يعني إعتراف كبير من طرف الحكومة الإيطالية للتشفير هذا سيشجع أكثر على بناء أسواق ضخمة في الدولة تتعامل بالتشفير.لا أخي دفع الرسوم الضريبية يتم بواسطة اليورو أو الدولار ، لكن هناك حالتين: 1 -  عندما يشتري مواطن إيطالي عملة مشفرة باستخدام اليورو أو الدولار لا يتم أخذ ضريبة منه. 2 -  عندما يقوم مواطن إيطالي بشراء عملة مشفرة بواسطة عملة مشفرة أخرى مثلا يقوم بشراء بيتكوين بواسطة USDT فيتم أخذ الضريبة منه باليورو أو الدولار. ربما يكون هذا التشجيع للشراء بواسطة اليورو مقصود من طرف الحكومة الإيطالية، لأنه عندما يقوم شخص ما بالشراء عن طريق اليورو فمن المؤكد ستكون الحكومة قادرة على معرفة بيانات هذا الشخص وتتبع تحويلاته سواء عن طريق الفيزا كارت أو التحويل البنكي أو غيرها. أما في حالة شراء عملة مشفرة بعملة مشفرة أخرى فمن الصعب على الحكومة معرفة أي شيء إلا إذا قام هذا الشخص بالإعلان عن ذلك. طبعا هذا استنتاج شخصي مني وربما يكون صحيح وربما يكون خطأ. ليس من مصلحة ايطاليا ان يتم التخلي نهائيا عن استعمال العملات الرئيسية حتى لو كانت تستطيع فرض ضرائب على الشراءات التي تحدث بالعملات المشفرة. دليل على ذلك ان الضرائب يتم فرضها في جميع الحالات باستخدام اليورو او الدولار حتى لو كانت المدخرات و طريقة شرائها هي بالعملات المشفرة.المشكلة برأيي هو كيف ستتمكن الحكومة من تتبع عمليات الشراء بالكريبتو ليتم فرض ضريبة 26 بالمائة عليها؟ و كيف سيتم تحديد ان كانت مدخرات شخص ما هي ما قام بشرائه او هو عبارة عن ارباح استثمارية سواء من التداول او التخزين.لنفرض مثلا انني اشتريت 1 بيتكوين بمبلغ 15 الف يورو ثم بعد سنة تم اقرار هذا القانون الضريبي ب26 بالمائة اداءات بعد ان صار ثمن 1 بيتكوين الذي اشتريته في حدود 20 الف يورو. ما المبلغ الذي يتوجب عليا دفعه و ماذا لو حصل العكس اي ان سعر البيتكوين انخفض؟ هل ستبقى نفس النسبة الضريبية؟مع تداخل كل هذه التفاصيل تصبح تلك التقارير الحكومية بلا معنى الى حون صدور قوانين و مراسيم تفصيلية في الغرض.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}