{
  "id": "topic_5434477",
  "title": "KupaCrypto",
  "author": "KupaCrypto",
  "created_time": "January 12, 2023, 01:55:35 PM",
  "content": "Right now am so confused, because I spend more time here gaining knowledge and it is now a major problem in my house as my wife thinks am chatting with another lady, Should I quit chatting regularly online to please my wife or to ignore her and the peace of my home to continue gaining knowledge here??Things are getting serious and soon getting out of hand",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434477",
  "comments": [
    {
      "author": "Erumo",
      "created_time": "January 12, 2023, 02:04:43 PM",
      "body": "How the hell is this connected with cryptocurrency? Tell her your are mining crypto every time you tap your screen. Or be a man - divorce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 12, 2023, 02:10:41 PM",
      "body": "The best reasoning I ever read for 2023. To please your wife, I think its only you who could do that. Just explain that you are focusing on learning here but thats not an excuse to be so busy. Hanging around here doesnt mean you are 24/7 on your laptop/phone reading all threads.Quote from: KupaCrypto on January 12, 2023, 01:55:35 PMShould I quit chatting regularly online to please my wife or to ignore her and the peace of my home to continue gaining knowledge here??Things are getting serious and soon getting out of hand Kinda feels your torn between a gold and an apple. You should really do some time management, and this is not even a choice to ask for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 12, 2023, 02:24:29 PM",
      "body": "Quote from: cryptoaddictchie on January 12, 2023, 02:10:41 PMThe best reasoning I ever read for 2023. To please your wife, I think its only you who could do that. Just explain that you are focusing on learning here but thats not an excuse to be so busy. Hanging around here doesnt mean you are 24/7 on your laptop/phone reading all threads.Not like am always online, she gets jealous easily and whenever am online I give my full attention there, have tried explaining to her, but her jealousy won't let her see things with me and me am not ready to quit.She just want hundred percent attention whenever am home and it's not possible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "January 12, 2023, 02:26:32 PM",
      "body": "Quote from: KupaCrypto on January 12, 2023, 01:55:35 PMRight now am so confused, because I spend more time here gaining knowledge and it is now a major problem in my house as my wife thinks am chatting with another lady, Should I quit chatting regularly online to please my wife or to ignore her and the peace of my home to continue gaining knowledge here??Things are getting serious and soon getting out of hand This sounds a bit funny to me mate, because I always tell all the work I do to my wife so she never feels suspicious of me again or gets jealous when I hold my phone for a long time every time. Now it's your turn to have to explain everything you do on the internet or when you are online to your wife because I think your wife is very afraid that you will have an affair with another woman through the internet world.Actually it's a small thing that you can handle well with your wife, because you can still find another place if you want to study and work online which is not too far from your home too, so you don't need to worry about that now because you can tell him about your goals for it and try to make him understand that it is not for your affair in the online world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "January 12, 2023, 02:33:17 PM",
      "body": "Quote from: KupaCrypto on January 12, 2023, 01:55:35 PMRight now am so confused, because I spend more time here gaining knowledge and it is now a major problem in my house as my wife thinks am chatting with another lady, Should I quit chatting regularly online to please my wife or to ignore her and the peace of my home to continue gaining knowledge here??Things are getting serious and soon getting out of hand I think your problem is far-fetched and trifling. Show this forum to your wife and briefly explain what's what, talking about the main points. Let her also try to join the community and gain useful knowledge. Perhaps even she will be more interested in the forum than you. Bitcoin's mass adoption should start with close people. Start with this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 12, 2023, 02:35:08 PM",
      "body": "Quote from: Wapfika on January 12, 2023, 02:15:23 PMMaybe you have a history of cheating that’s why she is accusing you of that. Being honest on what you are doing usually stops all the accusations but it’s different when you have a history of cheating because everything that you will do is obviously suspicious for her. Be a man and let her watch you for significant amount of time to make her appreciate what you are doing.Not about cheating have never cheated on her before, but it's just jealousy and  finding a way to deal with it, She has access to my phones we share same password,  and anytime am on this platform I pay maximum attention, and maybe she needs me to gist with her and the rest after have already done it, if I say no then there is a problem.Most times when I drop the phone if I notice she's not happy I might end up not touching the phone again till maybe two days after and I don't like that, she won't just understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "January 12, 2023, 02:38:34 PM",
      "body": "This meme is really fit for you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}