{
  "id": "topic_5527658",
  "title": "Sanitough",
  "author": "Sanitough",
  "created_time": "January 24, 2025, 10:09:11 PM",
  "content": "As we’ve all noticed, it’s Trump causing a lot of hype in the market lately. People are speculating that he might introduce crypto-friendly policies, and of course, he probably has his own intentions, like promoting his coin.But once this hype fades, I wonder who could be the next president to have such a huge impact on the crypto community. Someone who could spark bullish speculation like what we’re experiencing now. It’ll likely be a leader with a strong stance on blockchain innovation, maybe someone who openly supports decentralized systems or sees crypto as a tool for economic growth. Any guesses?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5527658",
  "comments": [
    {
      "author": "Ambatman",
      "created_time": "January 24, 2025, 10:15:38 PM",
      "body": "The one people least expected The President of China Xi Jinping",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 24, 2025, 10:21:48 PM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingThe president of China is what that will come to people's mind and not the one that is least expected. But I do not think that is going to happen. As China did not support bitcoin and cryptocurrencies generally, bitcoin still continue to increase. Which means bitcoin do not depending on China to grow.China government gets something wrong. That bitcoin may let their currency, yuan to lose value but that is not true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hazink",
      "created_time": "January 24, 2025, 10:24:35 PM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingI agree with you on this too: China is also part of the countries with the world's largest economy. If I'm not mistaken, they should be second after the US, and any president under such a country that publicly accepts bitcoin and makes moves like Trump might be able to cause a pump, but it won't be as heavy as what the trend from Trump has done, adding to the fact that people might have actually not taken China too seriously again in terms of crypto since they have banned Bitcoin more than 3 times if I'm correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "January 24, 2025, 10:24:39 PM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingThat would be ideal, but China would need to change its stance on Bitcoin, from banning it to accepting it as legal currency. If we’re looking at presidents who could make a big impact, they’d likely come from major countries with strong economies. In my opinion, China, being a big rival to the US, could have a huge effect. Bitcoin would definitely get a boost if countries that aren’t allies with the US started adopting Bitcoin-friendly policies similar to those in the US.I’m hoping China will eventually change its stance, but that seems unlikely for now. They’ve been firm in their position since the beginning, and shifting that would take a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 24, 2025, 10:28:11 PM",
      "body": "Well with the unnecessary fomo and FUD caused by people who are more interested in politics than Crypto-currency, I believe many presidents and world leaders can cause this sort of hype too.From China, UK and if not maybe for the war Russia to can cause this unrest too.I would say it again the success of crypto-currency should not be attributed to any politician.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 24, 2025, 10:49:36 PM",
      "body": "If Donald Trump who is currently creating the hype around bitcoin and cryptocurrency at large gets to accomplish or complete his proposal about the reserve, the next presidents I believe will create extra hype or FOMO to the public will be Chinese government or rather president, them banning bitcoin in the past causing the FUD it did, an acceptance of it will simply translate to a bullish sentiment too. Another president or government I think would make such hype again is the Russian government and Saudi Arabia because they are involve in multiple trades and it is international and most because all Middle East countries are actually taking lead from them so them heading in that direction is like an access created for them to ease an integration into the space",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 24, 2025, 10:57:12 PM",
      "body": "The one of a big country for sure, maybe the president of Russia or China. Or the prime minister of Canada, Australia, or United Kingdom. Unfortunately it couldn't be a country of European Union since the regulation don't allow this kind of thing anymore. A country wanting to take unexpected stances about cryptocurrencies would need to leave EU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "finaleshot2016",
      "created_time": "January 24, 2025, 11:24:37 PM",
      "body": "I think no other president could match the global influence of Trump in cryptocurrency. I mean look what happened, even other world leaders followed the trend, placed a spot on Bitcoin using the government funds. Tbh, there are many presidents that I can mention here, like those who adapted bitcoin like Trump did but in my PIV they’re nothing or can’t give influence globally. Like for example if China or Russia, made a move in cryptocurrency, some will follow but the effect might be negative, they might doubt cryptocurrency because of that. So for me, can’t really find someone like Trump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "January 24, 2025, 11:34:53 PM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingTo be honest, he's the one that I am thinking of that's next influential to Donald Trump. While Trump keeps on mentioning his name, there's the importance that he plays to the status of world economy and peace and order. But I don't think that he'd talk just as how Trump talked and became very vocal about cryptocurrencies. What we used to see with China is about them manipulating the market about the bans that the media is releasing and talking about them. And later on, the uplifting of that ban that we have seen its impact to the market whenever they do these press releases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "January 24, 2025, 11:39:40 PM",
      "body": "I have checked to see but no other president could be able to do what Trump has been doing in the crypto space. Trump is a businessman and knows the strategies to use as a businessman in politics and crypto to have a good and successful economy. I have never seen anybody except the Chinese president who could be a bit of an influence on the crypto community due to the Chinese economy and their population, which can be of a good advantage in an increase in the demand for bitcoin fuelling price increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ammar M. A.",
      "created_time": "January 24, 2025, 11:53:14 PM",
      "body": "Big influence, comes from big countries. Currently the United States, China & Russia lead the ranking of the world's powerful countries. President-elect Donald J. Trump has already expressed his stance on the crypto industry & we all celebrate his actions. It only takes 2 more supports, namely from Xi Jinping as president of China & Vladimir Putin as president of Russia to make this madness even crazier.Unfortunately, both presidents have not given a strong stance & support for this industry. Let's see what will happen after all crypto regulations in the United States will be made by Donald J. Trump, hopefully we get a surprise.Source:1. https://www.usnews.com/news/best-countries/rankings/power- Ammar M. A.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "January 24, 2025, 11:59:12 PM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingIt is undeniable that in the end China could be one of the good options but in the end with the characteristics of their country which is more closed and a little contrary to the ideology they are taking for now then I think this will be the last possibility to happen because after all it does not mean to weaken but they will still uphold what they have done since the beginning where transparency of each citizen's income and equalizing conditions for each citizen is always a priority. By trying in bitcoin and introducing this just like the US did then indeed they will erode the ideology that they have upheld since the beginning and that is clearly difficult to happen.But when it comes to economic conditions and including political elements in it then all things can happen but if in the end Xi Jinping does that and without any obstacles from his decision then in the end the same situation could happen even though I don't expect such a thing because for me it will make a little bit of the assumption that bitcoin will only be able to be like now thanks to the help of a few people who raised it alone but the fact is certainly not like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "January 25, 2025, 01:13:39 AM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingLook at history, they are countries that are open to crypto. A few years ago China became a very influential country in crypto, but that's not for now. President Xin Jinping's policy made China ban Bitcoin from developing. In November 2021 they officially banned Crypto in their country. They focus on CBDCs and possible futures I don't know. But with the conditions predicting the future if China reopens the ban, I think it is fundamental good for the development of crypto. Although I have heard of some large mining investors choosing to move countries to continue their activities, they do not appear to be a stronger state policy and have no influence. Maybe if they change presidents, I think crypto could be a campaign tool like Trump. Source: https://www.investopedia.com/news/price-cryptocurrencies-totally-dependent-china/#:~:text=China%20does%20not%20allow%20cryptocurrency,from%20mainland%20Chinese%20financial%20regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 25, 2025, 01:41:07 AM",
      "body": "It doesn't matter who for as long as he/she is a president of a powerful and influential country. But I think it's difficult to equal the Trump effect on Bitcoin. Trump is a populist and he's the president of no less than the United States of America. El Salvador's aggressive support on Bitcoin didn't produce the kind of hype that Trump's support created. The same is true when the Central African Republic announced that they too will also declare Bitcoin as a legal tender. So, I guess it's a matter of influence. If China does it, the effect would be huge, whether it is Xi Jinping or somebody else who will make it happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "January 25, 2025, 02:43:15 AM",
      "body": "Quote from: Sanitough on January 24, 2025, 10:09:11 PM---But once this hype fades, I wonder who could be the next president to have such a huge impact on the crypto community. Someone who could spark bullish speculation like what we’re experiencing now. It’ll likely be a leader with a strong stance on blockchain innovation, maybe someone who openly supports decentralized systems or sees crypto as a tool for economic growth. Any guesses?There are only 2 presidents that comes to my mind when it comes to \"Making Bitcoin bullish\".President of Russia, and the President of China.Any similarities? 3 of them are superpower countries, and in terms of global influence, I believe the 3 of them are at the top especially US that's why we are seeing a huge effect on the price of Bitcoin and other top cryptocurrencies whenever Trump says something positive about it. Putin already had some statements regarding digital currencies, but nothing directly about Bitcoin in the past while President Xi Jinping will still ban crypto on his country.We've seen countries like El Salvador and Bhutan buying Bitcoin, but that didn't have that much effect compared to US and Trump. There might be other people though that can make Bitcoin bullish, but not presidents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "January 25, 2025, 02:46:46 AM",
      "body": "Quote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingChina would rather create their own Bitcoin rather than use what US currently eyeing for investment. They have their own google, facebook and other things which other country popularly using since they can create their own and implement it to their citizens without any problem.I’m also done with China since they make Bitcoin crazy pump and down with their manipulation in the past. Current Bitcoin market is good with US leading it. I think Korea or Japan is much better candidate since they create a hype or trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 25, 2025, 03:22:45 AMLast edit: January 25, 2025, 04:27:22 PM by franky1",
      "body": "Quote from: Sanitough on January 24, 2025, 10:09:11 PMAs we’ve all noticed, it’s Trump causing a lot of hype in the market lately. its not 'coz trump' you silly man...we are in a well known season of a bitcoins market cycle. we are in the bull run of the ATH season.. we know the market cycles are in 4 year cycles and they have seasons such as the halving season, the ATH season and the post ATH correction seasonstop showing how much of a trump fangirl you are by thinking trump controls bitcoin.. wake up and realise people years ago could have told you the price trend(bull) of this season without having to know which president was in poweroh and just wait until after the ATH when the price comes down and goes bearish for a couple years during the correction season and try to explain how your beloved idol trump is the reason for the price drop(it would be a laugh to see you explain)ill give you a hint: (future prediction)2026-27 will be the time the price will be below 2025's ATH(the ATH yet to hit this year)2028 will see the halving beginning of a bull season(price meets and start to exceed 2025 ATH). 2029 will see the bull and next ATH of the next cycle, then it would correct below the 2029 ATH.. until 2032 where the bull begins againand i didnt need to tell you of any president of any country",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 25, 2025, 04:32:58 AM",
      "body": "Bitcoin is the only sound money in the world that doesn't need hype (like pump and dump shitcoins do) to become bullish and increase its adoption and consequently go up in price. Not to mention that these short lived \"hypes\" are more damaging to Bitcoin than helping, since they create volatility and bring in speculators and weak hands instead of real adopters who wouldn't just panic sell their coins if the same person who started the hype reverses their random statements.Have you all forgotten what Musk did?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "January 25, 2025, 04:54:40 AM",
      "body": "Quote from: Coin_trader on January 25, 2025, 02:46:46 AMQuote from: Ambatman on January 24, 2025, 10:15:38 PMThe one people least expected The President of China Xi JinpingChina would rather create their own Bitcoin rather than use what US currently eyeing for investment. They have their own google, facebook and other things which other country popularly using since they can create their own and implement it to their citizens without any problem.I’m also done with China since they make Bitcoin crazy pump and down with their manipulation in the past. Current Bitcoin market is good with US leading it. I think Korea or Japan is much better candidate since they create a hype or trend.yeah if china don't want to allow bitcoin, then let them not allow it even without china BTC is getting trillion valuation, I don't think it's such a problem that china don't want to have anything to do with crypto.the thing is, I've seen whenever there's some good news with crypto related coming from china the market seems to be not reacting at all, maybe because china influence isn't that great in crypto anyway, even if somehow china allow bitcoin and approve it, there might be some small wave, but since we've seen ETF approval in the US, china's approval won't be a big thing anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}