{
  "id": "topic_5458324",
  "title": "siamaro",
  "author": "siamaro",
  "created_time": "July 02, 2023, 01:19:03 PM",
  "content": "Binomo, an unregulated broker claiming membership in the Financial Commission, has been accused of engaging in fraudulent activities. This includes closing accounts without justification, stealing deposits, manipulating market movements, and victimizing numerous investors. In this complaint, we will delve into the specific tactics employed by Binomo and discuss potential strategies for gathering evidence against them.1. Lack of Regulation and Exploitation:Binomo takes advantage of its unregulated status, allowing them to operate with minimal oversight. This creates an environment where they can manipulate accounts and engage in illicit activities without consequences. As an investor, it's crucial to be aware of the risks associated with unregulated brokers.2. Unjustified Account Closures:One common complaint against Binomo is the arbitrary closure of accounts. Numerous users have reported having their accounts terminated without any valid reason provided. These closures often occur even when users have not violated any terms or conditions, raising concerns about the transparency and integrity of Binomo's operations. (they have access to the server they can easily manipulate the databases and fake the proofs i don't suspect if they even have insiders into the financial commission to launch such fraudlent business which based on closing high profits investors accounts especially in the arabics and other poor countries where those poor people don't have money and experience to hire lawyers or companies to deal in such cases in the other hand they're blocking multiple strong countries like usa canada and the european countries to avoid the problems ! many  youtubers have exposed them aleardy but no body is moving )3. Payment Rejections and Deposit Theft:Your personal experience with Binomo is unfortunately not unique. Many investors have fallen victim to rejected payments and subsequent loss of funds. In your case, the deposit made via Bitcoin was deducted from your wallet but was ultimately rejected, resulting in stolen funds. Such incidents contribute to a growing body of evidence against Binomo's fraudulent practices.4. Manipulation of Market Movements:Binomo's manipulation of market movements, particularly through candlestick charts, is another alarming issue. There have been instances where users suspect foul play, with prices not reflecting the actual market conditions. This manipulation can lead to substantial financial losses for unsuspecting investors.5.  Proofs: recently i made out a payment through bitcoin currency through a deposit and 24h hours have been passed and the money have beeen deducted from my wallet and they rejected the payment  and stole my money again ! i'll try get strong proofs against them how they steal deposits money how they play with candles how they close accounts for no reason ! t binomo have aleardy scammed a lot of my friends Conclusion:Binomo's fraudulent practices and unscrupulous behavior pose a significant risk to investors.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458324",
  "comments": [
    {
      "author": "robelneo",
      "created_time": "July 02, 2023, 02:10:21 PM",
      "body": "Quote from: siamaro on July 02, 2023, 01:19:03 PMProofs: recently i made out a payment through bitcoin currency through a deposit and 24h hours have been passed and the money have beeen deducted from my wallet and they rejected the payment  and stole my money again ! i'll try get strong proofs against them how they steal deposits money how they play with candles how they close accounts for no reason ! t binomo have aleardy scammed a lot of my friends You have to post the transaction ID or screenshot of your transaction that you did deposit money on this platform so you can verify that it is indeed a scam, so far there are two mentions of Binomo in this section but there was no proof of deposit.Bitcointalk topic about Binomo https://bitcointalk.org/index.php?topic=5344096.0On Trustpilot reviews, they are getting a lot of good reviews but there were reports also that they are paying people to give them good reviews.https://www.trustpilot.com/review/binomo.comWith you posting screenshots of your deposit we have warning one valid warning here on Binomo and this is going to hurt their campaign unless they go here and address this issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 02, 2023, 02:19:41 PM",
      "body": "Quote from: robelneo on July 02, 2023, 02:10:21 PMYou have to post the transaction ID or screenshot of your transaction that you did deposit money on this platform so you can verify that it is indeed a scam, so far there are two mentions of Binomo in this section but there was no proof of deposit.There's really no need to (at least not for me) share screenshot in order to prove that Binomo is a bullshit exchange. Just one look at their inflated number of users and traders says enough. On top of that, from what I can see they are not listed on Coingecko or Coinmarketcap and that tells you everything that you have to know about this \"exchang\". Not being on CMC/Coingecko is not a sign of legitimacy of course, but an exchange not being listed there at all is a major red flag. Quote from: robelneo on July 02, 2023, 02:10:21 PMWith you posting screenshots of your deposit we have warning one valid warning here on Binomo and this is going to hurt their campaign unless they go here and address this issue.Since they are not active on bitcointalk, I don't think that this topic will hurt them much (if anything), but it may bitcointalk members from losing their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "July 02, 2023, 05:52:18 PM",
      "body": "Quote from: Rikafip on July 02, 2023, 02:19:41 PMQuote from: robelneo on July 02, 2023, 02:10:21 PMYou have to post the transaction ID or screenshot of your transaction that you did deposit money on this platform so you can verify that it is indeed a scam, so far there are two mentions of Binomo in this section but there was no proof of deposit.There's really no need to (at least not for me) share screenshot in order to prove that Binomo is a bullshit exchange. [...]No need indeed. The name rang a bell on my head that I came across it a while back. A quick ninjastic brought me to an even newer post than what I had in the back of my mind, about this... exchange,Quote from: bayu7adi on June 11, 2023, 03:23:08 AM[...]Trading app fraud: Police list Indra Kenz's assets for seizureBinary Options: Trading or Gambling?And I found the one I tried to recall, a post made by YOSHIE,Quote from: YOSHIE on January 11, 2023, 01:16:57 PM[...]Your story reminds me of one of the fraudulent investment phenomena that occurred in Indonesia some time ago called (Binomo), such practice is exactly what you described with the gambling scheme or better known as the money games and binary options model, sweetly offered by influencers as if carrying out these activities is a profitable and legal action for their customers, without suspecting that the victims have experienced fantastic losses from such practices.[...]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 02, 2023, 10:37:17 PM",
      "body": "Quote from: Rikafip on July 02, 2023, 02:19:41 PMQuote from: robelneo on July 02, 2023, 02:10:21 PMYou have to post the transaction ID or screenshot of your transaction that you did deposit money on this platform so you can verify that it is indeed a scam, so far there are two mentions of Binomo in this section but there was no proof of deposit.There's really no need to (at least not for me) share screenshot in order to prove that Binomo is a bullshit exchange.  It can be quite helpful and convincing to a newbie who might land on this thread in the future... As for us old users, we already know it's a shit exchange, but these scam accusations very good for the new future users or even for future references. So everything available counts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 03, 2023, 12:08:07 AM",
      "body": "Quote from: siamaro on July 02, 2023, 01:19:03 PM4. Manipulation of Market Movements:On several occasions I have watched many explanations of indications of chart manipulation by some of the former users of this platform, and I think this manipulation is also probably a common practice by most binary options platforms. Overall, I'd rather spend my money in online casinos than binary options.Quote from: Rikafip on July 02, 2023, 02:19:41 PMThe list of 133 countries doesn't mean they operate legally, but on the other hand it's an advantage to easily \"confiscate\" (I assume it's stealing) users' money where they won't get any legal protection from the base country. In the case of this platform that has happened in my country, the process of refunding victims who feel \"cheated\" is so complicated, that in essence they don't want to be responsible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}