{
  "id": "topic_5461590",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "July 31, 2023, 02:39:48 PM",
  "content": "Как же меня бесит, когда на моих глазах разводят ЛОХОВ. Нет, бесит не то, что они лохи,  и что их разводят. А бесит факт того, почему я такой весь из себя честный и добрый, знаю схему, полностью в теме и никого не развожу? И не зарабатываю миллионы долларов? Может быть пора начать этим заниматься?        Короче, к теме. Только что попался мне на глаза свежий рецепт из интернета. Где написано, что нужно туда класть «стручки ванили». Для аромата. А вы знаете, что такое ваниль? Да это просто ванилин. Обычное химическое соединение, посложнее соды, но проще сахара. Производится миллионами тонн в мире. И чисто «по запаху» НИКТО, я уверяю вас НИКТО не отличит ванильный стручок от синтетического ванилина. Потому что это есть одно и то же. Это типа как отличить «по запаху» морскую соль от обычной пищевой. НЕВОЗМОЖНО! А если кто-то говорит, что он может это сделать – это ОБМАНЩИК 100% - врун. Пусть попробует это самое сделать в условиях контролируемого эксперимента. 100% - что не сможет. Просто потому, что ваниль пахнет ванилином. И наоборот. И никак иначе.        Однако ушлые продавцы каким-то образом ухитряются впаривать не только ванилин по цене трюфелей, но и ванильный сахар по цене х100 к исходнику. Даю бесплатный рецепт, как заработать миллион долларов. Легко и точка. 1 килограмм ванилина в розницу тупо по инету стоит примерно 2500 рублей. Плюс сахар 1:1000. Тонну сахара на кг ванилина. Плюс-минус. Расфасовать и продать. И все дела. Вот первый миллион долларов и заработан!   Вы будете смеяться, но это только ПЕРВАЯ часть прикола. А прикол в том, что из Ванилина с помощью некоторых других ингредиентов и такой-то матери можно синтезировать не только Мескалин, но и МДМА (Экстази) (см PIHKAL). Но про то, как это сделать, будет в следующих выпусках нашего практикума. Подписывайтесь на меня, и будет вам счастье и экстаз!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461590",
  "comments": []
}