{
  "id": "topic_5416069",
  "title": "david678345",
  "author": "david678345",
  "created_time": "October 05, 2022, 06:14:05 PM",
  "content": "Hi I am following bitcoin signals from a discord channel and in the video they mention that in conditional orders the trigger price should be almost the same as order price (but should be a bigger or a smaller number?for example if order price is 23450, trigger price should be 23451 or 23459?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416069",
  "comments": [
    {
      "author": "jackg",
      "created_time": "October 05, 2022, 06:25:53 PM",
      "body": "I don't think it matters unless they've actually listed what the trigger price should be. There's two different ways this is done on exchanges though, the trigger price I'm thinking of is the one that makes the order active/live after the price is hit? In this case you can set it to whatever you want as long as it's close and perhaps learn from how the market reacts to it if they have a bot that updates when the assets have been bought. If you have a trigger price set too close, there's a chance everyone's could trigger at once and produce a buy/sell wall that ultimately acts as support or resistance that might then be broken again before the take profits are hit meaning you could have set your trigger price to be further away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vinaa77",
      "created_time": "October 05, 2022, 10:27:14 PM",
      "body": "Quote from: david678345 on October 05, 2022, 06:14:05 PMHi I am following bitcoin signals from a discord channel and in the video they mention that in conditional orders the trigger price should be almost the same as order price (but should be a bigger or a smaller number?for example if order price is 23450, trigger price should be 23451 or 23459?Maybe you mean those who trade using stop loss, or OCO on Binance. So they can control crypto prices automatically. If the price drops below the specified price, then Bitcoin will automatically be sold. This serves to avoid bigger losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 06, 2022, 02:31:09 AM",
      "body": "Trigger price is most commonly used as a stop loss. The way it works is as follows.Say you are long Bitcoin at $20000 and if it goes below $20000 you want to sell. You need to give 2 numbers. First one is when you want it to trigger, basically send to market. Second is the lowest you want to sell. So you need something like $20000 for trigger and $19900 for limit sell. Because sometimes if you put $20000 for both, it will go right thru your stop and won’t execute and you will have big losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 09, 2022, 06:38:44 AM",
      "body": "It shuld be a little bit lower but not too low to avoid selling bottom during flash crash events. Should not be placed higher becasue price can go down, trigger your order and continue to go down without filling it exposing you to unlimited losess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 09, 2022, 08:25:24 AM",
      "body": "Such channels aim to achieve small profits by entering many transactions, as placing the operating price at a level close to the ask price means that you can execute several successful transactions during the day with profits of less than 2%.So it is not a rule, but according to the trading strategy that you follow, and whether you want to open several daily deals, or do you want to rely on the levels of support and resistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 10, 2022, 06:21:17 AM",
      "body": "Quote from: david678345 on October 05, 2022, 06:14:05 PMHi I am following bitcoin signals from a discord channel and in the video they mention that in conditional orders the trigger price should be almost the same as order price (but should be a bigger or a smaller number?for example if order price is 23450, trigger price should be 23451 or 23459?It doesn't matter what the order price is if the trigger price hasn't been reached. Suppose you put a buy order of BTC at 20000$ and put the trigger price at 23000$, in this conditional order, that order will be activated once the BTC price reaches 23000$ and will automatically place an order at 20000$. It's a useful tool if you are trading based on the support and resistance level of BTC or certain of its behavior in the upcoming days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}