{
  "id": "topic_5473550",
  "title": "darkv0rt3x",
  "author": "darkv0rt3x",
  "created_time": "November 09, 2023, 11:17:41 PM",
  "content": "Este foi um post que li hoje sobre os devs de Bitcoin estarem a pensar em abandonar as mailinglists.https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-November/022134.htmlEstá um post no forum internacional de Bitcoin e vou traduzir apenas o primeiro post, para lançar aqui também a discussão!QuoteA Linux Foundation está a terminar o suporte às mailing lists. Eles acordaram em continuar a ter o conteúdo antigo, mas a dev mailing list de Bitcoin vai ter de migrar para uma nova plataforma, até ao final do ano.Algumas alternativas surgiram, como uma nova mailing list, Google Groups, groups.io, Nostr, Matrix, um forum, Github discussions ou mesmo não fazer nada e deixar a mailing list \"morrer\".De qualqer forma, uma decisão tem que ser tomada em breve, antes do final deste ano!Alguns comentários referem os serviços como Google Groups como indesejados devido à centralização e a quem detém estes serviços e que seria complicado conseguirem alguma liberdade para alterarem configurações ou outros parâmetros.Outros ainda referem que serviços descentralizados como Nostr também não são a melhor escolha devido a termos que ter uma key para ver/colocar conteúdo e referem também que outros serviços têm outros downsides.Há quem ainda desse como alternativa uma board aqui no forum, tipo uma self-moderated thread mas isso implicaria das duas uma: ou uma moderação gigantesca para evitar spam e shitposting ou então um sistema de user aproval para se poer postar. Este último tem a desvantagem de se correr o risco de se ter que esperar imenso até um post ser aprovado ou o user ser aprovado!Que acham vocês?Source:https://bitcointalk.org/index.php?topic=5473376.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473550",
  "comments": [
    {
      "author": "Disruptivas",
      "created_time": "November 10, 2023, 12:22:29 AM",
      "body": "Quote from: darkv0rt3x on November 09, 2023, 11:17:41 PMEste foi um post que li hoje sobre os devs de Bitcoin estarem a pensar em abandonar as mailinglists.https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-November/022134.htmlEstá um post no forum internacional de Bitcoin e vou traduzir apenas o primeiro post, para lançar aqui também a discussão!QuoteA Linux Foundation está a terminar o suporte às mailing lists. Eles acordaram em continuar a ter o conteúdo antigo, mas a dev mailing list de Bitcoin vai ter de migrar para uma nova plataforma, até ao final do ano.Algumas alternativas surgiram, como uma nova mailing list, Google Groups, groups.io, Nostr, Matrix, um forum, Github discussions ou mesmo não fazer nada e deixar a mailing list \"morrer\".De qualqer forma, uma decisão tem que ser tomada em breve, antes do final deste ano!Alguns comentários referem os serviços como Google Groups como indesejados devido à centralização e a quem detém estes serviços e que seria complicado conseguirem alguma liberdade para alterarem configurações ou outros parâmetros.Outros ainda referem que serviços descentralizados como Nostr também não são a melhor escolha devido a termos que ter uma key para ver/colocar conteúdo e referem também que outros serviços têm outros downsides.Há quem ainda desse como alternativa uma board aqui no forum, tipo uma self-moderated thread mas isso implicaria das duas uma: ou uma moderação gigantesca para evitar spam e shitposting ou então um sistema de user aproval para se poer postar. Este último tem a desvantagem de se correr o risco de se ter que esperar imenso até um post ser aprovado ou o user ser aprovado!Que acham vocês?Source:https://bitcointalk.org/index.php?topic=5473376.0Gente, que triste!Eu nem tinha ideia que a mailing list que eles usavam eram e dependiam da  Linux. Eu não tinha ideia na verdade do que poderia estar por trás, mas imaginava que era algo ''mantido descentralizado'' de alguma forma, um sistema de comunicação peer to peer usand chave PGP!Mas se usassem o Google eu ficaria bem surpresa. Nostr parece uma boa opção. Mas imagino que tenha alguns critérios de gerenciamento de versão e discussão que talvez seja o mais importante a se levar em conta.Espero que o BITCOINTALK seja o escolhido e que vejamos nos proximos dias o anuncio de que aqui se tornara O LOCAL dos devs. Eu adoraria",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 10, 2023, 08:05:15 PM",
      "body": "Quote from: darkv0rt3x on November 09, 2023, 11:17:41 PMHá quem ainda desse como alternativa uma board aqui no forum, tipo uma self-moderated thread mas isso implicaria das duas uma: ou uma moderação gigantesca para evitar spam e shitposting ou então um sistema de user aproval para se poer postar. Este último tem a desvantagem de se correr o risco de se ter que esperar imenso até um post ser aprovado ou o user ser aprovado!Como funcionavam os mailinglists na plataforma LF?Só quem tinha autorização é que conseguia enviar um comunicação, certo? Qual é a dificuldade de fazer isso aqui no fórum?Eu até diria, que usar o fórum seria uma excelente opção. É possível, por exemplo, criar uma board dedicada a eles, visível a todos os utilizadores, mas só alguns utilizadores autorizados podem postar e criar tópicos. Acredito que o @theymos não se importaria de criar esse espaço para os devs do Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "November 10, 2023, 08:53:47 PM",
      "body": "Quote from: joker_josue on November 10, 2023, 08:05:15 PMQuote from: darkv0rt3x on November 09, 2023, 11:17:41 PMHá quem ainda desse como alternativa uma board aqui no forum, tipo uma self-moderated thread mas isso implicaria das duas uma: ou uma moderação gigantesca para evitar spam e shitposting ou então um sistema de user aproval para se poer postar. Este último tem a desvantagem de se correr o risco de se ter que esperar imenso até um post ser aprovado ou o user ser aprovado!Como funcionavam os mailinglists na plataforma LF?Só quem tinha autorização é que conseguia enviar um comunicação, certo? Qual é a dificuldade de fazer isso aqui no fórum?Eu até diria, que usar o fórum seria uma excelente opção. É possível, por exemplo, criar uma board dedicada a eles, visível a todos os utilizadores, mas só alguns utilizadores autorizados podem postar e criar tópicos. Acredito que o @theymos não se importaria de criar esse espaço para os devs do Bitcoin.Sim, também concordo. Seria até uma homenagem ao Satoshi. Trazer para aqui o trabalho dos devs (ou deverei dizer, as discussões sobre o trabalho deles) seria talvez como um tributo ao criador de Bitcoin.No entanto, como sabemos, o Bitcoin Core e o próprio protocolo é um software aberto a todos e qualquer um pode ser colaborador. Mas tanto hoje és colaborador como amanhã já não és, e tomar conta destas ocorrências todas, pode ser imenso trabalho diário, para conseguir manter as coisas a funcionarem minimamente bem!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 10, 2023, 09:22:29 PM",
      "body": "Quote from: darkv0rt3x on November 10, 2023, 08:53:47 PMNo entanto, como sabemos, o Bitcoin Core e o próprio protocolo é um software aberto a todos e qualquer um pode ser colaborador. Mas tanto hoje és colaborador como amanhã já não és, e tomar conta destas ocorrências todas, pode ser imenso trabalho diário, para conseguir manter as coisas a funcionarem minimamente bem!Mas como é feito isso hoje? O trabalho seria assim tão diferente?Provavelmente não.Talvez mais trabalhoso no sentido de comunicar? Não sei como funcionam essas mailing lists. Os utilizadores aprovados enviam um para a plataforma e ela regista?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "November 11, 2023, 04:22:31 PM",
      "body": "Quote from: joker_josue on November 10, 2023, 09:22:29 PMMas como é feito isso hoje? O trabalho seria assim tão diferente?Provavelmente não.Talvez mais trabalhoso no sentido de comunicar? Não sei como funcionam essas mailing lists. Os utilizadores aprovados enviam um para a plataforma e ela regista?Eu acho que é muito usado para o debate dos Bips''Fluxo de trabalho BIPO processo BIP começa com uma nova ideia para Bitcoin. Cada BIP potencial deve ter um defensor – alguém que escreve o BIP usando o estilo e formato descritos abaixo, conduz as discussões nos fóruns apropriados e tenta construir um consenso comunitário em torno da ideia. O defensor do BIP (também conhecido como Autor) deve primeiro tentar verificar se a ideia é compatível com o BIP. [....]Depois que o autor perguntar à comunidade Bitcoin se uma ideia tem alguma chance de aceitação, um rascunho do BIP deverá ser apresentado à lista de discussão de desenvolvimento do Bitcoin. Isto dá ao autor a oportunidade de dar corpo ao BIP para torná-lo devidamente formatado, de alta qualidade, e para abordar preocupações adicionais sobre a proposta. Após uma discussão, a proposta deve ser submetida ao repositório git dos BIPs como uma solicitação pull. '''https://www.disruptivas.org/post/_bip2A lista em questão da linux citada nesse BIP é essa: https://lists.linuxfoundation.org/mailman/listinfo/bitcoin-dev",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}