{
  "id": "topic_5397754",
  "title": "StanCrypt",
  "author": "StanCrypt",
  "created_time": "May 08, 2022, 09:53:55 AM",
  "content": "To store cryptocurrency, you'll need a decentralized wallet. Then there's the choice of a software wallet or a hardware wallet. Theft of funds from a software wallet is very likely  Even as cryptocurrencies  have risen in popularity and security mechanisms supposed to safeguard customers and exchanges have become more sophisticated, hacks and thefts have continued to occur. A preliminary investigation revealed that a hacker took advantage of a \"vulnerability between contract calls,\" according to Poly Network. After millions of dollars in tokens were transferred to different cryptocurrency wallets, it pushed multiple exchanges to restrict deposits of the coins. About $267 million in Ether, $252 million in Binance coins, and $85 million in USDC tokens were seized.KuCoin is a Singapore-based cryptocurrency exchange. It was launched in 2013 and trades Bitcoin, Ethereum, Litecoin, and Ardor, among other cryptocurrencies. It was targeted in September 2020, and attackers were able to take about $281 million in coins and tokens. Hackers also gained access to the keys to some of the most popular wallets on the exchange. The harm had already been done, even though KuCoin instantly banned all transactions on its website. This is one of the biggest hacks in the history of crypto assetsBinance is a well-known cryptocurrency exchange and if i may say, is one of the biggest names in the business. The exchange is based in the Cayman Islands and is the largest cryptocurrency exchange in the world (by volume). The exchange supports over 360 coins and operates in over 1200 marketplaces. Over 7000 bitcoins were taken from the hot wallet by the hackers. The attack cost around $40 million in total. The attackers gained access to the exchange's security infrastructure and obtained sensitive data such as two-factor codes, APIs, and other  information.However, more people are still entering the crypto area now and i believe will still be entering in the near future. They can't neccesaryly utilize a hardware wallet since (like Ledger Nano S, Trezor Model One- Crypto Hardware Wallet, SafePal S1, Steel Bitcoin Wallet for Hardware Wallet Backup), given its use and cost, a software wallet seem to better option. But in light of the recorded hacks, which wallet do you believe is the safest and most secure for storing cryptocurrency in resent times and why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397754",
  "comments": [
    {
      "author": "Despairo",
      "created_time": "May 08, 2022, 09:59:49 AM",
      "body": "There's no such decentralized wallet, but a non-custodial wallet! Not all software wallet and hardware wallet a non-custodial wallet! Pay attention with the source code, a open source wallet is better than closed source wallet. Though open source wallet doesn't always safe, but if there's a reputable user ever verify all the codes, it should be safe.Centralized software wallet: freewallet (scam, avoid)Closed source non custodial wallet : Trust wallet, ExodusOpen source non custodial wallet : Electrum, Bitcoin Core, Bluewallet, Samourai.Software wallet isn't safe for large amount, it's used to carry low amount such as <$50-$100The safest and most secure wallet is a cold wallet with well correctly set up, but hardware wallet is almost secure and you don't really need to have technical knowledge to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 08, 2022, 10:22:35 AM",
      "body": "Never use an exchange to store bitcoin or any other cryptocurrencies. Never use a custodial wallet for holding. To have full control, use noncustododial wallet.For privacy, going for Bitcoin Core can be the only option, but it requires almost 400 gigabyte to download the full blockchainBest SPV wallet is Electrum in my opinionSafest are cold wallets. Cold wallets are paper wallet, hardware wallet and wallets on airgapped devices. Lists of open source hardware walletElectrum cold storageQuote from: Despairo on May 08, 2022, 09:59:49 AMClosed source non custodial wallet : Trust wallet, ExodusAlso amlost all (all that I know) altcoin wallets are close source, the reason not to go for such wallets, instead to better buy open source hardware wallet that have open source software that support the coins.Open source does not totally mean security, there can be fake open source wallets that would have scammed before it is taken down, but reputed open source wallet are better than close source wallets because its source code is available to the public to view and check for vulnerabilities unlike close source wallet that you do not know its source code and you can not verify if it has spyware or other vulnerabilities which can even be intention from the developers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "May 08, 2022, 11:21:28 AM",
      "body": "Wallet itself does not enough. You have to learn how to use it (create it offline, back it up, protect your backup, recovery practice) and basics about security in order to keep your device clean and safe from potential harzadous threats from the Internet.Custodial vs. Non Custodial Wallets - \"Not your keys, not your coin\" Explained.Crypto Security - Additional Protection For Your Seed/Private Keys.How to Install Tails OS on USB flash drive for Wallet Purpose[Guide] Secure air-gapped crypto wallet storage method",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 08, 2022, 11:24:13 AM",
      "body": "The wallet is a program that creates and manages private keys, and based on who can know and manage those private keys, we can divide them into non-custodial wallet and custodial wallet.There is no such thing as centralization or decentralization here, whenever you generate the private key/seed randomly and manage it in perpetual mode you are safe as long as only you know those keys.All the talk above is about wallets, not services, and therefore you have confused several concepts in crypto.in centralized cryptocurrency exchange you need to use a middle man or third party to make exchange process, you need to trust that middle man with your fund and he will have full control of that private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 08, 2022, 11:34:21 AM",
      "body": "Quote from: StanCrypt on May 08, 2022, 09:53:55 AMHowever, more people are still entering the crypto area now and i believe will still be entering in the near future. They can't neccesaryly utilize a hardware wallet since (like Ledger Nano S, Trezor Model One- Crypto Hardware Wallet, SafePal S1, Steel Bitcoin Wallet for Hardware Wallet Backup), given its use and cost, a software wallet seem to better option. But in light of the recorded hacks, which wallet do you believe is the safest and most secure for storing cryptocurrency in resent times and why?On the basis of \"use\"; anyone can properly set up and use a hardware wallet. There are lots of helpful tutorials about how to do so, and with a bit of research anyone can get them. Products are designed to be used and have instructions to this effect. The idea that Bitcoin is some bizzare concept which is almost impossible to understand is inaccurate.On the basis on \"cost\"; it boils down to how much you plan to keep in your wallet, significant amounts like $5000+ are safer in a hardware wallet than on a mobile phone/PC.Much smaller amounts can be carried around in a mobile device, sort of like a digital wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "only1mehedi",
      "created_time": "May 08, 2022, 01:04:17 PM",
      "body": "We all know that the most safe crypto Wallets are hardware wallets. And they are Trezor wallet and Ledger wallet. And from software wallets trust wallet is one of the safest wallet. As a Bounty hunter I always use Trust Wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 08, 2022, 01:57:24 PM",
      "body": "Quote from: only1mehedi on May 08, 2022, 01:04:17 PMtrust wallet is one of the safest wallet. As a Bounty hunter I always use Trust Wallet.Trust wallet is not a recommended wallet, they are not open source and have other huge question marks about their operations.If you're looking for a secure, open source and non custodian wallet, you should check other options depending on what currency you wish to store.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 08, 2022, 04:09:16 PM",
      "body": "Quote from: StanCrypt on May 08, 2022, 09:53:55 AMBut in light of the recorded hacks, which wallet do you believe is the safest and most secure for storing cryptocurrency in resent times and why?You uploaded information from various websites and mixed up things that have nothing to do with each other - because crypto exchanges should serve as a place where you buy/sell cryptocurrencies, not where you store them. There is no doubt that your digital assets will be more secure in every non-custodial crypto wallet, but assuming you understand how that wallet works. Every desktop/mobile wallet is subject to being hacked by a fake wallet update, it happened with Electrum a few years ago. So don't trust anyone or anything without verifying each file before using it. You have a hardware wallet and you think you're untouchable? If you know that the seed should not be shared with anyone and you know how to make a safe backup, and if you know what checking a coin address is for - then you are pretty sure that something bad will not happen to you. If you want maximum security, the only thing I can say is that a properly made cold wallet has no alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 08, 2022, 05:15:48 PM",
      "body": "Quote from: Despairo on May 08, 2022, 09:59:49 AMThere's no such decentralized wallet, but a non-custodial wallet! To be fair, we do have a decentralized wallet — the one and only Bitcoin Core software! Perfectly safe to assume that it's the open-source wallet software that not one entity controls, but instead being coded by a huge number of Bitcoin enthusiasts worldwide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "May 08, 2022, 05:34:07 PM",
      "body": "Quote from: only1mehedi on May 08, 2022, 01:04:17 PMAnd from software wallets trust wallet is one of the safest wallet. Where do you get this information from? I don't think Trust wallet can be considered the safest wallet by any criteria. If it's just your personal opinion, than it's absolutely free speech and it's well within your rights to give your opinion. But you should not try and mislead or manipulate other people into believing something that not true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "May 08, 2022, 06:06:51 PM",
      "body": "With everything everyone has said thus far, i would just like to add a very important one: in all, remember that your Bitcoin is not technically stored in whichever wallet you use, your Bitcoins are stored in the blockchain network.What that means is that there are no funds in your wallet, but keys you use to make transaction, meaning you must keep your keys/seed phrase safe, if you do so then you then you are on the path to protecting your funds firmly without any breachNow why you are advised to use open sourced/non-custodial/cold/offline wallet is that it keeps you safer and far away from malware and other vulnerabilities that could hurt, but you must still keep your keys/recovery phrase properly when you use them. On the other hand, when you use a hot/online/closed source wallet you are exposed to quite a lot of vulnerabilities that you can lose your funds to. Using an exchange/custodial wallet should of course be an absolute no to anybody who has done their research, remember when you don't own the keys, the funds are definitely not yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "May 08, 2022, 07:41:40 PM",
      "body": "Quote from: only1mehedi on May 08, 2022, 01:04:17 PMAnd from software wallets trust wallet is one of the safest wallet. As a Bounty hunter I always use Trust Wallet.Please stop misleading people based on your preferences.Blindly trusting a wallet or service is why you might end up losing your assets at one time. Moreover, it is a close sourced wallet. You don't know what they are doing behind the scenes, your seedsJust because it's called \"Trust\"wallet  shouldn't mean you should blindly trust it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 08, 2022, 09:01:14 PM",
      "body": "Quote from: StanCrypt on May 08, 2022, 09:53:55 AMThey can't neccesaryly utilize a hardware wallet since (like Ledger Nano S, Trezor Model One- Crypto Hardware Wallet, SafePal S1, Steel Bitcoin Wallet for Hardware Wallet Backup), given its use and cost, a software wallet seem to better option. But in light of the recorded hacks, which wallet do you believe is the safest and most secure for storing cryptocurrency in resent times and why?There is no universal solution wallet for bunch of shitcoins and tokens people use, but it's perfectly fine to use open source Electrum wallet for Bitcoin.Most of the other alternatives are either closed source or their require some investment like in case with hardware wallets.If someone have larger amount of money in crypto, than I think it's good idea to spend between $50 and $150 and buy some open source hardware wallets like Keystone, Bitbox, Passport or Trezor.Few alternatives that are free and you can consider testing are:- Atomic Dex, open source wallet and atomic swap exchange.- Unstoppable wallet, open source multi-currency mobile wallet.- Bisq, real decentralized opensource exchange that can serve as a wallet also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 08, 2022, 10:39:47 PM",
      "body": "You should never store your crypto on any centralized exchange platform, they're always prone to hack and scams.You can use temporarily the open-source software wallets but if you dont have a budget, if you can afford just go to the hardware wallet which is my preferred and consider the safest wallet among all wallets.  Hardware wallets have security features that protect while using this kind of wallet. Quote from: dkbit98 on May 08, 2022, 09:01:14 PMFew alternatives that are free and you can consider testing are:- Atomic Dex, open source wallet and atomic swap exchange.- Unstoppable wallet, open source multi-currency mobile wallet.- Bisq, real decentralized opensource exchange that can serve as a wallet also.That's a good suggestion, in addition, Hodl-hodl exchange also is a decentralized exchange that you can trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 09, 2022, 07:08:25 AM",
      "body": "Quote from: only1mehedi on May 08, 2022, 01:04:17 PMWe all know that the most safe crypto Wallets are hardware wallets. And they are Trezor wallet and Ledger wallet. And from software wallets trust wallet is one of the safest wallet. As a Bounty hunter I always use Trust Wallet.Close source wallet should first not be considered safe because the public do not know the code the wallet is using, just like you are using something you do not know about if it can even steal from you or watching over you and giving your wallet details to its developers. Online wallets should not be considered safe because its private key can be leaked online to scammers or hackers and be stolen to compromise your wallet. If commenting on a wallet that is safe, that should be cold wallets, not online wallets.Quote from: Marvelman on May 08, 2022, 05:34:07 PMWhere do you get this information from? I don't think Trust wallet can be considered the safest wallet by any criteria.It is not and not recommendable.Quote from: sheenshane on May 08, 2022, 10:39:47 PMif you can afford just go to the hardware wallet which is my preferred and consider the safest wallet among all wallets.  Hardware wallets have security features that protect while using this kind of wallet. Hardware wallet is one of the safest wallet that can be easy to use and make frequent transactions possible with ease but there are other wallets that are considered safer like wallet on airgapped device. Having the experience to avoid hack makes a wallet to be more perfectly safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "May 09, 2022, 07:51:09 AM",
      "body": "Quote from: mk4 on May 08, 2022, 05:15:48 PMTo be fair, we do have a decentralized wallet — the one and only Bitcoin Core software! Perfectly safe to assume that it's the open-source wallet software that not one entity controls, but instead being coded by a huge number of Bitcoin enthusiasts worldwide.The wallet itself is neither decentralized nor centralized: the code it contains is merely a static set of instructions that defines the behavior of the nodes of the Bitcoin network. It is the nodes that provide decentralization, they are essential for the network operation: the more they are distributed, the more robust and decentralized the network will be. The burden of the decision-making process is split among thousands of nodes to ensure that no one can make changes unilaterally without having to ask everyone that have invested their time, money, and effort into the network. In the case of wallets, the only process that can be said to be relatively decentralized is the process of development in which everybody has a right to join, participate, contribute, review the code, and discuss any changes. The process is \"relatively\" decentralized because only a small group of people has a right to \"inject\" the changes into a certain codebase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "May 09, 2022, 09:25:31 AM",
      "body": "Quote from: StanCrypt on May 08, 2022, 09:53:55 AM...However, more people are still entering the crypto area now and i believe will still be entering in the near future. They can't neccesaryly utilize a hardware wallet since (like Ledger Nano S, Trezor Model One- Crypto Hardware Wallet, SafePal S1, Steel Bitcoin Wallet for Hardware Wallet Backup), given its use and cost, a software wallet seem to better option. But in light of the recorded hacks, which wallet do you believe is the safest and most secure for storing cryptocurrency in resent times and why?Exchanges wallet - are not safe (it's a big NO)Open-source wallets - are not safe as well but a good alternative, if you can't afford to purchase hardware walletsHardware wallet -it is costly but it has the highest level of securityBut have in mind that hackers are smart as well that even if we use hardware wallets and strong passwords still can't achieve 100% safety assurance. That is why we should be careful all the time if possible as we are prone to such hacking incidents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 09, 2022, 10:47:06 AM",
      "body": "Quote from: Yamifoud on May 09, 2022, 09:25:31 AMOpen-source wallets - are not safe as well but a good alternative, if you can't afford to purchase hardware walletsOnline (be it web, mobile or desktop) and cold (be it paper, hardware wallet) can be open source wallet, so far their source codes for the wallet makeup are available for the public the view and check. Also online and offline wallets can be close source if the source code is only available to the developers and not the public.Quote from: Yamifoud on May 09, 2022, 09:25:31 AMHardware wallet -it is costly but it has the highest level of securityCold wallets are most secure generally but only safe if the person that generate the cold wallet do it the right way. Hardware wallet are only easy to use like I have posted about it before, there are other cold wallets like paper wallet and wallet on airgapped devices, they are also very safe if you maintain appropriate safety measures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}