{
  "id": "topic_5412603",
  "title": "stevennhansen",
  "author": "stevennhansen",
  "created_time": "September 06, 2022, 01:43:26 PM",
  "content": "I will send DM messages advertising your mint or any crypto project to the users interested in Crypto/NFT. This is great for grow your Discord server audience or for sending relevant people to your ongoing mint.1000 DMs - $60The maximum DM amount is 100K DMs in one day.1) What is the TATThe turnaround time for 1000 DMs is 5-6 hours2) Can I order more than 100?Yes sure, the maximum amount of DMs you can order is 100K3) How does it work?- Contact me in Telegram or by mail with the message that you want to send.- Send the payment- During the TAT I will mention, your order will be completed.4) Payment methods.USDT, BUSD, SOL, BTC, ETH, MATIC, BNB or any other \"well-known\" crypto.5) Any refunds?No, I don't provide any refunds. I am fully confident in what I provide.6) Any Review Copies?I don't provide review copies, but every person who will order my service will get a bonus - I will re-tweet one tweet for free after the main order complete.Contact me: deuris1212@gmail.com or Telegram: t.me/al1ex2 (@al1ex2)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412603",
  "comments": [
    {
      "author": "fortunecrypto",
      "created_time": "September 06, 2022, 09:29:08 PM",
      "body": "You have no refund no escrow everything is in your favor, as if you are a reputable member of this forum you don't provide testimonials coming from other clients, you are fully confident in what you provide, I don't see why we should trust you, you don't come here offer to send you money without giving us something that will prove that you are legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stevennhansen",
      "created_time": "September 08, 2022, 12:38:48 PM",
      "body": "Quote from: fortunecrypto on September 06, 2022, 09:29:08 PMYou have no refund no escrow everything is in your favor, as if you are a reputable member of this forum you don't provide testimonials coming from other clients, you are fully confident in what you provide, I don't see why we should trust you, you don't come here offer to send you money without giving us something that will prove that you are legit.  I am new at this forum, but you can check my thread, on BHW, for example: https://www.blackhatworld.com/seo/real-twitter-nft-followers-grow-your-nft-community-100-real-and-relevant-audience.1393850/page-5#post-15590649For those who are really interested in my thread and the services I provide, I can always negotiate review copies etc. Just contact me through email or TG and we will talk about all these",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stevennhansen",
      "created_time": "September 14, 2022, 02:06:21 PM",
      "body": "Taking new orders!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stevennhansen",
      "created_time": "September 18, 2022, 05:43:30 PM",
      "body": "Taking new orders!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 19, 2022, 08:40:33 AM",
      "body": "OP, delete your previous bump before posting new. That's the forum rule. I assume that the same applies to BHW as well.I'm not a fan of spam and I certainly won't even consider such offers through DM, most often it ends with a report and block. but can you somehow prove the quality and functionality of your service? is it possible to measure your work?you should definitely include the negative effect of the spam campaign in the whole analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}