{
  "id": "topic_5470164",
  "title": "Synchronice",
  "author": "Synchronice",
  "created_time": "October 13, 2023, 08:28:15 AMLast edit: October 13, 2023, 08:41:43 AM by Synchronice",
  "content": "How did Israeli intelligence miss Hamas' preparations? That's the question we all have, especially right then when Egypt warned Israel of potential violence three days before Hamas' but they ignored it. The country, that has one of the greatest military and advanced technologies, missed the Hamas preparations even after the warning, does that really make sense? No, that doesn't. Over years, Israel has passed a series of discriminatory laws to be able to confiscate Palestinian property. They have a law like: if the land was not cultivated for several years in a row it would become the property of the state. Read about The draconian law used by Israel to steal Palestinian land.It makes perfect sense to say that Israel wants to obtain as much Palestine territory as possible, or probably takeover whole Palestine. But wait, here is another problem, Two years ago, a Jewish Electorate Institute poll found that 58% of American Jewish voters support restrictions on US military aid to prevent Israel using it to expand West Bank settlements. One-third agreed that “Israel’s treatment of Palestinians is similar to racism in the United States” and one-quarter said that “Israel is an apartheid state”, numbers that shocked some Jewish community leaders..If the support for Palestine increases, how will Israel be able to get more territories? It will lose support and won't be able to get the job done.This opinion really makes some sense: Hamas was not created by Israel, but it was empowered and enhanced by Israel as a counter force to the Fatah in the 1970s. Israel has provided it space and allowed it to generate resources with the hope that it will bring down the power of the secular national movement that began to intensify in the occupied territories..In the end, I just wanna say that I don't support any of them because I am not 100% sure what's going on. I just want this war to end and peaceful people should continue their life without blood and terror. And truth has to be said, Israel is not an innocent country and Palestine is not only the guilty one.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470164",
  "comments": [
    {
      "author": "adamin1i",
      "created_time": "October 13, 2023, 10:01:29 AM",
      "body": "Israel created an excuse to attack Gaza. And the whole world watches with pleasure the 2.5 million people there struggling to survive in an environment without hunger, water and electricity. The USA is preparing the necessary environment to strike Iran. The whole world is watching this theatre. But no one cares about innocent people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 13, 2023, 10:17:45 AM",
      "body": "One certainly has to wonder how they managed to screw up and miss the warnings of an attack of this magnitude. If they purposely ignored the warnings knowing that their own civilians and civilians from other countries would be assassinated or kidnapped, then it is certainly a disgusting use of polítics and intelligence to meet a territorial end.I am not as informed as other people is about this conflict, so I won't dare to talk openly from my ignorance, but this attack was never supposed to happen in the first place and the people of Palestine need to further distance themselves from Hamas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 13, 2023, 12:04:14 PM",
      "body": "Quote from: Synchronice on October 13, 2023, 08:28:15 AMHow did Israeli intelligence miss Hamas' preparations? That's the question we all have, especially right then when Egypt warned Israel of potential violence three days before Hamas' but they ignored it. The country, that has one of the greatest military and advanced technologies, missed the Hamas preparations even after the warning, does that really make sense? No, that doesn't.The explanation is pretty simple, every single word in the bold part has always been a lie Israel has always been like one of those blowfishes, in reality a weak creature that if you poke it, it will perish but it blows itself up to a much bigger size to create the illusion that it is big and strong and scary.All that aside you should also consider the intelligence work by Palestinians. For example over the past year they have captured many spies and traitors and that practically made any intelligence leak out of Gaza impossible.Additionally large number of cyber attacks against the Israeli terrorists from half a dozen countries have been leaking all kinds of intelligence including highly classified ones that helped with inflicting the biggest intelligence damage on October 7.Not to mention that as I've explained many times, Israel has been falling apart for some time now. For example over the past 4 yeas none of the \"governments\" could last more than months before falling apart. Over the past 40+ weeks there has also been mass protests by the Israeli terrorists against the government in office and majority of their forces in military, air force, intelligence, foreign terror group, etc. have refused to work and have abandoned their posts.All of this means that the chances of them having the slightest clue about this operation before its start is nearly zero.Quote from: Synchronice on October 13, 2023, 08:28:15 AMThis opinion really makes some sense: Hamas was not created by Israel, but it was empowered and enhanced by Israel as a counter force to the Fatah in the 1970s. Israel has provided it space and allowed it to generate resources with the hope that it will bring down the power of the secular national movement that began to intensify in the occupied territories..Well first of all it is called Fat'h not Fatah (that's another thing). I have no idea how those who supposedly are \"experts\" can't even pronounce the name correctly.Secondly there are 32 different movements in Palestine and they are all now against Fat'h (formerly Palestinian National Liberation Movement) because they consider them traitors because Israel has created Fat'h and they are the literal definition of traitors because they legitimized both the occupation and ethnic cleansing of Palestinians. In other words Israel wants Fat'h not others. Claiming they deliberately weakened the only movement that was in their favor and in their pocket makes no sense to me.Quote from: adamin1i on October 13, 2023, 10:01:29 AMIsrael created an excuse to attack Gaza.That would have been true if this was the first attack on Gaza. But it isn't. In the pat the Israeli terrorists never needed an excuse to slaughter thousands of Palestinians at a time and they didn't need it now either.Quote from: adamin1i on October 13, 2023, 10:01:29 AMThe USA is preparing the necessary environment to strike Iran.haha. If USA had the balls or the capability of striking Iran they would have done it after January 8, 2020 when Iran openly bombed the shit out of two US military based in Iraq eliminating an estimated 140 US troops. Not to mention that it happened at a time when those in oval office were the biggest war mongers and have been pushing a war with Iran for months back then",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamin1i",
      "created_time": "October 13, 2023, 12:45:57 PM",
      "body": "Quote from: pooya87 on October 13, 2023, 12:04:14 PMQuote from: adamin1i on October 13, 2023, 10:01:29 AMIsrael created an excuse to attack Gaza.That would have been true if this was the first attack on Gaza. But it isn't. In the pat the Israeli terrorists never needed an excuse to slaughter thousands of Palestinians at a time and they didn't need it now either.Quote from: adamin1i on October 13, 2023, 10:01:29 AMThe USA is preparing the necessary environment to strike Iran.haha. If USA had the balls or the capability of striking Iran they would have done it after January 8, 2020 when Iran openly bombed the shit out of two US military based in Iraq eliminating an estimated 140 US troops. Not to mention that it happened at a time when those in oval office were the biggest war mongers and have been pushing a war with Iran for months back then Yes, Israel always finds an excuse to attack Gaza. But this time, Hamas was the first to attack and attacked many innocent people, both local and foreign, in the concert area, making Israel more right than ever. and managed to get the support of the entire West. Otherwise, he would not have had the courage to imprison 2.5 million people and rain bombs on them for days.Yes, America cannot do this alone. But it can be done with the support of Nato and Israel. They will attack Iran's oil wells in the near future. In this way, the already bad Iranian economy will become even worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 13, 2023, 01:19:50 PM",
      "body": "Quote from: adamin1i on October 13, 2023, 12:45:57 PMOtherwise, he would not have had the courage to imprison 2.5 million people and rain bombs on them for days.They've done this in the past many many times killing thousands at a time.Quote from: adamin1i on October 13, 2023, 12:45:57 PMYes, America cannot do this alone. But it can be done with the support of Nato and Israel.How about with a coalition of 50+ countries and half a million troops already deployed to all around Iran in the Old Word Order where US was the only power? That is early 2000's for you and Iran used to be a lot weaker back then. US couldn't even match Iran's strength at that time. Today Iran's strength is at least 100 times higher not to mention that Iran is now a nuclear threshold state. Refer to memoirs of the retired United States Army officer, general Wesley Kanne Clark for more details.Had enough? How about the former United States Marine Corps intelligence officer Scott Ritter? He paints a much more dire picture that in comparison to my comments where I say Iran is the only superpower, mine looks like understatements Quote from: adamin1i on October 13, 2023, 12:45:57 PMThey will attack Iran's oil wells in the near future. In this way, the already bad Iranian economy will become even worse.Shooting a bullet in Iran's direction would increase the oil price, attacking any oil facility would shoot both the oil and gas price to the moon. That means the first to suffer is the Western economy not Iran's. Western economy may be big but it is too fragile to perform if oil price is something like $500-$1000 per barrel and there is barely any shipments. Meanwhile Iran's economy has already survived when barely any oil was being sold. Not to mention declaring war on Iran is a declaration of World War 3. The first stage of such a conflict would be 60+% of the global oil/gas infrastructure either destroyed or stop production within first 24 hours. Also all international trades and shipments are going to stop across the globe as all the chokepoints will be completely shut off (Panama Canal, Suez Canal, Strait of Gibraltar, and of course Strait of Hurmuz). I don't even want to get into what the second stage looks like",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 13, 2023, 06:13:39 PM",
      "body": "Quote from: Synchronice on October 13, 2023, 08:28:15 AMHow did Israeli intelligence miss Hamas' preparations? That's the question we all have, especially right then when Egypt warned Israel of potential violence three days before Hamas' but they ignored it. The country, that has one of the greatest military and advanced technologies, missed the Hamas preparations even after the warning, does that really make sense? No, that doesn't. Pride and overconfidence blinded their sense of reasoning. They underrated Hamas and felt that they were powerless and couldn't pose any threat. They see Palestine as a conquered people that is powerless. But I think they have learned their lesson the hard way. Quote from: adamin1i on October 13, 2023, 10:01:29 AMIsrael created an excuse to attack Gaza. And the whole world watches with pleasure the 2.5 million people there struggling to survive in an environment without hunger, water and electricity. The USA is preparing the necessary environment to strike Iran. The whole world is watching this theatre. But no one cares about innocent people.It was Hamas that started the attacks and they have to endure the consequences.  I know that they have been under the oppression of Israel for a long time but they should have known that the consequences will be very costly. Now the world is watching as Israel receives support from world powers to destroy a powerless nation. I have seen videos of the bodies of children torn in pieces because of these attacks and I wonder what was the crime of these beautiful creatures. We don't need another war because it will be disastrous. If the US ever strikes Iran, they will fight a war that will make them regret their actions for decades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LucyFurr",
      "created_time": "October 13, 2023, 08:17:03 PM",
      "body": "Around 5000 missiles were launched on that day that is why the Iron dome system failed even with 99% success rate, so Hamas actually initiated the attack but they didn't expect this kind of approach from Israel and to be honest it seems Israel government has been waiting for such reason to destroy the Gazan and invade that place too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvbcof",
      "created_time": "October 13, 2023, 09:40:02 PM",
      "body": "Quote from: LucyFurr on October 13, 2023, 08:17:03 PMAround 5000 missiles were launched on that day that is why the Iron dome system failed even with 99% success rate, so Hamas actually initiated the attack but they didn't expect this kind of approach from Israel and to be honest it seems Israel government has been waiting for such reason to destroy the Gazan and invade that place too.At least some Israelis have been saying the quite part out loud about doing a 'final solution' on the Palestinians for decades now.  Gotta love the cute add they are running on Jewtube to try to get the Western goyim behind their reprehensible plans to 'do 'em all' in Gaza.  https://www.bitchute.com/video/l4tZOSGlQrUM/Sadly it probably will work to a fair degree because over the years a lot of money and effort has been put into making Westerns ignorant, stupid, and evil by default.  With special emphasis on the so-called 'Christians'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 15, 2023, 12:16:36 AM",
      "body": "Quote from: adamin1i on October 13, 2023, 12:45:57 PMYes, America cannot do this alone. But it can be done with the support of Nato and Israel. They will attack Iran's oil wells in the near future. In this way, the already bad Iranian economy will become even worse.Promises promises, when they will start then? We have been waiting for 44 years for them to come and rescue us from these mullas, I mean wtf is going on, can't they defeat a few old mullas already? Where are these superpower almighty western armies to save us all?I know where they are, in hollywood movies.😉But here is my suggestion, they need to tighten the sanctions, a total siege is required IMO, current situation is boring, we need the actual challenge.Now one has to wonder, if they manage to destroy Palestine and kill them all, what will stop Iran and Lebanon to destroy Israel?  Whatever you do, it will lead to mutual  destruction. It's best if a few honorable people from inside their governments just kill all the mullas and zionists, it'd be a favor to the whole world.😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 15, 2023, 01:20:25 AM",
      "body": "Quote from: LucyFurr on October 13, 2023, 08:17:03 PMAround 5000 missiles were launched on that day that is why the Iron dome system failed even with 99% success rate, so Hamas actually initiated the attack but they didn't expect this kind of approach from Israel and to be honest it seems Israel government has been waiting for such reason to destroy the Gazan and invade that place too.It is not a secret there are powerful nationalist movements within Israel which seek to take as much land as possible from the Palestinian mandate. Hamas' move in this occasion was foolish, since this kind of reaction to such brutal attack was to be expected from Israel. What kind of response was is to be expected after more than 1000 of your residents are massacred without warning and many concert goers are shot dead? Anyreasonable nation on the planet would act in retaliation on such terrorist attack, specially Israel. The big difference here is the struggle for the land and the fact Hamas is the organization which rules the Gaza region.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "October 15, 2023, 06:30:51 AM",
      "body": "Quote from: pooya87 on October 13, 2023, 12:04:14 PMThe explanation is pretty simple, every single word in the bold part has always been a lie Israel has always been like one of those blowfishes, in reality a weak creature that if you poke it, it will perish but it blows itself up to a much bigger size to create the illusion that it is big and strong and scary.You want to tell me that weak Israel is destroying strong Palestine? In this case, Gaza strip? Overall, Jewish people are intelligent and they represent 22% of all Nobel prize recipients, which, I don't understand why and how is that but the fact is fact. Israel, with the help of the USA, Russia and Europe, will definitely have way better technologies and intelligence than Palestine.Israel wants Palestine's territory, they have been trying over years to get their territory and lately, the sympathy towards Palestinian people has been growing. It was the perfect time for Israel to fund Hamas and stage this attack in order to have a legitimate reason to destroy Palestine to death.Quote from: pooya87 on October 13, 2023, 12:04:14 PMQuote from: adamin1i on October 13, 2023, 10:01:29 AMIsrael created an excuse to attack Gaza.That would have been true if this was the first attack on Gaza. But it isn't. In the pat the Israeli terrorists never needed an excuse to slaughter thousands of Palestinians at a time and they didn't need it now either.I think this time it's different. Israel is probably looking for an excuse to destroy them with rockets and what not. That's why it makes more sense that this attack is actually staged by Israel in order to gain legitimate reason to destroy Palestine and Palestinians forever. Just think about it, overall, Muslim people have a reputation of being terrorists and they never do good things when they come as refugees in Europe. They rape and murder children and women in Europe, most of the crime is done by them. They prefer this over working, not everyone, but the difference is clear. So, after this, how are you going to convince people to support Palestine over Israel? Israel knows that and probably uses that as an advantage to gain vote and help of other countries while in this case, Palestine is not the guilty one because it was their land and Jewish people came here out of nowhere in 20th century and decided to live there via force. Just imagine, another family coming at your house and telling you that 2 rooms out of 3 belongs to them and since it was their home 10 years ago, now they decided to live there. And then imagine lawyer gives them right to live in your house and then these family members try to increase their room at the cost of your room and space. This is what happened in Palestine.I personally think that this territory belongs to Palestinians and Israel has no right to live there, their before the Christ history means nothing because if that means anything today, then Italy should wage a war to get back the territory of Roman Empire, Germany should probably wage a war to rebuild its Holy Roman Empire, Britain should probably wage a war to get it's British Empire back.Quote from: pooya87 on October 13, 2023, 12:04:14 PMhaha. If USA had the balls or the capability of striking Iran they would have done it after January 8, 2020 when Iran openly bombed the shit out of two US military based in Iraq eliminating an estimated 140 US troops. Not to mention that it happened at a time when those in oval office were the biggest war mongers and have been pushing a war with Iran for months back then It's not only about balls, war is never a good idea, war doesn't bring benefits, war kills people, destroys economies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 15, 2023, 09:44:58 AM",
      "body": "Quote from: Synchronice on October 15, 2023, 06:30:51 AMYou want to tell me that weak Israel is destroying strong Palestine?Look at the statistics. Palestinian armed forces have only had 19 soldiers KIA from the start of the Hurricane of Al-Aqsa operation. With about 2000 women and children slaughtered by the Israeli terrorists.On the other side the Israelis have lost at least 1000 soldiers by estimations (270+ by admittance) dead and at least 300 were captured as poisoners with 500-700 MIA. That is on top of the dozens of tanks, helicopters and a single F16 jet they lost.From a military perspective, one teeny tiny armed militant Palestinian force is far more strong than Israel! In fact that is why the Israeli terrorists have been murdering unarmed women and children from the start, so that they can pretend that they are doing something on paper when the numbers come out!Quote from: Synchronice on October 15, 2023, 06:30:51 AMJust think about it, overall, Muslim people have a reputation of being terrorists and they never do good things when they come as refugees in Europe.Propaganda-wise because US wanted to invade oil-rich countries that all happen to also be Muslim countries, the Muslims had to be introduced as radicals which is why the idea of an operation codename \"Radical Islam\" was started in Washington by CIA and have been bombarding people with the propaganda ever since in the mainstream media, Hollywood movies, etc.Funny enough, those who fight terrorists are Muslims, for example it was the Muslim world with the leadership of Iran that fought and destroyed ISIS while US had both created ISIS and have been supporting it ever since.As for radical behavior of immigrants, all those who are forced to be dislocated, specially by war are always committing radical acts. Ukrainian refugees are a good example that are neither from Middle East nor are Muslims and yet many of them are far more radical than other war refugees. Quote from: Synchronice on October 15, 2023, 06:30:51 AMSo, after this, how are you going to convince people to support Palestine over Israel?There is no need for anybody to convince other people, the free and civilized people with brain always find the truth themselves. There were so many large protests in support of Palestine across Europe that the European regimes are now banning it! For example in France there now is 5-7 years of prison for anybody who would carry the Palestinian flag or posts anything in support of Palestine in social media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "October 18, 2023, 08:58:21 PM",
      "body": "Quote from: Synchronice on October 13, 2023, 08:28:15 AMHow did Israeli intelligence miss Hamas' preparations? That's the question we all have, especially right then when Egypt warned Israel of potential violence three days before Hamas' but they ignored it. The country, that has one of the greatest military and advanced technologies, missed the Hamas preparations even after the warning, does that really make sense? No, that doesn't. This happen maybe due to their negligent or act of under rating them, truly am not happy about this war with the looks of things seem that the war is not end at any moment now, my reason for saying this is that those that will say something about the war are busy make damage. I just read from the link you posted thatQuoteThis opinion really makes some sense: Hamas was not created by Israel, but it was empowered and enhanced by Israel as a counter force to the Fatah in the 1970s. Israel has provided it space and allowed it to generate resources with the hope that it will bring down the power of the secular national movement that began to intensify in the occupied territories..So if this is so definitely Hamas are not working alone they have people giving them the information, I am not surprised seen them attacking Israel because anything you plant that what you will havest, still something is happening between Israel and Hamas which is a hidden secret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "October 19, 2023, 08:57:58 AM",
      "body": "Well, the head and people in the land of Israel were used like everyone else in the world who is slave to the system. They may be unaware of their roles. Those who may be aware usually have deep ties with the entity the runs the world who is called satan by Christians. It's still thesame issue of creating choas/problems and offering solutions that end up giving more power or control over societies and the world to the entity that runs them.  The entity took advantage of a program set to keep the land of Israel secure. The program was designed to keep those who live in the land secure as long as they do not ally with the leadership in Babylon/USA against Russia, doing so would also hasten the full take over by the entity. The program also keeps the friends of Russia allies stronger. The Babylonia leadership was designed to take full control by weakening strong nations, introducing all manner of abominable immortality around the world and even persecuting Christians.  They tried multiple times to takeover via the abominable immorality but failed. That alone can weaken the shield protecting the world or any nation. So, they tried that in the land of Israel plus used the head of the land against Eritrea, a Russia ally, and allied with the Russian enemy in Babylon the entity hope to conquer the world with. But this evil tricks would all have failed if the one who currently supports the world and the land of Israel with the Authority/Power of our CREATOR didn't reduce his support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 19, 2023, 11:56:36 AM",
      "body": "On discussions like this, everyone is at fault in one way or the other, when things like this are happening, each of the parties involved always try to vested the fault o the other, the same way Ukraine and Russia crisis all started, one thing I know about Israel is that as small as they are, they will never accept defeat no matter how, Palestine are claiming there's while Israel still standing on their own right, all we pray is for them to both have concession on these and make a resolution to end it just the way it all started.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}