{
  "id": "topic_5414766",
  "title": "Balmain",
  "author": "Balmain",
  "created_time": "September 24, 2022, 05:36:42 PM",
  "content": "Başlık için biraz ne alaka diyeceksiniz. Türkiye de, Istanbul da gece hayatının özetini içeren bir video paylaşıcam ardından yorumlarınız rica edeceğim. Gece hayatı her zaman böyleydi artık daha fazla görüntüler sızıyor tabi. 10 tane takım elbiseli koruma hepsi tetikte bu her zaman böyledir gelen insanlara bok gibi davranırlar. Kafayı atan tip dayağı hak etmiş bunlardan zaten geçilmiyor adamlar almıyor mekana neye zorluyorsun üstüne kafa atıyorsun bu neyin kafası ?Ben şiddete karşıyım her türlüsüne ama bu kadar şiddete meraklı bir toplum da olmaz yahu bunun sebebi cahillikten başka nedir başka cevabı var mı ?https://twitter.com/Balikesirposta/status/1573688279223918592?s=20&t=758C76NSc5gaiGSaM-Ww7w",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414766",
  "comments": [
    {
      "author": "mandown",
      "created_time": "September 24, 2022, 05:44:14 PMLast edit: September 24, 2022, 05:58:07 PM by mandown",
      "body": "iktidar devletin en temel görevlerini unutturdu.Cahil adam bir yerde korkar bunların yaptığı cahillik değil bilinçli ve akıllı adam işi. Herhangi bir ceza almayacaklarını biliyorlar. Ülkemizde hırsızlığın, yalanın, dayağın ciddi bir cezası varmı? yok.  Caydırıcılığı varmı?  yok.Hocam yasalar engelleyici değil.  Tek sorun bu.  Geçen günde soförü 7 yerinden bıçakladılar bıçaklayan aynı gün salındı bu adam tekrar birini bıçaklamaya kalkarmı? Kalkar neden bıçaklamasın nasıl olsa salınacak...Yasalar hiçbir konuda yeterli değil. Bu gibi durumlar son bulmaz.Daha önceden anlattığım bir durum vardı yayla evimizi birisi yıktı eve sahip çıkmaya çalıştı şahsın kendisi yıkacağını telefonda söylediği halde devlet bu kaydı delili olarak kabul etmedi ve aynen vatandaşın söylediği oldu yaylada devlet yok. Şahıs adam öldürse içeri girmez. üstüne üstlük yalancı şahit buldu ve bizim küfrettiğimizi söyledi evi yıkılan biziz eşyalarımıza el koyan onlar ve eşyalarımızı kullandıkları yeri devlete söylüyoruz devlet kanıt yok diyor.  Yayla evimizde telefon ve elektrik yok. Beni orada koruyacak tek şey aldığım kayıtlar. Ne hikmetse onlar kanıt değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "September 24, 2022, 06:33:55 PM",
      "body": "hiç kulube gitmedim ama geçerken görüyorum genelde bi okadarda içerde koruma vardır çünki gelen kişiler genelde elit oluyor bu elemanı almamaları doğru hemen kafa atmıs sen atarsan o kafayı olacakları kabullenmişsindir. Kulublere elit kişilerin alınmasını doğru buluyorum çünki adamlar oraya eylenmeye geliyor oysa gariban anadolu insanı oraya karı kız için geliyor ulan orda o kadar para babaları varken kızlar sana bakarmı oraya giden kız paranın kokusunu 100 metre öteden alır senin cebinde ne var ne yok bilir. Sen evden bir kaşık çorba içip gelmişsindir o erişte kokusundan herkes kaçar ama zengin suçi yiyip gelmiştir ne koku ne birşey mis gibi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 24, 2022, 06:38:44 PM",
      "body": "Şiddet, doğada insan dışındaki varlıkların belirli bir sebebe bağlı olarak başvurduğu, insanın ise sebep gerekmeksizin de kullandığı bir argüman aslında. Hastanede, okulda, dolmuşta, trafikte, sokakta, yani her yerde rastlayabiliyoruz rahatlıkla. Burada asıl mevzu yasaların bu durumda ne kadar engelleyici olduğu. Örneğin doktora şiddet uygulayani tüm aile bireyleri ile birlikte ömür boyu sağlık hizmetlerinden men edeceksin, öğretmene uygulayani eğitimden mesela. Cinayet ile sonuçlanan olayların faillerinin hiç gün yüzü görmemesini saglayacaksin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "September 24, 2022, 06:53:15 PM",
      "body": "Eskiden de vardı bu durumlar ama sosyal medya bu kadar yaygın olduğu için şimdi daha kolay duyuluyor. Gazino önünde vurulan öldürülen çok duydum. Bunda alkolün etkisi de çok fazla genelde kavga dövüş olayı kulüp çıkışında oluyor. Görüntülere baktım. Diğerleri sanki tetikte bekliyor gibi kafa atıyor adam arkadakiler aynı anda dalıyor. Acayip bir durum.Arada kadınlarda kaynamış adamların gözü dönmüş resmen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "September 24, 2022, 08:05:07 PM",
      "body": "Valla izledim o kadına helal olsun dedim o kadar yarmanın arasında gitti adamın üstüne kapaklandı korumaya çalıştı bi o kadarda dayağı kendisi yedi. O adam o kadını bırakırsa enayilik eder net. Objektif bakış açımla buraya kadar. Şimdi mesertif bakış açımı söylüyorum. İki tarafta da hatalı ve bu kişilerin ciddi bir psikolojik destek alması lazım. Kendileri için olmasa da çevre için bu şart. Gerçi böyle bir uygulamaya gidilse ülkenin %80-85'ine gerekiyor geri kalanların çoğuda psikolog vb falan filan yani. Bir tarafa bakıyorsun içeri alınmadığı için dil döküp en sonda kafa atan bir maganda. Diğer tarafta mesai arkadaşı kafa yedi diye hunharca toptan dalan güvenlik görevlileri. Ve araya kadın girmesine rağmen ona da yardırmaları. Bu insanların elini kolunu sallayarak bu sokaklarda gezmeleri kalan halk için risk ama kime neyi anlatabiliriz ki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 24, 2022, 08:12:29 PM",
      "body": "Kafa atan elemanın ya kafası çok iyiydi ya da dayak yemeyi göze almıştı. 10 tane korumanın arasında kafayı korsan adamı kevgire çevirirler tabi. Gece kulübü ortamında bulunmam da sevmem de. Ancak bu tarz yerlerin de kendi kuralları olduğunu bilmek gerekir. Bu tarz ortamlara girmek isterseniz ya müdavim ya ünlü ya da mekan sahibinin tanıdığı olmanız şarttır. İsterse içerisi bomboş olsun o mekan sizi almazsa basıp gitmek en iyisidir. Ancak mekana girmeye çalışan kişiyle korumalar arasında nasıl bir diyalog geçti bilmiyorum. Belki de istediği her kapıya bu zamana kadar giren biriydi ve gurur yaptı. Yalnız kafa atan adam zaten baştan bir mallık yapmış dayağını yemiş. Sonradan bacaklarına durmak bilmeden sopayla vurmak da neyin nesi orayı anlamadım. Kafa atan muhtemelen komalık olmuş zaten ne diye hala ayaklarını kırmak istercesine vurursun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "September 24, 2022, 08:33:07 PM",
      "body": "Quote from: mandown on September 24, 2022, 05:44:14 PMiktidar devletin en temel görevlerini unutturdu.Cahil adam bir yerde korkar bunların yaptığı cahillik değil bilinçli ve akıllı adam işi. Herhangi bir ceza almayacaklarını biliyorlar. Ülkemizde hırsızlığın, yalanın, dayağın ciddi bir cezası varmı? yok.  Caydırıcılığı varmı?  yok.Hocam yasalar engelleyici değil.  Tek sorun bu.  Geçen günde soförü 7 yerinden bıçakladılar bıçaklayan aynı gün salındı bu adam tekrar birini bıçaklamaya kalkarmı? Kalkar neden bıçaklamasın nasıl olsa salınacak...Yasalar hiçbir konuda yeterli değil. Bu gibi durumlar son bulmaz.Aslında söylediklerinize bir nebze katılmıyorum hocam Türk Ceza Kanunu caydırıcılık açısından oldukça yerinde.Suçlara ön görülen cezalar dünyanın birçok bölgesine göre daha ağır bile sayılır ama asıl sıkıntı burada yargıda.Orada zaten büyük sorun yaşadığımız toplumun tamamı tarafından kabul ediliyor.Kurumları ayağa kaldırmadıkça yasaları daha da caydırıcı yapın yine bir etkisi olmayacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yenerbatmaz",
      "created_time": "September 24, 2022, 09:32:35 PM",
      "body": "Haber sitelerinde bende gördüm ama burada başlığı görünce görüntüleri izledim. Acı  bir durum ses yok pek anlaşılmıyor ama adam artık ne gibi bir durum yaşadı ki kafa attı akabinde olanlar gerçekten vahim. Hepsi ayni anda dalıyor kadınlarda var. Sonuç belli  savcılığa gider 1-2 gün yatar çıkarlar. Çünkü Türkiye de cezalar caydırıcı değil. Bunu da herkes biliyor. Bu olayda süreç nasıl işleyecek bekleyip görelim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "September 25, 2022, 04:02:56 AM",
      "body": "bu görüntülr dayaktan fazlası...yazık yani ne hale geldikneresi olduğunu bilmiyorum ama ifşa edilmeli ve prim verilmemeli...yasal yollar zaten denenmeli sonuna kadar..bu arada ben adamın yerinde olsaydım beni istemeyeni ben de istemiyorum derdim, misal ev sahabı evi boşalt dedi tamam dedim, istesem çamura yatardım yıllarca...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 26, 2022, 07:04:10 PM",
      "body": "Quote from: wolwoo on September 25, 2022, 04:02:56 AMbu görüntülr dayaktan fazlası...yazık yani ne hale geldikneresi olduğunu bilmiyorum ama ifşa edilmeli ve prim verilmemeli...yasal yollar zaten denenmeli sonuna kadar..bu arada ben adamın yerinde olsaydım beni istemeyeni ben de istemiyorum derdim, misal ev sahabı evi boşalt dedi tamam dedim, istesem çamura yatardım yıllarca...Yorumlarda Ortaköy'deki Ruby olduğunu söylemişler. Ben Ortaköy Kuruçeşme civarlarına gitmeyeli 4 yıl kadar oldu, Ruby'yi de bilmiyorum açıkçası ama Fenerbahçe Beko'nun Efes'i yenip lig şampiyonluğunu aldıktan sonra kutlama yaptığı mekanmış. (https://www.instagram.com/p/CeyYwJrr2HH/?hl=en) Leş bir yer gibi durmuyor. Oralarda alkolsüz nargileci mekanı dolmuştu benim en son bildiğim kadarıyla, lüks de olsa rezalet yerlerdi. Ama burası daha eli yüzü düzgün bir yere benziyor. Düzgün bir yer olduğunu varsayıyorum, herkesi almamaları tabi ki normal ama dayağın da bir sınırı olmalı sanki. Eleman kafayı attıktan sonra tüm güvenliklerin birbirlerinin üstünden adama uzanmaları komik olmuş. Sanırım iş tanımlarında öyle bir şey olabilir. Birisi efelendiyse herkes birlikte anında dalacak gibi. Yoksa görüntü çok komik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "September 26, 2022, 09:04:35 PM",
      "body": "Bu olay olduktan sonra dayak yiyen elemanlar geri dönüp mekanı taramış güvenliklerden bazılarını yaralamış diye haberler okudum ama detayını bilmiyorum.Sonuç olarak orada kafayı atan eleman dayak yiyeceğini tahmin etmiştir. Kadın arada kaynamış özellikle ona vurmamışlar gibi geldi. Elemanı korumaya çalışırken de darbe almış oldu. Adrenalinin tavan yaptığı kontrollerin kaybedildiği böyle durumlarda ortamda sakin kalıp durumu idare edecek birileri olmayınca böyle linçler yaşanabiliyor. Bazıları engellemeye çalışmış ama güçleri yetmemiş.Peki tüm bunların sonunda ne cezalar gelecek? Çok merak ediyorum. Video görüntüleri ortaya çıkmayan daha böyle ne olaylar oluyor her gün kim bilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "September 26, 2022, 10:00:18 PMLast edit: September 26, 2022, 10:12:59 PM by eightdots",
      "body": "Kafa atanın belirli bir derecede dayağı yiyeceği her mekanda bellidir şaşmaz. Hele ki o ortamda tek başına neyin kafasını atıyorsun. Ama burada kocaman bir ama var. Orada yere düşürdükten sonra kanun devreye farklı şekilde giriyor. Bunun eğitimini ve özellikle hukuktan yana sıkıntıya düşmemek için sınırlarını bilmeleri gerek. Bir de hukuki yanını geçtim yerde hareketsiz birine vurmak nasıl bir şeydir anlamıyorum, haklı ya da haksızlar mı onu bilmediğimiz için sadece o kadar adamın yerde hareketsiz yatan birine vurması garip geliyor. Kavgadır olur ama bunun yanında da istedikleri kadar kalite mekanlarda çalışsınlar hukuki seviyedeki eğitimi bilmeliler ki haklılarsa başları belaya girmesin. Haksızlarsa zaten diyecek bir şey yok. En basiti orada yere düştükten sonra ve özellikle adamın hareketsiz halini gördükten sonra vurmaları hukuk eğer uygulanırsa başlarının büyük belada olduklarını gösterir. Normal şartlar altında olması gerekeni yazıyorum ama sonrasını bilmiyoruz ceza oldu mu konu kapandı mı vs. oraları geçiyoruz. Bir de mekan korumalarında bir olayda suçu tek şahısa yıkmak yerine toplu olarak hareket etme de meşhurdur. Yine de her ne kadar o grup arasında deli dolu olarak görünen ve sopalarla yerde hareketsiz kişiye vuran kişi olsa da bunu durdurmasını bilecek olanlar da olmalı. Burada o durdurmayı bilen kişiler yok gibi. Yerde hareketsizken defalarca vurdukları belli. Yazık, basit bir mekan kavgası bile ne derece yapıya dönüştüğümüzü gözler önüne seriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 27, 2022, 03:22:01 PM",
      "body": "Quote from: Gerceklerisoyleyen on September 24, 2022, 06:33:55 PMhiç kulube gitmedim ama geçerken görüyorum genelde bi okadarda içerde koruma vardır çünki gelen kişiler genelde elit oluyor bu elemanı almamaları doğru hemen kafa atmıs sen atarsan o kafayı olacakları kabullenmişsindir. Kulublere elit kişilerin alınmasını doğru buluyorum çünki adamlar oraya eylenmeye geliyor oysa gariban anadolu insanı oraya karı kız için geliyor ulan orda o kadar para babaları varken kızlar sana bakarmı oraya giden kız paranın kokusunu 100 metre öteden alır senin cebinde ne var ne yok bilir. Sen evden bir kaşık çorba içip gelmişsindir o erişte kokusundan herkes kaçar ama zengin suçi yiyip gelmiştir ne koku ne birşey mis gibi. Orantılı güç diye bir şey var haberdar mısınız bundan kafa atmaya yeltenmiş kişiyi böyle öldüresiye dövmek ne kadar mantıklı biri içeri gidiyor demir sopa alıp geliyor muhtemelen kemikleri kırılmıştır adamın kendinden geçiyor zaten aldığı darbelerle kafa atmaya yeltenme böyle mi bitmeli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 27, 2022, 04:36:38 PM",
      "body": "Zaten hepsi adama bir şey yapsa da dalsak der gibi bakıyordu. O kafa atma girişimi adamın muhtemelen büyük çoğunluğunu hastanede veya evde tedavi olmasını gerektirecek şekilde yaşanmasına sebep olacak son girişimdi. Bu kadar izbandut gibi adamın içinde neden böyle bir hareket yapar derseniz bayan arkadaşı var diye bir şey yapmayacaklar zannediyordu herhalde. Hem kadını hem adamı çok fena dövmüşler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "September 27, 2022, 06:21:44 PM",
      "body": "3 ay heyet raporu almak istediğimde ben de bi deniym olmadı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "September 27, 2022, 06:24:58 PM",
      "body": "Quote from: wolwoo on September 27, 2022, 06:21:44 PM3 ay heyet raporu almak istediğimde ben de bi deniym olmadı  3 ay rapor akmaya değmez inanın hocam, adamı hurdaya ayırmışlar, baksanıza yerde bitmiş artık pili adamın, bu dayaklar gerçekten insafsızca oluyor bazen, her şeyin bir ayarı var yani 4-5 kişi dalıp ağzını burnunu kırmaya ne gerek var, adam bayılmış üstüne hala sopayla gidip defalarca vurmak canilikten başka bir şey olamaz ya, bence bir kere daha düşünün 3 ay değil bu dayaktan sonra 6 ay alırsınız herhalde",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "September 28, 2022, 12:05:03 PM",
      "body": "Çok kötü görüntüler. izlerken insanın içi burkuluyor. kadına da üzüldüm fena darbeler yiyor. herhalde erkek arkadaşı ve üstüne kapaklanıyor o da dayak yiyor arada. zaten fiziksel olarak çok güçlüsünüz, 3-4 kişi bu şekilde dövmelerinin nasıl bir açıklaması olabilir. resmen adamı öldürmeye çalışmışlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "September 29, 2022, 02:35:04 PM",
      "body": "Müşterisine saygısı olmayan mekanlar bunlar. Başka nasıl bir tavır beklersiniz ki. Paranızla hizmet almak istediğiniz mekandan geri çevriliyorsunuz. Israr ederseniz darp ediliyorsunuz. Müşteri parayı eksik mi ödedi. Sahte para mı kullandı ödeme olarak. Bahşişi eksik mi verdi. Ne yapmış olabilir müşteri. Ne yaparsa yapsın karşılığı bu mu? 10 kişinin 1 kişiye şiddet uygulaması mı? Hammurabi yasalarında bile böyle bir karşılık olmaz. Müşteri parasıyla hizmet almak istediğinde işletme sahibi sadece hizmeti faturalandırır. Veya müşterinin uygunsuz taleplerini reddeder. Başka bi şey yapamaz. Aslında mekanların isimleri paylaşılsa süper olur. Gerçekten eğlence arayanlar gitmez böyle mekanlara. Bu olaylar ders olur onlara. Müşterileri azalınca böyle mekanlar da müşterilere nasıl davranması gerektiğini öğrenir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}