{
  "id": "topic_5425947",
  "title": "Canaan Online Shop",
  "author": "Canaan Online Shop",
  "created_time": "December 06, 2022, 09:13:22 AM",
  "content": "Dear allCanaan official online shop has been open for more than half a year, now it's almost the end of the year 2022, so we'd like to collect some advice from all users and fans We are open to hearing all voices and we will review and share with our team to improve our service in the upcoming new year 2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425947",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "December 07, 2022, 01:34:27 PMLast edit: December 07, 2022, 01:59:23 PM by philipma1957",
      "body": "Quote from: Canaan Online Shop on December 06, 2022, 09:13:22 AMDear allCanaan official online shop has been open for more than half a year, now it's almost the end of the year 2022, so we'd like to collect some advice from all users and fans We are open to hearing all voices and we will review and share with our team to improve our service in the upcoming new year 2023 This was a nice idea. My Advice is simple consider cc payments for USA buyers at the USA store.I have good lines of credit and would not mind getting some usa stock with a credit card.I have 1 card with 15 months to pay and zero interest for that time. It pays me back 2% on the purchase.If I used the card at your USA store I could get some of these https://shop.canaan.io/products/canaan-avalon-miner-a1246-87t?VariantsId=10002You have my kycI did 30 or 40k in group buys for your company.  And you make it a royal P.I.T.A. to buy gear.BTW your industry is truly fucked up when it comes to buying gear. not Just you but all the major sellers are like this.I am really well known and to buy with a credit card is normal in just about every industry there is. Not yours.Frankly you need to consider how much it holds you back that you do not do this for reputable people. (ie me)I could upgrade my entire fleet of miners I could get 20 of your a1246 87t models.Pull my older gear and I am done for the next 6 months. Plus I would have 15 months to pay it off with zero interest.I would not even mind paying you a cc fee of 3$.My last major sha 256 gear purchase was in fall of 2019. Bitmain allowed PayPal for 60 days or so. We grabbed 20 s17pros. Did well with them. Since then no major asic company has taken credit cards to buy with. So in 2020 and 2021 I purchased 200 gpus. over 200 thousand dollars no interest and they are paid off.  so sha 256 lost 200000 in sales to me in 2020 and 2021",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "December 08, 2022, 02:29:21 AM",
      "body": "Quote from: philipma1957 on December 07, 2022, 01:34:27 PMQuote from: Canaan Online Shop on December 06, 2022, 09:13:22 AMDear allCanaan official online shop has been open for more than half a year, now it's almost the end of the year 2022, so we'd like to collect some advice from all users and fans We are open to hearing all voices and we will review and share with our team to improve our service in the upcoming new year 2023 This was a nice idea. Thanks, we will discuss about this with our team Any other advice about our Avalon miners or service? We are all ears",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "December 08, 2022, 02:52:09 AM",
      "body": "Quote from: Canaan Online Shop on December 08, 2022, 02:29:21 AMQuote from: philipma1957 on December 07, 2022, 01:34:27 PMQuote from: Canaan Online Shop on December 06, 2022, 09:13:22 AMDear allCanaan official online shop has been open for more than half a year, now it's almost the end of the year 2022, so we'd like to collect some advice from all users and fans We are open to hearing all voices and we will review and share with our team to improve our service in the upcoming new year 2023 This was a nice idea. Thanks, we will discuss about this with our team Any other advice about our Avalon miners or service? We are all ears Right now I am talking with a local reseller. He has some used bitmain s19 gear that he will let me use my CC. it is the 95th model that pulls around 3250 watts very much the same as your a1246 87th unit. Price is close  I would prefer to buy new from you and not used from him. But he will let me use a line of credit via my CC . You won't make sit tough to buy from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "December 09, 2022, 03:39:43 AM",
      "body": "We are just at the beginning  It takes time to be perfect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "December 19, 2022, 03:20:46 AM",
      "body": "Quote from: Canaan Online Shop on December 06, 2022, 09:13:22 AMDear allCanaan official online shop has been open for more than half a year, now it's almost the end of the year 2022, so we'd like to collect some advice from all users and fans We are open to hearing all voices and we will review and share with our team to improve our service in the upcoming new year 2023 Dear all, welcome to share more ideas with us, your opinions will help us grow up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "December 23, 2022, 09:07:16 PM",
      "body": "The early Avalon/Canaan miners it was easy to add extra options to adjust the settings.The miner had a field to do exactly that. Why was it removed?Alas the new ones seem to have a major problem in this regard.Even though they are pumping 3.3kW or more through them, they get too cold in sub zero weather and you have to shut them off.Odd that 3.3kW of heat generated inside it isn't enough to keep a miner warm enough to run",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "December 26, 2022, 02:50:01 AM",
      "body": "Hello, thanks for your feedback.BTW, which model did you have before?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 26, 2022, 08:06:02 PMLast edit: December 26, 2022, 11:38:45 PM by DaveF",
      "body": "You, and all manufacturers need to make low power - low noise miners.Home mining is dead due to the noise level and power requirements. Which means hobby miners, tinkerers are forced to either get used miners and pull boards / do other things or do the same but with new miners and waste money since they can't run them at full speed.But 35T 1000W at the $1000 price point and you would probably sell out. From discussions with a lot of people who are running old miners with 1 or 2 boards would happily buy something newer and more efficient and QUIET with a warranty.Someone who is dumping $100s of thousands of dollars in his farm is not your target for these. It's just the small home people.And with ETH going PoS there are probably a lot of people out there who would get them since they are no longer running their GPU rigs.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "December 26, 2022, 11:51:12 PM",
      "body": "Quote from: DaveF on December 26, 2022, 08:06:02 PMYou, and all manufacturers need to make low power - low noise miners....Alas as I mentioned above I pointed that out to them a couple years ago and they rejected it.Maybe that can change now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "December 26, 2022, 11:56:09 PM",
      "body": "Quote from: Canaan Online Shop on December 26, 2022, 02:50:01 AMHello, thanks for your feedback.BTW, which model did you have before?You've given me an A741, A851 and an A921 - and a few before that also.(though when I say 'you' I mean the people that canaan fired last year)The A741 is easy to adjust due to the 'extra options' and being able to see the source code to adjust the frequency etc.The A851 has a low power mode (source code is also available)The A921 I was never able to get it to run in a low power mode nor quiet enough to run at home.(so it's spent most of it's life living in it's box unused)All miners you've released since the A10 you hide behind China not giving a crap about Copyright laws and you violate the cgminer license.So there's no idea what is possible there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 27, 2022, 12:01:38 AM",
      "body": "Quote from: DaveF on December 26, 2022, 08:06:02 PMBut 35T 1000W at the $1000 price point and you would probably sell out. From discussions with a lot of people who are running old miners with 1 or 2 boards would happily buy something newer and more efficient and QUIET with a warranty.I can totally agree on this. People that want a silent miner with a good efficiency often just buy a lot of stick miners. This is complete bullshit, but is the best option if you want quiet powerful miners. Maybe we will see at some point somebody who just puts the mining chips at a board with a better cooling solution, since it is not that difficult. It is the same as in the GPU market, where we see different manufactures use the same chip with different cooling solutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "December 28, 2022, 07:39:27 AM",
      "body": "However, someone on my pool bought a miner from them and was rejected due to the 'coins being risky'So apparently canaan keeps some unknown list of addresses to filter the payments and won't accept all BTC payments.Clearly canaan's new leadership has some delusion about what Bitcoin is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "December 29, 2022, 02:26:49 AM",
      "body": "Quote from: kano on December 28, 2022, 07:39:27 AMHowever, someone on my pool bought a miner from them and was rejected due to the 'coins being risky'So apparently canaan keeps some unknown list of addresses to filter the payments and won't accept all BTC payments.Clearly canaan's new leadership has some delusion about what Bitcoin is.Hello, our company is a listed company with strict audits, so we have to filter Bitcoin and ensure legality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Acktarius",
      "created_time": "December 29, 2022, 12:22:35 PM",
      "body": "There are a lot of room for customer satisfaction improvement:I placed and order, passed the KYC, and send my Bitcoin, and you answered me the day later that my bitcoin are coming from a \"Risk Address\" used for gambling or mixing (things I never did), that being based on the verdict of a central entity, and that you'd like the coin to be freshly coming from a central exchange. What an irony for a company selling hardware for decentralization and what a disappointment as customer. Such a scheme which makes your business actually suspicious of money laundering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "December 30, 2022, 08:21:38 AM",
      "body": "Quote from: Acktarius on December 29, 2022, 12:22:35 PMThere are a lot of room for customer satisfaction improvement:We do apologize for the inconvenience caused, the KYC is done by a third party, and we will try our best to negotiate and make it more user-friendly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "altair_tech",
      "created_time": "January 04, 2023, 05:17:29 PM",
      "body": "One advice I would give Canaan is to be more conservative in your hashrate claims. All our Canaan machines have about 10% lower hashrate than advertised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "January 05, 2023, 01:30:31 AM",
      "body": "So I think I blew my a1246 psudoes the a1166 psu work as a drop in.also where is a firmware link for psu and a1246I have a spare a1166 psu and I am looking at this link from Newegg which says the a1166 psu works https://www.newegg.com/p/3GG-000G-00001but your website link for psu's says nothing about the a1246https://shop.canaan.io/collections/spare-partssays a1056 to  a1126 oh never mind found info herehttps://shop.canaan.io/products/powersupply?VariantsId=10050I should have a good psu for repair",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "January 06, 2023, 05:58:06 AM",
      "body": "Quote from: philipma1957 on January 05, 2023, 01:30:31 AMSo I think I blew my a1246 psuoh never mind found info herehttps://shop.canaan.io/products/powersupply?VariantsId=10050I should have a good psu for repairHello, how many pieces of PSU do you need?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "January 09, 2023, 02:04:10 AM",
      "body": "Power supply for most Avalon miners https://shop.canaan.io/products/powersupply?VariantsId=10050",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}