{
  "id": "topic_5446609",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "March 28, 2023, 09:35:21 AM",
  "content": "Is it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446609",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "March 28, 2023, 09:48:05 AM",
      "body": "When bitcoin was first created, there were decentralized gambling sites, but all we noticed has been that decentralized gambling sites are shrinking while centralized gambling sites are increasing and expanding.Quote from: KiaKia on March 28, 2023, 09:35:21 AMbut with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing fundsGambling sites have choice to accept a coin or not accept it, although CBDCs are not coins, they are fiat. This are crypto gambling sites, you can decide to deposit and withdraw in coins of your choice that a crypto gambling site supports.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 28, 2023, 09:58:04 AM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform?  It's definitely possible to create a decentralized gambling platform. The technology exists to make it happen, but the real question is whether it's feasible to do so in a way that's sustainable in the long term. I think the biggest challenge with a decentralized gambling platform is gaining the trust of users. People are naturally skeptical of online gambling, and with a decentralized platform, there's no central authority or regulators that users can turn to if something goes wrong. Trust is key when it comes to gambling, and it's hard to build trust in a decentralized platform. Quote from: Oshosondy on March 28, 2023, 09:48:05 AMGambling sites have choice to accept a coin or not accept it, although CBDCs are not coins, they are fiat. If and when a Central Bank Digital Currency (CBDC) is established and declared as legal tender in a specific jurisdiction, online casinos will be obligated to accept it as a form of payment due to regulations imposed by law and governing bodies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "March 28, 2023, 10:05:38 AM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. You should ask yourself one question. If you were an owner of a gambling business, would you want to create a decentralized gambling platform?What would be the cost? Will it bring higher profits? I think that a decentralized gambling platform would be less profitable than a centralized online casino, that's why decentralized gambling isn't popular. The online casino owners simply don't want to bother with decentralization. They are pretty much OK with running centralized platforms.Can a gambling business run unregulated? Or course it can, but it will have way less customers and sooner or later the authorities are doing to find out and penalize that business.I don't know about the CBDC's future impact over the gambling industry. Let's wait and see what happens after CBDCs get implemented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "March 28, 2023, 10:21:10 AM",
      "body": "Quote from: davis196 on March 28, 2023, 10:05:38 AMQuote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. You should ask yourself one question. If you were an owner of a gambling business, would you want to create a decentralized gambling platform?What would be the cost? Will it bring higher profits? I think that a decentralized gambling platform would be less profitable than a centralized online casino, that's why decentralized gambling isn't popular. The online casino owners simply don't want to bother with decentralization. They are pretty much OK with running centralized platforms.Can a gambling business run unregulated? Or course it can, but it will have way less customers and sooner or later the authorities are doing to find out and penalize that business.I don't know about the CBDC's future impact over the gambling industry. Let's wait and see what happens after CBDCs get implemented.I think that the people who open the casinos are looking only for profit as the first thing most people that get a degree in Business Administration and Economics learn that the first objective of any private company is to maximize the profit.Since most people feel more comfortable when playing in a regulated casino that is the reason why we see more of such casinos than decentralized ones.I think the best example of a decentralized casino/sport betting site was directbet.eu as there you just placed a bet anonymously and just putted your wallet address to get the winnings in case you win your sports bet and that was all,no KYC no nothing and I doubt they were government aware which was the ultimate thing that led to its closure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 28, 2023, 10:24:04 AM",
      "body": "Yes, it's possible.You know that the government will just intervene when the company is quite big already. They'll do all the means to track the owners down and make the business at risk by applying such laws that haven't been seen by the developers.If the law states that they can't do it then that's questionable because they didn't enforce it when it was just launched. But it's because the company was too small to be considered and apply the law on them. That's mostly the status of many startups and even new casinos, it's like a test and dry run for them. If it's a success, they'll be recognized and too big not to be noticed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "March 28, 2023, 10:27:14 AM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. No e-gaming license is the key for a casino to run in a real decentralized manner. The problem is user doesn’t trust casino without a license and at the same time doesn’t want to submit KYC and create an infinite loop. Decentralized gambling platform exist especially on the blockchain that use smart contract in every bet result. These casino doesn’t regulated by the government. It just this type of casino offers a limited games which is not appealing that result for being unpopular to the players. They are existing but no one just noticing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "March 28, 2023, 10:33:46 AM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? Very possible, as long as you're going to maintain being decentralized indeed and in all your dealings, we have casinos that were decentralized and don't require for KYC information, but the fear possible have with any is not to scam or took away their funds anytime, which means you have to create a means whereby gamblers will trust you.Quote from: KiaKia on March 28, 2023, 09:35:21 AMI know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. Not all gambling platforms were registered under government, if they registered them they were no more decentralized because they will be subjected to government regulations, you also being a gambler under such casino is not decentralized because they can track you down through the KYC information you must have presented during the course of registration or later after, you can't also expect them to accept CBDC among the foinw their casino support because the gamblers want crypto and not CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "March 28, 2023, 10:41:13 AM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. In order to run casino, you need a lot of money, team of talented web developers, IT professionals, Project Managers, Marketers, Promoters, etc. You need to hire a very big office, you can't do it online via two guys. So, this business requires so much capital, mankind, office and many more, you can't just hide it from the government. They will ask you how do you have that much capital and they'll have an eye on where your money goes, your employees won't like an idea to work underground, especially when you hire people who should be educated in modern finances, technologies, marketing strategies.You can't just do it, it's not a bitcoin mixer, it's a very huge business and you have serious competitors who do things legally and won't forgive or let you to stay illegally in their competition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "March 28, 2023, 10:48:53 AM",
      "body": "It's possible, but the question is how long it will stay. Another one is that, it will depend on how small or huge a casino is. There are some small-scale casinos out there who are operating, but isn't sustainable. On the other hand, there are large casinos out there, and for sure, government will know it because over time, it will become more popular hence, government will notice it.I don't know if it's just me being dumb or I really don't know, but who will create a decentralized casino right now? What if something goes wrong with the casino? Who will the user contact to? What if the user won a huge amount of money, but turns out it is a bug coming from the system? Who will they approach with that problem? What if there's a problem with the withdrawal process? Who they will call and share their problem? Overall, it's possible to create a decentralized gaming platform, but it isn't sustainable. As for a casino running without government's awareness, still depends on how small or large the casino is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "March 28, 2023, 11:10:48 AM",
      "body": "I think its possible to establish such decentralized gambling business/platform. But most countries would directly block your website because you don't follow their legal terms. So your website can easily become inaccessible like %90 of world countries. What would that mean? It means you will have very low amount of returns/profits. I think noone other than Elon Musk type of rich guy would try to establish such kind of business with nightmare profits. There is a reason most gambling websites get along with governments. They wanna stay profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "March 28, 2023, 11:32:51 AM",
      "body": "A decentralized casino is possible but the user experience is probably going to be substantially worse on average than a centralized casino. Which is going to make running one exceedingly difficult since UX is far more important than decentralization to your average player. Worse also is going to be the currency options. If you run it on a shitcoin it's going to be dead on arrival. And even if you run it on Bitcoin it's going to be nearly dead on arrival. Most want to be able to play in fiat currency.Having a centralized casino can probably run without government awareness if it remains small enough. At scale, that would be close to impossible, even if it were crypto only. I can't imagine a casino worth over $500m just persists in the long run without some kind of government intervention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "March 28, 2023, 11:38:05 AM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. By this time it's going to be difficult to run a platform that is not transparent to government or to any crypto regulators. We are now in a point wherein they are hot on our tails because maybe they want to tax or simply doesn't want to give their control.And as you have said, with CBDC just around the corner.It's just a matter of time that they will take control of us, through monitoring, including our gambling habits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "March 28, 2023, 11:40:55 AM",
      "body": "If we are referring to that kind of casino, then it is called an illegal casino. Only the government can make the business legal, and you need to obtain the necessary permits to make your business legal, which means you are under the supervision of the government.Take crypto, for example, it's supposed to be anonymous, but look what is happening now. In fact, there's what we call a DEX (decentralized exchange) before, but look where they are now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "March 28, 2023, 12:03:44 PM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? Most online gambling platforms I believe are operating on either a decentralized network or on a semi decentralized network - Edgeless casino and TrueFlip casino.QuoteI know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. There is nothing wrong with accepting CBDC. But I doubt they will. I am pretty sure that it is not going to be mandatory as the option to fund your wallet with other cryptocurrencies will still be allowed. They will still be able to address the issues of fraud and transparency etc. If you feel that your personal information will be revealed by the casino if you use the CBDC when look to other casinos where you do not need to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "March 28, 2023, 12:08:34 PM",
      "body": "Yup. That was back then though I think it should still be possible now, it might be kind of hard to stay anonymous without the knowhows, and it's only a matter of how \"long\" can it actually stay up since it WILL be brought down if the government was able to see how it can gain traction with their citizens, especially if it was a country that prohibits gambling. I highly doubt a registered crypto casino will need to accept CBDC's, they were well and fine enough with how they work right now with only specific cryptos being accepted after all. And even then, it will only remain as an option in the casino, and not the sole coin that people are able to use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "March 28, 2023, 12:08:56 PM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AM so that is what makes me think if it's possible to run a decentralized gambling platform at all. For now, it's clear that all gambling-based companies will agree to the government's offer. The aim is for them to operate freely under supervision, indeed ideally a decentralized casino makes a lot of sense. However, if I were a casino owner and had to escape government scrutiny, the risk would be considered illegal.In fact, to stay safe and mutually beneficial to each other, the casinos surrender their rights to the government. Furthermore, the government asks for a percentage of the profits, so as long as we can benefit each other, that's the best course. Instead of being an enemy of the government and operating invisibly, the casinos would indirectly become targets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "March 28, 2023, 12:30:14 PM",
      "body": "it very likely could run without government knowledge. after all it's decentralized casino that usually preferred by users who are not happy with KYC, to me both are the same whether it's a decentralized casino or a casino that is officially associated with the government. although the regulations are stricter but as long as it can be trusted I have no problem, I've only seen decentralized casinos very rarely last a long time usually they go bankrupt faster and disappear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "March 28, 2023, 12:45:23 PM",
      "body": "Quote from: KiaKia on March 28, 2023, 09:35:21 AMIs it possible to run a decentralized gambling platform? I know that all popular gambling platforms have no choice but to be transparent to the law to have a steady business running, but with the introduction of CBDC and yes a registered gambling platform has no choice but to accept CBDC too, and I don't trust this centralized currency, I believe CBDC will have the capability to monitor incoming and outgoing funds, so that is what makes me think if it's possible to run a decentralized gambling platform at all. Before yes where cryptocurrency based casino has not been taken seriously by government, but since crypto is gaining fame together with businesses using this including casino they are  been strict upon regulating it maybe for questionable reasons about it. But they could still run without government awareness but the question there is those gambler would trust them especially they know if the casino is avoiding government regulation? For sure no since as I seen this became a new trend to be seen as good indicator that a casino is legitimate and not a shady one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "March 28, 2023, 01:30:56 PM",
      "body": "It is possible. However, the question is if it will be sustainable for the long run, not just in the beginning. Establishing a business in general is   risky and requires a lot of effort. It is a tedious task that needs to be looked upon every now and then to monitor the process from the conceptualization to the implementation. Running a business usually requires permit and other documents to legally operate. While it is possible to make a casino that is decentralized in nature, just how bitcoin started, due to multiple cases on scams and schemes will make it difficult for people to trust a website that just happen to appear out of nowhere, not listed in any license operators and isn't at the reach of the government for monitoring purposes. It could be a good idea especially for those people who aren't fond of the KYC process, however, trust issues will arise from lack of documents and proof of legitimacy. But the moment you establish the name and reputation of the casino, it will just all fall into place. Only that it will be a long journey for a casino website to be acknowledged as reputable and worth trying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}