{
  "id": "topic_5466970",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "September 16, 2023, 08:13:58 AM",
  "content": "My piple, make una shift come make we reason this matter wey dey ground bcos many Nigerian na hustler yet Dem dey suffer. I wan talk about wetin dey cause this kind thing , well, no be all I wan talk, na just the one wey dey very important I wan make we reason am . Shae una no say almost 80% of our youth na ihn dey gamble their money with one platform or the other with d hope say Dem go make big money one dey, many person don gamble so tey Dem no fit buy food for their own mouth again. This same issue don scatter relationship and marriage, many student too wey dey addicted to gambling don drop out for school, some papa no fit send pikin go school bcos Dem dey find magic wey go happen through gambling.Pesin wey dey gamble ihn money more ten years with no result, wetin go be in later result, na abject poverty. As we dey talk am so, some people dey wey be Bitcoin investor and na gambler Dem be, na gambling Dem dey waste their profit from bitcoins. Na why gambler no fit get money be this, when Dem win any money after plenty days, weeks, months or years of trying , Dem go hope say make Dem use the money play bigger one if anything go fit drop. Na so them go play until some go sell their property. My piple, wetin I wan make e clear to us be say, to dey gamble no be wey to make money wey dey sure bcos if we calculate all the money wey u don use since you start to dey gamble, e reach build house or send pesin go university. Everybody fit choose wetin Dem go do ooo, no be by force but me just get small advice say either you find better business or you avoid addiction and always check if u no dey loose so dat u go fit take correct measures.My piple wetin una think for this matter wey I just yan so",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466970",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 16, 2023, 08:53:08 AM",
      "body": "Quote from: Forever101 on September 16, 2023, 08:13:58 AMMy piple wetin una think for this matter wey I just yan soI can not agree more than this. A good suggestion is to use 1% of monthly income to gamble. If you are earning ₦100000 monthly, use just ₦1000 to gamble. Some people may not agree with me, but if you want to enjoy gambling, us the amount of money that you can afford to lose to gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "September 16, 2023, 11:16:40 AM",
      "body": "Quote from: Charles-Tim on September 16, 2023, 08:53:08 AMQuote from: Forever101 on September 16, 2023, 08:13:58 AMMy piple wetin una think for this matter wey I just yan soI can not agree more than this. A good suggestion is to use 1% of monthly income to gamble. If you are earning ₦100000 monthly, use just ₦1000 to gamble. Some people may not agree with me, but if you want to enjoy gambling, us the amount of money that you can afford to lose to gamble.This one you talk na just the only way to use the enjoy gambling be that. And for people wey see gambling as fun this idea go sink well inside them for them to use am according to how them dey earn as salary.Nah those wey take gambling as source to use make money go see this idea as something wey hard to do, the excuse go be say 1% too small nah. And that kind talk na dey make dem spend on beyond what they can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 16, 2023, 11:23:06 AM",
      "body": "Na lack of strategy dey cause the kind failure wey people dey fail for gambling. Make we no forget say plenty successful gamblers dey for Naija, example is Mayor of Ekiti. He is a successful gambler that have dealt with several bookies on various occasions. I know say grace follow but person gat apply strategy because na lack of strategy go make person take all him money play gamble when you know say na game of probability.E dey pain me when I see the kind attitude some people dey form untop gambling... your family never chop you carry the small money you get go dey play gamble. Naija no too dey play gamble self... visit US and see how gambling and casino centres plenty and many people dey play am... but e come be say our people no add sense untop am. For Naija now, if them know say you dey play gamble, the first thing them go say you be useless and irresponsible man. E no suppose be like that. Make people dey add brain sha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 16, 2023, 12:46:44 PM",
      "body": "Quote from: Forever101 on September 16, 2023, 08:13:58 AMNa why gambler no fit get money be this, when Dem win any money after plenty days, weeks, months or years of trying , Dem go hope say make Dem use the money play bigger one if anything go fit drop. Na so them go play until some go sell their property. My piple, wetin I wan make e clear to us be say, to dey gamble no be wey to make money wey dey sure bcos if we calculate all the money wey u don use since you start to dey gamble, e reach build house or send pesin go university.  The funny part be say them get the belief say if them put a bigger amount, a bigger win go come their way and this mentality dey blind them from taking their winnings home. Gambling nah something wey if you no get self control, you fit enter sapa mode in a matter of seconds. Just like Bitcoin investment, if you dey gamble understand say nah risk you dey take and nah 50-50 something, e fit enter and e fit cut but some dey believe say if e no enter the first hand, e go possibly enter the second one.  This kind thing nah sometin wey dey worry for society but how we wan take stop am? I feel that nah individual race.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 16, 2023, 01:12:18 PM",
      "body": "Quote from: Odohu on September 16, 2023, 11:23:06 AMMake we no forget say plenty successful gamblers dey for Naija, example is Mayor of EkitiYou do not have to refer to successful gamblers, it is just a way to encourage people to gamble more and more people will lose money to gambling. If you are not offering gambling service but depending on playing gambling to earn more, that is a fast way someone is driving himself to a remorseful life of depression. Quote from: Odohu on September 16, 2023, 11:23:06 AME dey pain me when I see the kind attitude some people dey form untop gambling... your family never chop you carry the small money you get go dey play gamble. Naija no too dey play gamble self... visit US and see how gambling and casino centres plenty and many people dey play am... but e come be say our people no add sense untop am.Betting agents are in almost every streets in my town. The Southern part of Nigeria is full of gambling agents. Gambling is allowed in many part of the North and many Nigerians are gambling there. Nigerians also are gambling, we do not have to compare because this thread is not a about comparison.Quote from: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8274406/#:~:text=Many%20Nigerians%20view%20gambling%20as,these%20people%20were%20daily%20gamblers.Many Nigerians view gambling as a harmless leisure activity: a recent study of the Nigerian general population found that 36% of adult respondents had gambled and 53% of these people were daily gamblers.If most of our women are excluded (because most of them are not gambling), that percentage is huge. Most young guys in my street are gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 16, 2023, 01:15:43 PM",
      "body": "Make I also address this issues as little I can because na small small we dey take leave bad attitudes. Somehow gambling na investment but when we noticed say nothing dey come out for months or weekly we supposed paused that investment because no results instead our people go still say hope dey while you and I know say no hope.The biggest mistake we dey always make be say we dey always think say we get time but deeply bro we no get time again, have you considered your real age and think of how many years you need to hustle more to raise your own personal family? Yes this one go vex some people but I go take am say na unserious element go pick offense say why I dey talk like this.Everything na planning, if you plan you self and your years you go see say better go come out of your works and things you budget. Most at times we go just feel say if we keep gambling one faithful day we go blow but make I tell you the truth, those people wey get that site no be mumu people them know how hard e dey for people to win any bet because, sometimes me dey reason am too the way you predicts games no go be the out and sometime you go dey surprised how come.Yes, see wetin dem dey do be say them dey always make things dey real for eyes but within their system them know wetin them dey do. But people wey no dey reason out of the box no go understand the logic behind the thing, although I no go say me na expert for gambling but after I take sit come seat down I come know say this one na destiny waster so e go better you shift my thinking to something much better than putting hope for money I know I can't even see for 10 years to come.Another again na laziness dey cause am why because you see say you don graduate from school with first class or distinction and you see say you no fit start work with at least 30k to 50k, why can't you manage and at the time while you keep praying for a bigger Job or have you also forgotten that those small works or jobs gives you exposure and connect you with a better people in your field of work? Yes na true me na living example wey get exposed through smaller works to a much higher works, e for say I talk say for what should I go do work of 30k or 50k I for no get lifting and keep in mind that is only God that blesses man, and he can only blessed with the work of thy hands. So like this if you no get at least small job to do how Him fit carry blessed? No way!So I go say make we remove pride and greed accept reality and know that you have things on your neck to tackle instead of waiting for an awoof money to just hit your balance for place a simple bet, bro things doesn't work that way and even though you must gamble do not capitalized on it otherwise you can't go further to hustle aside it rather you would always want to wait till your luck counts by then you have wasted 10 years for nothing without skills.Make I rest my case before some people go pick offense but the truth is always bitter and make we no see every small opportunities as a life changing ones because you should know that good things doesn't comes so easily so do not be attracted to investment platforms as well since most of the scammers are really using that aspect to scam people online and in real worlds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "September 16, 2023, 01:41:45 PM",
      "body": "Quote from: Adbitco on September 16, 2023, 01:15:43 PMEverything na planning, if you plan you self and your years you go see say better go come out of your works and things you budget. Most at times we go just feel say if we keep gambling one faithful day we go blow but make I tell you the truth, those people wey get that site no be mumu people them know how hard e dey for people to win any bet because, sometimes me dey reason am too the way you predicts games no go be the out and sometime you go dey surprised how come.Normall those site won't make you win easily but instead,  they make you have hope of winning by choosing randomly to give a massive win. However,  to keep you gambling they will pay you little back out of the money lost to them by you . So this will always raise your hope that you will win one day. However if it come to past and you are part of the random  people then count it a jackpot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 16, 2023, 01:48:40 PM",
      "body": "Quote from: promise444c5 on September 16, 2023, 01:41:45 PMQuote from: Adbitco on September 16, 2023, 01:15:43 PMEverything na planning, if you plan you self and your years you go see say better go come out of your works and things you budget. Most at times we go just feel say if we keep gambling one faithful day we go blow but make I tell you the truth, those people wey get that site no be mumu people them know how hard e dey for people to win any bet because, sometimes me dey reason am too the way you predicts games no go be the out and sometime you go dey surprised how come.Normall those site won't make you win easily but instead,  they make you have hope of winning by choosing randomly to give a massive win. However,  to keep you gambling they will pay you little back out of the money lost to them by you . So this will always raise your hope that you will win one day. However if it come to past and you are part of the random  people then count it a jackpot.Na wetin make people no fit leave gambling because when them see say them get little winning their brain go rise and them go think say na better thing be that, make we always remember say this gambling no come today and e go dey here we still go as well if you used brain play you no go become addicted gambler or seeing yourself as someone who often make looses when ever you places bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 16, 2023, 01:56:53 PM",
      "body": "Quote from: Charles-Tim on September 16, 2023, 01:12:18 PMQuote from: Odohu on September 16, 2023, 11:23:06 AMMake we no forget say plenty successful gamblers dey for Naija, example is Mayor of EkitiYou do not have to refer to successful gamblers, it is just a way to encourage people to gamble more and more people will lose money to gambling. If you are not offering gambling service but depending on playing gambling to earn more, that is a fast way someone is driving himself to a remorseful life of depression. I don't know if you see gambling as entirely bad, if that be the case, I do not share that notion with you because gambling is not an entirely bad business... it is just the approach of some people that make it look as if it is bad. Come to think of it, gambling have been there right from time, from pools to papa Ijebu, and now betting and casinos, it has always been there. People have made successes in it. I still maintain that if proper strategy is applied, gambling can be a very profitable venture. I just gave one example of successful gambler, the list is long.... I even know those who are not ready to work for anybody because they are making it big from gambling. It is all about strategy. I know it is in human nature to criticise what they don't understand so I will not be surprised if many people condemn gambling.... but for the records, gambling is business that you can win with the right strategy. One good thing you should know about gambling is that it gives people hope which is very good for our health as depression is sometimes the absence of hope",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "September 16, 2023, 04:26:35 PM",
      "body": "The problem here be say plenty pple no get work for we country, e come be say Gambling na him be the surest way to make a living. Wetin dey happen here be say, If you come start gambling and you lost the first time wey you play,  you go definitely dey tempted to play again make you recover your first money, and you don enter wahala be that. Another thing wey make people dey play gamble and dem no dey win money be say,  Imagine how person go take #100 go stake up to 15 -50  games for one slip dey expect say him go win 1 million and become rich overnight, na him make plenty people dey lose money. I been fall victim of this before until I come learn my lessons, if you wan profit small without losing all the time, stick to playing one or two-games alone to always avoid cut one and stake with a reasonable amount of money u can afford loose. Make you no fear , if you win you win , if you lose you lose, I assure you will see an improved result if you try this method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "September 16, 2023, 06:02:07 PM",
      "body": "Quote from: promise444c5 on September 16, 2023, 01:41:45 PMNormall those site won't make you win easily but instead,  they make you have hope of winning by choosing randomly to give a massive win. However,  to keep you gambling they will pay you little back out of the money lost to them by you . So this will always raise your hope that you will win one day. However if it come to past and you are part of the random  people then count it a jackpot.That's nothing but the truth, most gamblers always think they are smart. The person that owns the gambling companies established them for their own interests and they have their ways of keeping their users with them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 16, 2023, 11:54:33 PM",
      "body": "Quote from: Forever101 on September 16, 2023, 08:13:58 AMMy piple, wetin I wan make e clear to us be say, to dey gamble no be wey to make money wey dey sure bcos if we calculate all the money wey u don use since you start to dey gamble, e reach build house or send pesin go university. Gambling so no be wetin you go call investment, just because people dey use am cashout no mean say na investing. E just belike yahoo, because say people dey use am cashout no make am business. Gambling na wetin we suppose dey use to catch fun and entertainment but as dem talk, dis days na wetin you dey do dey enjoy wey dey give you joy na wetin suppose dey pay you too that's why dey say turn your hobby into your job and dat's why many youth dun dey carry ring light every dey do influencing job because dey spend most of their time on social media and they want to be making money from it. Nobi everybody dey lose for gambling so if e dey favor you no wahala you fit continue to dey do am but just try make e no become an addiction problem because e go run you dry. Addiction no be for only people wey dey lose oh because as you dey win so, you need dey watch ur back too.As you dey wonder where people dey see money gamble, you dun forget say gambling no need much money so, the least 100 h to 1k you dun knack you better odds wey if e sure for you, you fit carry better money go house. Job no dey my broda and people dey find wetin dem go use hold body abi you want make dem go steal or dey uptain people upandan. Gambling na wetin boys dey carry hold their side and although e no dey always click for dem but dat one time wey e enter they give dem better joy and dem get hope say e go click another day. Quote from: Forever101 on September 16, 2023, 08:13:58 AMEverybody fit choose wetin Dem go do ooo, no be by force but me just get small advice say either you find better business or you avoid addiction and always check if u no dey loose so dat u go fit take correct measures.My piple wetin una think for this matter wey I just yan so.So if everybody fit choose wetin dem go do, whey you come dey worry yourself, dem know where there weight reach so allow dem make dem carry their cross because you no go carry am for dem. Gambling no be bad thing, difference dey between bad things and good things and also things wey be say dem just dey their dey but when you no do am well e go bad for you but when you run am well e no go good for you and na so gambling just dey. You suppose know ur limit and arrange yourself well so you no go go do pass yourself come dey blame the innocent gambling people dem wey just dey try make end means too and dey provide the platform for you to take run your matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 17, 2023, 12:56:38 AM",
      "body": "The possibilities to ruin a business, lavish money or even living a wasted dey very entertaining by addicted gamblers.I take this for an experience shared is a teacher so to everyone, no wait to sit before the black or white boards or even sitting before a counselor before u fit learn or pick points way dey necessary to u.1 of the worse categories of persons to entrust money or property for n hand na addicted gambler (s) them dey lost, consciousness of trustworthy if u entrust any with dem.I remember 1 of my friend way him sister entrust her #60K with him, just within 5 days him gambled all the money including him phone to stake bets and lost all.Na then him eyes opened and in few days him sister ask am to send am #10K out of the money and hold the rest but to bo avail. Him come dey run Helter skelter looking for solutions til person borrow am #5K but guess what? Him use the #5K go bet again with the believe say him go realize all that of him sister money wasted in the gambling.Yet him stil dey tell me say him believe say him to be big man through gambling and him no fo stop gambling til him win bigly. Jesus, who do this one?My people eehh... See! Spirits of possessions dey on many kind oh and this gambling stuff own dey very high. Una know say e get how u go loose or dey committed to  gambling e go yield u lot of regrets?Battles of addicted gambler (s)*Ruin of resources *Looses of funds and properties *Engagement to borrowing*Attracted to stealing*Lost of personalities/carelessness *Untruthful*Frustrations/mental breakdowns *Lead to suicidal  etc.To my best research, addition is something that almost gone to stay in for a life time depending the stage it was before battling to let go otherwise, you can fight an addition for years after years without getting off 📴 it. So  I will bring this strategy up in accordance to your addition but I will be specifying on the gambling.Characters to be considered to get out of get gambling addictions*Stay of the environment*Stay of the people that influences you*If you must have memories towards the path, let it be the negative side of it so you don't find good reasons to embark.*Don't engage on a challenge/debate towards the path*Don't clamour of an ex. expert but a shitty fucked up ass.*Tend to be a good leader of followers. Possibly an offspring.Addiction is indeed a battle to swim out of and I hope we have got to learn by what happened to others without expecting them to happen to us before we could say we have got experience?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adams0001",
      "created_time": "September 17, 2023, 02:37:57 AM",
      "body": "Quote from: Franctoshi on September 16, 2023, 04:26:35 PMThe problem here be say plenty pple no get work for we country, e come be say Gambling na him be the surest way to make a living. Wetin dey happen here be say, If you come start gambling and you lost the first time wey you play,  you go definitely dey tempted to play again make you recover your first money, and you don enter wahala be that. Another thing wey make people dey play gamble and dem no dey win money be say,  Imagine how person go take #100 go stake up to 15 -50  games for one slip dey expect say him go win 1 million and become rich overnight, na him make plenty people dey lose money. I been fall victim of this before until I come learn my lessons, if you wan profit small without losing all the time, stick to playing one or two-games alone to always avoid cut one and stake with a reasonable amount of money u can afford loose. Make you no fear , if you win you win , if you lose you lose, I assure you will see an improved result if you try this method. Na the truth be that, people dey play gambling because dey no get work for the country and the country done hard now, but i just dey imagine person dey use 100# play almost 30 game to win big money that one go hard before he happen, if no be say you be lucky person the best thing person fit do be say make him dey stake 2odd and double your money that one dey sure pass then playing 15 to 30odd to start thinking about how can the games enter.people were dey play gambling na the money dey fit lose dey dey use play bet,  anything for this life na just risk we dey take anytime to get profit, dey get people were sabi play gambling very well and dey use to win anytime dey stake money for bet, because even gambling too you go get knowledge about it very well before you stake money. i just believe say if you no take risk for this live you he go hard for you to be successful person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Salahmu",
      "created_time": "September 17, 2023, 11:28:58 AM",
      "body": "When we talk about gambling we shouldn't channel our view point on one direct but we should also need to evaluate the positive outcome of gambling to others because just as you have a real job were you go every morning other sees gambling as there real time job which is actually paying them irrespective of there losses, there are persons who gamble for a living and may have achieve a great things for himself through gambling so if someone like is advising about gambling he encourage people to join it but shouldn't allow yourself to be addicted to it. While those that doesn't gamble always sees a gambling as a means of losing money, gambling is only good for those that have self discipline were as they cannot exceed there targeted deposit and withdrawal weather losing or winnings, in summary gambling is a vise versa because is neither good nor bad is just based on individual mindset about gambling because in as much as people are losing money others are also making money so what works for others may not work for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "September 17, 2023, 02:45:57 PM",
      "body": "Quote from: Salahmu on September 17, 2023, 11:28:58 AMWhen we talk about gambling we shouldn't channel our view point on one direct but we should also need to evaluate the positive outcome of gambling to others because just as you have a real job were you go every morning other sees gambling as there real time job which is actually paying them irrespective of there losses, there are persons who gamble for a living and may have achieve a great things for himself through gambling so if someone like is advising about gambling he encourage people to join it but shouldn't allow yourself to be addicted to it. While those that doesn't gamble always sees a gambling as a means of losing money, gambling is only good for those that have self discipline were as they cannot exceed there targeted deposit and withdrawal weather losing or winnings, in summary gambling is a vise versa because is neither good nor bad is just based on individual mindset about gambling because in as much as people are losing money others are also making money so what works for others may not work for you. If you are seeing it from that point, I will like to ask you, how many successful gamblers do you have in your area in a year. Gamblwrs in my areas have work and they keep wasting their money on gambling every year. For the past 20years, there has not been a record of anyone becoming successful through gambling in my local government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "September 17, 2023, 03:05:35 PM",
      "body": "Quote from: Forever101 on September 16, 2023, 08:13:58 AMMy piple, wetin I wan make e clear to us be say, to dey gamble no be wey to make money wey dey sure bcos if we calculate all the money wey u don use since you start to dey gamble, e reach build house or send pesin go university. My broda, I like this your advice o. And I agree with wetin you yarn. But one thing be say, gamblers no go ever hear word...and as our people talk say fly wey nor dey hear word go follow dead bodi enta grave. E go hard to for gamblers to take another person advice because we don normalize am now. For all over social media people dey drop game and whatever have you. E too plenty. I follow concur with wetin Charles-Tim talk but 1k per month for 100k salary nor go fit make sense to any gambler. Las las Sha be best advice wey a gambler fit get na the one him give himself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 17, 2023, 06:06:07 PM",
      "body": "Quote from: Forever101 on September 16, 2023, 08:13:58 AMMy piple wetin una think for this matter wey I just yan soThe truth be say lack of job, don make youths dey look for any means to survive without any qualification. Most gamblers wey think say gambling na investment for them mostly, na the only hope wey them go fit use hamma. Wetin I see be say, everybody won hamma, but them no know how to go about am, especially the ones wey no won involve their hands for bad thing. This na e make you see say many youths dey into gambling, but them forget say you can't win the house hedge and many of them don already become addicts wey make, e hard to counsel them and make them listen. I no see gambling as any investment rather I see am as a means of entertainment and if you know understand this, then gambling go be a means of wasting your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "September 17, 2023, 08:59:46 PM",
      "body": "Well, any body way say gambling na part of investment, nai be say that person either the gambling they favour am or the gambling they gain from am, e get 2 things way they involved:- 1, lose and 2, win, if you no lose for gambling you go win, but I know come understand why some gamblers no they think am like that.Another thing be say e no good to they addicted to gambling, for this country now people done put their hands for different things and some they do business, investment and some go into gambling, now if you go imagine well those people way no get business but any little money way enter their hand them go use am go bet game, how those people go take progress if them no win bet? Although say some of them gambling fit done help change their life but the once way gambling done scatter their life plenty pass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}