{
  "id": "topic_5444850",
  "title": "Dzwaafu11",
  "author": "Dzwaafu11",
  "created_time": "March 14, 2023, 10:52:15 AMLast edit: March 16, 2023, 07:19:27 PM by Dzwaafu11",
  "content": "I'd like to take this opportunity to share some very important advice with my fellow newcomers in this community, because since joining, I've learned a lot and gained some experience, and I'm confident that if my fellow Newbies get it right, the forum will be the best place they've ever been.* As a newcomer to bitcoin/cryptocurrency and this community, you must abide by the forum's rules and regulations. This is why the vast majority of newcomers visit these forums only to leave once they realize they can't follow the forum's rules and regulations; whereas the rules are laid out to have a standard forum, protect the forum from any obstacles, and maintain the forum's reputation.* Some people believe that these forums are simply places where we can come and succeed in life if we participate in them. This is not the case; if you come here expecting to make quick money, you may end up not learning much in the forum, and you won't be able to enjoy a better investment in bitcoin without the fundamental knowledge.Some basic tips we beginners need to take into consideration to avoid costly mistakes 1. High quality post: One of the most important skills to learn in these forums is how to write meaningful content. If you can't write good content as a newcomer, you would be considered a shitposter in the forum and end up with nothing in your posts. I'm still not sure what a quality post is because there's so much content on this topic with different definitions. All I can say is that we beginners should avoid spamming by making our content meaningful.2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org. If you do plagiarism and they catch you, you will be permanently banned, regardless of your forum rank, and this is what is affecting those of us who are new to the forum. Most of the time, we fail to read the forum rules until we commit an offense and are punished; Therefore, beginners need to avoid Plagiarism.3. Inadequate understanding of cryptocurrency: The majority of newcomers to cryptocurrency do not understand it well enough to profit from it. If you don't understand how cryptocurrency works, you risk losing your assets quickly. You must learn from the forum thoroughly before investing in Bitcoin or cryptocurrency in order to reduce risk.Finally, I intend to create this thread based on the little experience I have gained from the forum. I decided to share the mistakes I have observed we beginners making that have been affecting us in the forum.I welcome corrections and additional suggestions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444850",
  "comments": [
    {
      "author": "notocactus",
      "created_time": "March 14, 2023, 11:22:05 AM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org.It is untrue.In third-world nations, plagiarism is not a serious matter even in university, college, research articles or business companies.In forum globally, Bitcoin talk forum is a most serious forum about plagiarism but unfortunately plagiarism cases nowadays tend to be handled considerably softer than the past especially in 2018 or 2019.It was introduced circa 2016 and second chance started to be initiated since 2018.explanation in 2018 and became more often applied in 2019. In that year, theymos started to give global moderators' right to handle plagiarism cases and award second chance for deserved members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "March 14, 2023, 11:22:52 AM",
      "body": "All your points are valid, thanks for that, and in addition, it's good for all to be sure that they are natural and not chase anything. Do not post when you should not post, by forcing it, one is bound to make one or two mistakes.Also, there is no excuse for plagiarism and not knowing the field you want to discuss about. And I believe that the issue of the low-quality posts is in two categories, there are some that are poor in the English language, while some are just in a hurry to make a post. The former is forgivable since they are not good in the language, and when one reads their writeup, it should be easily detected.While the latter is so bad, in doing so, they will only be reducing their reputation which is not worth it. So why the post?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 14, 2023, 11:31:39 AM",
      "body": "Quote from: tranthidung on March 14, 2023, 11:22:05 AMQuote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org.It is untrue.In third-world nations, plagiarism is not a serious matter even in university, college, research articles or business companies.I take exception to this remark. Plagiarism is basically about honesty. And honesty doesn't have anything to do with how developed a country is. I am coming from an underdeveloped country and plagiarism is a capital sin in my university. As a matter of fact, I have a friend who was expelled not only from the political science program but from the entire university for inserting a plagiarized paragraph in his thesis proposal. He was never able to graduate. OP, plagiarism is indeed unacceptable anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "March 14, 2023, 11:41:26 AM",
      "body": "Quote from: tranthidung on March 14, 2023, 11:22:05 AMQuote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org.It is untrue.In third-world nations, plagiarism is not a serious matter even in university, college, research articles or business companies.How? To us who are still new members, plagiarism is a very serious issue because it has a complication that we will completely ban not only new members but any rank someone has in the forum once he/she plagiarizes is banned and that account is gone.When you mention university, college, and other places, such as school, can you borrow someone's book and copy their notes without their permission? It is plagiarism to use another person's information without their permission.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 14, 2023, 12:28:17 PM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 11:41:26 AMIt is plagiarism to use another person's information without their permission.Please don't generally speaking like this. Let's discuss plagiarism in Bitcointalk only.Here, you don't have to ask anyone permission. Just leave a quote or a source link and it's enough.Quote from: Darker45 on March 14, 2023, 11:31:39 AMI take exception to this remark. Plagiarism is basically about honesty. And honesty doesn't have anything to do with how developed a country is. I am coming from an underdeveloped country and plagiarism is a capital sin in my university. As a matter of fact, I have a friend who was expelled not only from the political science program but from the entire university for inserting a plagiarized paragraph in his thesis proposal. He was never able to graduate. Depends on local rules on plagiarism as well as how serious it is enforced. It is only started in third world nations and I am sure with you punishment there would be less seriously strict than in developed nations.QuoteOP, plagiarism is indeed unacceptable anywhere. Again, depends on how laws are enforced in that nation. If law means mostly nothing by lack of serious enforcement, law if has still means nearly nothing for locals. They don't obey laws if government don't make punishment. Same goes for plagiarism.I agree that we can say plagiarism is unacceptable everywhere in moral aspect. In legal aspect, it depends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 14, 2023, 01:03:33 PM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM1. High quality post: A quality post is a post that is written in a simple and correct English which helps to answer a question or give information about a specific topic. It doesn't need to be bulky or comprehensive but it should cover the specific area it is tends to deal with. Some people now use AI to right their post which is not the right thing to do Quote2. Plagiarism: Plagiarism is claiming the ownership of an information. It is the act of coping other people's writings without referencing or quoting them. In Bitcointalk you need to show that what you posted is not you idea by adding the source of the information.Quote3. Inadequate understanding of cryptocurrency: You can learn more about Bitcoin by staying in the forum and keep reading from it. Any novice that joins the forum and is committed to learning with gradually become knowledgeable about the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 14, 2023, 01:30:06 PM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AMSome people believe that these forums are simply places where we can come and succeed in life if we participate in them. This is not the caseFor the fact that you're not into ponzi schemes doesn't mean you cannot still make it in life on a quicker track through this forum, this platform is the only community I've ever seen that guide one through a right path in life because you learn here in different aspects, you build a career here, you participate in a campaign if you so wish, you meet people and relate, you got exposed to the real world here because this platform constitute every potential and positive thoughts thinking people allover the world with a common goal, which is bitcoin and many other opportunities that may come through that while being on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 14, 2023, 01:39:57 PM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM~snip1. High quality post: One of the most important skills to learn in these forums is how to write meaningful content. If you can't write good content as a newcomer, you would be considered a shitposter in the forum and end up with nothing in your posts. I'm still not sure what a quality post is because there's so much content on this topic with different definitions. All I can say is that we beginners should avoid spamming by making our content meaningful.~snipIt will not be so easy for beginners to fulfill this condition. The quality of the posts will directly depend on the background of the person. If this is not the case, then it is almost impossible to create high quality posts and this will have to be learned. I will not say that this is a super-difficult task, but depending on the abilities of people, it will take a different amount of time to master. Everything new is always something to learn. So, for many beginners, writing low-quality posts is almost inevitable and they all have to go through this path on their own. Someone will improve, but someone will not be able to and will abandon the forum (or become a shitposter).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "March 14, 2023, 02:10:42 PM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org.Obviously, plagiarism is not acceptable here, @mprep has included plagiarism in one of the forum rules.Quote from: mprep on July 21, 2014, 05:27:51 PM33. Posting plagiarized content is not allowed.[e]Plagiarism needs to be fought or even eliminated in forums. For Newbies who want to avoid accusations of plagiarism, they need to attach the original source of the writing made on this forum, whether it's in the form of information or pictures taken outside the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "March 14, 2023, 06:28:43 PMLast edit: March 14, 2023, 06:42:27 PM by Nheer",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org. If you do plagiarism and they catch you, you will be permanently banned, regardless of your forum rank, and this is what is affecting those of us who are new to the forum. Most of the time, we fail to read the forum rules until we commit an offense and are punished; it happened to me as well; at the time, I copied some content from the internet and posted it here in the forum without realizing it was an offense. Therefore, beginners need to avoid Plagiarism.When I first came across the plagiarism thread in the META section of the forum, I saw many newbies fall victim to plagiarism, possibly due to ignorance of forum rules or due to negligence, and they end up being banned. Plagiarism is a serious issue that is seriously frowned upon here. No matter how new you are to the forum, everyone is expected to read the pinned threads and the forum rules before posting as a new user.Quote from: m2017 on March 14, 2023, 01:39:57 PMIt will not be so easy for beginners to fulfill this condition. The quality of the posts will directly depend on the background of the person. If this is not the case, then it is almost impossible to create high quality posts and this will have to be learned. I will not say that this is a super-difficult task, but depending on the abilities of people, it will take a different amount of time to master. Everything new is always something to learn. So, for many beginners, writing low-quality posts is almost inevitable and they all have to go through this path on their own. Someone will improve, but someone will not be able to and will abandon the forum (or become a shitposter).Just as @m2017 stated, a person's background affects the quality of their posting. It will take some time for a beginner to fully understand cryptocurrencies when he is fresh to the concept in general. Only after that would he or she find it simple to post something worthwhile. Those who are committed and eager to learn will undoubtedly get better with time, but not everyone will be able to cross this bridge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ketesnuko",
      "created_time": "March 15, 2023, 10:48:08 AM",
      "body": "At first, I thought this is about what beginners need to do to avoid getting scammed in the crypto space, but it's all about the forum rules which is a good reminder for newbies, this forum is for learning about crypto and it won't benefit anyone that breaks the rules only to be ban out of here, thanks to this forum I was able to learn a lot about crypto and how to stay safe using a crypto wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "March 15, 2023, 04:34:03 PM",
      "body": "Quote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM1. High quality post: One of the most important skills to learn in these forums is how to write meaningful content. If you can't write good content as a newcomer, you would be considered a shitposter in the forum and end up with nothing in your posts. I'm still not sure what a quality post is because there's so much content on this topic with different definitions. All I can say is that we beginners should avoid spamming by making our content meaningful.One issue with newbies having to post with high quality is their desire to feel included in the forum despite not knowing much about the forum rules and regulations. They simply want to post whenever they feel like it, even if they have no knowledge of the topic, in order to increase their post count and activity. Everything in this forum is gradual and steady; learn and understand before you try to tell for anything.Quote2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org. If you do plagiarism and they catch you, you will be permanently banned, regardless of your forum rank, and this is what is affecting those of us who are new to the forum. Most of the time, we fail to read the forum rules until we commit an offense and are punished; it happened to me as well; at the time, I copied some content from the internet and posted it here in the forum without realizing it was an offense. Therefore, beginners need to avoid Plagiarism.Plagiarism, as I understand it, is the act of copying someone else's work without acknowledgment and reference to his/her work. I'm sure the rules apply here as well. Many users obtain information that will enlighten the forum users here from other sites, and if the author of the post is acknowledged, you will not face a plagiarism ban. It's good that you learned your lesson about plagiarism in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "March 15, 2023, 05:17:04 PM",
      "body": "Quote from: Fiatless on March 14, 2023, 01:03:33 PMA quality post is a post that is written in a simple and correct English which helps to answer a question or give information about a specific topic. It doesn't need to be bulky or comprehensive but it should cover the specific area it is tends to deal with. Some people now use AI to right their post which is not the right thing to do Who said posts that are written in only English are classified under quality posts? There are many local board posts which are written in their local languages but are really good post.The main thing is it should be having useful information and be on topic which adds on some more content to the topic.So there are many ways under which we can say the post was quality one not only in English.Quote from: Ndabagi01 on March 15, 2023, 04:34:03 PMOne issue with newbies having to post with high quality is their desire to feel included in the forum despite not knowing much about the forum rules and regulations. They simply want to post whenever they feel like it, even if they have no knowledge of the topic, in order to increase their post count and activity. Everything in this forum is gradual and steady; learn and understand before you try to tell for anything.The newbies need to realise that this is just an open discussion forum where they can share their ideas and obtain knowledge from other members on any topic they are interested in but they make things complex in rush of ranking up and gaining merits fast which is first mistake.Slowly you will gain knowledge if you are interested in but treat this as normal forum not too much to follow up right?Quote from: Ndabagi01 on March 15, 2023, 04:34:03 PMPlagiarism, as I understand it, is the act of copying someone else's work without acknowledgment and reference to his/her work. I'm sure the rules apply here as well. It is against the forum rules and if you are caught in plagiarism your account will be banned so don't involve yourself in such things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "March 15, 2023, 08:41:09 PM",
      "body": "Quote from: m2017 on March 14, 2023, 01:39:57 PMQuote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM~snip1. High quality post: One of the most important skills to learn in these forums is how to write meaningful content. If you can't write good content as a newcomer, you would be considered a shitposter in the forum and end up with nothing in your posts. I'm still not sure what a quality post is because there's so much content on this topic with different definitions. All I can say is that we beginners should avoid spamming by making our content meaningful.~snipIt will not be so easy for beginners to fulfill this condition. The quality of the posts will directly depend on the background of the person. If this is not the case, then it is almost impossible to create high quality posts and this will have to be learned. I will not say that this is a super-difficult task, but depending on the abilities of people, it will take a different amount of time to master. Everything new is always something to learn. So, for many beginners, writing low-quality posts is almost inevitable and they all have to go through this path on their own. Someone will improve, but someone will not be able to and will abandon the forum (or become a shitposter). Beginners still have to go a long process in learning before they can achieve high quality post in the forum. Although some have manage to create good post but we can’t say the contents are really impressive and of high quality, and that’s expected since they are still starting to learn and gain knowledge on the different insights of cryptocurrency. But we know everything can be learned and perfected in time. With determination and hard work in the forum, I know beginners will eventually become the quality posters in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "March 15, 2023, 08:52:15 PM",
      "body": "Quote from: EarnOnVictor on March 14, 2023, 11:22:52 AMAll your points are valid, thanks for that, and in addition, it's good for all to be sure that they are natural and not chase anything. Do not post when you should not post, by forcing it, one is bound to make one or two mistakes.Also, there is no excuse for plagiarism and not knowing the field you want to discuss about. And I believe that the issue of the low-quality posts is in two categories, there are some that are poor in the English language, while some are just in a hurry to make a post. The former is forgivable since they are not good in the language, and when one reads their writeup, it should be easily detected.While the latter is so bad, in doing so, they will only be reducing their reputation which is not worth it. So why the post? Some have also limited knowledge on the thread they are posting that’s why their post become less meaningful and has low quality. However, we can always learn and improve those things if we also make efforts to make it happen. While everything that we have to learn is already available in the internet, so it only takes much of our diligence so we can maximize learning and apply them in achieving high quality post. Also, beginners have less or no experience in the forum yet, the reason why they fail to create a high quality post because they don’t have personal experiences that can make their post more valid and meaningful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "March 15, 2023, 10:53:57 PM",
      "body": "So apparently, you is simply tryna tell 'em newbies some tips? ...and I was wondering if I couldn't see properly cus I realized you're still a newbie...lol, I like your courage 🙂There are alot of points in your content, that are practically self-centered,...or rather ideally ascribed to BTT alone, even when your meant to include other sites too. Always remember that everyone didn't start off Great; I began somewhere, we all did and gradually -- it wasn't our accuracy is writing or interpretation that paid off, it was the consistency....stay finger-crossed.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "March 16, 2023, 06:37:33 AM",
      "body": "In order to succeed here as beginner, You must be open minded person who is open to take corrections , you must be willing to unlearn old things, relearn and learn new things, because there are some information you got out there which are not the rightful information and Satoshi created this forum for proper Information and knowledge about Bitcoin. Most of us here started gradually by learning, improving along the line and are still learning as we go because each day we learn new things .... Learning never stops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "March 16, 2023, 09:04:56 AM",
      "body": "One mistake that newbies make is, failing to search the forum to see if the thread they want to begin is already existing. Additionally, some newbies don't read responses on a thread before making up theirs, which may lead to similar ideas or offkey ideas co-existing in a thread. The things you listed on this thread, OP, are all good, but has been stressed alot in the forum; plagiarism, quality content, etc. Yet newbies fall prey to such rules and get panalized. Newbies also fail to scrutinize the forum before participating in this forum. Notwithstanding that they're rules controlling this forum, which newbies are advised to read. Yet things like quarrels, misunderstanding, fights and indept arguments happen in the forum too, which newbies are expected not to be a part of such disputes with fellow members. So, if a newbie scouts the forum and understand it fully well, they won't have issue with plagiarism and quality contents, i.e seeing for themselves how members are panalized for such mistakes, how members fight against a particular member who drops offkey responses on a thread and how members beg DT members to please remove the negative trust issued to them. Such experience would not only erect a newbies behavior in the forum, it'll make him to be careful with their contents while on the forum, thereby previewing before they publish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cedie",
      "created_time": "March 16, 2023, 10:06:41 AM",
      "body": "Quote from: tranthidung on March 14, 2023, 11:22:05 AMQuote from: Dzwaafu11 on March 14, 2023, 10:52:15 AM2. Plagiarism: As we all know, plagiarism is unacceptable anywhere, including bitcointalk.org.It is untrue.In third-world nations, plagiarism is not a serious matter even in university, college, research articles or business companies.In forum globally, Bitcoin talk forum is a most serious forum about plagiarism but unfortunately plagiarism cases nowadays tend to be handled considerably softer than the past especially in 2018 or 2019.It was introduced circa 2016 and second chance started to be initiated since 2018.explanation in 2018 and became more often applied in 2019. In that year, theymos started to give global moderators' right to handle plagiarism cases and award second chance for deserved members.But I think that doesn't mean that plagiarism is not unacceptable. Somehow your comment created an impression on me that it is okay to do plagiarism since chances can be given. Thanks for the links you've inserted by the way, I am a newbie and I didn't know there were such things.  Quote from: Accardo on March 16, 2023, 09:04:56 AMOne mistake that newbies make is, failing to search the forum to see if the thread they want to begin is already existing. Additionally, some newbies don't read responses on a thread before making up theirs, which may lead to similar ideas or offkey ideas co-existing in a thread. The things you listed on this thread, OP, are all good, but has been stressed alot in the forum; plagiarism, quality content, etc. Yet newbies fall prey to such rules and get panalized. Newbies also fail to scrutinize the forum before participating in this forum. Notwithstanding that they're rules controlling this forum, which newbies are advised to read. Yet things like quarrels, misunderstanding, fights and indept arguments happen in the forum too, which newbies are expected not to be a part of such disputes with fellow members. So, if a newbie scouts the forum and understand it fully well, they won't have issue with plagiarism and quality contents, i.e seeing for themselves how members are panalized for such mistakes, how members fight against a particular member who drops offkey responses on a thread and how members beg DT members to please remove the negative trust issued to them. Such experience would not only erect a newbies behavior in the forum, it'll make him to be careful with their contents while on the forum, thereby previewing before they publish. I think even in day to day life, these things apply. And simply reading the rules first really help newbies like me. Respect, honesty and being authentic is something that I'll still do in this forum. I'll include good research as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}