{
  "id": "topic_5404862",
  "title": "jamyr",
  "author": "jamyr",
  "created_time": "July 01, 2022, 10:31:34 PM",
  "content": "I believe this modify button has been changed to just Edit but the user guide https://bitcointalk.org/index.php?action=help;page=post#modifybut the user guide still says \"Modify\".",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404862",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 01, 2022, 10:41:46 PM",
      "body": "Quote from: jamyr on July 01, 2022, 10:31:34 PMbut the user guide still says \"Modify\". Perhaps it's because it still means the same thing?Here are synonyms of the verb Edit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 01, 2022, 10:53:49 PM",
      "body": "There is no difference in both modifying and editing they are the same. The only difference is that Modify means change and edit means correction. So there is nothing that needs to be changed in the guide because those words were perfectly understandable unless you don't know how modifying/editing works?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 02, 2022, 12:43:25 AM",
      "body": "I think it was just a copy and paste from the user guides of smf. It's something that could be fixed but might be unnecessary (like the thread deletion statement below it with \"some forums allow it\"). It's probably because you don't need it/aren't expected to look there as the edit button is more available/obvious than the forum guides.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 02, 2022, 06:39:40 AM",
      "body": "It is a minor text display for a button or if admin won't edit the Help document, admin can edit the button from Edit to Modify.An alternative solution is user script. You can suggest it to BPIP team and ask them to add this minor script to theirs.[BPIP] Bitcointalk Public Information ProjectQuote locked threads, 120-day merit total, custom themes, and other good stuffI believe it is a minor script and not too difficult to code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 05, 2022, 02:49:37 PM",
      "body": "Just like every other persons have said , Modify and Edit both mean the same thing, but I understand where you are coming from @op, though they both mean the same thing, its unprofessional to have a help document call a \"function\" by one word, and then, call the same function by a different word in the main product, that function in the help document and main product should bear the same wordings so as not to cause confusion for the less educated who might not understand that the different words both mean the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "July 06, 2022, 03:09:38 PM",
      "body": "Quote from: jamyr on July 01, 2022, 10:31:34 PMI believe this modify button has been changed to just Edit but the user guide https://bitcointalk.org/index.php?action=help;page=post#modifybut the user guide still says \"Modify\". Here i was thinking I'll be met by something new. I almost mistook the thread for some of the forums rarely used buttons. I would like to say gor most but, I can't accurately tell except for on my part. As I've only used these tool or button very few times since I joined the forum.Modify indeed means Edit and Edit happens to be very common and attains a wide usage as opposed to modify and that's out of experience.With references to some rarely used buttons, I've got 2.1.  Hides/Fuses the sub-boards to a board. Probably to not be of interest.2.  brings up most recent unread  threads.That aside, I've always noticed this function:I exemplified that in course of this reply but I truly don't see the need. Like,It help to put a comment on topic with respect to its subject as edited?Won't that be an off topic response with respect to the thread.What really does it serve if that isn't it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 07, 2022, 07:22:55 PMLast edit: January 11, 2024, 09:22:45 PM by OgNasty",
      "body": "Quote from: Bitcoin_Arena on July 01, 2022, 10:41:46 PMQuote from: jamyr on July 01, 2022, 10:31:34 PMbut the user guide still says \"Modify\". Perhaps it's because it still means the same thing?Here are synonyms of the verb EditIt doesn't mean the same thing though when you're referring to a specific object.  The button you press is called the \"edit\" button.  Referring to it as the \"modify\" button is wrong, as there is no modify button.  Sure, pressing the edit button might mean you are modifying the post, but you are still pressing the edit button.  You can't just use synonyms when describing a process or object.  Especially in a guide that might be read by non-native English speakers.  That's a pretty slippery slope to start treading down.  For example, \"cut dead\" is a synonym for \"ignore\" but I don't think the user guide should say to press the cut dead link to hide a user's posts.  Anyway, I'm surprised anyone reads that and it certainly doesn't matter much, but to be clear, there is no \"modify\" button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 08, 2022, 09:18:41 AM",
      "body": "Quote from: Bitcoin_Arena on July 01, 2022, 10:41:46 PMQuote from: jamyr on July 01, 2022, 10:31:34 PMbut the user guide still says \"Modify\". Perhaps it's because it still means the same thing?Not everyone necessarily knows English well enough to know the meanings of both words, and someone may have to look up the meaning of \"modify\" when trying to change their post. The documentation should match the actual procedure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 08, 2022, 05:29:03 PM",
      "body": "Quote from: BitMaxz on July 01, 2022, 10:53:49 PMSo there is nothing that needs to be changed in the guide because those words were perfectly understandable unless you don't know how modifying/editing works?I'm gonna play devil's advocate here and say that whatever guide is put up for this site, any site, or anything ought to have very precise and consistent language, else misunderstandings are going to happen--and if the guide creator isn't lazy or sloppy, those misunderstandings should be minimized.  Let's not forget that we have members of varying degrees of intelligence, for one thing, but more importantly there are a lot of languages spoken here and many members have trouble with English.  I only know English, but I'd suspect that other languages might not have 100 different words to describe the exact same thing.By the way, this is the newest, biggest change on the forum, some wording for the edit button?  Argh.Ah, I just saw PrimeNumber7 made the same argument I just did about the language diversity.  Reading is fundamental.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jamyr",
      "created_time": "July 08, 2022, 08:31:24 PMLast edit: July 09, 2022, 11:39:45 AM by jamyr",
      "body": "an edited version:Whenever I find simple stuff like this, meaning inconsistency from documentation to system, as simple as it maybe, as long as its valid. Makes listening/reading even more productive for me. -- and fun too.Quote from: ThePharmacist Reading is fundamental ..Reading Comprehension of different composition from different countries are sometimes confusing my rusty brain. Perhaps it is my vision losing its once pristine 20-20 vision that I would have to reread a line or a phrase just to make sure I read it right. So I utilize the \"read aloud\" feature of Edge. And instead of Reading, it is now comprehension by listening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 08, 2022, 09:58:55 PM",
      "body": "Quote from: PrimeNumber7 on July 08, 2022, 09:18:41 AMQuote from: Bitcoin_Arena on July 01, 2022, 10:41:46 PMQuote from: jamyr on July 01, 2022, 10:31:34 PMbut the user guide still says \"Modify\". Perhaps it's because it still means the same thing?Not everyone necessarily knows English well enough to know the meanings of both words, and someone may have to look up the meaning of \"modify\" when trying to change their post. The documentation should match the actual procedure. Might be a thing but its a common english words to modify is to edit and to edit is to modify. The same meaning.Honestly, speaking clicking the link of help page->posting on the op is my first time visiting the page, like it doesnt exist to me at all. Because i think people before coming to this forum used to know what forum is, and posting fundamentals same as the terms used either edit or modify, remove or delete and post or reply or comment that going to help page is not necessary since they know it already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 09, 2022, 07:29:26 AM",
      "body": "Quote from: PX-Z on July 08, 2022, 09:58:55 PMQuote from: PrimeNumber7 on July 08, 2022, 09:18:41 AMQuote from: Bitcoin_Arena on July 01, 2022, 10:41:46 PMQuote from: jamyr on July 01, 2022, 10:31:34 PMbut the user guide still says \"Modify\". Perhaps it's because it still means the same thing?Not everyone necessarily knows English well enough to know the meanings of both words, and someone may have to look up the meaning of \"modify\" when trying to change their post. The documentation should match the actual procedure. Might be a thing but its a common english words to modify is to edit and to edit is to modify. The same meaning.You can argue the two words have the same meaning, but this argument does not address the issue that the documentation does not match the actual process. If someone is looking for the xyz button, they should not have to go looking for words similar to xyz when looking for this button.It is trivial to correct the documentation (or the actual process). I see no reason why one of these cannot be corrected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 09, 2022, 08:43:09 AM",
      "body": "Quote from: PrimeNumber7 on July 09, 2022, 07:29:26 AMIt is trivial to correct the documentation (or the actual process). I see no reason why one of these cannot be corrected.Oh, yeah, right, the documentation. Calling @theymos for the unfinished work. But anyway, I dont think he will do it urgently as its probably too far on its todo list. Good thing it's discovered though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 10, 2022, 09:17:42 PM",
      "body": "Quote from: PX-Z on July 09, 2022, 08:43:09 AMQuote from: PrimeNumber7 on July 09, 2022, 07:29:26 AMIt is trivial to correct the documentation (or the actual process). I see no reason why one of these cannot be corrected.Oh, yeah, right, the documentation. Calling @theymos for the unfinished work. But anyway, I dont think he will do it urgently as its probably too far on its todo list. Good thing it's discovered though.I think most likely that the documentation is from SMF, or is the default documentation from SMF. Updating the documentation is something that shouldn't take more than 2 minutes. Or if the button name were to be updated, it should take a similar amount of time. Quote from: The Pharmacist on July 08, 2022, 05:29:03 PMAh, I just saw PrimeNumber7 made the same argument I just did about the language diversity.  Reading is fundamental.Great minds think alike",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 11, 2022, 07:53:06 AM",
      "body": "That same help content can be seen in many other SMF forums, so it's not something exclusive to Bitcointalk. Here are just a few of them:https://www.hihowareyou.com/messageboard/index.php?action=helphttps://forum.mellencamp.com/index.php?action=helphttps://www.comunidadmoviles.com/index.php?action=helpAlthough theymos could easily change this from \"modify\" to \"edit\" I doubt he will do it and it isn't really important either. People don't even read the rules here when they first sign up, let alone the help section. Maybe a 1-year signature ban for theymos would be in order for not posting a reference link for the text in the help section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}