{
  "id": "topic_5461986",
  "title": "mandown",
  "author": "mandown",
  "created_time": "August 03, 2023, 08:06:22 PM",
  "content": "Arkadaşlar meraklı biri olduğumu az çok tahmin ediyorsunuzdur. Her önüne gelenin dex açtığı bir dönemde açıkçası dex nasıl çalışır, local'dede olsa kendi uniswap'ımı forklayarak kendim çalıştırmak istiyorum. Daha önceden hazır script vs ile deneyen oldu mu? veya bu tarz bir hazır script varmı? Kodların güvenilirliği pek önemli değil mainnete denemeyeceğim. Birçok kaynak farklı formuillerle çalıştırabilecek bir yapı ortaya koymuş ama bana bir kısmı anormal zor geldi. Şimdiden teşekkürler.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461986",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "August 03, 2023, 09:05:19 PM",
      "body": "Quote from: mandown on August 03, 2023, 08:06:22 PMArkadaşlar meraklı biri olduğumu az çok tahmin ediyorsunuzdur. Her önüne gelenin dex açtığı bir dönemde açıkçası dex nasıl çalışır, local'dede olsa kendi uniswap'ımı forklayarak kendim çalıştırmak istiyorum. Daha önceden hazır script vs ile deneyen oldu mu? veya bu tarz bir hazır script varmı? Kodların güvenilirliği pek önemli değil mainnete denemeyeceğim. Birçok kaynak farklı formuillerle çalıştırabilecek bir yapı ortaya koymuş ama bana bir kısmı anormal zor geldi. Şimdiden teşekkürler.Yapacağınız İngilizce arama ile bir çok örneğine ulaşmak mümkün. Kendiniz bir değişiklik yapmadığınız sürece kaynak kod olan Uniswap v2 kodları ile aynı olacağğı için bir güvenlik açığı da oluşmaz. Sıkıntı yaşayabileceğiniz durum bir aracı ile kontratları yaratmaya kalktığınızda cüzdanı aracıya bağlayacak olmanız bu yüzden boş bir cüzdanla denerseniz sorun da kalmaz testnet bile olsa.Uniswap V2 githubÖrnek anlatım:Fork Uniswap v2 Smart-Contracts & UI on Remix",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 05, 2023, 12:21:51 PM",
      "body": "Hocam daha basit script arıyorum birçok buna benzer anlatımlar var ama bazen içerideki modülün versiyonundan kaynaklı hata veriyor bu seferde hangi versiyon lazım diye dörünüp duruyorsun. Dün denedim birçok yazılımın versiyonu farklı olduğu için build edilirken hatalar veriyorTeknik konulardan çok anlamayinca malesef harcadığınız zaman tamamen çöp oluyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bcasoftware",
      "created_time": "August 09, 2023, 07:35:29 PM",
      "body": "Quote from: mandown on August 05, 2023, 12:21:51 PMHocam daha basit script arıyorum birçok buna benzer anlatımlar var ama bazen içerideki modülün versiyonundan kaynaklı hata veriyor bu seferde hangi versiyon lazım diye dörünüp duruyorsun. Dün denedim birçok yazılımın versiyonu farklı olduğu için build edilirken hatalar veriyorTeknik konulardan çok anlamayinca malesef harcadığınız zaman tamamen çöp oluyorBuild ederken hangi hatayı aldığınızı yazarsanız hatayı çözmenizi sağlıyabilirim harici kurusıkı gibi birşey olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 14, 2023, 08:49:23 AM",
      "body": "Hocam projeyi şimdilik rafa kaldırdım yakın zamanda tekrar başlamayı planlıyorum hazır kolay bir kurulum yapabileceğim script varmıdır? Mantar gibi bir gecede onlarca dex türüyor bunlar bir şekilde hazır script olmalıki yapıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}