{
  "id": "topic_5401689",
  "title": "ZekiBeyy",
  "author": "ZekiBeyy",
  "created_time": "June 07, 2022, 02:06:28 PM",
  "content": "Şimdilik 10 bin gibi bir tutar için günübirlik al sat yapmayı düşünüyorum. Banka olarak Ziraat Bankası, Akbank ve Yapıkredi bankalarında internet bankacılığım bulunuyor. Al sat olarak hem işlem kolaylığı hemde komisyon olarak hangi banka yada aracı kuruluşu tavsiye edersiniz. Eskiden Global Menkul Değerler’de hesap açtırmıştım bankalara göre komisyon oranları daha uygun ve fonksiyoneldi. Borsamızda işlem yapıyorsanız hangi aracı kuruluşu tavsiye edersiniz. Konu dışı yorum yapılmazsa sevinirim.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401689",
  "comments": [
    {
      "author": "Lachrymose",
      "created_time": "June 07, 2022, 02:18:27 PM",
      "body": "Ben orta ve uzun vadeli yatırımlarımda Akbank’ı kullanıyorum ama özünde bütün hisse ve fonlar aynı merkezi kayıt kuruluşunda saklanıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "June 07, 2022, 03:06:30 PM",
      "body": "Quote from: Lachrymose on June 07, 2022, 02:18:27 PMBen orta ve uzun vadeli yatırımlarımda Akbank’ı kullanıyorum ama özünde bütün hisse ve fonlar aynı merkezi kayıt kuruluşunda saklanıyor.Bir ara Akbank'ta işlem yapmayı denedim karışık gelmişti çok eskiden iş bankasıyla al sat yapıyordum mesela iş bank çok daha kolay geliyordu daha sonra 2010 yılı gibi komisyonun daha az olduğu Global Menkul Değerlerden hesap açtırmıştım komisyon oranları çok daha cazipti ve kampanya yapmışlardı komisyon iadesi şeklinde. Ayrıca şimdi bazı aracı kuruluşlar emir iptal etmeden bile komisyon alabiliyor.Birde anlık borsa takip edilebilen bir uygulama yada platform bulunuyor mu? (ücretsiz) benim bildiğim bir tek matriks vardı bildiğim oda ücretliydi Borsa İstanbul£dan çok uzak kaldım",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "June 07, 2022, 09:36:54 PM",
      "body": "Quote from: ZekiBeyy on June 07, 2022, 03:06:30 PMQuote from: Lachrymose on June 07, 2022, 02:18:27 PMBen orta ve uzun vadeli yatırımlarımda Akbank’ı kullanıyorum ama özünde bütün hisse ve fonlar aynı merkezi kayıt kuruluşunda saklanıyor.Bir ara Akbank'ta işlem yapmayı denedim karışık gelmişti çok eskiden iş bankasıyla al sat yapıyordum mesela iş bank çok daha kolay geliyordu daha sonra 2010 yılı gibi komisyonun daha az olduğu Global Menkul Değerlerden hesap açtırmıştım komisyon oranları çok daha cazipti ve kampanya yapmışlardı komisyon iadesi şeklinde. Ayrıca şimdi bazı aracı kuruluşlar emir iptal etmeden bile komisyon alabiliyor.Birde anlık borsa takip edilebilen bir uygulama yada platform bulunuyor mu? (ücretsiz) benim bildiğim bir tek matriks vardı bildiğim oda ücretliydi Borsa İstanbul£dan çok uzak kaldım Ben sadece endekslere uzun vadeli yatırım yapıyor ve endeksleri Tradingview'den dolar bazlı takip edip Akbank Mobil'den alım emri giriyorum. O tür anlık trading platformları hakkında hiçbir fikrim yok malesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}