{
  "id": "topic_5470564",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "October 16, 2023, 03:57:40 PM",
  "content": "Like it says. Time to get great Internet connectivity wherever you are. I wonder how much it costs?STARLINK DIRECT TO CELLhttps://direct.starlink.com/STAY CONNECTEDDirect to Cell works with existing LTE phones wherever you can see the sky. No changes to hardware, firmware, or special apps are required, providing seamless access to text, voice, and data. A CELLPHONE TOWER IN SPACEStarlink satellites with Direct to Cell capability have an advanced eNodeB modem onboard that acts like a cellphone tower in space, allowing network integration similar to a standard roaming partner....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470564",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "October 17, 2023, 05:01:26 PM",
      "body": "That sounds awesome, sadly I do not think it will be affordable for most of people, specially where it is needed: countries with a precarious network infrastructure.Since here in my country internet connection is regarded to be quite bad, I have already seen people restoring for Starlink, though I have always assumed it is not supposed to be a service for the masses, but a small percentage of people who want to be able to connect to the internet as they move around the world, or for people who want to live in remote places.if that is the case, then it is a limited market. I wonder who this is supposed to compete against already established providers of internet through cables and optical fiber.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 17, 2023, 09:09:55 PM",
      "body": "I believe T-Mobile already had a deal with starlink to provide mobile internet in certain locations. I’m not familiar enough with all the costs involved to know if this is something that is going to put pressure on traditional providers like AT&T, but common sense tells me that this sort of service is probably easier provided without satellites floating around in space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 17, 2023, 09:39:34 PM",
      "body": "I have heard from a user that it is not as successful as it is advertised to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 21, 2023, 08:55:42 PM",
      "body": "Quote from: BADecker on October 17, 2023, 09:39:34 PMI have heard from a user that it is not as successful as it is advertised to be.It will never be easy for Starlink to reach advanced stages of success due to the problems of high operating costs and other technical complications related mainly to the extent of the project’s ability to cover the necessary coverage in a reasonable time, especially after the emergence of competing companies that will continue to attempt to seize the market from Starlink. I mean here the Chinese giant whose technologies are developing very quickly and does not face the same degree of difficulty in obtaining financing and competencies.There is another important point hindering the Starlink program, which is that it is considered a dangerous competitor for all companies working in the field of providing Internet services, which will find themselves unemployed if Elon Musk succeeds in spreading Starlink coverage to large areas of the world. This particular element could lead to turmoil in the economies of some of the countries in which these companies operate, and thus it will be difficult for Starlink to obtain licenses for either activity or even to fly over their skies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 22, 2023, 04:04:38 PM",
      "body": "The connectivity is a bit slower compared to 5G provided by telecom services but if the cost is effective then people will use the feature for sure but the problem is he is thinking about launching it across the world which may not happen since some governments are not supporting this idea or telecom company will Lobby the existing leaders to keep polcies that favors for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 23, 2023, 01:46:41 AM",
      "body": "Quote from: jrrsparkles on December 22, 2023, 04:04:38 PMThe connectivity is a bit slower compared to 5G provided by telecom services but if the cost is effective then people will use the feature for sure but the problem is he is thinking about launching it across the world which may not happen since some governments are not supporting this idea or telecom company will Lobby the existing leaders to keep polcies that favors for them.It makes some sense, doesn't it? Specially in autocratic countries like China and Russia, where there are already pretty much strict laws which moderate the traffic of the internet it would be devastating to countries not to be able to regulate the content and the access their own citizens have on whatever they do on their phones and computers, at least, not being able to profit off it. It is a very interesting and also weird precedent if they allowed so much communication power to accumulate in the hand of a single CEO, that being Elon Musk.  Also, there are countries and regimes which are very fond of blocking internet access to their citizens when something negative is going on nationwide, like massive protests, or anything which could affect the image of the president or his associates, if people started to grow independent of those information blackout induced by those regimes, then some transparency could start to ensue, which is exactly what they try to prevent from happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}