{
  "id": "topic_5446338",
  "title": "Onyeeze",
  "author": "Onyeeze",
  "created_time": "March 26, 2023, 07:47:23 AM",
  "content": "One day I began to think of things that will deprive people's not to participate in the forum and make their posting skills irrelevant, and also cause a permanent ban, when reading the guidelines of the forum through the link sent to me on my previous threads I created, and I recalled that paraphrasing, spamming, plagiarism and scamming.Is the main factor, When I read directly in meta board I noticed their is a thread created because of plagiarism, and I saw some of the appeals made by people, I became shocked. From the observation I note  ;)down the things that may possibly leads beginners into issues.                             Paraphrasing Paraphrasing, this have to be avoided for someone who wants to come up with wise ideas since its against the forum. And I note down why people do paraphrase is due to laziness and also claims to make a quality posts, and from what I observed. People who paraphrased do that because they want the claims of using a good grammatical irony for their text composition to claim that they are original author because of qualities posts, It will be impressed that a newbie come up with new ideas than Paraphrasing someone articles, let us try to be avoiding Paraphrasing.                                Spamming Spamming, this is basically known that people who commit this crime is people who is making several posts daily in one thread to accumulate their posts within a day or two days to make out twenty to forty posts within the range of one or two days. In meta board some people agitate for deletion of their posts. The result of spamming is deletion of posts due to low quality posts. From observation I note down that what reduces low quality is when you turn spamming as habits and respond to a thread you don't have the ideas of the discussion. Spamming can make your profile irrelevant in contributions.                                 Scamming Scamming, this in particular is a crime in any nation, so what I understand here is that scamming is a punishable offence in the forum, and a situation the forum notice that your motive to be here is a scam, the account of the user will be damage with red trust. Scam should be avoided because it's one of the things forum forbids, and also be aware of scam.                                  Plagiarism  Plagiarism, these are one of the things that get most  people ban in the forum, anyone who avoid plagiarism have long way to go as a beginner, when you go across of plagiarism/copy and paste threads in meta board, most of users reported plagiarised, 60% are newbies. And a plagiarism sometimes is being committed intentional because the users trying to make a quality posts with copyright. What I note down that causes plagiarism is laziness and inability to research before making a post. It will be helpful to be original author of your work than Paraphrasing someone's work or plagiarised someone's article.It will be helpful if we avoid all these and have our way of drafting something meaningful without be victims of committing crimes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446338",
  "comments": [
    {
      "author": "_act_",
      "created_time": "March 26, 2023, 08:03:03 AM",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AM                                Scamming Scamming, this in particular is a crime in any nation, so what I understand here is that scamming is a punishable offence in the forum, and a situation the forum notice that your motive to be here is a scam, the account of the user will be damage with red trust. Scam should be avoided because it's one of the things forum forbids, and also be aware of scam.If someone register on this forum, having the intention to scam and make a scam attempt, the account of the person would be painted with negative trust, that is true. But that is done by the forum members and you should know that scam is not moderated on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Seinlocko",
      "created_time": "March 26, 2023, 10:17:17 AM",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AM                               Spamming Spamming, this is basically known that people who commit this crime is people who is making several posts daily in one thread to accumulate their posts within a day or two days to make out twenty to forty posts within the range of one or two days. In meta board some people agitate for deletion of their posts. The result of spamming is deletion of posts due to low quality posts. From observation I note down that what reduces low quality is when you turn spamming as habits and respond to a thread you don't have the ideas of the discussion. Spamming can make your profile irrelevant in contributions.                       many newbies are entangled in cases of spam posts or low-quality posts, that's not their fault, and those who report are also not wrong, because it's for the good of the newbies in the future. but sometimes beginners still find such actions bitter, because they feel they are not considered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "March 26, 2023, 10:40:24 AM",
      "body": "If you order for a new gadget, the first thing to check out and spend time on after opening the casing is the manual book.Newbies this days don't do this, how can you understand the rules of a platform if you don't trying finding what and what are against the platform rules and regulation, this is why many newbies get in trouble fast.Some forum don't care about paraphrasing, spamming, or plagiarism, and they come on this forum, thinking every forum are the same, this is why many of they can't tell the difference when someone is trying to scam them online or when a scam project is giving them an offer they can't ignore. It's not all newbies that come on this forum have bad intention, many of them are just ignorant with themselves and everything they get into, but still, ignorance is a disease, as for scamming, well some intent won't last long in the forum, the moment someone posts something sketchy and malicious on the forum they will be dealt with, with immediate effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 26, 2023, 12:04:03 PM",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AMI recalled that paraphrasing, spamming, plagiarism and scamming.Guide threads are most common thread type created by new members. In guide thread type, plagiarism is most favorite topic for new members.From text spinning, paraphrasing, Google translating (English > Local language and vice versa), AI-generating, lazy members have many ways to steal intellectual idea and contents of others. Generally you can classify paraphrasing, spamming and plagiarism into a same trait type of members with nearly zero-contribution for forum.Plagiarsism QA topics. I don't think new topics about plagiarism are necessary",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "March 26, 2023, 12:32:41 PM",
      "body": "Quote from: tranthidung on March 26, 2023, 12:04:03 PMQuote from: Onyeeze on March 26, 2023, 07:47:23 AMI recalled that paraphrasing, spamming, plagiarism and scamming.Guide threads are most common thread type created by new members. In guide thread type, plagiarism is most favorite topic for new members.From text spinning, paraphrasing, Google translating (English > Local language and vice versa), AI-generating, lazy members have many ways to steal intellectual idea and contents of others. Generally you can classify paraphrasing, spamming and plagiarism into a same trait type of members with nearly zero-contribution for forum.Plagiarsism QA topics. I don't think new topics about plagiarism are necessaryI agree. On other Internet forums, this problem is not so big, but on this forum there is a possibility of earning, and that is why some new members of the forum try to find a quick way to reach a certain forum rank and start earning.Everything depends on the motivation and work of new members. All new members who had an honest approach, and invested effort and time to contribute in some way to this forum, were eventually rewarded for it. All other members, who used dishonest methods such as text plagiarism or spam, were eventually caught and kicked out of this forum.Follow the rules on this forum and you won't have any problems.Invest your time and effort to help other forum members and you will be rewarded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "March 26, 2023, 12:59:01 PM",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AM                             Paraphrasing People who paraphrase are under the pressure to impress with their writing style. The intention is usually to attract merits or make one seem like a good poster when they are not. Paraphrasing is equivalent to stealing someone's work.Quote from: Onyeeze on March 26, 2023, 07:47:23 AM                                                          Spamming Some newbies who do not go through forum rules may not have a proper idea of what spamming is, even some old members spam some mega threads to meet up post count, that is highly not advisable.Quote from: Onyeeze on March 26, 2023, 07:47:23 AM                             Scamming  Scam should be avoided because it's one of the things forum forbids, and also be aware of scam.The forum is a platform to learn, but everyone is not here to learn. As a member of this forum, you have to be cautious and careful with other forum members especially those that will send you private messages. Not everyone has good intentions here so you should be careful who you choose to trust. Before you are scammed, your trust is usually gained. If you easily trust, you will easily be scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "March 26, 2023, 01:42:38 PM",
      "body": "Quote from: Daniel91 on March 26, 2023, 12:32:41 PM-snip-. All other members, who used dishonest methods such as text plagiarism or spam, were eventually caught and kicked out of this forum.Follow the rules on this forum and you won't have any problems.Invest your time and effort to help other forum members and you will be rewarded. Rewarding accounts that contribute well to the forum is a plus. Those of us who have been on this forum for a long time and dedicate time to the forum, to exchange ideas and be critical of what is happening. The rewards are not only Money, but the way we think will be different. New or old members who do not use honest methods will only become useless trash. How can it be expected, if they only use instant methods? A good punishment is a warning or a banning, but they will not be expelled in this forum. They will remain with a sign that says they are a spammer.Rules are made to be obeyed, and if violated there will be sanctions given. Helping other members is certainly a good thing, but not everything will be rewarded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 26, 2023, 03:02:15 PM",
      "body": "Almost all megathreads are filled with paraphrasing. The question discussed on the front page, asked a few months ago after a while, receives the same type of answers, which in part can be called paraphrasing. I don't know if users read all the pages, but I don't see the point in replying to threads like this. And you may ask, \"Who is not a spammer when people are not too lazy to paraphrase or chew on the same topic?\"This topic is just as common a paraphrase, and many understand why the OP created it.But to say that it is useless is useless . Since exactly the same topic will appear after a while and everyone knows it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "March 26, 2023, 03:37:02 PM",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AMIt will be helpful if we avoid all these and have our way of drafting something meaningful without be victims of committing crimes.In the case as you describe below.QuoteParaphrasing, Spamming, Scamming, PlagiarismNot only beginners, even high-ranking ones are not spared from the four elements they commit, mistakes.My understanding, every beginner who comes here it is important they read and pay attention to these rules: Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQ, if they consider and study some of the rules written there, they rookies should be fine here without any problems.Sometimes we see a lot of beginners, they know all the rules, but many of them underestimate it, they think it's all nonsense and ignore it, after they are ensnared in a case / case they always ask for a second, third chance and don't repeat the mistake again, that's what we often see here, actually they know the punishment for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "March 26, 2023, 04:15:41 PM",
      "body": "Quote from: lovesmayfamilis on March 26, 2023, 03:02:15 PMThis topic is just as common a paraphrase, and many understand why the OP created it.But to say that it is useless is useless . Since exactly the same topic will appear after a while and everyone knows it.The topic will be useless to someone who knows it already, but it will act as reminder if they have forgotten. Someone who is new and it haven't know the implications of what is being stated from the thread will pick some points valuable. Old members will not see this thread courageous why beginners will find it courageous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 26, 2023, 04:23:21 PM",
      "body": "Quote from: Onyeeze on March 26, 2023, 04:15:41 PMThe topic will be useless to someone who knows it already, but it will act as reminder if they have forgotten. Someone who is new and it haven't know the implications of what is being stated from the thread will pick some points valuable. Old members will not see this thread courageous why beginners will find it courageous. What he meant is there are other topics whom content are the same with this one. I got your point, that its helpful to others who doesnt know it yet. But being redundant on subject like this isnt tolerated by others. Since there are of same topic been posted once in a while. Thanks for the effort though you must use search function to see if there are already content you wanted to make so it wouldnt double or become a spam to every thread. Its not wrong to make topics OP but some here looking for nee ideas or any topic that might interest them. But dont be down if some here would correct you, its good thing since they suggested something to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 26, 2023, 04:40:54 PMLast edit: March 26, 2023, 06:06:33 PM by Fiatless",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AMOne day I began to think of things that will deprive people's not to participate in the forum and make their posting skills irrelevant, and also cause a permanent ban, when reading the guidelines of the forum through the link sent to me on my previous threads I created, and I recalled that paraphrasing, spamming, plagiarism and scamming.Is the main factor, When I read directly in meta board I noticed their is a thread created because of plagiarism, and I saw some of the appeals made by people, I became shocked. From the observation I note  ;)down the things that may possibly leads beginners into issues.                             The rules in this forum are not strange or new. If you are privileged to attend college you will acknowledge that plagiarism is a crime that leads to expulsion from school, especially in higher degrees. paraphrasing without referencing the source of the information is also considered plagiarism. Scamming is a crime everywhere in the world and it could lead to imprisonment. The issue of spamming might not be an issue in most social media but it is also frowned upon in most schools. If more than one student submits the same answer to personal assignments, the teacher might penalize them for copying each other.If you analyze the rules of this forum, it will be clear that they are not stringent at all. These rules are not new because most platforms and educational institutions also apply these rules. Therefore these rules shouldn't discourage any member from joining and enjoying this forum. All they need to do is read the rules and try as much as possible to respect and obey them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "March 26, 2023, 05:16:23 PM",
      "body": "Quote from: Onyeeze on March 26, 2023, 07:47:23 AMOne day I began to think of things that will deprive people's not to participate in the forum and make their posting skills irrelevant, and also cause a permanent ban, To summarize it all, I'll say greed is the reason behind all you're trying to say in your thread. Without greed newbies won't engage in this crimes. It's because of the greediness in them that makes them want to steal someone else works to pass it as theirs so they get the accolades and probably the merits reward needed to grow their accounts. If not for the greed, they won't be spamming the forum just to meet up weekly quota for their campaign to get paid. Same thing with greed when it comes to scamming people as well as people who are satisfied with what life has given them won't result ti scamming others if the little they have as well.To avoid all this problem, one needs to able to control his greed, we all have it in us but how will manage it will determine how successful we'll be both on the forum and off the forum. You have to put in the work if you want to grow yourself and your account. Avoid this shortcuts as they only end in regrets. If you visit the meta board, you'll see users regretting for the plagiarism they did. You can learn from their mistakes and better yourself or you pay the price when you engage in this crimes in the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "March 26, 2023, 05:43:10 PM",
      "body": "Firstly beginners won’t have much problem if the only just read through the forum before they start posting, on thing I am sure that would have eliminated if it were carried out is spamming.There is the rules, pinned post on board especially this one https://bitcointalk.org/index.php?topic=1689727.0The forum never expected newbies to be perfect but with all this pieces of information giving away it can help newbies find a good path here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 27, 2023, 10:24:35 AM",
      "body": "All you've listed, plagiarism is the quickest means to end a career in bitcointalk because you will immediately get a permanent banned as soon as it been discovered, paraphrasing also has a purnishable offence but if lucky it may not be a permanent ban, instead a temporary one but a continuous process will eventually landed you on same track of doing plagiarism, other ones does not give ban, if you spam your post will likely end been deleted, if you scam you may be lucky to remain here because spam isn't moderated but spamming is, but the good is to always abstain oneself from all the above bad mannered attitudes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "March 27, 2023, 10:30:37 AM",
      "body": "Those mistakes is avoidable if they could just read the rules of this forum posted, its easy to locate it so there's no excuse for anyone to commit a mistake on those possible violation they can get. So to get good run here always do legal actions  and avoid taking advantage on anything especially cheating on something that you think can give you wrong take about fast way to rank up. Just do all organically and all of your efforts in forum will be paid up plus you will end up more knowledgeable since you can read all forum users discussions and other information's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "March 27, 2023, 10:46:07 AM",
      "body": "All of these are common knowledge and there are countless threads about it, if you had used the search button you'd find quite a lot of them. The forum isn't really all that stringent and people really don't have to watch their steps carefully, it is basically just a discussion forum and you shouldn't do things that you ordinarily would not do in other discussion forums, like scamming, spamming, plagiarism and the rest; there is hardly any place that it is acceptable. Having said that, Beginners would not have too many problems on the forum if they just be themselves, because as far as freedom of speech goes, Bitcointalk uphold that quite strongly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StormHawk",
      "created_time": "March 27, 2023, 03:08:31 PM",
      "body": "The last warning on your list is the most important one, any form of plagiarism on this forum can't be forgiven, you will instantly get yourself painted with red trust if you engage in the act of plagiarism on this forum, the fault is on newbies not ready to read first before using the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "March 27, 2023, 03:57:56 PM",
      "body": "Both spamming and plagiarism are the result of a user being too lazy to conduct additional research in order to bring something qualitative, informative, and useful to the forum; instead, they paraphrase someone else's content in order to change some words and claim it as their own, which is very wrong globally, not just in this forum; therefore, we should avoid plagiarism because it is a crime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}