{
  "id": "topic_5432291",
  "title": "Ludmilla_rose1995",
  "author": "Ludmilla_rose1995",
  "created_time": "December 29, 2022, 03:25:07 PM",
  "content": "currently being hotly discussed about the new plan of the pro-bitcoin elected prime minister of Fiji to make bitcoin a legal tender there. looks like he saw huge potential in bitcoin and wanted to follow in the footsteps of el salvador.QuoteNewly elected Fiji Prime Minister Sitiveni Rabuka is pro-Bitcoin and is reportedly considering pushing a bill to adopt BTC as legal tender in the country. Pro-Bitcoin politician Sitiveni Rabuka recently took office as the new Prime Minister of the Pacific Islands of Fiji. Now, it seems the new PM is actively considering the adoption of bitcoin as legal tender there.➥ https://www.nasdaq.com/articles/fijis-new-pro-bitcoin-prime-minister-ponders-legal-tender-bill:-reportQuoteFiji, a country in the South Pacific, is an archipelago of more than 300 islands. It's famed for rugged landscapes, palm-lined beaches and coral reefs with clear lagoons. Its major islands, Viti Levu and Vanua Levu, contain most of the population. Viti Levu is home to the capital, Suva, a port city with British colonial architecture. The Fiji Museum, in the Victorian-era Thurston Gardens, has ethnographic exhibits. ― GoogleCapital: SuvaPresident: Wiliame KatoniverePopulation: 902,899 (2021) World BankCurrency: Fijian DollarContinent: OceaniaI am happy to hear this news,, one by one countries are starting to recognize Bitcoin as a legal tender",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432291",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "December 29, 2022, 03:43:46 PM",
      "body": "Quote from: Ludmilla_rose1995 on December 29, 2022, 03:25:07 PMI am happy to hear this news,, one by one countries are starting to recognize Bitcoin as a legal tender Let's not get ahead of ourselves. I can't find anything in this article about Fiji prime minister saying anything publicly about making bitcoin legal tender. As a matter of fact, it looks more like a clickbait article based on a rumour started by a Tonga politician who claimed Fiji PM is pro-Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 29, 2022, 03:54:09 PM",
      "body": "A first, a pioneer is always most important because it makes a milestone, sets up a new standard, new direction, new growth of adoption.El Salvador is a first country which makes Bitcoin as legal tender. Fiji even makes a same thing, effect should be smaller. Because there is a first nation made it. In addition, in bear market, effects would be smaller too.At the end, Fiji did not announce that they are planning to do it. The article does not reveal that plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 29, 2022, 04:35:42 PM",
      "body": "Quote from: Rikafip on December 29, 2022, 03:43:46 PMLet's not get ahead of ourselves. I can't find anything in this article about Fiji prime minister saying anything publicly about making bitcoin legal tender. As a matter of fact, it looks more like a clickbait article based on a rumour started by a Tonga politician who claimed Fiji PM is pro-Bitcoin. That lord from Tonga is already old news, and every time he appears in the media, a new date appears when Bitcoin will be legal tender in his country - and now he has decided to use a politician from another country, calling him a Bitcoin pro-bull, even though no evidence has been presented that he even knows what Bitcoin is.Quote from: Ludmilla_rose1995 on December 29, 2022, 03:25:07 PMI am happy to hear this news,, one by one countries are starting to recognize Bitcoin as a legal tender When you say one by one, I know of only two, one of which is so insignificant that it is not news at all. Legal tender does not mean that Bitcoin will be something that people will use regardless of what is regulated, and we have many examples of countries where Bitcoin is not legal tender, but has very successfully integrated into society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 29, 2022, 05:03:14 PM",
      "body": "Quote from: Rikafip on December 29, 2022, 03:43:46 PMI can't find anything in this article about Fiji prime minister saying anything publicly about making bitcoin legal tender. As a matter of fact, it looks more like a clickbait article based on a rumour started by a Tonga politician who claimed Fiji PM is pro-Bitcoin. And as I should have gotten used by now, you read the title, you open the article and the two are a world apart.QuoteWhile Rabuka himself hasn’t been very public about his opinions on Bitcoin thus far, Lord Fusitu'a, a noble and former member of parliament of neighboring nation Tonga, has reportedly confirmed that the Fijian politician is a bitcoin bull.In others news, a former member of parliament from Guyana has info that the United States plans to make bitcoin legal tender.This is starting to look like desperation, we have a guy labeled as a bitcoin bull who has never ever mentioned crypto or bitcoin in public before and I'm starting to think he is more surprised about that news than we are. Btw, I lost count of how many times \"coup d'état \" is mentioned on this guy's Wikipedia page.Quote from: Lucius on December 29, 2022, 04:35:42 PMThat lord from Tonga is already old news, and every time he appears in the media, a new date appears when Bitcoin will be legal tender in his country -Hihihttps://twitter.com/LordFusitua/status/1481101011506774016How easy it sounded, and now from 1-2-3, clap clap one week he is back with late 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 29, 2022, 05:13:56 PM",
      "body": "Indeed. It appears that the article in question may be based on a rumor or false information, rather than accurate reporting. The statement about the Fiji prime minister making bitcoin legal tender does not appear to be supported by any credible sources or evidence. In fact, there is a lot of evidence that suggest this story is false or misleading. The article that appears to be the primary source for this claim does not cite any credible sources for its claims and runs counter to every other piece of information available online about Fiji's stance on cryptocurrency.It is always important to critically evaluate the sources and veracity of information before relying on it or sharing it with others. This is particularly true for information that appears to be newsworthy, as it may spread quickly and reach a wide audience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 29, 2022, 05:29:49 PM",
      "body": "I hope Fiji will not make same mistake as El-Salvador. Making bitcoin a legal tender is a great step for sure! But replacing their own currency system with bitcoin can be a suicide. That's not a good idea! Bitcoin has not reached to a level where it can support an entire country. The network will become congested and will push the transaction fees higher. That will not be an ideal scenario for the bitcoin network.Adding bitcoin as a legal tender alongside their own currency, is an ideal path to take and it will give convenience to their citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 29, 2022, 05:30:17 PMLast edit: December 29, 2022, 05:53:32 PM by Die_empty",
      "body": "Quote from: Rikafip on December 29, 2022, 03:43:46 PMQuote from: Ludmilla_rose1995 on December 29, 2022, 03:25:07 PMI am happy to hear this news,, one by one countries are starting to recognize Bitcoin as a legal tender Let's not get ahead of ourselves. I can't find anything in this article about Fiji prime minister saying anything publicly about making bitcoin legal tender. As a matter of fact, it looks more like a clickbait article based on a rumour started by a Tonga politician who claimed Fiji PM is pro-Bitcoin. I wonder how an ex-lawmaker in another country (Tonga) would speak for an independent and democratic government of Fiji. The newly elected Prime Minister has not even settled in his newly appointed and there is no bill proposed either by the executive or the legislature about making bitcoin a legal tender. This news is just hearsay or grapevine information that cannot be verified. There is no information from any reliable source that backs the claim that Sitiveni Rabuka is pro-bitcoin.But it would be a welcomed development if the news turns out to be true. Sometimes some rumors turn out to be true. Fiji might not be a leading country in the global economic space but it has little influence in Oceania.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 29, 2022, 10:17:26 PM",
      "body": "Quote from: BlackBoss_ on December 29, 2022, 03:54:09 PMEl Salvador is a first country which makes Bitcoin as legal tender. Fiji even makes a same thing, effect should be smaller. Because there is a first nation made it. In addition, in bear market, effects would be smaller too.Being first in this case doesn't really matter. What matters is doing it the proper way and actually being successful at it and that's something all countries imho failed so far.Quote from: Lucius on December 29, 2022, 04:35:42 PMThat lord from Tonga is already old news, and every time he appears in the media, a new date appears when Bitcoin will be legal tender in his country - and now he has decided to use a politician from another country, calling him a Bitcoin pro-bull, even though no evidence has been presented that he even knows what Bitcoin is.I haven't had a pleasure of hearing about him before, but one look at his Twitter is enough to see that guy is full of shit. I like how he is all about bitcoin, and then upon checking him a little bit closer you found that he is behind some DeFi crap known as DeFiWallet, \"one stop shop for Web 3.0 enthusiast. Swapping, staking, yield farming, AR-bsaed NFT marketplace all under same roof\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "December 29, 2022, 11:55:11 PM",
      "body": "Quote from: Rikafip on December 29, 2022, 10:17:26 PMQuote from: BlackBoss_ on December 29, 2022, 03:54:09 PMEl Salvador is a first country which makes Bitcoin as legal tender. Fiji even makes a same thing, effect should be smaller. Because there is a first nation made it. In addition, in bear market, effects would be smaller too.Being first in this case doesn't really matter. What matters is doing it the proper way and actually being successful at it and that's something all countries imho failed so far.Quote from: Lucius on December 29, 2022, 04:35:42 PMThat lord from Tonga is already old news, and every time he appears in the media, a new date appears when Bitcoin will be legal tender in his country - and now he has decided to use a politician from another country, calling him a Bitcoin pro-bull, even though no evidence has been presented that he even knows what Bitcoin is.I haven't had a pleasure of hearing about him before, but one look at his Twitter is enough to see that guy is full of shit. I like how he is all about bitcoin, and then upon checking him a little bit closer you found that he is behind some DeFi crap known as DeFiWallet, \"one stop shop for Web 3.0 enthusiast. Swapping, staking, yield farming, AR-bsaed NFT marketplace all under same roof\".  more and more small countries are thinking of making btc a legal tender. maybe, they are trying to take a dip in the crypto market and see what lies ahead of them.. if it is a small country would be easier to implement. if it fails, they can easily go back to where they were. first or last, it doesn't matter. so long they are making progress in terms of crypto adoption, why not?some are just riding the hype on this market, we will know how the leader is serious about it if he will lay out a long-term plan for crypto adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HELENA22",
      "created_time": "December 30, 2022, 06:00:30 AM",
      "body": "Quote from: BlackBoss_ on December 29, 2022, 03:54:09 PMA first, a pioneer is always most important because it makes a milestone, sets up a new standard, new direction, new growth of adoption.El Salvador is a first country which makes Bitcoin as legal tender. Fiji even makes a same thing, effect should be smaller. Because there is a first nation made it. In addition, in bear market, effects would be smaller too.At the end, Fiji did not announce that they are planning to do it. The article does not reveal that plan.I want to say that when Bitcoin meets politics, Bitcoin becomes a tool used by the government to control the country. Is Bitcoin still pure? If it is perfectly integrated, is Bitcoin under strict supervision? My point is: Anyone and any country can use Bitcoin, but it is the users who need to be regulated, not Bitcoin itself. All in all, this is good news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 30, 2022, 06:30:23 AM",
      "body": "Quote from: HELENA22 on December 30, 2022, 06:00:30 AMI want to say that when Bitcoin meets politics, Bitcoin becomes a tool used by the government to control the country. Is Bitcoin still pure? If it is perfectly integrated, is Bitcoin under strict supervision? My point is: Anyone and any country can use Bitcoin, but it is the users who need to be regulated, not Bitcoin itself. All in all, this is good news.You must know there's many countries are ban Bitcoin, you can't use Bitcoin at all including hold it. So people who live on those countries can't use Bitcoin, I don't think people are force the government to accept Bitcoin as legal tender because most people use Bitcoin as an investment. Bitcoin need to be legal in every countries, but Bitcoin doesn't really need to be accepted as legal tender.If a country doesn't willing to refund every Bitcoin that got hacked on centralized exchange that operated in their countries, I will say there's no point to make Bitcoin as legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "December 30, 2022, 06:34:48 AM",
      "body": "If I'm not mistaken, Fiji was already doing this a long time ago, started the process with accepting Bitcoin to gain citizenship. That's just some complicated way to get more money for your small country who relies on tourists and oligarchs.As pointed out, old news from some guy who pretends to be a Bitcoiner but wants to make stupid shitcoin money with defi, and now wants to appear serious with \"legal tender BTC\" lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ARTURVH",
      "created_time": "December 30, 2022, 09:07:24 AM",
      "body": "You can’t be overjoyed if you don’t see the evidence. A lot of news is better than knowing where to get it. I think it’s only a matter of time before Bitcoin is accepted by all countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 30, 2022, 11:33:59 AM",
      "body": "Quote from: avikz on December 29, 2022, 05:29:49 PMI hope Fiji will not make same mistake as El-Salvador. Making bitcoin a legal tender is a great step for sure! But replacing their own currency system with bitcoin can be a suicide. That's not a good idea! Did El Salvador make the mistake you're talking about? The official currency of that country is still USD, and has been for more than 20 years, so no one is forced to use Bitcoin on the client's side if they don't want to. Bitcoin is an alternative to the existing system, legalized to the extent that every merchant must enable it if the client requests it.Quote from: Rikafip on December 29, 2022, 10:17:26 PMI haven't had a pleasure of hearing about him before, but one look at his Twitter is enough to see that guy is full of shit. ~snip~I don't know how you missed it, but there were at least 4-5 threads in this board on that topic, as it will be the same with Fiji if it becomes relevant in the mainstream media. It seems that positive news is positive even when it doesn't make much sense.Tonga will probably be the next country to make Bitcoin legal tender",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 30, 2022, 11:47:51 AM",
      "body": "Quote from: Ludmilla_rose1995 on December 29, 2022, 03:25:07 PMcurrently being hotly discussed about the new plan of the pro-bitcoin elected prime minister of Fiji to make bitcoin a legal tender there. looks like he saw huge potential in bitcoin and wanted to follow in the footsteps of el salvador.Your kind of title isn't that appropriate to me since we have alot of people that have also wanted this kind of decision to be in place and this is legal tender we are talking about, has their been any bill submitted to be acknowledged with this, i think this is just a mere talk to covet public interest as there's much to adoption than this we are seing, only him cannot do it alone, he needs others in support within his government to push forward for an adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 30, 2022, 01:44:59 PM",
      "body": "Quote from: AmoreJaz on December 29, 2022, 11:55:11 PMmore and more small countries are thinking of making btc a legal tender. Yeah, if we go by what Bitcoinmagazine claims with every single possible thing in this universe as a real deal already in place you will see thousands of countries, oh wait, million adopting bitcoin. Do you know how many of these bitcoin legal tender is imminent in x we had lately?QuoteBitcoin Legal Tender in Central African RepublicMexican senator proposes bill to make Bitcoin legal tenderBitcoin Legal Tender in PanamaMadeira and Prospera adopting bitcoin as legal tenderHonduras to declare Bitcoin as a legal tenderMalaysian Ministry proposes cryptocurrencies as legal tender?State Senator Introduces Bill to Make Bitcoin Legal Tender in ArizonaParaguay to propose Bill that would make Bitcoin Legal Tenderand I'm tired of copy-pasting especially since I fell for the Lugano craze myself.Quote from: AmoreJaz on December 29, 2022, 11:55:11 PMif it fails, they can easily go back to where they were. first or last, it doesn't matter. Yeah, because forcing merchants to accept something they don't have a clue about, creating the infrastructure, employing and paying people to take care of the system to allow easy switch between currencies, and revamping the whole tax system is just a plug-and-play feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "December 30, 2022, 06:25:19 PM",
      "body": "Quote from: avikz on December 29, 2022, 05:29:49 PMI hope Fiji will not make same mistake as El-Salvador. Making bitcoin a legal tender is a great step for sure! But replacing their own currency system with bitcoin can be a suicide. That's not a good idea! Bitcoin has not reached to a level where it can support an entire country. The network will become congested and will push the transaction fees higher. That will not be an ideal scenario for the bitcoin network.Adding bitcoin as a legal tender alongside their own currency, is an ideal path to take and it will give convenience to their citizens. el salvador has done nothing wrong,, they have been using US Dollars all this time and adding bitcoin as a currency that can be used officially in their country. I will be keeping abreast of any updates on the plans of the new Fijian prime minister, I remain hopeful that these plans are successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 30, 2022, 07:00:11 PM",
      "body": "Quote from: stompix on December 29, 2022, 05:03:14 PM[...]Lol. You're ridiculing every thread with legal tender as topic. Every single time.  In other news, people still fall in attractive titles, and skip reading the article. Does this stuff even affect anyone, anymore? I mean, okay, I get it. If Bill Gates announced adoption for bitcoin in 2013, that'd be some news to pump the price, but... Fiji's prime minister being bullish in late 2022? Kindly: who tf cares?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 30, 2022, 07:11:40 PM",
      "body": "Like Rikafip said, there is no confirmation or guarantee of any kind that the new prime Minister of Fiji wound adopt bitcoin as a legal tender, for all I know this could turn out to be a rumor in the end, being a new elected minister who jus t assumed office, I think for now, there would likely be things of much more importance on his desk to deal with other than debating whether to make bitcoin legal tender or not.This could possibly be a rumor, I won't believe any news that's not from an official source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}