{
  "id": "topic_5400718",
  "title": "bmw_roga",
  "author": "bmw_roga",
  "created_time": "May 30, 2022, 10:49:39 AM",
  "content": "Hallo, bin relativ neu auf dem Gebiet Mining.Ich habe eine RTX 3070 iChill Grafikkarte, leider LHR gedrosselt . Aus dem Grund der Drosslung habe ich mir noch eine Eagle 3090 gekauft, jedoch habe ich hier nur am Anfang 120mh/s und nach kurzer Zeit 100 mh/s. Wird die Karte zu heiß und drosselt daher herunter? Die Temp. bleibt eigentlich im Rahmen aber wo kann ich die Memorytemp. einsehen?Zudem wollte ich meine 3070 jetzt nicht verstauben lassen und daher meine Frage ob ich das LHR deaktivieren kann und diese zusätzlich an meinen PC anschließen kann? Will jetzt kein großer Miner sein, aber meinen PC trotzdem etwas nebenbei laufen lassen um etwas Geld zu verdienen bzw. ETH zu erhalten.LG und vielen Dank",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400718",
  "comments": [
    {
      "author": "mole0815",
      "created_time": "May 30, 2022, 01:46:31 PM",
      "body": "Hey bmw_roga,ich habe es mir erlaubt deinen Thread zu verschieben.Da das Thema keinen BTC Bezug hat passt es hier besser hin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "May 30, 2022, 01:58:07 PM",
      "body": "Denke in diesem Thread geht es genau um dein Problem, Willi kann dir da bestimmt helfen .zur Info - 100% LHR unlock !!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bmw_roga",
      "created_time": "May 30, 2022, 03:27:00 PM",
      "body": "Hallo und vielen Dank für den Link. Ich hatte zuletzt den Awesome-Miner genutzt. Werde dann gerne mal den Nice Hash Miner versuchen. Habe soweit alles eingerichtet aber der Status der Grafikkarte steht seit 30 Minuten auf Benchmarking, woran kann das liegen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "May 30, 2022, 03:49:51 PMLast edit: May 30, 2022, 04:08:05 PM by Lafu",
      "body": "Quote from: bmw_roga on May 30, 2022, 03:27:00 PMHallo und vielen Dank für den Link. Ich hatte zuletzt den Awesome-Miner genutzt. Werde dann gerne mal den Nice Hash Miner versuchen. Habe soweit alles eingerichtet aber der Status der Grafikkarte steht seit 30 Minuten auf Benchmarking, woran kann das liegen?Benutzt du beide Karten in einem PC und welche der 2 beiden karten ist deine Hauptkarte also wo der monitor angeschlossen ist ?Bei Lhr Karten ist es so das diese erkennen wenn kein display port aktiv ist und somit die hashrate runtergeht.Hier kann mit einem Displaydummy abhilfe geschafft werden.Versuche doch mal NBminer , wie Buchi-88 bereits geschrieben hat haben wir im anderen thread schon einiges geschrieben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bmw_roga",
      "created_time": "May 30, 2022, 03:57:07 PM",
      "body": "Ich hatte die 3090 drin und diese jetzt gegen meine 3070 getauscht. Ist bei beiden Karten das gleiche. Habe also nur eine Karte verbraut, da mein Mainboard nur Platz für eine Karte hat, daher muss ich da eh noch etwas für kaufen, damit ich beide gleichzeitig nutzen kann.Oh ich dachte Nice-Hash ist NBMiner, da ich dieses PlugIn dort installieren musste",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "May 31, 2022, 01:39:32 AM",
      "body": "Quote from: bmw_roga on May 30, 2022, 03:57:07 PMIch hatte die 3090 drin und diese jetzt gegen meine 3070 getauscht. Ist bei beiden Karten das gleiche. Habe also nur eine Karte verbraut, da mein Mainboard nur Platz für eine Karte hat, daher muss ich da eh noch etwas für kaufen, damit ich beide gleichzeitig nutzen kann.Oh ich dachte Nice-Hash ist NBMiner, da ich dieses PlugIn dort installieren musste Nein Nicehash ist nicht der NBminer , diesen findest du hier in diesen Thread : NBMiner v41.0, 100% LHR unlock for ETH mining ! Oder du kannst auch direkt zur Webseite hier gehen : https://nbminer.com/Wenn du den Miner startest dann musst du das mit Adminrechten machen das der Unlock aktiv wird.In deinem fall brauchst du einen pci riser das du beide karten gleichzeitig benutzen kannst und auch einen display dummy für die 2 Karte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}