{
  "id": "topic_5477314",
  "title": "BtcMaxi2090",
  "author": "BtcMaxi2090",
  "created_time": "December 10, 2023, 02:34:54 PM",
  "content": "hey guys, i'm  using a wallet from dogecoin and guess what i forget to save the latest word, please is there anything i can do to save ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477314",
  "comments": [
    {
      "author": "Ruttoshi",
      "created_time": "December 10, 2023, 02:43:34 PM",
      "body": "Quote from: BtcMaxi2090 on December 10, 2023, 02:34:54 PMhey guys, i'm  using a wallet from dogecoin and guess what i forget to save the latest word, please is there anything i can do to save ? What is the name of the wallet that you are using. You are to write down your seed phrase on a paper and back it up and then put the three back ups in three different location very far from each other. If you still have access to your wallet, you can still write down the seed phrase, but if you don't have access, then there is nothing you can do because it is only your seed phrase that you can use to recover your wallet if you forget your password or lost your phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 10, 2023, 02:50:20 PM",
      "body": "The generated seed only shows on your screen and it's very difficult to guess that, there's nothing we can do, only if you're asking for it with a uninstalled software, logged out account or lost device.Now if you are still logged in (can access) on that wallet, it should be on your wallet's security settings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BtcMaxi2090",
      "created_time": "December 10, 2023, 02:51:44 PM",
      "body": "Hey ty lot for your answer,i'am using unielon wallet which is used to generated 12 random word (same as ethereum wallet or bitcoin wallet). I'am not using the wallet with auth and email etc from dogecoin website. I don't know how i should brute force the latest word. Any help would be very helpful guys!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "December 10, 2023, 02:59:14 PM",
      "body": "I think https://github.com/gurnec/btcrecover can be used if you got 11 of 12 words of your phrase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BtcMaxi2090",
      "created_time": "December 10, 2023, 03:13:42 PM",
      "body": "yes i got the 11 word from the 12 word. Does this software would work for dogecoin ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BtcMaxi2090",
      "created_time": "December 10, 2023, 03:33:47 PM",
      "body": "does the software would work for doge ? because it look like that the software is supposed to work only with eth and btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "December 10, 2023, 05:10:28 PM",
      "body": "Quote from: BtcMaxi2090 on December 10, 2023, 02:51:44 PMHey ty lot for your answer,i'am using unielon wallet which is used to generated 12 random word (same as ethereum wallet or bitcoin wallet). I'am not using the wallet with auth and email etc from dogecoin website. I don't know how i should brute force the latest word. Any help would be very helpful guys!If you are talking about https://unielon.com/wallet and have password to access the wallet then its very easy to see your passphrase. I am using Chrome extension version of unielon for this guide. First click on HD Wallet #1 located on top right corner and then click setting option displayed on right and then select Show Recovery Phrase. It will ask for password. If you have the password, you can see the seed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BtcMaxi2090",
      "created_time": "December 10, 2023, 06:04:30 PM",
      "body": "yes but i have deleted the extensions and downloaded again so i can't connect on my wallet sadly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 10, 2023, 06:20:23 PM",
      "body": "Quote from: BtcMaxi2090 on December 10, 2023, 03:33:47 PMdoes the software would work for doge ? because it look like that the software is supposed to work only with eth and btcNo it actually works for other Alticoins too like the dogecoin, but it depends on the derivation path of the wallet. The software works on wallets base on the derivation path, there are wallets that have different derivation I don’t know the one this your particular wallets actually uses but if it is the default derivation path that most dogecoin d wallets use then it should support it. Here is a list of wallets of wallets supported by the software is listed  https://btcrecover.readthedocs.io/en/latest/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "December 10, 2023, 06:26:35 PM",
      "body": "Is it only me, or should this topic be moved in the Altcoins board (https://bitcointalk.org/index.php?board=67.0) ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "December 10, 2023, 07:04:26 PM",
      "body": "Does this doge wallet use BIP39 word list? if so, since it's only one word that you missing, and if you are not tech-savvy enough and don't know how check the brute-force code or run it safely so that you don't leak the remaining 11 words, I would just try each word on the list manually.There are 2048 words on the list, if each trial is going to take you 10 seconds, you would need less than 6 hours,  , this is a maximum time you would spend on it, it could be a lot less, besides, when you view the list of the words, you may be able to remember it, at least remember the first first letter or something, that should bring the time to as low as a few minutes instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "December 10, 2023, 09:33:22 PM",
      "body": "I don't know how or why you forgot to save just the last word! The most important question here is: are you sure it's the last word of the seed phrase!If yes then you don't have to worry too much. As mikeywith has explained above, the worst thing you will have to do is to try each one of the 2048 bip39 words. It's not supposed to take more than 24 hours if done manually. Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 13, 2023, 08:28:55 AM",
      "body": "Quote from: BtcMaxi2090 on December 10, 2023, 03:13:42 PMyes i got the 11 word from the 12 word. Does this software would work for dogecoin ? I can't able to find whether the wallet used words from BIP39 lists or has its own like electrum but it is possible to recover which may take a while to bruteforce the word but try it only if the balance in the wallet has a balance that is worthy of trying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "December 13, 2023, 08:39:38 AM",
      "body": "Ther is only option left which is suggested by mikewywith if your wallet uses Bitcoin Improvement proposal 39 then give a try for all of them and guess you will be able to get the last word before you end the list of words. Just in case if this wallet doesn't use BIP39 word list then it would be a challenge and only thing is try your best to guess the last word. I know it's not easy since I have similar experience with blockchain wallet where I missed entire seed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "December 13, 2023, 11:15:04 AM",
      "body": "I don't know which wallet you are using every wallet has different methods to save the phrase.If it is installed in your mobile so I think you have the option of backup in your wallet by going there you can backup it again. Go to the settings if there is the option of backup so there you will find the secret phrase again. So you can write it down and save it at safe place. But if you have uninstalled the wallet so there is no method to recover it. Forget it and make a new wallet and save it carefully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 13, 2023, 03:37:59 PM",
      "body": "It is often said here I'm this forum that\" not your key not your coin\" whenever you open a new wallet first thing to do is to save your seed phrase in a safe place otherwise if you are locked out of your wallet your money is traped forever and there is no seed phrase guesting can complete your 12 key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 13, 2023, 03:41:44 PM",
      "body": "Quote from: BtcMaxi2090 on December 10, 2023, 02:34:54 PMhey guys, i'm  using a wallet from dogecoin and guess what i forget to save the latest word, please is there anything i can do to save ? Is there funds on that wallet? I really dont think theres much help for that. Unless you knew some of the words maybe try to guess the others you wont and I hope tis like 1 or 2 words on your seed phrase cause if all. I think you might say kiss good bye to your assets. This is the most rule on crypto dont forget your seed phrase or at least have plenty of copies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "December 13, 2023, 05:09:59 PM",
      "body": "If you haven't saved your secret phrase then you can do that later on. All the non custodial wallet service provider support this features. Not only one time you can see your phrase as many times as you want. Just make sure you stored it somewhere safe so that you don't need to frequently see the phrase from the wallet because sometimes our digital device has malware on it that can take screenshots of our desktop and this will lead our wallet to be compromised to the hackers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "December 13, 2023, 05:35:32 PM",
      "body": "Quote from: cryptoaddictchie on December 13, 2023, 03:41:44 PMQuote from: BtcMaxi2090 on December 10, 2023, 02:34:54 PMhey guys, i'm  using a wallet from dogecoin and guess what i forget to save the latest word, please is there anything i can do to save ? Is there funds on that wallet? I really dont think theres much help for that. Unless you knew some of the words maybe try to guess the others you wont and I hope tis like 1 or 2 words on your seed phrase cause if all. I think you might say kiss good bye to your assets. This is the most rule on crypto dont forget your seed phrase or at least have plenty of copies. Maybe there are funds in the wallet so OP asked about seed phrase recovery, but I don't know if there are funds or not OP didn't mention it.Even if it's a forgotten word that would be difficult to recover what if Doge's wallet lists the word BIP39? Then it will be complicated again.If the funds are not much then leave it because here no one can recover the wallet in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}