{
  "id": "topic_5460153",
  "title": "Stacks1959",
  "author": "Stacks1959",
  "created_time": "July 17, 2023, 11:50:14 PM",
  "content": "Im trying to get my rpc working but when trying to send the requests im getting an error of \"No connection could be made because the target machine actively refused it\". I am wanting to be able to send requests from multiple locations so i read to use the allowip as 0.0.0.0this is my .conf file:server=1rpcuser=-----rpcpassword=-----rpcallowip=0.0.0.0rpcport=8332Could somebody help me resolve this im new to running a node so some help would be great.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460153",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "July 18, 2023, 12:16:18 AM",
      "body": "What do you mean by multiple locations is it in the same network? Or you are using a different server(e.g. DigitalOcean)?You might need to add to rpcbind= on Bitcoin.conf like this sample belowCode:server=1rpcbind=0.0.0.0rpcuser=-----rpcpassword=-----rpcallowip=192.168.1.10rpcport=8332The rpcallowip should be the IP where you perform RPC commands and take note after changing the bitcoin.conf file make sure to restart the daemon to apply the changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stacks1959",
      "created_time": "July 18, 2023, 12:21:31 AM",
      "body": "yes i have tried i entered my ip where my node is running under rpcallowip but it still refuses the requests. I am trying to set up so i can send http requests.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stacks1959",
      "created_time": "July 18, 2023, 12:28:13 AM",
      "body": "What would the format be for: http://login:password@ip:port Maybe i am going wrong there? i have http://user:pass@rpcallowip:8332i have re tried the .conf like you said and i still get the same error",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "achow101",
      "created_time": "July 18, 2023, 01:54:42 AM",
      "body": "Quote from: Stacks1959 on July 18, 2023, 12:21:31 AMyes i have tried i entered my ip where my node is running under rpcallowip but it still refuses the requests. I am trying to set up so i can send http requests.You need to set rpcbind as well. rpcbind=0.0.0.0 will expose the rpc server on all interfaces, you may want to restrict that to just the interfaces that your other machines can see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "July 18, 2023, 09:59:34 AM",
      "body": "Quote from: Stacks1959 on July 18, 2023, 12:28:13 AMi have re tried the .conf like you said and i still get the same errorBitcoin Core has to be restarted in order for the new config to apply.Also, are you using Bitcoind or Bitcoin-qt, have you set the data directory via the GUI?Because depending on the setup, Bitcoin core may not be loading your bitcoin.conf file in the default data directory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}