{
  "id": "topic_5453447",
  "title": "mendace",
  "author": "mendace",
  "created_time": "May 20, 2023, 05:08:56 PM",
  "content": "I found this interesting post that I recommend reading and I wanted to share it with you here. I don't want to spoil the whole article but it basically argues that we need more apps that leverage LN and not new wallets to pay with LN.  As clearly, the Fiat currency is widely supported in our devices where everything can be paid in our apps, so we must also try to implement payments with LN so that this can reach mass adoption.https://medium.com/breez-technology/we-need-more-apps-with-lightning-not-more-lightning-apps-b5f37f9ac8bdClearly the article is quite detailed but it goes on to explain how we got to a thoughtless use of the camera despite the fact that in 2007 there was a camera on the market with a resolution of 12mpx the latter did not contribute at all to the use but it was a machine with only 2mpx and obviously I'm talking about the iPhone one.  So it's not the quality that leads people to use something but the simplicity with which it comes to them and obviously a camera in a device capable of satisfying multiple use cases has contributed to what the world is today.  So I think this is really how LN must evolve, more apps that integrate it because basically it already works like this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453447",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "May 20, 2023, 05:29:51 PM",
      "body": "Acceptance 1st, other things later.As more people / businesses accept LN more people will want to design things around it. Otherwise people will find other things to integrate with.If I know that there are tons more places to spend LN then I would be more inclined to have it as an option. As of now there are a lot, but more is better. You need to get to that tipping point where it's everywhere. Then programmers will just start to integrate it into apps by default.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 20, 2023, 05:38:49 PM",
      "body": "Quote from: DaveF on May 20, 2023, 05:29:51 PMAcceptance 1st, other things later.As more people / businesses accept LN more people will want to design things around it. Otherwise people will find other things to integrate with.If I know that there are tons more places to spend LN then I would be more inclined to have it as an option. As of now there are a lot, but more is better. You need to get to that tipping point where it's everywhere. Then programmers will just start to integrate it into apps by default.-DaveYou probably didn't understand the concept and I'll try to explain it again.  Iphone didn't have a 12 mpx camera but only a 2mpx one and people didn't use the camera until 2007 even to photograph what they shit in the toilet (excuse the phrase but it explains the concept a lot) yet when they had it at hand it was that's right, photos and videos everywhere, social media based on your digital life made up of photos, services developed to enhance your photos to make them look professional and why didn't it arrive before 2007 when 2 mpx had long since been surpassed?  Simply because it wasn't always there in your hands.  Try making LN payments on a new Samsung Galaxy and you'll see how people start using it...the cloud is the same concept they don't even know what it is yet they use it because it's already inside their phone.  We don't have to improve LN but make it accessible to everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 20, 2023, 06:03:32 PM",
      "body": "I've seen some forum members as well kicking against the use of the lightning network but i want to believe that they are yet to fully understand the role of lightning network in bitcoin ecosystem, if you consider the reason why the lightning network was initially introduced was to make transactions complications go easy with the use of layer 2 protocols, now how do we encourage for more use of this, there must be an increased adoption first, more corperate organizations, industries and companies including government need to join hands in this massive adoption, by then, we would have gotten enough numbers of those that will implement the massive use of bitcoin lightning network in their own system all over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "May 20, 2023, 06:13:52 PM",
      "body": "Quote from: mendace on May 20, 2023, 05:38:49 PMQuote from: DaveF on May 20, 2023, 05:29:51 PMAcceptance 1st, other things later.As more people / businesses accept LN more people will want to design things around it. Otherwise people will find other things to integrate with.If I know that there are tons more places to spend LN then I would be more inclined to have it as an option. As of now there are a lot, but more is better. You need to get to that tipping point where it's everywhere. Then programmers will just start to integrate it into apps by default.-DaveYou probably didn't understand the concept and I'll try to explain it again.  Iphone didn't have a 12 mpx camera but only a 2mpx one and people didn't use the camera until 2007 even to photograph what they shit in the toilet (excuse the phrase but it explains the concept a lot) yet when they had it at hand it was that's right, photos and videos everywhere, social media based on your digital life made up of photos, services developed to enhance your photos to make them look professional and why didn't it arrive before 2007 when 2 mpx had long since been surpassed?  Simply because it wasn't always there in your hands.  Try making LN payments on a new Samsung Galaxy and you'll see how people start using it...the cloud is the same concept they don't even know what it is yet they use it because it's already inside their phone.  We don't have to improve LN but make it accessible to everyone.I guess you are supporting what DaveF stated.  Acceptance 1st, without acceptance the LN won't be used even if it is the best solution for the ever-congested Bitcoin network.  Second, there should be the need or demand of people. Simply making applications while there is really no demand would be only a waste of time and effort.QuoteTry making LN payments on a new Samsung Galaxy and you'll see how people start using it...the cloud is the same concept they don't even know what it is yet they use it because it's already inside their phone.  We don't have to improve LN but make it accessible to everyone.The world isn't magic.  If there is a catch or let us say a 50% discount in using LN for  Samsung phone payments, I am sure even those who do not know it will try to understand what LN is just to avail of that 50% discount.  There should be a driving factor for people to use LN without it, they will just use fiat payment since it is more convenient to just swipe a card than create/join a channel for LN payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 20, 2023, 06:21:42 PM",
      "body": "Quote from: serjent05 on May 20, 2023, 06:13:52 PMThe world isn't magic.  If there is a catch or let us say a 50% discount in using LN for  Samsung phone payments, I am sure even those who do not know it will try to understand what LN is just to avail of that 50% discount.  There should be a driving factor for people to use LN without it, they will just use fiat payment since it is more convenient to just swipe a card than create/join a channel for LN payment.I didn't say there will be a discount but I did say to put apps that use LN inside our smartphones.  Take Uber why pay only with cards and not LN or again airbnb, eBay, amazon all these are apps that could potentially use LN (obviously they won't for now) but if someone is developing an app that uses a payment then put LN in the your app.  You don't necessarily have to open channels or self-host a node but also use custodial wallets and send almost instantly or onchain or exchange in your own currency but in this way you will still have fed the network and incentivized the developers through fees.  Don't always be hostile to change, don't think it's always wasted energy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "May 20, 2023, 06:44:41 PM",
      "body": "Quote from: mendace on May 20, 2023, 06:21:42 PMQuote from: serjent05 on May 20, 2023, 06:13:52 PMThe world isn't magic.  If there is a catch or let us say a 50% discount in using LN for  Samsung phone payments, I am sure even those who do not know it will try to understand what LN is just to avail of that 50% discount.  There should be a driving factor for people to use LN without it, they will just use fiat payment since it is more convenient to just swipe a card than create/join a channel for LN payment.I didn't say there will be a discount but I did say to put apps that use LN inside our smartphones.  Take Uber why pay only with cards and not LN or again airbnb, eBay, amazon all these are apps that could potentially use LN (obviously they won't for now) but if someone is developing an app that uses a payment then put LN in the your app.  You don't necessarily have to open channels or self-host a node but also use custodial wallets and send almost instantly or onchain or exchange in your own currency but in this way you will still have fed the network and incentivized the developers through fees.  Don't always be hostile to change, don't think it's always wasted energy.That would be very effective if the only option of payment is LN.  It would be not as effective as you think if there is some other option of payment which is more user-friendly and more convenient to use. Besides if we develop an application for payment, isn't it easier to just have an internal transaction than using LN network?  The app's feature itself then possibly kills the purpose of LN transfers since more probably than not, users will use the convenience of internal transfer.  This is not different from an application that has an internal transfer and an integrated bank transfer.  Most users avail of the internal transfer because it is cheaper(no fee in most applications)  and faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 20, 2023, 06:52:08 PM",
      "body": "Quote from: mendace on May 20, 2023, 05:38:49 PMWe don't have to improve LN but make it accessible to everyone.axctually you do need to improve itel salvador tried it and seen how broke it wasn. and yep within 3 months they stopped using LN as the behind the scenes system of chivo.. also just having an app on millions of phones is like a fake sibyl node count. pretending its popular but not used much. and when idiots do use it and its still broke those idiots wise up quick and see its buggy and flawed and has bottlenecks and not 100% payment successes. and they too drop it and start slinging insults about it on many review sites. and there is no recovering from thatyep many people who are LN advocates tried returning to el salvador saying they fixed a few things so can el salvador give it another try.. el salvador said no thanksand now the guy at strike ran off with the tail between his legs distincing himself from el salvador pretending he had no involvement in their LN trials.. learn from your mistakes. stop repeating them by saying \"we dont need to fix mistakes, lets just get more people to try the broke system and hope devs come along to make it better after\"if something is broke fix it. if you cant fix it admit it and try something elseLB is not the solution to bitcoin congestion because LN will never be able to handle the value amounts bitcoin moves per transactionfor instance.. lets use the latest bitcoin block whilst im typing this(790620)total BTC11,565~total Value$313,615,468Average Value3.9497887817 BTCthen look at the average channel capacity of routing.. it cant cope with payments of ~4btc eachdo the math. the liquidity of routing is not there to handle bitcoins loadeditQuote from: mendace on May 20, 2023, 06:52:55 PM Now expand your mind and turn the world map, catapulted into Africa where 90% of the population is Unbanked but will most likely have a smartphone in hand, give it the opportunity to buy something without transition costs without any bank account and in the blink of an eye take a look and tell me if it can workbut didnt you just sayQuote from: mendace on May 20, 2023, 05:38:49 PMYou don't necessarily have to open channels or self-host a node but also use custodial walletsyou do know what a custodian is right?.. a bank.. a financial service",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 20, 2023, 06:52:55 PM",
      "body": "Quote from: serjent05 on May 20, 2023, 06:44:41 PMQuote from: mendace on May 20, 2023, 06:21:42 PMQuote from: serjent05 on May 20, 2023, 06:13:52 PMThe world isn't magic.  If there is a catch or let us say a 50% discount in using LN for  Samsung phone payments, I am sure even those who do not know it will try to understand what LN is just to avail of that 50% discount.  There should be a driving factor for people to use LN without it, they will just use fiat payment since it is more convenient to just swipe a card than create/join a channel for LN payment.I didn't say there will be a discount but I did say to put apps that use LN inside our smartphones.  Take Uber why pay only with cards and not LN or again airbnb, eBay, amazon all these are apps that could potentially use LN (obviously they won't for now) but if someone is developing an app that uses a payment then put LN in the your app.  You don't necessarily have to open channels or self-host a node but also use custodial wallets and send almost instantly or onchain or exchange in your own currency but in this way you will still have fed the network and incentivized the developers through fees.  Don't always be hostile to change, don't think it's always wasted energy.That would be very effective if the only option of payment is LN.  It would be not as effective as you think if there is some other option of payment which is more user-friendly and more convenient to use. Besides if we develop an application for payment, isn't it easier to just have an internal transaction than using LN network?  The app's feature itself then possibly kills the purpose of LN transfers since more probably than not, users will use the convenience of internal transfer.  This is not different from an application that has an internal transfer and an integrated bank transfer.  Most users avail of the internal transfer because it is cheaper(no fee in most applications)  and faster.You say this because you most likely live in the first industrialized world where everyone relies on their bank to keep their assets and obviously have a MasterCard in their pockets.  Now expand your mind and turn the world map, catapulted into Africa where 90% of the population is Unbanked but will most likely have a smartphone in hand, give it the opportunity to buy something without transition costs without any bank account and in the blink of an eye take a look and tell me if it can work.Quote from: franky1 on May 20, 2023, 06:52:08 PMaxctually you do need to improve itel salvador tried it and seen how broke it wasn. and yep within 3 months they stopped using LN as the behind the scenes system of chivo.. lol you probably don't know what you're talking about, in El Salvador it's not LN that doesn't work but just the adoption of how it was dealt with.  So I avoid commenting more because you're basing your speech on a concept that doesn't hold up.  Instead try checking out Bitcoin Lake or Bitcoin Jungle to see if that works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 20, 2023, 07:13:57 PM",
      "body": "I believe we already have a lot of wallets or apps that supported the lightning network but the major problem is that the lightning service hasn't gotten the needed hype to make it known to every Bitcoin holder and based on my belief I think only the BTC community are fully aware of the functionality and benefit of the lightning network which is the reason why most of the wallet/app that supported LN never get much traffic.In the meantime, if an exchange like Binance supported LN we may see some change.When read the article almost close it because the first statement on there was about digital cameras and phones which is not what I wanted to read. If you're the writer of the article make the amendment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 20, 2023, 07:55:30 PM",
      "body": "Quote from: suzanne5223 on May 20, 2023, 07:13:57 PMI believe we already have a lot of wallets or apps that supported the lightning network but the major problem is that the lightning service hasn't gotten the needed hype to make it known to every Bitcoin holder and based on my belief I think only the BTC community are fully aware of the functionality and benefit of the lightning network which is the reason why most of the wallet/app that supported LN never get much traffic.In the meantime, if an exchange like Binance supported LN we may see some change.When read the article almost close it because the first statement on there was about digital cameras and phones which is not what I wanted to read. If you're the writer of the article make the amendment.No I'm the author of the article even if what he writes is so true that I would like to be.  I wonder how you can say certain things, but at least you understand what we're talking about?  Nobody wants more LN wallets we don't need them.  Furthermore, I would NEVER see Binance as the bearer of the one who made LN known to the masses, it would be the biggest defeat for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 20, 2023, 08:08:53 PMLast edit: May 20, 2023, 08:30:32 PM by franky1",
      "body": "Quote from: mendace on May 20, 2023, 06:52:55 PMlol you probably don't know what you're talking about, in El Salvador it's not LN that doesn't work but just the adoption of how it was dealt with.  So I avoid commenting more because you're basing your speech on a concept that doesn't hold up.  Instead try checking out Bitcoin Lake or Bitcoin Jungle to see if that works.try to learn before defaulting to ignoranceel salvador first tried what they thought was \"bitcoin\" via a chivo wallet. but it actually used LN channels not bitcoin network.. so using LN as the back bone of payments they gave it a try. however users experienced liquidity bottlenecks and lost connections to channels which meant they lost value. this made the chivo developers have to quickly stop letting people use the chivo wallet by december 2021 whilst they redeveloped the chivo walletthey decided by january 2022 to use a CEX (exchange custodian called alpha) as the balance manager of chivo value without the LN stuff. where by balance was swapped in-house. and users would only get to touch bitcoin if they requested a withdrawal. which most people chose fiat instead becasue LN ([pretending to be bitcoin adoption) left them with a bad taste in their mouth in 2021you might wanna learn the history if you ever want to dare learn from history. becasue relying on ignorance is just how history repeats itself.. as the LN lemmings are learning with strikes second failure in nigeria.. which he too is trying to run away with tail between his legs AGAINyep strike was singing its own praises of its own involvement of el salvator adoption mid 2021. then the complaints started by el salvadorians by december 2021then strike ran off and didnt say a word until late 2022. saying he moved on to nigerian propositions.. then in 2023 strike wanted to say how he was not involved with el salvador at all and its nothing to do with his business..then his nigerians proposals didnt flourish. so now he is back in 2023 trying to get back into el salvadors good graces again for a second attempt.. which he is only able to get a second step in the door becasue this time he is bringing along bitfinex.. LNs biggest liquidity holder and (for strike) the hope that it will be enough for el salv president to give strike another chance.. hoping el sav government will swap el saves reserves from 'alphapoint' to bit finex to then hope balance holders at bitfinex then request LN withdrawals via strike so he can claim fees as a middleman of all payments in and out of el salv <> bitfinex so yea. maybe you should try learning some of the history. good and bad and ugly. it will help you.... dont just read the dreamy utopian hype. or you wil never learn the truth (technically bitfinex will want to be the custodian LN channel balance owner giving el salv citizens inbound balance)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 20, 2023, 08:40:32 PM",
      "body": "OP I think I agree with the person who wrote that article. We do need more non-LN apps to start implementing LN in order to further the adoption of Bitcoin. Right now there isn't much reason to use LN for most people because you can't buy anything with Bitcoin in most places. Just a couple weeks ago was the first time in my life I experienced someone mention they take Bitcoin as an option for payment (and that was just for the tip, not for the actual payment).Like, Venmo is great, but it wouldn't have been so popular if you had to get a different currency than the USD or whatever national currency you use. That's the situation LN is in. LN wallets are like decentralized Venmo with hard money, but there aren't nearly enough people onboarded onto Bitcoin, let alone LN, yet to have it be very useful just to pay other people or pay merchants cuz nobody accepts Bitcoin yet. But it gets useful if you can start interacting with other apps using LN even if you still can't use LN at popular merchants. I think this is what that writer was saying.Then once you get a network of various apps that are LN enabled, and you get a growing community of people using LN regularly, not just enthusiasts who have a LN wallet because they are enthusiasts and barely get to use it, then that's when merchants start thinking hey we should tap into this growing payment network that people are already using more and more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 20, 2023, 08:45:33 PM",
      "body": "Quote from: mendace on May 20, 2023, 07:55:30 PMQuote from: suzanne5223 on May 20, 2023, 07:13:57 PMI believe we already have a lot of wallets or apps that supported the lightning network but the major problem is that the lightning service hasn't gotten the needed hype to make it known to every Bitcoin holder and based on my belief I think only the BTC community are fully aware of the functionality and benefit of the lightning network which is the reason why most of the wallet/app that supported LN never get much traffic.In the meantime, if an exchange like Binance supported LN we may see some change.When read the article almost close it because the first statement on there was about digital cameras and phones which is not what I wanted to read. If you're the writer of the article make the amendment.No I'm the author of the article even if what he writes is so true that I would like to be.  I wonder how you can say certain things, but at least you understand what we're talking about?  Nobody wants more LN wallets we don't need them.  Furthermore, I would NEVER see Binance as the bearer of the one who made LN known to the masses, it would be the biggest defeat for Bitcoin.I don't think you should have a problem with Binance, or any exchange making LN more popular by adding it to their exchange. Exchanges SHOULD be using LN because right now they are the main place Bitcoin is used. Why wouldn't we want exchanges to help popularize LN?Also exchanges allowing deposits and withdrawals on LN likely would mean people using larger channels/capacity because if you're trading you're probably not only trading a couple hundred bucks worth of Bitcoin. So that helps the LN not only become more popular but also helps the node capacity grow and therefore improves LN scaling, since capacity is the scalability bottleneck of LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 20, 2023, 09:06:52 PMLast edit: May 20, 2023, 09:35:23 PM by franky1",
      "body": "Quote from: thecodebear on May 20, 2023, 08:45:33 PMAlso exchanges allowing deposits and withdrawals on LN likely would mean people using larger channels/capacity because if you're trading you're probably not only trading a couple hundred bucks worth of Bitcoin. So that helps the LN not only become more popular but also helps the node capacity grow and therefore improves LN scaling, since capacity is the scalability bottleneck of LN.maybe learn about the routing and channel capacity and the bottlenecks.. because the only solution LN lemmings can come up with is custodians(CEX offering factory channels they managebinance and bitfinex wont want to give people their \"your key your value\" system they will want to be the balance owner giving a user inbound balance on the CEX's side of a commitmentso goodluck with all the over promising while not actually giving users true expereince of bitcoin. where all they ever play with is msats owned by a CEXheck even government CBDC have been sandboxing lightning with help of blockstream devs via hyperledger. and they found the only way to give users set capacity(to avoid too many setup-close-reopens) is a 3 tiered account system of unconfirmed balance which is set to their central reserves. yep normal users are given a channel(account)with inbound balance of upto $2k  (low/no KYC requirement due to lack of value involved in that account) then another account they have to upgrade to ($2k -$100k) for middle plan users (midle incme/small business) requiring basic/moderate KYC then upgrade to $100k+ channel(account) which requires full KYC including proofs of income, tax numbers, business registration numbers and such, for the rich folk. so expect that binance and bitfinex to do the same. because yep LN is deemed as a payment facilitator network (due to routing) and so the routers would need to register as money service businesses.so good luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "May 21, 2023, 05:07:34 AM",
      "body": "Quote from: mendace on May 20, 2023, 05:08:56 PMI don't want to spoil the whole article but it basically argues that we need more apps that leverage LN and not new wallets to pay with LN. We don't actually need more new applications for Bitcoin Lightning Network. Having new applications has pros and cons. Not all new applications will be good in security and operations especially very important problem with potential holes in their wallet security.If current Lightning Network applications are good (secure) to use, I would like to not touch a new application and take more risk with it.Top Bitcoin Lightning Network wallets in slow InternetBest Bitcoin Lightning Network wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 21, 2023, 07:36:27 PM",
      "body": "Quote from: SquirrelJulietGarden on May 21, 2023, 05:07:34 AMQuote from: mendace on May 20, 2023, 05:08:56 PMI don't want to spoil the whole article but it basically argues that we need more apps that leverage LN and not new wallets to pay with LN. We don't actually need more new applications for Bitcoin Lightning Network. Having new applications has pros and cons. Not all new applications will be good in security and operations especially very important problem with potential holes in their wallet security.If current Lightning Network applications are good (secure) to use, I would like to not touch a new application and take more risk with it.Top Bitcoin Lightning Network wallets in slow InternetBest Bitcoin Lightning Network walletsYour answer is given by the fact that you do not understand what we are talking about.  You are talking about apps that are wallets like many of the ones already present, however I am saying that you need applications that take advantage of LN and that they absolutely must not be other wallets in which to store Bitcoin.  In fact, in my hypothesis they don't need to be secure apps in the case but they just need to integrate the LN payment alongside the traditional Fiat one, take for example an uber that works with LN, that would be fantastic.  You are thinking that all of this should concern America or Europe, while I am thinking of the oppressed and unbanked populations who are the real engine for mass adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 21, 2023, 07:40:27 PM",
      "body": "Quote from: thecodebear on May 20, 2023, 08:45:33 PMQuote from: mendace on May 20, 2023, 07:55:30 PMQuote from: suzanne5223 on May 20, 2023, 07:13:57 PMI believe we already have a lot of wallets or apps that supported the lightning network but the major problem is that the lightning service hasn't gotten the needed hype to make it known to every Bitcoin holder and based on my belief I think only the BTC community are fully aware of the functionality and benefit of the lightning network which is the reason why most of the wallet/app that supported LN never get much traffic.In the meantime, if an exchange like Binance supported LN we may see some change.When read the article almost close it because the first statement on there was about digital cameras and phones which is not what I wanted to read. If you're the writer of the article make the amendment.No I'm the author of the article even if what he writes is so true that I would like to be.  I wonder how you can say certain things, but at least you understand what we're talking about?  Nobody wants more LN wallets we don't need them.  Furthermore, I would NEVER see Binance as the bearer of the one who made LN known to the masses, it would be the biggest defeat for Bitcoin.I don't think you should have a problem with Binance, or any exchange making LN more popular by adding it to their exchange. Exchanges SHOULD be using LN because right now they are the main place Bitcoin is used. Why wouldn't we want exchanges to help popularize LN?Also exchanges allowing deposits and withdrawals on LN likely would mean people using larger channels/capacity because if you're trading you're probably not only trading a couple hundred bucks worth of Bitcoin. So that helps the LN not only become more popular but also helps the node capacity grow and therefore improves LN scaling, since capacity is the scalability bottleneck of LN.@mendace, You can't use your stance to judge what everybody in the Bitcoin community wants. Therefore, you ought to speak for yourself and dont say \" Nobody wants more LN wallets we don't need them\". Why is the Binance integration of LN will be the biggest defeat for BTC?@thecodebear In situations when there's an issue people will always seek alternatives and this is what I believe triggers Binance's planning to integrate LN.  I think if Binance integrates LN it will make LN known outside the BTC community because people are unaware of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 21, 2023, 07:44:27 PM",
      "body": "The adoption rate of LN has to increase and all of these apps and wallets are good if there are people willing to accept LN. But as of now, it's still like an unknown thing. Just as you've said about those obsolete cameras that later on are no longer viable to use because most smartphones today have clear cameras. And just like with those more apps in the LN, they won't be useful anymore if there will be better than them in the future. We mostly see the sign in some stores about \"Bitcoin accepted here\" and soon we may see \"Bitcoin Lightning Network is accepted here\" in some occasions but as of now, I haven't seen any of it yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 21, 2023, 07:58:54 PM",
      "body": "Quote from: suzanne5223 on May 21, 2023, 07:40:27 PM@mendace, You can't use your stance to judge what everybody in the Bitcoin community wants. Therefore, you ought to speak for yourself and dont say \" Nobody wants more LN wallets we don't need them\". Why is the Binance integration of LN will be the biggest defeat for BTC?@thecodebear In situations when there's an issue people will always seek alternatives and this is what I believe triggers Binance's planning to integrate LN.  I think if Binance integrates LN it will make LN known outside the BTC community because people are unaware of it.Because it would be like having thousands of car models each doing something better than the other and ultimately having no roads to drive them on, that's why I say we don't need new portfolios, do you feel the need for other portfolios for LN?  While for Binance obviously it will be a defeat if people get to know LN through this, and if you haven't figured it out yet then you should try to study the real mission of Bitcoin and not answer with such absurd things.Binance is the largest centralized exchange at the moment but it has nothing different than FTx or the rock trading will come its time and fuck the money of poor people because not your keys not your coins so I don't have to say more if you can understand.Quote from: blockman on May 21, 2023, 07:44:27 PM We mostly see the sign in some stores about \"Bitcoin accepted here\" and soon we may see \"Bitcoin Lightning Network is accepted here\" in some occasions but as of now, I haven't seen any of it yet.Excuse me why should they display here we accept LN?  Isn't it enough for you to know that they accept Bitcoin?  It is a layer to make Bitcoin transact if the merchant does not know LN then it is our duty to tell him about it and make him understand the advantages, otherwise what are we for?  Just to write two posts in this forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}