{
  "id": "topic_5414510",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "September 22, 2022, 03:26:46 PM",
  "content": "QuoteA pair of exchange-traded funds that would mirror the personal portfolios of members of Congress may be coming soon.The Unusual Whales Subversive Democratic Trading ETF (ticker NANC) and the Unusual Whales Subversive Republican Trading ETF (KRUZ) would analyze the financial disclosure of lawmakers from both parties and their spouses and dependent children to construct a portfolio of between 500 and 600 holdings, according to a regulatory filing Thursday. When a position is reported as sold, the ETFs will offload the security as well.The proposed funds would tap into a controversy over stock transactions made by lawmakers that sparked a flurry of bills to overhaul or update a 2012 law that governs disclosure, which have largely stalled despite bipartisan support. Currently, members of Congress are required to disclose any securities transactions valued at more than $1,000 within 45 days.While it’s unclear if packaging lawmakers’ portfolios into an ETF will generate returns, it will almost certainly produce buzz, said Bloomberg Intelligence ETF analyst James Seyffart.“It’s a fixation of the online trading community and financial Twitter to track what politicians are doing,” Seyffart said. “I’m not sure what kind of longevity this strategy will have, but I think they will drum up a lot of interest and if these things start beating the market, I think they could garner more than enough assets to be profitable.”The funds will only focus on equity holdings, the filing said. Both ETFs would charge a 1% expense ratio. Michael Auerbach and Christian Cooper will serve as portfolio managers.https://news.yahoo.com/etfs-track-stock-trades-us-214203963.html....Most internet gamers would call 450 ping in PvP unplayable. Likewise, I think a 45 day lag time in congressional securities reporting will not allow for much useful predictive investment in a mutual fund that tracks their movement. With equities investment its the entry point that is most critical. 45 day lag won't allow for the get in early phase necessary to consistently profit from insider information.If it were however possible to somehow gain access to realtime tracking data, these mutual funds would be the next bitcoin.I for one don't mind politicians and their inside trading ventures. They profit and make money at no one's expense. No one is injured or hurt by the process. Politicians tend to be hoarders of wealth who do not use their gains to have an impact upon civilization or society. They seem content with their freezer drawers fully stocked of ice cream. Over the long term, I think this will end up being like that guy who tracked Elon Musk's private plane flights. It will have its 30 seconds of fame in news cycles. Then people will forget it happened. One interesting point that could provide for longevity will be the ROI rates. I hope those are released as it could encourage average and ordinary people to become more interested and involved in investing and finance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414510",
  "comments": [
    {
      "author": "jackg",
      "created_time": "September 22, 2022, 03:45:38 PM",
      "body": "Sounds like something to fuel manipulation. The 45 day delay is certain something that can be problematic. A lot of stocks I've invested in (because they've dropped/gone up in volatility) tend to recover by at least half of their fall in the span of a month.Companies might also expect lawmekers to try to invest at specific times (maybe this'll give them a way they can pump their stock too and make senators more suspicious of ventures).I remember the memes that came out about the people countertrading popular news broadcasts on the stock market and this looks like it might become something similar (or there might be some sort of strategy that might be used - like mass shorting a certain stock/type when it gets released as being bought by a senator if there's a good pump from that).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}