{
  "id": "topic_5466477",
  "title": "dansus021",
  "author": "dansus021",
  "created_time": "September 12, 2023, 01:40:38 AM",
  "content": "Penulis: GazetaBitcoinTopik Original: Governs try to limit access of public to information and freedom since agesSepotong sejarah hari ini hadir sebagai lanjutan dari postingan Gazeta yang lain: 1, 2 dan 3.Pemerintah tidak ingin masyarakat luas memiliki akses terhadap informasi dan mencoba untuk menghentikannya sejak zaman kuno. Contoh paling terkenal adalah penemuan mesin cetak pada tahun 1448, yang merupakan langkah maju yang besar dalam mengakses informasi dan menuju kebebasan. Setelah penemuan Gutenberg dipublikasikan, pemerintah tidak dapat lagi membatasi akses masyarakat terhadap informasi, karena tulisan, buku, dan manuskrip dapat diterjemahkan ke dalam berbagai bahasa dan disebarkan ke berbagai budaya. Desentralisasi dimulai sejak tahun itu. Pada tahun 1517, 95 tesis yang ditulis oleh Martin Luther dicetak dalam ribuan eksemplar dan diterjemahkan dalam berbagai bahasa dan perkataannya dikenal oleh seluruh benua. Sebagai konsekuensi atas tindakannya dia dikucilkan oleh Gereja. Namun tanpa dia dan tanpa mesin cetak, kemungkinan besar reformasi Protestan akan gagal.Siapa yang bisa memegang informasi dapat juga memegang kekuasaan dan, secara umum, informasi dipegang oleh oleh para elit – pemerintah, lembaga, penegak hukum. Atau Gereja, seperti yang terjadi dalam kasus Luther. Dan mereka tidak ingin masyarakat mengaksesnya, karena itu berarti kehilangan kekuasaan.Kembali ke zaman modern, namun masih zaman dulu. Masa Cypherpunks. John Gilmore, salah satu dari mereka, mempunyai dendam pribadi terhadap NSA. Atau mungkin saya seharusnya menulis bahwa NSA punya dendam pribadi dengannya? Salah satu kemenangan paling luar biasa dari informasi melawan penindasan dipimpin pada tahun 1989 oleh Gilmore yang mempublikasikan sebuah dokumen rahasia. Penulis dokumen tersebut bekerja untuk Xerox dan NSA secara khusus meminta Xerox untuk menghancurkan dokumen tersebut. John Gilmore tidak setuju dengan sensor ini dan memposting dokumen tersebut di Internet. Tentu saja itu dengan cepat diunduh ribuan kali, dan perang antara Gilmore dan NSA pun dimulai.Pada tahun 1992 terjadi pertempuran besar lainnya antara John Gilmore dan NSA. Untuk alasan yang jelas (terkait dengan penyensoran informasi gratis), manuskrip William Friedman - yang dianggap sebagai kakek kriptografi di AS - dirahasiakan, meskipun ditulis pada masa Perang Dunia II. Gilmore kembali tidak setuju, mengingat karya Friedman harus tersedia bagi siapa saja yang berminat. Jadi dia memanggil NSA ke Pengadilan dan mendasarkan permintaannya untuk mendeklasifikasi buku-buku tersebut berdasarkan Undang-Undang Kebebasan Informasi. Tentu saja NSA enggan menanggapi permintaannya, sehingga semuanya harus diselesaikan dalam persidangan. Setelah itu, dia berhasil menemukan buku Friedman di perpustakaan umum. Selama persidangan dia diberitahu bahwa kecuali dia menyerahkan buku-buku tersebut kepada pemerintah, dia akan dituduh melakukan spionase yang dapat mengakibatkan hukuman 10 tahun penjara, karena dia memiliki materi rahasia. NSA tidak berhenti sampai di sini. Badan tersebut berusaha mencari materi lain yang \"masuk akal\" di berbagai ruang publik. Gilmore memberi tahu hakim bahwa apa yang dia temukan sudah diketahui publik, karena buku-buku itu ada di perpustakaan umum dan pada saat yang sama dia memutuskan untuk berbicara kepada pers tentang keseluruhan kasus. Segera setelah itu, buku-buku tersebut dicetak oleh Aegean Park Press.Kasus Gilmore diketahui publik dan sejak saat itu pemerintah mundur. Tuduhan tersebut dibatalkan dan manuskrip-manuskrip tersebut dideklasifikasi. John Gilmore menang. Rakyat pun menang, karena informasi publik tetap berada di tangan publik, sebagaimana mestinya.Perjuangan untuk kebebasan berpendapat, untuk privasi dan untuk pemerintah yang kurang relevan sedah dahulu. Sekarang berada di tangan kita.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466477",
  "comments": [
    {
      "author": "GazetaBitcoin",
      "created_time": "September 12, 2023, 05:57:47 AM",
      "body": "Terima kasih dansus021 untuk terjemahannya! Ini adalah thread terakhir dari 4 topik, yang juga berisi Pemerintah akan \"mendatangi\" para trader!, Mata Uang Kripto Vs Uang digital yang dikeluarkan oleh Negara dan Manifesto Crypto Anarchist – Kita semua harus membacanya.Saya berharap user di Indonesia akan menikmati bacaan bagian sejarah ini, yang akan membantu kita memahami lebih baik betapa sulitnya menggunakan kriptografi beberapa dekade yang lalu. Seiring berjalannya waktu, mata uang kripto tidak lagi dilarang, namun para penguasa masih menggunakan banyak trik kotor untuk menghentikan mata uang kripto. Namun, seperti halnya kriptografi, semua upaya mereka sia-sia. Tidak ada yang bisa menghentikan kripto pada saat itu dan tidak ada yang bisa menghentikan kripto saat ini!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}