{
  "id": "topic_5415386",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "September 29, 2022, 05:24:17 PM",
  "content": "En pocos días, he visto múltiples artículos referentes a la contaminación que se le atribuye a la minería de bitcoin. Curiosamente, en un intervalo de tiempo muy corto, tenemos titulares que parecen haber nacido de una estrategia de divide y vencerás:QuoteBitcoin Mining Pollutes as Much as 6 Million Cars Annually, Report Findshttps://www.ecowatch.com/bitcoin-mining-pollution-us.htmlQuoteBitcoin climate impact greater than gold mining, study showshttps://www.theguardian.com/technology/2022/sep/29/bitcoin-climate-impact-gold-mining-environmental-damage-cryptocurrencyQuoteBitcoin Could Be as Bad for the Planet as Beefhttps://www.bloomberg.com/news/articles/2022-09-29/mining-bitcoin-climate-impact-similar-to-beef-crude-productionQuoteBitcoin mining is just as bad for the environment as drilling for oil, study claimshttps://studyfinds.org/bitcoin-mining-environment/Salvo el titular de los coches, que parte de otros estudio local, el resto de los titulares, y sus numerosas réplicas por doquier, parten de un estudio de la universidad de New Mexico, donde el párrafo que cada uno destripa a su antojo parece ser este:QuoteFinally, the authors compared Bitcoin climate damages to damages from other industries and products such as electricity generation from renewable and non-renewable sources, crude oil processing, agricultural meat production, and precious metal mining. Climate damages for Bitcoin averaged 35% of its market value between 2016 and 2021. This share for Bitcoin was slightly less than the climate damages as a share of market value of electricity produced by natural gas (46%) and gasoline produced from crude oil (41%), but more than those of beef production (33%) and gold mining (4%). Ver: http://news.unm.edu/news/technology-unm-researchers-find-bitcoin-mining-is-environmentally-unsustainableObsérvese que, sin entrar en los pormenores de la veracidad o falsedad de la información (habría que buscar el estudio completo, comparar, contrastar, etc.; algo más propio para esta iniciativa):-   Habla de datos 2016..2021, cuando desde entonces se vienen haciendo grandes esfuerzos en cambiar el modelo de la energía usada en la minería de bitcoin.-   Los valores porcentuales de coste en contaminación que compara son relativos al valor de mercado de cada industria, lo cual, como comparativa, no se me antoja como la mejor (es mejor hablar en este caso de valores absolutos para comparar).-   El valor de mercado 2016..2021 para bitcoin cambió radicalmente. No cita como pondera este valor en un periodo tan amplio.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415386",
  "comments": [
    {
      "author": "d5000",
      "created_time": "September 30, 2022, 11:44:26 PM",
      "body": "Gracias por recopilar, he visto uno o dos de estos artículos pero no sabía que un mismo estudio fue usado por tantos medios y en tantas variantes.Ahora bien, el equivalente a seis millones de autos no me parece un valor tan alto para un sistema de pagos global. Es el parque automotor de algún país pequeño o pobre.Quote from: DdmrDdmr on September 29, 2022, 05:24:17 PM-   Los valores porcentuales de coste en contaminación que compara son relativos al valor de mercado de cada industria, lo cual, como comparativa, no se me antoja como la mejor (es mejor hablar en este caso de valores absolutos para comparar).-   El valor de mercado 2016..2021 para bitcoin cambió radicalmente. No cita como pondera este valor en un periodo tan amplio.El método en si me parece interesante, pero obviamente hasta el Guardian lo cita en parte de una manera que se puede malinterpretar.Claramente, si vemos los valores absolutos, el Bitcoin ya no queda tan mal. El artículo del Guardian cita que Bitcoin contamina como el equivalente de 35% y el oro el 4% de su capitalización del mercado. Si asumimos que el market cap de Bitcoin equivale al valor actual (~400 mil millones de dólares) y el del oro 9,9 billones (9900 mil millones, 187000 toneladas x 53 milliones de dólares por tonelada; otras fuentes lo ubican en 11 mil millones), entonces el valor absoluto del Bitcoin debe quedar cerca de un equivalente de 140 mil millones, pero la minería de oro de casi 400 mil millones.Voy a ver si encuentro el estudio así confirmo los datos. Me da la impresión que el valor del Bitcoin debería ser más bajo, ya que el promedio del precio entre 2016 y 2020 fue seguramente bastante menor a $19.000 USD, mientras que el valor del oro también subió pero a lo sumo un 30% (1200 en 2018, 1600 ahora).Es decir, ya puedo deducir que el título del Guardian está mal, porque para \"el impacto\" no importa la capitalización. En el mejor de los casos es un error, en el peor ... una mentira.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "November 12, 2022, 01:43:21 PM",
      "body": "Todo esto gracias al de Ripple y sus 5 millones de dólares de la campaña para intentar ensuciar Bitcoin. Por supuesto que Ripple es la altcoin diseñada por y para los bancos, no es que no tengan intereses de por medio...Y resulta que lo que consume la banca es muy pero muy por encima de lo que consume Bitcoin, quien los reemplaza por completo. Además gracias a la minería Bitcoin en todo el mundo se reducen las emisiones de gas natural producto de la extracción petrolífera, incluso de gas metano producto de la actividad agropecuaria se está empleando para esta actividad.Pero claro que no tenemos un grupo de bancos aportando millones de dólares para hacer campaña sucia, ni grupitos interesados en posicionar su altcoin con una fundación detrás y otros intereses de grupos minoritarios con poder de controlar. Por eso solo Bitcoin vale, el resto es basura.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}