{
  "id": "topic_5468234",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "September 26, 2023, 11:16:02 PM",
  "content": "Ako lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468234",
  "comments": [
    {
      "author": "bhadz",
      "created_time": "September 26, 2023, 11:36:31 PM",
      "body": "Yun naman ang focus nila at itong ganitong awarding ay normal lang para makahikayat pa sila ng mga ahensya ng gobyerno na magparticipate sa mga ganitong events. Wala namang connect yung mga nanalo ng awards sa nangyari sa Philhealth. Pero doon sa kung ano man ang pinalusot nila tapos nabigyan ng award tapos wala naman palang connect sa mother company na nirerepsent nila, sino ba yang tinutukoy mo kabayan ito ba yung issue nila sa Miss Universe? Parang ang bilis lang din tumunog ang pangalan ng PBW dahil siguro ito sa nangyari sa kanila sa Miss Universe kaya parang naging pabor lang din sa kanila kaya baka gagawa pa sila ng mas maraming events in the future. Sa mga awards naman, merong recognized lang at meron din naman yung masakit na katotohanan na paid lang din.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 26, 2023, 11:53:03 PM",
      "body": "Anu ba connection ng PBW sa philhealth? Parang wala naman. Those who give and received rewards ay walang connection sa hacked incident ng philhealth. In fact, kasalanan yan ng philhealth IT department, masyado nilang ina-underestimate at undervalue ang IT sa mga government agencies, besides na maliit sweldo, wala pang enough budget allocated diyan, or malaki lang nakaw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 27, 2023, 01:58:36 AM",
      "body": "Quote from: PX-Z on September 26, 2023, 11:53:03 PMAnu ba connection ng PBW sa philhealth? Parang wala naman. Those who give and received rewards ay walang connection sa hacked incident ng philhealth. In fact, kasalanan yan ng philhealth IT department, masyado nilang ina-underestimate at undervalue ang IT sa mga government agencies, besides na maliit sweldo, wala pang enough budget allocated diyan, or malaki lang nakaw.Alam ko boss malaki mga sahod ng mga yaan, since may ranking sa government, madami din silang benefit, may kilala ako sa government ngwwork kasi may bracket yaan, pero baka tamad lang itong mga IT ng Philhealth ngpapalaki lang siguro ng tiyan kasi impossible na unang attack palang if mayroon silang firewall or kahit hosted yan, meron agad yan email, kung nkahost yan sa labas alam agad ng ngmamanage ng infra yan, i mean ngmamanage ng mga servers or ng engr na nakaassign, possible baka nga nareport sa kanila yan pinagwalang bahala lang siguro, kasi may attempt logs at ip na ngbbrute, pero bat wala ginawa nakumpyansa siguro, or tamad lang magcheck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 27, 2023, 09:58:05 AM",
      "body": "Quote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/Wala kabang idea na ang mga awards ay nababayaran para magkaroon ka nyan? Meron akong kakila sa isang company, na siya mismo para maging mabango at maganda sa paningin ng mga community dito sa ating bansa ang isang company kpag nagsisimula palang ay yung iba hindi ko nilalahat ay binabayaran nila o sinumang nag-oorganize ng nagbibigay ng mga award sa isang business. Kaya hindi na bago sa akin yung ganyang concept dude, yung iba dyan sa Block ay dating mga team member sa NEM philippines at yung iba dun ay mga nakausap ko narin ng personal nung nagsisimula palang sila sa crypto industry sa totoo lang. Kaya yung ganyang ginagawa nila promotion ng block ay merong hidden agenda yan though napapalaganap nila ang blockchain technology sa iba't-ibang lugar sa pinas, kaya mapapansin mo puro universities ang target nila, ang tanung bakit kaya? hindi nila inaabot yung mismong masang pinoy talaga.Saka ano konekesyon ng PBW dito sa ginawa mong paksa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "September 27, 2023, 10:32:36 AM",
      "body": "Quote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/For sure maraming mga ganitong event ang bayad para mapabango ang pangalan nila lalo na sa mga nagsisimula pa lamang kaya hindi na nakapagtataka ang ganitong event, minsan nagugulat na lang talaga tayo sa mga events na tulad nila. Not sure kung bakit sila nakakuha ng ganitong mga awards pero for sure possible naman na rig itong event dahil madali kasing gumawa ng ingay at news lalo na kung maraming mga ganitong event.Not sure kung pano naging connected ang PBW, i mean ung Philhealth ay nakakabahala pero normal na rin naman talaga sa mga government ang bulok na security kung titignan palang ang kanilang mga system ay mapapansin mo rin naman ang bagal neto at kahit mga design ay parang sobrang low budget lang kaya ang pagkakahack ay hindi na rin nakakagulat. Siguro sadjang mababa talaga ang mga pasahod sa kanilang security, dapat kung titignan naman naten ang mga malalaking companies ay kaya naman magdeliver, and for sure if may kasalanan ang mga IT or mayroon ginagawang hindi tama ay mayroon malalagot kaya for sure may something sa kanila like mababang sahod dahil mababa ang performance nila, sadjang kinukurakot lang talaga ang budget kaya hindi rin siguro makagalaw ang mga IT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "September 27, 2023, 02:49:28 PM",
      "body": "Quote from: Asuspawer09 on September 27, 2023, 10:32:36 AMQuote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/For sure maraming mga ganitong event ang bayad para mapabango ang pangalan nila lalo na sa mga nagsisimula pa lamang kaya hindi na nakapagtataka ang ganitong event, minsan nagugulat na lang talaga tayo sa mga events na tulad nila. Not sure kung bakit sila nakakuha ng ganitong mga awards pero for sure possible naman na rig itong event dahil madali kasing gumawa ng ingay at news lalo na kung maraming mga ganitong event.Not sure kung pano naging connected ang PBW, i mean ung Philhealth ay nakakabahala pero normal na rin naman talaga sa mga government ang bulok na security kung titignan palang ang kanilang mga system ay mapapansin mo rin naman ang bagal neto at kahit mga design ay parang sobrang low budget lang kaya ang pagkakahack ay hindi na rin nakakagulat. Siguro sadjang mababa talaga ang mga pasahod sa kanilang security, dapat kung titignan naman naten ang mga malalaking companies ay kaya naman magdeliver, and for sure if may kasalanan ang mga IT or mayroon ginagawang hindi tama ay mayroon malalagot kaya for sure may something sa kanila like mababang sahod dahil mababa ang performance nila, sadjang kinukurakot lang talaga ang budget kaya hindi rin siguro makagalaw ang mga IT.Basta ahensya ng gobyerno asahan mo na merong corrupt dyan, sadyang yung iba lang kasi ay experts na sa ganyang bagay at malinis magtrabaho, isipin mo nasa ombudsman na ang kaso pero hindi parin mahatulan dahil walang makitang malakas na ebidensya. Kaya yung sinasabi mo posible nga na yung nakaalocate na magandang pasahod dapat para sa mga IT ay maaring may katotohanan yun.Kaya lang posible din na binawasan ng mga matataas na opisyal ang nakaallocate para sa kanila(IT) na wala naman din silang idea at kalaban-laban. Ngayon, tungkol sa paksa na ginawa ni Op naman ay sa aking palagay ay nagpapaingay lang ng pangalan yung karamihan sa event na yan lalo na sa main speaker nila dyan at kung anuman ang kanilang agenda ay hindi natin alam kung ano yun, pero for sure related ang pera dun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 27, 2023, 04:04:36 PM",
      "body": "ang DICT ata ibig nyang sabihin na wala namang kayang gawin para isecure mga database. pero ang teorya ay inside job daw. alam naman nating na taggipit rin ngayon baka ngha totoo. at ang goberno mismo kelangan ng pera para sa kanilang Maharlika Investment Funds. scam in da making itong MIF ni Bongbong. baka ang MIF mismo gustong halukayin ang Philhealth database para ungkatin sino itong mga mapera  sa pinas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "September 27, 2023, 09:19:09 PM",
      "body": "Maybe its part of the agenda since hinde naman ganoon kadali gumawa ng award and for sure, baka ito na ren ang way nila to make partnership with our Government agencies and hinde naman ito tungkol sa security ng mga Pinoy on those agencies. Well, very unfortunate yung nangyare sa Philhealth and hoping na mas maging secured pa ang system naten so we can really encourage more Pinoy to at least invest and trust the system as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 27, 2023, 11:15:57 PM",
      "body": "Quote from: tech30338 on September 27, 2023, 01:58:36 AMAlam ko boss malaki mga sahod ng mga yaan, since may ranking sa government, madami din silang benefit, may kilala ako sa government ngwwork kasi may bracket yaan, pero baka tamad lang itong mga IT ng Philhealth ngpapalaki lang siguro ng tiyan kasi impossible na unang attack palang if mayroon silang firewall or kahit hosted yan, meron agad yan email, kung nkahost yan sa labas alam agad ng ngmamanage ng infra yan, i mean ngmamanage ng mga servers or ng engr na nakaassign, possible baka nga nareport sa kanila yan pinagwalang bahala lang siguro, kasi may attempt logs at ip na ngbbrute, pero bat wala ginawa nakumpyansa siguro, or tamad lang magcheck.Not so sure, lahat ng IT or mga IT officers (regular) na kilala ko sa gobyerno either JO ng matagal, taga print ng mga papel, taga gawa ng sirang computer, minsan taga templa pa ng kape, taga bilo snacks, or idk na. Sa kaka undervalue ng mga IT diyan malamang may iba ibang gawain pa. Sa philhealth naman, kita mo ba itsura ng website nila? College student kayang gawin yan, eh bakit nga yan ang itsura if kaya naman ng college stud. at mga professionals na ang gumawa? Simple, mababa sahod, i-base mo work mo sa sahod mo, or else iti-take advantage ka nila dahil sa kasipagan mo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 29, 2023, 01:50:36 AM",
      "body": "Quote from: PX-Z on September 27, 2023, 11:15:57 PMQuote from: tech30338 on September 27, 2023, 01:58:36 AMAlam ko boss malaki mga sahod ng mga yaan, since may ranking sa government, madami din silang benefit, may kilala ako sa government ngwwork kasi may bracket yaan, pero baka tamad lang itong mga IT ng Philhealth ngpapalaki lang siguro ng tiyan kasi impossible na unang attack palang if mayroon silang firewall or kahit hosted yan, meron agad yan email, kung nkahost yan sa labas alam agad ng ngmamanage ng infra yan, i mean ngmamanage ng mga servers or ng engr na nakaassign, possible baka nga nareport sa kanila yan pinagwalang bahala lang siguro, kasi may attempt logs at ip na ngbbrute, pero bat wala ginawa nakumpyansa siguro, or tamad lang magcheck.Not so sure, lahat ng IT or mga IT officers (regular) na kilala ko sa gobyerno either JO ng matagal, taga print ng mga papel, taga gawa ng sirang computer, minsan taga templa pa ng kape, taga bilo snacks, or idk na. Sa kaka undervalue ng mga IT diyan malamang may iba ibang gawain pa. Sa philhealth naman, kita mo ba itsura ng website nila? College student kayang gawin yan, eh bakit nga yan ang itsura if kaya naman ng college stud. at mga professionals na ang gumawa? Simple, mababa sahod, i-base mo work mo sa sahod mo, or else iti-take advantage ka nila dahil sa kasipagan mo.Sa tingin ko baka iyan ay mga ojt lang madalas tlga sa simula mga gnyan parang initiation nila ba , pero if matagal kana at sa MIS ka pinagtitimpla ka kape , taga bili ng snacks bka need mo na umalis, kasi nsa JD mo namn yan, pagdating naman sa site, may bidding kasi yan kung sino malaki bigay sa knila un mas papaboran nela kahit pangit, dba dati boss ung computer set ewan ko if nabilitaan mo 25k lang value pero sabi 60k , same with laptop na halos di magamit dahil gapang, pero may ranking yaan, andun naman sa site nila ung sahod basta government, not sure lang sa tropa mo boss bakit mababa sa kanya,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 29, 2023, 05:09:23 AM",
      "body": "Quote from: electronicash on September 27, 2023, 04:04:36 PMang DICT ata ibig nyang sabihin na wala namang kayang gawin para isecure mga database. pero ang teorya ay inside job daw. alam naman nating na taggipit rin ngayon baka ngha totoo. at ang goberno mismo kelangan ng pera para sa kanilang Maharlika Investment Funds. scam in da making itong MIF ni Bongbong. baka ang MIF mismo gustong halukayin ang Philhealth database para ungkatin sino itong mga mapera  sa pinas.Tingin ko naman hindi siya inside job kasi kung inside job at nanghihingi sila ng ransom, dapat binayaran na nila. Pero ayon naman sa balita, hindi nila binayaran at mukhang doon sila medyo nakalie low sa issue na ito. Parang ilang araw lang, natambakan naman na ng panibagong issue yung nangyari dito sa Philhealth nung Socorro na grupo tapos may hearing pa sa senado. Ang daming issue sa bansa natin pero hindi naman natututukan at nakakalimutan lang ng mga tao. Sa akin, ito yung napansin ko at kapansin pansin naman kapag may mga malalaking halaga na involve parang biglang natatabunan nalang ng mga panibagong issue tapos naiiba yung attention ng publiko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 29, 2023, 06:58:31 PM",
      "body": "Quote from: blockman on September 29, 2023, 05:09:23 AMQuote from: electronicash on September 27, 2023, 04:04:36 PMang DICT ata ibig nyang sabihin na wala namang kayang gawin para isecure mga database. pero ang teorya ay inside job daw. alam naman nating na taggipit rin ngayon baka ngha totoo. at ang goberno mismo kelangan ng pera para sa kanilang Maharlika Investment Funds. scam in da making itong MIF ni Bongbong. baka ang MIF mismo gustong halukayin ang Philhealth database para ungkatin sino itong mga mapera  sa pinas.Tingin ko naman hindi siya inside job kasi kung inside job at nanghihingi sila ng ransom, dapat binayaran na nila. Pero ayon naman sa balita, hindi nila binayaran at mukhang doon sila medyo nakalie low sa issue na ito. Parang ilang araw lang, natambakan naman na ng panibagong issue yung nangyari dito sa Philhealth nung Socorro na grupo tapos may hearing pa sa senado. Ang daming issue sa bansa natin pero hindi naman natututukan at nakakalimutan lang ng mga tao. Sa akin, ito yung napansin ko at kapansin pansin naman kapag may mga malalaking halaga na involve parang biglang natatabunan nalang ng mga panibagong issue tapos naiiba yung attention ng publiko.hindi na pag-uusapan yan sa balita kahit pa mas importante yan.panay kasi balita dyan sa Panatag Shoal na parang maakikipaggera na ang Pilipinas. si bongbong naniniwala atang tutulungan talaga tayo ng US kung makikipaggera tayo. ang tsismis dyan sa Socorro group is that yan palang bundok ni Sr. Aguila ay gagawing Edca site (US military base) kaya timunbok ni Honrtiveros. paalisin ata sila dyan sa kanilang bundok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "September 29, 2023, 09:31:51 PM",
      "body": "Quote from: electronicash on September 29, 2023, 06:58:31 PMQuote from: blockman on September 29, 2023, 05:09:23 AMQuote from: electronicash on September 27, 2023, 04:04:36 PMang DICT ata ibig nyang sabihin na wala namang kayang gawin para isecure mga database. pero ang teorya ay inside job daw. alam naman nating na taggipit rin ngayon baka ngha totoo. at ang goberno mismo kelangan ng pera para sa kanilang Maharlika Investment Funds. scam in da making itong MIF ni Bongbong. baka ang MIF mismo gustong halukayin ang Philhealth database para ungkatin sino itong mga mapera  sa pinas.Tingin ko naman hindi siya inside job kasi kung inside job at nanghihingi sila ng ransom, dapat binayaran na nila. Pero ayon naman sa balita, hindi nila binayaran at mukhang doon sila medyo nakalie low sa issue na ito. Parang ilang araw lang, natambakan naman na ng panibagong issue yung nangyari dito sa Philhealth nung Socorro na grupo tapos may hearing pa sa senado. Ang daming issue sa bansa natin pero hindi naman natututukan at nakakalimutan lang ng mga tao. Sa akin, ito yung napansin ko at kapansin pansin naman kapag may mga malalaking halaga na involve parang biglang natatabunan nalang ng mga panibagong issue tapos naiiba yung attention ng publiko.hindi na pag-uusapan yan sa balita kahit pa mas importante yan.panay kasi balita dyan sa Panatag Shoal na parang maakikipaggera na ang Pilipinas. si bongbong naniniwala atang tutulungan talaga tayo ng US kung makikipaggera tayo. ang tsismis dyan sa Socorro group is that yan palang bundok ni Sr. Aguila ay gagawing Edca site (US military base) kaya timunbok ni Honrtiveros. paalisin ata sila dyan sa kanilang bundok.Kung totoo man yun saan kaya nila irerelocate yung members ng Socorro group e nasa 5 thousand mahigit daw ang members nito. Pero mahusay ang gobyerno sa pagtakip ng issues nila kung baga madali nilang palitan ang hot issues dahil nga may live na ngayon ang mga senate hearing sa iba't ibang platforms so madali na lang din ilihis ang atensyon ng mga tao.If ever man na gagawing US base ang bundok na yun, sana naman ay wag nilang itapon na lang din kung saan ang members ng Soccoro dahil biktima lang din naman ang marami sa kanila. Napakaraming issues ng bansa natin ngayon sa totoo lang pero sana huwag balewalain ang mas malalaki pang issues na dapat nireresolba din ng gobyerno.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 29, 2023, 10:11:18 PM",
      "body": "Quote from: gunhell16 on September 27, 2023, 09:58:05 AMQuote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/Wala kabang idea na ang mga awards ay nababayaran para magkaroon ka nyan? Meron akong kakila sa isang company, na siya mismo para maging mabango at maganda sa paningin ng mga community dito sa ating bansa ang isang company kpag nagsisimula palang ay yung iba hindi ko nilalahat ay binabayaran nila o sinumang nag-oorganize ng nagbibigay ng mga award sa isang business. Tama ka dyan kabayan, sa isang Food supplement na pinagtrabahuan ko, may mga lumapit na awarding body then nagoffer sila ng award in exchange for a certain donation for their cause.  It is really funny kung iisipin dahil ang company is newly established, then wala pa talagang mga parokyano or etablished users iyong products then biglang bibigyan ng certification of product excelence award. LOL.So I don't really respect or credit ang mga ganitong klaseng award.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 30, 2023, 06:55:48 AM",
      "body": "Quote from: electronicash on September 29, 2023, 06:58:31 PMQuote from: blockman on September 29, 2023, 05:09:23 AMTingin ko naman hindi siya inside job kasi kung inside job at nanghihingi sila ng ransom, dapat binayaran na nila. Pero ayon naman sa balita, hindi nila binayaran at mukhang doon sila medyo nakalie low sa issue na ito. Parang ilang araw lang, natambakan naman na ng panibagong issue yung nangyari dito sa Philhealth nung Socorro na grupo tapos may hearing pa sa senado. Ang daming issue sa bansa natin pero hindi naman natututukan at nakakalimutan lang ng mga tao. Sa akin, ito yung napansin ko at kapansin pansin naman kapag may mga malalaking halaga na involve parang biglang natatabunan nalang ng mga panibagong issue tapos naiiba yung attention ng publiko.hindi na pag-uusapan yan sa balita kahit pa mas importante yan.panay kasi balita dyan sa Panatag Shoal na parang maakikipaggera na ang Pilipinas. si bongbong naniniwala atang tutulungan talaga tayo ng US kung makikipaggera tayo. ang tsismis dyan sa Socorro group is that yan palang bundok ni Sr. Aguila ay gagawing Edca site (US military base) kaya timunbok ni Honrtiveros. paalisin ata sila dyan sa kanilang bundok.Oo nga puro sa Philippine Sea ang balita, ang akin naman hindi naman tayo makikipag gyera pero parang pangti-trigger din ng media yan. Pero ayaw din naman natin na makuha yang part na yan ng China kasi nasa EEZ naman natin lalong lalo na yung Masinloc. Yung sa SBSI, nakita ko nga na malapit yan sa dagat baka gawin ngang EDCA site yan, hindi natin alam kung ano ba talaga kasi unang beses ko palang narinig yan. Ang laki ng lupa doon, 350 hectares. Sa Philhealth naman, balik na ata ulit ang website nila. At may nasagap o nabasa ako na maglalabas ng something ang medusa group, antayin lang daw natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "September 30, 2023, 07:39:07 PM",
      "body": "Quote from: serjent05 on September 29, 2023, 10:11:18 PMQuote from: gunhell16 on September 27, 2023, 09:58:05 AMQuote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/Wala kabang idea na ang mga awards ay nababayaran para magkaroon ka nyan? Meron akong kakila sa isang company, na siya mismo para maging mabango at maganda sa paningin ng mga community dito sa ating bansa ang isang company kpag nagsisimula palang ay yung iba hindi ko nilalahat ay binabayaran nila o sinumang nag-oorganize ng nagbibigay ng mga award sa isang business. Tama ka dyan kabayan, sa isang Food supplement na pinagtrabahuan ko, may mga lumapit na awarding body then nagoffer sila ng award in exchange for a certain donation for their cause.  It is really funny kung iisipin dahil ang company is newly established, then wala pa talagang mga parokyano or etablished users iyong products then biglang bibigyan ng certification of product excelence award. LOL.So I don't really respect or credit ang mga ganitong klaseng award. Hindi mo rin talaga masisisi yung new businesses no kung may magoffer ng mga award sa kanila or kahit anong \"Best in\" plaque pa yan kasi ang nasa isip ng owner nun is flower yun sa name ng business especially big names ang nag award pero masayadong crook yung sistema dahil sa mga ganto. Mag-aalok ng award in exchange for donation pero sa totoo lang malaki yung nabubulsa nila dyan kesa sa napupuntahan ng donation. Kahit ako wala kong bilib sa mga award, award na ganyan lalo kung sila sila lang rin naman nagbibigayan, kanya kanyang buhat na lang sila ng bangko dyan kung tutuusin. Pero sa case ng Philhealth, sa tingin ko hindi dahil sa ganto, talagang ligwak lang talaga IT department nila kaya sila nahack. Isa pa hindi pu-pwedeng walang kaapelyido yung ibang IT nila dyan sa higher positions. Alam nyo na siguro yung ibig kong sabihin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "October 26, 2023, 05:40:17 AM",
      "body": "Quote from: gunhell16 on September 27, 2023, 09:58:05 AMQuote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/Wala kabang idea na ang mga awards ay nababayaran para magkaroon ka nyan? Meron akong kakila sa isang company, na siya mismo para maging mabango at maganda sa paningin ng mga community dito sa ating bansa ang isang company kpag nagsisimula palang ay yung iba hindi ko nilalahat ay binabayaran nila o sinumang nag-oorganize ng nagbibigay ng mga award sa isang business. Kaya hindi na bago sa akin yung ganyang concept dude, yung iba dyan sa Block ay dating mga team member sa NEM philippines at yung iba dun ay mga nakausap ko narin ng personal nung nagsisimula palang sila sa crypto industry sa totoo lang. Kaya yung ganyang ginagawa nila promotion ng block ay merong hidden agenda yan though napapalaganap nila ang blockchain technology sa iba't-ibang lugar sa pinas, kaya mapapansin mo puro universities ang target nila, ang tanung bakit kaya? hindi nila inaabot yung mismong masang pinoy talaga.Saka ano konekesyon ng PBW dito sa ginawa mong paksa?Agree ako sayo mate. Halos lahat ng mga pakulo ngayon ay meron talagang hidden agenda at involve dyan ang ibang pulitiko, institutions at iba pa lalo na at usapang pera yan. Though hindi na bago sa bansa natin yung mga ganyang kalakaran ay meron parin talaga mga kababayan natin na dia alam ang ganyan. Kala ko nga din dati na hanggang movies lang nangyayari yan pero naadopt na rin pala sa totoong buhay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "October 26, 2023, 07:41:39 AM",
      "body": "Quote from: serjent05 on September 29, 2023, 10:11:18 PMQuote from: gunhell16 on September 27, 2023, 09:58:05 AMQuote from: tech30338 on September 26, 2023, 11:16:02 PMAko lang ba ang nakapansin neto? o marami din ang nakapansin, philippine blockchain week should focus more, with blockchain technology and securitieslike for example nalang leadership award daw eh neto nahack ung philhealth tapos tumanggap ka leadership award, parang nasampal kapa sa mukha diba.alam ko iyong mga nagdadaos ng ganeto mga blockchain event walang mga ganyan only in the ph lang talaga.Pagkatapos may pinalusot pa na wala naman palang connection sa isang organization or not even have inform them, pagkatapos may awarding.Sana they should focus nlang sa kung anu talaga agenda, nahahaluan talaga ng politics dito madalas kaya minsan hanggang start lang wala na improvement.Ito ang source:https://bitpinas.com/feature/block-awards-winners-2023/Wala kabang idea na ang mga awards ay nababayaran para magkaroon ka nyan? Meron akong kakila sa isang company, na siya mismo para maging mabango at maganda sa paningin ng mga community dito sa ating bansa ang isang company kpag nagsisimula palang ay yung iba hindi ko nilalahat ay binabayaran nila o sinumang nag-oorganize ng nagbibigay ng mga award sa isang business. Tama ka dyan kabayan, sa isang Food supplement na pinagtrabahuan ko, may mga lumapit na awarding body then nagoffer sila ng award in exchange for a certain donation for their cause.  It is really funny kung iisipin dahil ang company is newly established, then wala pa talagang mga parokyano or etablished users iyong products then biglang bibigyan ng certification of product excelence award. LOL.So I don't really respect or credit ang mga ganitong klaseng award.nakakatuwa mga ganitong pakulo now na parang ginagawang tanga ang mga tao , akala nila lahat ng tao eh katulad ng mga na sscam nila sa text or email brigade    certification of product excellence eh ni wala pang napapatunayan sa negosyo? ano yon crokis? hehehekaso parang pulubi na namamalimos . certain donation eh bigyan mo ng 10 pesos mga yan eh baka bigla ka murahin  lahat talaga gagawin ng mga manloloko ngayon makakuha lang ng pera eh , kahit gawin pa tayong mga bobo na parang walang naiintindihan sa mundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "October 26, 2023, 08:36:44 AM",
      "body": "Quote from: bitterguy28 on October 26, 2023, 07:41:39 AMQuote from: serjent05 on September 29, 2023, 10:11:18 PMQuote from: gunhell16 on September 27, 2023, 09:58:05 AMQuote from: tech30338 on September 26, 2023, 11:16:02 PMsnipsnipsnipnakakatuwa mga ganitong pakulo now na parang ginagawang tanga ang mga tao , akala nila lahat ng tao eh katulad ng mga na sscam nila sa text or email brigade    certification of product excellence eh ni wala pang napapatunayan sa negosyo? ano yon crokis? hehehekaso parang pulubi na namamalimos . certain donation eh bigyan mo ng 10 pesos mga yan eh baka bigla ka murahin  lahat talaga gagawin ng mga manloloko ngayon makakuha lang ng pera eh , kahit gawin pa tayong mga bobo na parang walang naiintindihan sa mundo.Sa totoo lang hindi na talaga bago yung ganitong mga pakulo. Ginagawa nila yan para sa public image nila or matabunan yung previous issue na kinaharap nila. Kumbaga, pinapakita nila sa mga tao na nabago ang tingin sa kanila at maibalik yung tiwala o kompiyansa ng tao. Kahit wala ka naman nabalitaan na achievement ng kumpanya e magugulat ka nalang nagkaron sila bigla ng award.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}