{
  "id": "topic_5455948",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "June 10, 2023, 12:10:40 PM",
  "content": "Hoje vi circulando no Twitter essa imagem, de um BITCOIN sendo projetado no prédio do Banco Central da República Checa. Eu particularmente, tenho muito desejo de conhecer o país. Existe um movimento anarquista super forte lá e alguns projetos que tenho bastante interesse em conhecer, como o Parallel Polis. Mas, o que achei mais interessante, é que buscando pela notícia da imagem projetada, encontrei esse artigo do Banco Central do país:'' Não tenha medo de bitcoin''Praga é o lar de uma forte comunidade de apoiadores e detentores de criptomoedas. A cidade tem até um café onde os clientes podem pagar apenas em bitcoin. Muitos usuários da moeda digital a veem como uma alternativa viável ao sistema monetário atual. Eles até questionam se instituições como o Banco Nacional Tcheco deveriam ter medo do bitcoin e de outras moedas independentes e de seu poder de marginalizar o dinheiro tradicional.Realmente não há razão para os bancos temê-los. Todas as moedas alternativas são insignificantes em termos de tamanho e escopo: as transações eletrônicas usando bitcoin em todo o mundo representam apenas 16% das transações eletrônicas realizadas na coroa tcheca, uma moeda usada por apenas 10,5 milhões de pessoas.Uma questão mais fundamental é o poder de compra em constante mudança do bitcoin. O dinheiro é um meio de pagamento e liquidação de transações, uma unidade de conta e uma reserva de valor. Mudanças rápidas no poder de compra são inimigas de qualquer moeda boa. Se uma moeda está perdendo valor, as pessoas querem se livrar dela rapidamente. Em contraste, se está ganhando valor, eles o acumulam.O princípio fundamental do bitcoin é que seu suprimento será fixo, o que o torna inerentemente volátil. Esta é a antítese do nosso sistema monetário elástico, que se baseia no princípio de que, para manter o poder de compra do dinheiro relativamente constante, a quantidade de dinheiro deve mudar de forma flexível ao longo do tempo. A lição de política monetária do final dos séculos 19 e 20 é que a estabilidade de preços é importante. As pessoas podem considerá-lo um dado adquirido, mas esta é a característica mais benéfica do dinheiro na sua forma atual e da política monetária por trás dele. As pessoas podem usar uma moeda e nem pensar em por que confiam nela.Os banqueiros centrais falharam em explicar que uma das principais razões para suas ações durante e após a crise financeira de 2008 foi manter a estabilidade de preços. Isso às vezes exigia políticas pouco ortodoxas.As pessoas tendem a se preocupar com a \"criação\" de muito dinheiro, mas geralmente têm pouca ideia sobre o tamanho da oferta monetária. Quando pergunto a audiências instruídas, muitas vezes obtenho estimativas totalmente erradas para a oferta monetária, mas bastante precisas para a taxa de inflação. A estabilidade de preços, e não a oferta monetária, importa.Enquanto os banqueiros centrais respeitarem esse princípio, não há razão para temer que nosso sistema monetário existente seja substituído por uma alternativa de moeda fixa.'''Eu adorei o texto, não pelo conteúdo ou por concordar com o que ele diz. Mas pela FORMA de abordar. Ao invés de incriminar, o cara foi lá e discutiu uma caracteristica. Colocou pontos e dados interessantes no debate. Adoraria que os políticos brasileiros fizessem as reflexões dessa forma. E agora podemos discutir um pouco sobre o conteúdo também. Ele aponta a flexibilização monetária e a impressão como algo bom e necessário, mas de uma perspectiva que ainda não conheciam. Como sendo necessário para estabilidade de preço. O que acham??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455948",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "June 10, 2023, 04:51:03 PM",
      "body": "Quote from: Disruptivas on June 10, 2023, 12:10:40 PME agora podemos discutir um pouco sobre o conteúdo também. Ele aponta a flexibilização monetária e a impressão como algo bom e necessário, mas de uma perspectiva que ainda não conheciam. Como sendo necessário para estabilidade de preço. O que acham??Realmente o texto faz uma abordagem diferente do tema. E isso fez-me ficar a pensar no seguinte:O fiat hoje tem o valor que tem para as pessoas, porque é uma moeda aceite pelo Estado para pagar os impostas. Sendo o Estado a controlar +/- o seu valor, permite conseguir controlar os seus pagamentos (subsídios, contratação, indemnizações, etc.)Agora se um Estado passar aceitar o Bitcoin como moeda, permitindo então receber os impostos em BTC, deixa de poder controlar o seu valor.Então, isso quer dizer que o Estado passa a não conseguir prever quanto BTC vai receber, porque o valor cambial muda. Como não sabe quanto tem de pagar. Ou seja, se ocorrer uma super valorização do bitcoin, eles iriam receber menos BTC. E se mais tarde houver uma descida do valor, eles teriam de pagar muito mais BTC do previsto para os seus pagamentos.Isto não pode complicar as contas do Estado?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "June 10, 2023, 07:43:51 PM",
      "body": "Estava para fazer uma quantiade de quotes mas dá imenso trabalho.Vou simplesmente tentar elaborar uma resposta de uma forma ordenada conforme o texto que li.Devo confessar que do texto que a @Disruptivas escreveu, não percebo ao certo que é a favor da forma como fiat funciona e como é gerenciado pelos estados ou não.Claro que do ponto de vista estatal/socialista/capitalista, eles têm que ter medo de Bitcoin, pois sabemos que perdem o controlo que têm hoje e o que ainda procuram mais com as CBDCs.Eles não procuram um sistema financeiro justo, procuram um que sirvam os interesses deles e consequentemente dos grandes grupos económicos, pois são estes que controlam os políticos.Referncio apenas este quote:Quote from: Disruptivas on June 10, 2023, 12:10:40 PMSe uma moeda está perdendo valor, as pessoas querem se livrar dela rapidamente. Em contraste, se está ganhando valor, eles o acumulam....O princípio fundamental do bitcoin é que seu suprimento será fixo, o que o torna inerentemente volátil.Isto apenas acontece porque Bitcoin ainda não tem liquidez suficiente para dissolver grandes movimentos de valor. Num cenário onde Bitcoin é largamente usado em grande escala, a volatiliade diminui, tal como acontece neste momento com fiat!Discordo que o facto de a moeda ter um supply finito que a torne inerentemente volátil pela razão que acabei de mencionar!Isto é como mandar uma pedra para dentro de uma banheira e mandar a mesma pedra em mar alto de um helicóptero. O impacto e as ondas resultantes nas duas situações são completamente diferentes precisamente por causa da quantidade de água ser tãoa diferente nas duas circunstâncias.Quote from: Disruptivas on June 10, 2023, 12:10:40 PMA lição de política monetária do final dos séculos 19 e 20 é que a estabilidade de preços é importante.A estabiliade dos preços, num cenário onde deixamos o mercado livre funcionar, mantém-se proporcional à lei da oferta e da procura. E o equilíbrio obtém-se naturalmente. Essa estabilidade não tem que depender da impressão monetária, porque, naturalmente que, se o estado imprime notas sem haver alteração da procura (ou da oferta), os preçostêm que subir (ou desccer), ou devo dizer, que temos que pagar mais pelo mesmo porque o dinheiro desvalorizou (debasement).Quote from: Disruptivas on June 10, 2023, 12:10:40 PMAs pessoas podem usar uma moeda e nem pensar em por que confiam nela.Isto é o que, infelizmente, mantém os estados onde estão e com o poder que têm. E desde 1971 ainda mais!Quote from: Disruptivas on June 10, 2023, 12:10:40 PMOs banqueiros centrais falharam em explicar que uma das principais razões para suas ações durante e após a crise financeira de 2008 foi manter a estabilidade de preços.A que acções te referes? Achas que falharam ou que não lhes convinha? Eu acredito mais na segunda. Em 2020, mais do mesmo. Os nossos economistas não são burros e sabem bem como funciona a economia Keynesiana. E por cunivência, interesses ou por ordens superiores, as crises fuinanceiras acontecem de tempos a tempos, os chamados ciclos económicos [1] [2]Quote from: Disruptivas on June 10, 2023, 12:10:40 PMAs pessoas tendem a se preocupar com a \"criação\" de muito dinheiro, mas geralmente têm pouca ideia sobre o tamanho da oferta monetária.Para além disso as pessoas nem tão pouco sabem de onde vem a necessidade de imprimir dinheiro. De onde vem o valor que é atribuído ao dinheiro. Esse vem simplesmente da dívida que o estado vai contraindo e que nós como contribuintes asseguramos como pagantes! Somos os fiadores do estado assim que nós como pais, vamos ao registo civil dar aquele número mágico aos nossos filhos. A partir desse momento, aquela pessoa é uma empresa a pagar a dívida do estado!Quote from: Disruptivas on June 10, 2023, 12:10:40 PMEnquanto os banqueiros centrais respeitarem esse princípio, não há razão para temer que nosso sistema monetário existente seja substituído por uma alternativa de moeda fixa.'''O sistema em si está feito para não ser necessário respeitá-lo. E de cada vez que caímos em crises, é porque mais uma vez, esses e outros princípios são completamente abalrroados para servir interesses maiores.(presumo que o princípio que falas é o de que a impressão de dinheiro é importarte para estabilizar o preço dos proutos, ou por outras palavras, para estabilizar o poder de compra da moeda).Quote from: joker_josue on June 10, 2023, 04:51:03 PMO fiat hoje tem o valor que tem para as pessoas, porque é uma moeda aceite pelo Estado para pagar os impostas.Não sei se é necessário sequer o final da tua frase... Nós acreditamos no valor daquele bocado de papel, simplesmente porque o estado diz que tem aquele valor... :| :|Quote from: joker_josue on June 10, 2023, 04:51:03 PMpermite conseguir controlar os seus pagamentos...Se fosse só isso... O pior é que te controla a ti (a nós todos) como quer e bem lhe apetece, e como disse ali em cima, ainda mais vai controlar com as CBDCs...[3]Este carneiro descai-se no objectivo das CBDCs... Controlo absoluto. Seu eu usar uma nota de mil para limpar o cu, ele vai saber o que comi ao almoço!Quote from: joker_josue on June 10, 2023, 04:51:03 PMAgora se um Estado passar aceitar o Bitcoin como moeda, permitindo então receber os impostos em BTC, deixa de poder controlar o seu valor.Então, isso quer dizer que o Estado passa a não conseguir prever quanto BTC vai receber, porque o valor cambial muda. Como não sabe quanto tem de pagar. Ou seja, se ocorrer uma super valorização do bitcoin, eles iriam receber menos BTC. E se mais tarde houver uma descida do valor, eles teriam de pagar muito mais BTC do previsto para os seus pagamentos.Isto não pode complicar as contas do Estado? Nem tem que controlar o valor de BTC. Esse é o medo deles. Mas é um medo infundado uma vez que Bitcoin não é deflaccionário por causa do supply limitado..E também não acho que seja necessário prever  quanto vale BTC. 1BTC = 1BTC.   E sendo assim, mesmo que seja necessário estabelecer uma referência entre o valor intrínseco de BTC para saber se estamos a pagar a mais ou a menos por um bem ou serviço, temos que levar em conta que num cenário onde BTC esteja a ser usado em larga escala, o problema da volatilidade será tão grande como o que temos agora com o fiat. Quase negligenciável. Ninguém anda preocupado se o € subiu 0.1cent relativamente ao dolar ou se desceu 0.1cent...[1] - https://www.cgd.pt/Particulares/Poupanca-Investimento/Fundos-de-Investimento/Destaques/Pages/ciclo_economico.aspx[2] - https://pt.wikipedia.org/wiki/Ciclo_econ%C3%B4mico[3] - https://www.youtube.com/watch?v=rpNnTuK5JJUEdited;Não consegui evitar alguns quotes! :p",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 11, 2023, 01:02:34 PM",
      "body": "Quote from: joker_josue on June 10, 2023, 04:51:03 PMEntão, isso quer dizer que o Estado passa a não conseguir prever quanto BTC vai receber, porque o valor cambial muda. Como não sabe quanto tem de pagar. Ou seja, se ocorrer uma super valorização do bitcoin, eles iriam receber menos BTC. E se mais tarde houver uma descida do valor, eles teriam de pagar muito mais BTC do previsto para os seus pagamentos.Isto não pode complicar as contas do Estado? Não sei bem como Ele Salvador faz, mas sem dúvida teria desafios bem complexos. Tanto para os pagamentos das contas do Estado como das contas de fora eu imagino. Seria necessário uma gestão muito mais cuidadosa de tudo. Talvez não seja o ideal. O Hayek tem uma discussão de várias moedas convivendo. Talvez seja mais o caso, o Estado com uma moeda e várias outras sendo aceitas. Tal como é com os grãos no mercado agro, onde são usados para pagar contas de aluguel de propriedade por exemplos, cujo preço vária mas vai se ajustando. Não sei se ficou claro, pelas suas perguntas dark, tive impressão que não. O texto não é meu, é uma tradução de um texto publicado no site do Banco Central da República Checa.  Acho que havia esquecido o link:https://www.cnb.cz/en/public/media-service/interviews-articles/Dont-be-afraid-of-bitcoinConcordo com o ponto da liquidez dark, também acho que tende a ser menos volátil com o tempo, mas acho que ainda é necessário um marketcap muuuuuuuito maior. Não tenho ideia de quanto. Por que como é uma moeda global não bastaia chegar ao valor das moedas de alguns países para estabilizar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "June 12, 2023, 11:47:00 AM",
      "body": "Quote from: Disruptivas on June 11, 2023, 01:02:34 PMNão sei se ficou claro, pelas suas perguntas dark, tive impressão que não. O texto não é meu, é uma tradução de um texto publicado no site do Banco Central da República Checa.  Acho que havia esquecido o link:https://www.cnb.cz/en/public/media-service/interviews-articles/Dont-be-afraid-of-bitcoinConcordo com o ponto da liquidez dark, também acho que tende a ser menos volátil com o tempo, mas acho que ainda é necessário um marketcap muuuuuuuito maior. Não tenho ideia de quanto. Por que como é uma moeda global não bastaia chegar ao valor das moedas de alguns países para estabilizar. Ahh ok... tinha ficado com a ideia de que tinhas elaborado um comentário teu com base na notícia. Não me apercebi que tinhas feita apenas a tradução aqui para o Bitcointalk.Só para eu perceber aqui outra coisa de uma forma geral:Dos membros aqui do sub-forum português/brasileiro, poucos ou nenhuns são maxis, certo? Maior parte de vós vê valor noutras moedas para além de Bitcoin, certo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "June 13, 2023, 08:52:07 PM",
      "body": "Um lindo país que é a Republica Checa. Lembro ainda quando ela se chamava Tchecoslováquia. Foi quando caiu o muro de Berlim e veio uma onde de separações em países do leste europeu. Daí a Tchecoslováquia se separou e formou-se dois países. A Republica Checa e a Eslováquia. A essa separação deu-se o nome de : \"Separação de Veludo\", pois foi feita de forma totalmente pacifica.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 14, 2023, 08:33:21 PM",
      "body": "Quote from: darkv0rt3x on June 12, 2023, 11:47:00 AMQuote from: Disruptivas on June 11, 2023, 01:02:34 PMNão sei se ficou claro, pelas suas perguntas dark, tive impressão que não. O texto não é meu, é uma tradução de um texto publicado no site do Banco Central da República Checa.  Acho que havia esquecido o link:https://www.cnb.cz/en/public/media-service/interviews-articles/Dont-be-afraid-of-bitcoinConcordo com o ponto da liquidez dark, também acho que tende a ser menos volátil com o tempo, mas acho que ainda é necessário um marketcap muuuuuuuito maior. Não tenho ideia de quanto. Por que como é uma moeda global não bastaia chegar ao valor das moedas de alguns países para estabilizar. Ahh ok... tinha ficado com a ideia de que tinhas elaborado um comentário teu com base na notícia. Não me apercebi que tinhas feita apenas a tradução aqui para o Bitcointalk.Só para eu perceber aqui outra coisa de uma forma geral:Dos membros aqui do sub-forum português/brasileiro, poucos ou nenhuns são maxis, certo? Maior parte de vós vê valor noutras moedas para além de Bitcoin, certo?Eu comentei no outro tópico um pouco da minha perspectiva. Eu sem dúvida acho que o Bitcoin é melhor que quase todas as criptomoedas em quase tudo. Mas não é em tudo. E não é todas as criptomoedas que são inuteis. É o Stepn que me ajuda a todos os dias lembrar que eu sou um humano com um CORPO e me ajuda a sair pra caminhar na chuva, no frio, e não atrofiar minhas pernas sentadas nos dias mais dificeis Filecoin, Celo, Gitcoin.. são projetos que foram super importantes pra mim e cujo valor sem dúvida, eu reconheço. Isso faz eles melhores que o BTC em ser reserva de valor e meio de troca? Claro que não. Isso significa que eles não tenham valor? Claro que não. Quote from: Paredao on June 13, 2023, 08:52:07 PMUm lindo país que é a Republica Checa. Lembro ainda quando ela se chamava Tchecoslováquia. Foi quando caiu o muro de Berlim e veio uma onde de separações em países do leste europeu. Daí a Tchecoslováquia se separou e formou-se dois países. A Republica Checa e a Eslováquia. A essa separação deu-se o nome de : \"Separação de Veludo\", pois foi feita de forma totalmente pacifica. Tu já teve a chance de ir visitar?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "June 19, 2023, 06:35:30 PM",
      "body": "Quote from: Disruptivas on June 14, 2023, 08:33:21 PMTu já teve a chance de ir visitar? Dei uma passada rapidinha de uns 2 dias quando fui fazer um \"tour\" no Norte da Itália(origem dos meus antepassados) e acabei subindo para conhecer a Áustria e no finalzinho dei uma esticada em Praga, capital da República Checa. Um lugar bem interessante e um povo bem acolhedor.  A cerveja é muito boa. Hahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "June 19, 2023, 07:23:15 PM",
      "body": "Quote from: Paredao on June 13, 2023, 08:52:07 PMUm lindo país que é a Republica Checa. Lembro ainda quando ela se chamava Tchecoslováquia. Foi quando caiu o muro de Berlim e veio uma onde de separações em países do leste europeu. Daí a Tchecoslováquia se separou e formou-se dois países. A Republica Checa e a Eslováquia. A essa separação deu-se o nome de : \"Separação de Veludo\", pois foi feita de forma totalmente pacifica. E agora já nem República Checa se chama. Não sei qual a razão mas mudaram para algo como Chéquia ou algo assim. Não sei ao certo como se escreve. Deve ter sido para seguir a moda da Holanda que deixou de ser Holanda para ser Países Baixos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 19, 2023, 08:05:17 PM",
      "body": "Quote from: Paredao on June 19, 2023, 06:35:30 PM A cerveja é muito boa. HahahaMelhor que a cerveja portuguesa!?   Quote from: darkv0rt3x on June 19, 2023, 07:23:15 PME agora já nem República Checa se chama. Não sei qual a razão mas mudaram para algo como Chéquia ou algo assim. Não sei ao certo como se escreve. Deve ter sido para seguir a moda da Holanda que deixou de ser Holanda para ser Países Baixos.Portugal devia fazer o mesmo e chamar-se Lusitânia! Aos portugueses não se chamam lusos!? Então, devia ser Lusitânia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "June 19, 2023, 08:19:07 PM",
      "body": "Quote from: joker_josue on June 19, 2023, 08:05:17 PMQuote from: Paredao on June 19, 2023, 06:35:30 PM A cerveja é muito boa. HahahaMelhor que a cerveja portuguesa!?   Quote from: darkv0rt3x on June 19, 2023, 07:23:15 PME agora já nem República Checa se chama. Não sei qual a razão mas mudaram para algo como Chéquia ou algo assim. Não sei ao certo como se escreve. Deve ter sido para seguir a moda da Holanda que deixou de ser Holanda para ser Países Baixos.Portugal devia fazer o mesmo e chamar-se Lusitânia! Aos portugueses não se chamam lusos!? Então, devia ser Lusitânia.   E já se chamou, acho eu. Mas não quero estar a inventar. Mas sempre estivemos associados à Lusitânia, sim. Lembro-me de que Portugal se começou por chamar Condado Portucalense (ou Portus Calem ou algo ssim) mas o nome Lusitânia não me recordo de onde vem!E mais, se os habitantes de Espanha são espanhóis, porque é que os da Rússia não são rissóis?E se as habitantes da Polónia são polacas, porque é que as da Estónia não são estacas?Isto são piadas mas não sei se funcionam bem para vocês porque vocês não usam o \"polacas\" e \"polacos\" mas sim \"poloneses\", certo?E em Portugal temos o termo \"estacas\" que se refere a uma tábua que é enterrada na terra para servir de suporte a alguma coisa. Por exemplo a uma rede de arame, ou algo do género!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 19, 2023, 11:23:57 PM",
      "body": "Quote from: darkv0rt3x on June 19, 2023, 08:19:07 PME já se chamou, acho eu. Mas não quero estar a inventar. Mas sempre estivemos associados à Lusitânia, sim. Lembro-me de que Portugal se começou por chamar Condado Portucalense (ou Portus Calem ou algo ssim) mas o nome Lusitânia não me recordo de onde vem!Veem dos tempos do Imperio Romano.Durante o Imperio Romano, parte do que hoje é Portugal, era chamado Lusitânia. Não sei indicar exatamente as fronteiras, mas seria mais ou menos desde Coimbra até ao Algarve, apanhado ainda o que é hoje a Extremadura espanhola.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "June 20, 2023, 06:57:20 PM",
      "body": "Quote from: joker_josue on June 19, 2023, 11:23:57 PMVeem dos tempos do Imperio Romano.Durante o Imperio Romano, parte do que hoje é Portugal, era chamado Lusitânia. Não sei indicar exatamente as fronteiras, mas seria mais ou menos desde Coimbra até ao Algarve, apanhado ainda o que é hoje a Extremadura espanhola.Perfeito. Lusitânia era parte da província romana da Hispania. Teve até uma revolta comandada pelo General Viriato, um membro da Tribo Lusitana, contra a dominação romana à época. Tem um monumento na cidade de Viseu que homenageia o grande Viriato. Pena que a revolta acabou sufocada e Viriato foi executado pelos romanos:Obs*: Paredão também é cultura.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}