{
  "id": "topic_5412690",
  "title": "Blockchayne",
  "author": "Blockchayne",
  "created_time": "September 07, 2022, 07:05:50 AM",
  "content": "Hello, Firstly, I want to express how grateful I am to have Bitcointalk.org as a trusted resource to factiltate discussion of various crypto relations.    Thanks to all of my fellow members for their contributions.   2ndly I have a major concern about the bizarre means of calculations being applied by this casino TrustDice.Win (which has a higher than average reputation as I have heard) But perhaps it’s time to reevaluate the consensus after considering my recent experience  It's not anything I have seen in my decade plus of gaming and wagering. As such, I felt it necessary to confront this one openly and transparently. So here we go! Rather than go through all the transaction info and calculations I will provide a summary of the total amounts and outcomes: I deposited 2 MBTC and was advised that I won a wheel spin.  Prior to making my depo I opted OUT of the 50% deposit bonus that is pre-selected for you in their cashier.  I said no thanks.  But after the depo was confirmed, I then was offered spin on the wheel for this BATMAN promo. I spun the wheel and got 10 spins yayy (the lowest amount possible on the wheel) which I was fine with.  Okay 10 spins. And the winnings have a 40x playthrough.  Okay sure.  But here's where it becomes strange.  Free Spins begin, I have 10 spins total. Fast forward to the end, I finished with winnings of 0.000302 BTC or 0.3 mbtc! Hardly any winnings at all.  But okay. X40 playthrough gives me a wagering requirement 0.012 approx or 12.3 MBTCThese numbers are confirmed in the promo section of my account.  It shows these numbers in their respective columns. So remember I had deposited 2 mbtc so now I have 0.002302 BTC OR 2.3 MBTC TOTAL. Wow. Not exactly what I had hoped for but that's fine.  Maybe an unlikely set of freespins.  It happens. No problem.   Moving on.  So now I take my 2.3 MBTC and play for a while and while.  My lowest balance was only 1.3 MBTC and to my surprise I worked my way all the way through that playthrough.With 99% of the playthrough completed my balance was 8.7 MBTC.  A nice amount I thought.  So at this point there is only a few spins left until I hit the 100% and finally clear that playthrough to unlock my free spins winnings which we recall from earlier was 0.000302 BTC or 0.3 mbtc.  100% achieved.  Yayyy.  I made it right? Nice day of wagering. 8.7 MBTC nice little come up right? WRONGI look up and suddenly my balance has changed from 8.7MBTC to 3.3MBTC. Wait whatttt? Certainly there was some error or miscalc?!? So I open live chat and explain and the agent says: \"as I can see you were using the batman promo which has a maximum of 3.3MBTC for the freespins\" \"....For the freespins\" were her exact words.  I didn't see that listed anywhere prior but ya know what, I accept it as they say.  Maybe there were some fine print, not the most ethical practice but I've seen it many times Plus I only won a small amount on the freespins of 0.3mbtc so the Max of 3.3 MBTC WINNINGS on the freespins should not affect me anyways.  So I stand my position that there is an error.  The support agent says \"no sorry thats the Max win for this promo\" At this point I see that they are fully aware of my balance details and are miscategorizing my funds as being from the freespins which had a hidden maximum winnings restriction. This is one of the sleight of hand type of shady behavior that I wouldn't normally expect from what appears to be a reputable website.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412690",
  "comments": [
    {
      "author": "Blockchayne",
      "created_time": "September 07, 2022, 07:15:47 AM",
      "body": "I continue to protest and exclaim that these funds were not won on the freespins.  I won only 0.3 MBTC on the freespins.  The bonus module within my account that tracks these exact bonuses and wagering requirements says itself \"free spins promo : winnings 0.3 MBTC\" so they prove on their own means that 0.3 MBTC is the freespins winnings.  So then why has my balance been reduced by 5.5 mbtc as I cleared the playthrough? This is improper behavior, incorrect categorization of my balance.  It's dishonest bahavior and they are attempting to shave my winnings but they are using irregular means or scam-math to weasel their way out of Paying me my winnings.  I know they have a decent reputation and that's why I'm confronting this foolery. This is nonsense logic and the community should stand against nonsensical justifications like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blockchayne",
      "created_time": "September 07, 2022, 07:53:25 AM",
      "body": "Proof of the amount displayed in my bonus history",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blockchayne",
      "created_time": "September 07, 2022, 08:12:33 AM",
      "body": "I’m a very reasonable individual so naturally I have considered the possibility that I was wrong initially, and if that was the case then here are some other statements that would also be true as a consequence: It means that my 2 mBTC deposit would have a maximum profit multiplier of only 0.65X and that is if I got the highest payout possible on the freespins. Could you imagine any terms and conditions that said “maximum profit that can be paid out for this bonus is 0.65X”That’s asinine. 5X max cap is considered very low by any industry standard, most casinos wouldn’t even stoop to *that* level out of concern for their reputation but to think of a site applying a cap of 0.65X max winnings, that is a very bad joke! Also it would mean that I am risking 2 mBTC with a 40x playthrough (which is a long shot to make it through 40X to begin with) for a maximum total profit of 1.3 mBTC. Again, clearly that is not a favorable “promo”. Hey deposit and clear 40x playthrough and you will win your money back plus maybe a little extra if you score the highest possible return allowable I mean come on that is totally unreasonable and clear prooof that this is unacceptable behavior with absurdly restrictive terms and no reputable casino would even dare to act like this — they should be flagged. Upon looking into it further they openly pay their players for reviews on TrustPilot  so again that’s unethical as well and against the terms of use for TrustPilot… more trickery and illusions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blockchayne",
      "created_time": "September 08, 2022, 12:39:05 AM",
      "body": "Again I present another example: If I deposited 4mbtc and accepting the freespins bonus.  Spin through the spins and win the maximum amount allowable by the bonus and then clear the 40x playthrough, despite this incredible achievement I would actually have less money than I deposited. I would have only 3.3 MBTC but I deposited 4 MBTC. This shifts the favor in advantage of the house by such a high amount that the game is nearly impossible and should not be described as gambling st all.  It's either purely for entertainment and not really gambling or its a scam that used magic tricks to calculate their players balances.  Again.  No other casino operates under these corrupted rules and calculations.  It's asinine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "September 08, 2022, 04:04:30 AM",
      "body": "I remember seeing similar cases on other casinos where they'd have a limit on how much you can get out of their bonus.Even if the bonus they're giving out doesn't seem to be fair, there's nothing we could do against the terms and conditions of their bonuses since it's their casino they can also update it at any time. If you're hoping for a better bonus then it's best to not take the current bonuses they offer and hope the other players do the same so they'd get the message and make some improvements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 08, 2022, 07:02:31 AM",
      "body": "Quote from: Blockchayne on September 08, 2022, 12:39:05 AMAgain I present another example: If I deposited 4mbtc and accepting the freespins bonus.  Spin through the spins and win the maximum amount allowable by the bonus and then clear the 40x playthrough, despite this incredible achievement I would actually have less money than I deposited. I would have only 3.3 MBTC but I deposited 4 MBTC. This shifts the favor in advantage of the house by such a high amount that the game is nearly impossible and should not be described as gambling st all.  It's either purely for entertainment and not really gambling or its a scam that used magic tricks to calculate their players balances.  Again.  No other casino operates under these corrupted rules and calculations.  It's asinine.  If I'm not mistaken, 4mbtc is equal to 0.004btc which is in the amount of 76-77$, also according to your story, you entered 4mbtc and the only deposit when it came to the gambling platform was 3.3mbtc/0.0033btc 63-64$ came to your balance at the current price of bitcoin today.He also deducted quite a lot, I don't know if it's a transaction fee or what? Many crypto gambling platforms have that style. the other one, if you use dollars, the charge is even 20$, but if you use altcoins, the charge is small.If so, my advice to you is to use altcoins like Dogecoin, Trx, and not Bitcoin. I only suggest this so that you don't end up like the others who gambled in your experience there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 08, 2022, 07:17:46 AM",
      "body": "Promo related winnings always comes with lots of confusion,they don't even let us feel about our lucky wins and make them to regret with thoughts. Its probably mentioned in their terms but its highly unethical if they changed terms to avoid paying the rewards after your win then I don't trust them, you also free to hear about others opinion regarding this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "September 08, 2022, 08:21:36 AM",
      "body": "sorry, correct me if  I am wrong(and sorry if I am repeating what you said), your complaint is that they included the money you deposited into their promo, right? I mean you were supposed to get 3.3mbtc (after you cleared the wagering requirement) then plus your deposited coins which 2mbtc, so you are supposed to have 5.3mbtc in total but because they included your deposited amount into their promo you only got 3.3mbtc? reading through it, it seems like a huge misunderstanding. I hope trustdice could properly explain as to why they included your deposited money into their promo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "September 08, 2022, 10:09:06 AM",
      "body": "Quote from: acroman08 on September 08, 2022, 08:21:36 AMsorry, correct me if  I am wrong(and sorry if I am repeating what you said), your complaint is that they included the money you deposited into their promo, right? I mean you were supposed to get 3.3mbtc (after you cleared the wagering requirement) then plus your deposited coins which 2mbtc, so you are supposed to have 5.3mbtc in total but because they included your deposited amount into their promo you only got 3.3mbtc? reading through it, it seems like a huge misunderstanding. I hope trustdice could properly explain as to why they included your deposited money into their promo.It looks like his deposits and wins from the free spins were mixed so the casino could come up with a counter-argument that he probably wouldn't reach the 40x wagering requirement without using the 2mbtc.It's quite a messed up system and there has to be a way to separate bets using promotions and those regular deposits. Maybe there's an option there to forfeit the bonus winnings so he could just play normally with the 2mbtc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "September 08, 2022, 10:36:28 AM",
      "body": "Quote from: Blockchayne on September 07, 2022, 07:15:47 AM-snip-It's better to created a scam \"assumption\"In my opinion same as other people, the system miss-calculated a winning balance and with the wheel spin. This is also why, I hate any kind promotion with a turnover system (Most the time for turnover with over 40-50x).They design turnover for losing ~LOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 08, 2022, 11:21:45 AM",
      "body": "OP, Trust Dice's official representative here, Coinbox1, has already responded to your allegations with a lengthy explanation. It's on the Batman x TrustDice! Win Free spins and more! official thread, where you also raised your concern. It seems the official representative of Trust Dice has counter allegations against you. You're now being accused of having ill-intentions. You're now being accused of misleading us with partial screen grabs. Would you care to respond to it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 08, 2022, 01:12:46 PM",
      "body": "We are really talking about very small amounts here...  If this was my casino, I would just settle into some kind of agreement and then politely end the relationship with the gambler. (cut the ties)  The amount we are talking about is not going to break the Bank and there are not people lined up outside to also claim the same thing happened to them. Just settle and end the relationship..... the washing of the dirty clothes in public is causing a lot more damage. Also, time spend on investigating this and countering the claims made, could be better spend on other people's problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "September 08, 2022, 03:54:21 PM",
      "body": "That's why I also rarely claim promos that have a 40x round requirement, except from free promos because every casino has a max withdraw requirement from every ongoing promo. I think agree It shouldn't be combined because if you lose 0.0003 BTC the promo should have been completely used up, then you played and claimed your lowest balance already 0.0013 btc, but why is that requirement still running? it shouldn't ! That's right. But every casino has a different system and different conditions, hopefully in the future there will be a solution regarding main balance and promo balance \"separately\". Also agree with Yogge said above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 08, 2022, 04:57:19 PM",
      "body": "That is why you never chase bonuses and you never try to complete them. They can easily be manipulated or changed by the gambling platform and there will be not much you can do. But since you have already brought this into light, it's a good thing that we know about this so that we know how TrustDice operates when it comes to their bonuses. Then again, it would have been better if we read all of the terms and conditions on these bonuses before we decide to bet on it for the bulk of our gambling time at the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "September 08, 2022, 06:50:15 PM",
      "body": "Well to be honest if you did win through free spins it would be different but if you did win through your own balance then these guys need to pay you back, then again these bonuses are not really great, if you find yourself in a situation where you are getting too much money in the first place then it's certainly not a good idea to chase it since at the end this would somehow end bad, they have so many terms and conditions and thus no one know what is going to happen and how it's going to happen as well, you cannot go through all the paragraphs thus I think for them it was wrong to do something like this, maybe you should be compensated in terms of spins or something but ofc they could have told you when you did win the max. Amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 08, 2022, 07:15:47 PM",
      "body": "Quote from: Darker45 on September 08, 2022, 11:21:45 AMOP, Trust Dice's official representative here, Coinbox1, has already responded to your allegations with a lengthy explanation. It's on the Batman x TrustDice! Win Free spins and more! official thread, where you also raised your concern. It seems the official representative of Trust Dice has counter allegations against you. You're now being accused of having ill-intentions. You're now being accused of misleading us with partial screen grabs. Would you care to respond to it?It seems like the time to have a dialogue is here for the OP, but no response on the allegations that they are using partial screen grabs to mask their intention of defrauding the casino.  I think we're owed a bit of an explanation and to see your response to these allegations.The amount of money is so small, I imagine they've had to pay their employees more to deal with this.  That leads me to believe they aren't doing something crazy, but feel that they acted appropriately and all procedures were followed.Watching how this develops from here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "September 08, 2022, 08:27:41 PM",
      "body": "Quote from: jrrsparkles on September 08, 2022, 07:17:46 AMPromo related winnings always comes with lots of confusion,they don't even let us feel about our lucky wins and make them to regret with thoughts. Its probably mentioned in their terms but its highly unethical if they changed terms to avoid paying the rewards after your win then I don't trust them, you also free to hear about others opinion regarding this.Promo related winnings always come with lots of confusion I can attest, there have been countless times I witness such allegations and confusions and most times there are not clear ways to determine the truth except the gambling site involved would come up with their side of the story. The amount involved here isn't much, so I am hoping to read from TustDice and then know the total truth. Who cares to investigate what Ognasty pointed out below Quote from: OgNasty on September 08, 2022, 07:15:47 PMIt seems like the time to have a dialogue is here for the OP, but no response on the allegations that they are using partial screen grabs to mask their intention of defrauding the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "September 08, 2022, 08:39:54 PM",
      "body": "Quote from: Blockchayne on September 08, 2022, 12:39:05 AMAgain I present another example: If I deposited 4mbtc and accepting the freespins bonus.  Spin through the spins and win the maximum amount allowable by the bonus and then clear the 40x playthrough, despite this incredible achievement I would actually have less money than I deposited. I would have only 3.3 MBTC but I deposited 4 MBTC. This shifts the favor in advantage of the house by such a high amount that the game is nearly impossible and should not be described as gambling st all.  It's either purely for entertainment and not really gambling or its a scam that used magic tricks to calculate their players balances.  Again.  No other casino operates under these corrupted rules and calculations.  It's asinine.  This is why I always think twice if I think the bonus terms are confusing but I always ended up not playing through them because in my mind, I will only get busted without getting that tiny amount of bonus. Better if I will play the normal way because there are no commitments on it and there is no limit on how much I can win and withdraw.The house always has the advantage, this is why it's called gambling because you will be needing an extreme luck in order to win on them but it can also be entertaining because you won't know if you will get lucky or not but the most important aspect of all is that you must be willing to accept your defeat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsykes",
      "created_time": "September 11, 2022, 02:06:39 PM",
      "body": "@Blockchayne have a lot of bad experiences in casino especially casinos in this forum you can check the history of his postsIs this just a coincidence? impossible   I often see extortion efforts like this and try to damage other casino reputation I don't accuse anyone of just talking about the possibility",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}