{
  "id": "topic_5465318",
  "title": "ParaBoi",
  "author": "ParaBoi",
  "created_time": "September 01, 2023, 04:26:07 PM",
  "content": "I recently came across something when reading about transactions that I want to learn more about. A request is made, and a fee is then added, when someone wants to send some BTC to someone else. The sender can choose their own price or accept a preset amount. The recipient of transaction fees is? They appear to be independent of the incentive for finding a block, but as this becomes more expensive, will transaction fees be the only source of funding for BTC? as so, who will profit from them?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465318",
  "comments": [
    {
      "author": "Bitcoin Smith",
      "created_time": "September 01, 2023, 04:30:00 PMLast edit: September 01, 2023, 04:46:38 PM by Bitcoin Smith",
      "body": "The recepient of BTC transaction fees are miners but they also get block reward ( currently 6.25 BTC) along with fees of all the transactions in that block.There is something called Bitcoin halving[1] which happens every 210,000 by that time the block reward reduces from it's current value to half, the next halving is expected to be Apr 26, 2024 at 05:52:04 AM UTC so the block reward will be 3.125 BTC.The fees depends on the mempool status which is highly dynamic but you can choose the fee you want if you are sending Bitcoins from non custodial wallet such as Electrum or choose the fee depends on how long you can wait for the transaction to get confirmed.To get the estimation of current fee use https://mempool.space/The block reward and fees are to incentivize the contribution of miners which keeps the Bitcoin network decentralized.1.What Is Bitcoin Halving?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 01, 2023, 04:53:49 PMLast edit: September 01, 2023, 05:08:51 PM by EL MOHA",
      "body": "Quote from: ParaBoi on September 01, 2023, 04:26:07 PM The sender can choose their own price or accept a preset amount. The recipient of transaction fees is? It’s actually set based on the congestion on the mempool, that is why you will see different fees base on time priority. You can actually customize your own transaction fee if you use wallets that actually have that feature. Example is Electrum and BlueWallet. You can check for fees or calculate them your self from  https://jochen-hoenicke.de/queue/#BTC,24h,weightQuote from: ParaBoi on September 01, 2023, 04:26:07 PM They appear to be independent of the incentive for finding a block, but as this becomes more expensive, will transaction fees be the only source of funding for BTC? as so, who will profit from them?The profit of that transaction fee is for the miners and that’s is not all they also benefit on block reward which diminishes every four years as said by bitcoin Smith above Quote from: Bitcoin Smith on September 01, 2023, 04:30:00 PMThere is something called Bitcoin halving[1] which happens every 210,000 by that time the block reward reduces from it's current value to half, the next halving is expected to be Apr 26, 2024 at 05:52:04 AM UTC so the block reward will be 3.125 BTC.The exact date and time cannot be certain as stated because the changes is affected mostly by difficulty adjustment. The only actual time for halving to occur is every 210, 000 blocks which the assumed time is 10 minutes to mined each but this differs base on hash rate. So this in turn affects the time for halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "September 01, 2023, 05:18:09 PM",
      "body": "QuoteThey appear to be independent of the incentive for finding a block, but as this becomes more expensive, will transaction fees be the only source of funding for BTC?Yes, after all halvings, we will end up with zero basic block reward, and then fees will be the only incentive. Because of that, they were introduced from the first version, to get users familiar with them, and to see, how well they will behave in the wild. Also, fees are needed as a spam protection, because if transactions would be free, then users could send terabytes of data from the very beginning, that would bring us a lot of problems.In the earliest versions, there were a lot of free transactions, because Bitcoin was not popular, and allowing them was needed to encourage people to make any transactions. If you have one, two, or even ten small transactions per block, then it is fine, all of them could be free, especially if the block reward is 50 BTC. But as there were more and more of them, then conditions for fees were triggered, and people had to pay 0.01 BTC per transaction. Then, it later evolved into \"satoshis per byte\" concept, just to solve the Knapsack problem.Currently, after introducing witness, we use \"satoshis per virtual byte\" to measure fees. How they will look in the future? We can only guess. But in general, there are some proposals, and it is not yet clear, which path Bitcoin community will take. You can read some articles about it, for example this one: https://www.truthcoin.info/blog/security-budget-ii-mm/For example, in the link above, you can find three potential solutions, and all of them were demonstrated in practice, to some extent:1. Enormous Block Size Increases: this is what BCH community did, as well as a lot of other altcoins. You can see, where they are now, and make some conclusions, based on that.2. Violate 21M Coin Limit: this topic was raised some time ago, you can read here, how it was commented: https://bitcointalk.org/index.php?topic=5405755.03. >50% Miner Fee-Revenues Come From Merged Mining: you can see some federations (also known as \"somewhat centralized\" sidechains, like Liquid or RSK). We don't have fully decentralized sidechains yet, there were some proposals, like BIP-300 and BIP-301, but because first attempts were rejected, I guess people will try activating sidechains in other ways, or switch to some entirely different ideas, if all proposals will be killed.But also, it could be the fourth way, called \"Something Else\". I don't know exactly, what it could be. We can only guess, for example it could be first-layer non-interactive cut-through, that could make it \"cheap for users\", while being \"expensive in blocks\" at the same time, when you combine N transactions paying single satoshis each, into a single transaction paying N satoshis that will finally land in a block. But it could be something completely different, it is just based on guessing and predicting the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 02, 2023, 03:57:53 AM",
      "body": "Quote from: vjudeu on September 01, 2023, 05:18:09 PM3. >50% Miner Fee-Revenues Come From Merged Mining: you can see some federations (also known as \"somewhat centralized\" sidechains, like Liquid or RSK). We don't have fully decentralized sidechains yet, there were some proposals, like BIP-300 and BIP-301, but because first attempts were rejected, I guess people will try activating sidechains in other ways, or switch to some entirely different ideas, if all proposals will be killed.I wonder what will happen if/when the altcoins used for merge mining become less profitable for that purpose for whatever reason, despite infinite supply caps or whatever - I don't think e.g. LTC has a supply cap though, so it's mainly just going to be DOGE.Also it makes me wonder whether the merge mining is beneficial for the economy of the other coin in any way (and how).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "September 02, 2023, 05:55:23 AM",
      "body": "QuoteI don't think e.g. LTC has a supply cap though, so it's mainly just going to be DOGE.In case of those two coins, it is just \"Violate 21M Coin Limit\", because you can have LTC and DOGE. You cannot have a single Scrypt-based coin, that could be turned into LTC only, or DOGE only, when you move it between those chains. In general, to fix \"Violate 21M Coin Limit\" problem, you need to enforce that limit. And that means, other monetary bases should simply merge into a single one (for example by gradually merging coins, and burning overprinted ones, using free-market-based-dynamically-adjusted exchange rate). That also means, you need a single monetary base, wherever it will be placed (not necessarily on BTC, but I think it is the best option so far), and then, all altcoins should be pegged into that, exactly in the same way as Lightning Network is pegged into BTC.Also, as Paul Sztorc said: \"On Ethereum alone, there is already over 275,000 “wrapped BTC”. Bitcoin will become multichain, on Altcoins if not on Bitcoin\". Currently, we have federations, instead of decentralized sidechains (because federations are always possible). And we have some proposals, like BIP-300 and BIP-301, that were initially rejected. But, as long as altcoins exist, they will try to become multichain, and test sidechains in practice. And guess what: if any such attempt will be successful, then some altcoin could be \"the base for peg-ins and peg-outs\", instead of BTC. So far, many attempts are too centralized, as it is the case for \"wrapped BTC\", but I wonder how long it will take for people to truly understand, what decentralized chains are about, and how to implement them.QuoteI wonder what will happen if/when the altcoins used for merge mining become less profitable for that purpose for whatever reason, despite infinite supply caps or whateverThis problem exists only because the peg is not as strong, as it is for example in Lightning Network. If you have 1:1 peg, then mining some sidechain is never \"less profitable\", because you mine everything, based on exactly the same difficulty. It is also when you can see, why NameCoin implemented Merged Mining wrong, what are their mistakes, and how other coins repeated them, like a parrot. Imagine NameCoin, that produces no new coins at all, where people could just sign their Bitcoins, and use them directly to push any names into NameCoin. Or imagine Litecoin, that uses SHA-256 for mining, and acts like a P2Pool, where all coins are pegged, and when you can mine some smaller amounts, do a lot of transactions there, and later batch the whole traffic, and finalize on the main chain.Even more: if you have Lightning Network, you can try to introduce mining there. Then, instead of using millisatoshis, to pay for routing your transaction, you can pay with your computing power. And then, you don't need other mining algorithms than SHA-256 (because they are needed only if you have a separate monetary base, then you need to protect it with different algorithm). But even if you want to experiment with Scrypt, or other algos, then you can still have nodes accepting that, and use Scrypt hashes to pay for your transaction, instead of using millisatoshis.QuoteWho is account of transaction fees?Initially, miners could receive transaction fees directly. Later, centralized mining pools were created, and currently they are the ones receiving the coinbase reward. However, inside other networks, like Lightning Network, routing nodes receive all fees, and mainchain miners can get some, only when you open or close some channel. In sidechains, miners can always receive fees in P2P way, because they can mine the mainchain directly, or use some decentralized sidechain, mine some coins there (with Merged Mining, so it will raise mainchain difficulty as well), batch all of that, and withdraw it on a mainchain, when they mined something that is worth moving there.In general, I think the question about fees is quite important, because a lot of topics were born from handling that incorrectly (for example, almost all altcoins picked \"Violate 21M Coin Limit\" as their solution).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "September 03, 2023, 12:07:07 PM",
      "body": "The transaction fee is the positive difference of transaction outputs minus inputs. The block's miner usually claims all transaction fees of transactions in a block additionally to the block subsidy. If the miner deliberately doesn't claim the transaction fees in a block then those fees are burnt and forever out of circulation, but that doesn't make any economical sense but happened at least partially very rarely in the past (to make a statement, I guess, or due to some bugs). At current value of BTC no sane miner would refuse to claim transaction fees.As space for transactions is limited in a block, there's naturally competition and a market for that space. As a trustless and decentralized solution I can only imagine the current approach of a transaction fee market for such a limited space ressource. Miners have an incentive to fill a block with the most valuable transactions in terms of their offered transaction fees.We will have to watch and see how this will turn out after next few halvings. Of course, this can't be seen isolated from Bitcoin's value which nobody can predict for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "September 03, 2023, 03:18:34 PM",
      "body": "Quote from: vjudeu on September 01, 2023, 05:18:09 PM1. Enormous Block Size Increases: this is what BCH community did, as well as a lot of other altcoins. You can see, where they are now, and make some conclusions, based on that.2. Violate 21M Coin Limit: this topic was raised some time ago, you can read here, how it was commented: https://bitcointalk.org/index.php?topic=5405755.03. >50% Miner Fee-Revenues Come From Merged Mining: you can see some federations (also known as \"somewhat centralized\" sidechains, like Liquid or RSK). We don't have fully decentralized sidechains yet, there were some proposals, like BIP-300 and BIP-301, but because first attempts were rejected, I guess people will try activating sidechains in other ways, or switch to some entirely different ideas, if all proposals will be killed.But also, it could be the fourth way, called \"Something Else\". I don't know exactly, what it could be. We can only guess, for example it could be first-layer non-interactive cut-through, that could make it \"cheap for users\", while being \"expensive in blocks\" at the same time, when you combine N transactions paying single satoshis each, into a single transaction paying N satoshis that will finally land in a block. But it could be something completely different, it is just based on guessing and predicting the future.One of the \"Something Else\" might probably be to encourage and stimulate \"the other uses\" of Bitcoin's base layer to increase the demand for block space. High demand = high fees = miners happy. Plus it doesn't need a hard fork/soft fork. It will perhaps be the lesser of \"all evils\". It's Ordinals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "September 03, 2023, 03:41:30 PM",
      "body": "QuoteIt's Ordinals. There are issues with this approach, and this is quite serious in the current state of the network. If people use Ordinals, then they stop regular users from making on-chain payments. As long as you don't have transaction joining, it is a choice between putting Ordinals, and putting other payment-related transactions. If you have only payment-related transactions, then you can for example apply cut-through. Then, it doesn't matter that Alice send something to Bob, and later Bob sent it to Charlie. If after 20 transactions, it could be simplified into a transfer from Alice to Zack, then all that matters, is the amount of coins received in the end. But this is not true in case of Ordinals, because if they are cut in the middle, then you practically lose that data.Also, I wonder how Ordinals will respond to the cut-through. Because this method is something that can be used to specifically kill Ordinals, while leaving regular payments unaffected. However, as I told you previously, \"nobody tested that\", so I wonder what will happen, when some on-chain optimizations will kick in. So far, MimbleWimble was resistant to Ordinals, which means that weapon could be used to hit two birds with one stone: improve scalability, while killing Ordinals at the same time, because then on-chain users could at least have any weapon to compete with them.Not to mention that such approach will effectively force Ordinals' users to move into some second layers, exactly as they should from the very beginning. Because the problem with them is not that they want to put some data. The problem is that they want to store everything on-chain, and cut-through could be used to push them in a better direction.QuoteOne of the \"Something Else\" might probably be to encourage and stimulate \"the other uses\" of Bitcoin's base layer to increase the demand for block space.In case of Ordinals, it is just \"Enormous Block Size Increases\" path. Only in that case, you can actually store all of them on the first layer. They are not resistant to cut-through. Also, if you encourage people to put more things, then you will only flood mempools. Only a fraction of transactions will confirm, and obviously fees will rise, but then, implementing cut-through will be needed immediately, to transact on-chain at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "September 03, 2023, 03:57:28 PM",
      "body": "Quote from: vjudeu on September 02, 2023, 05:55:23 AMSo far, many attempts are too centralized, as it is the case for \"wrapped BTC\", but I wonder how long it will take for people to truly understand, what decentralized chains are about, and how to implement them.Can you please enlighten us? I have noticed you've been sharing articles that talk about sidechains a lot, but I want to read how it will work decentrally on a fundamental level. Quote from: vjudeu on September 02, 2023, 05:55:23 AMIn sidechains, miners can always receive fees in P2P way, because they can mine the mainchain directlySo why isn't it happening? There is P2P mining implemented, called P2Pool. I presume that it doesn't financially attract miners, but maybe you're having a different opinion. Quote from: vjudeu on September 03, 2023, 03:41:30 PMBecause the problem with them is not that they want to put some data. The problem is that they want to store everything on-chain, and cut-through could be used to push them in a better direction.The problem begins from the very fact that Ordinals' value is determined completely subjectively. It can be as simple as \"Ordinals that are outside mainchain are not as valuable as those inside\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "September 03, 2023, 04:29:12 PM",
      "body": "QuoteCan you please enlighten us?I wrote some posts with details, you can read them in other topics, related to sidechains, for example start from this reply, and continue downwards, to have the full context: https://bitcointalk.org/index.php?topic=5231460.msg61733323#msg61733323QuoteSo why isn't it happening?1. Because people think that Merged Mining could be implemented only in the same way as it was done in NameCoin. They don't think about NameCoin's mistakes, and take for granted, that it can be done only in this specific way. And because it failed in some points, they think Merged Mining failed as the whole concept, and they cannot understand, that NameCoin developers didn't implement it correctly. For example, you should have a single difficulty when using Merged Mining. There should be a single stream of block headers, that dictates the global difficulty, no matter if some chain is correct or not. And then, miners should receive the fraction of the coinbase reward, proportional to that, on all chains. Then, you need 51% on the global difficulty, and not just 51% on the sidechain difficulty, to trigger any chain reorgs.2. Because some proposals were rejected, see BIP-300 and BIP-301. That means, it can be rejected as a soft-fork, and if you try to do it in that way, you can meet people that simply will say \"no\". Some of them will point you some mistakes in your design, but some will simply tell you, that \"sidechains are bad, because they will connect Bitcoin with altcoins, and I don't like it\". And then, the latter cannot be fixed by some better proposal, which means \"sidechain as a concept\" may not pass the soft-fork process.3. Because no-fork proposals, that could be unstoppable, should be properly done the first time it will be tried. I can think about a system like that, but in the current state, I can still see things that could go wrong. And I don't want to release a scam. I want to make things the best they could be, because if that first attempt will have some serious mistakes, then it will be misused. Exactly in the same way as Ordinals: I can think about some positive use cases for that, but the current implementation has many serious bugs, and probably more will be found in the future. I could say that being vulnerable to cut-through may be critical in a long-term scenario, if people will have enough courage to push Bitcoin into payment-only system. Not to mention other optimizations, for example inside Initial Blockchain Download, that could kill Ordinals as well, and that is also well-aligned with payment-only system, but not-so-well-aligned with cloud-storage-system.4. Because doing that is hard. Talking about it is easier than focusing on my code for 100% of my time. It is Sunday, and I spend some of my free time posting on forum, and battle-testing some of my ideas. I could spend that time only on writing code, but guess what: it is possible I wouldn't invent this \"cut-through as a weapon for Ordinals\" idea, if I wouldn't read Wind_FURY's response. That means, talking is as important as programming: it saved me in the past from many mistakes, for example from releasing my own altcoin, without realizing, how many holes would it contain, if I would go for it when I first heard about Bitcoin. So, programming is hard, and hard things takes time. So, even if something sounds easy, it is the case only if you know, how it should look like. But before that, it is hard to get everything right (and if you write blockchain-related things, then your first version should stand the test of the time, because it will always be \"set in stone\").QuoteThere is P2P mining implemented, called P2Pool.It is a great proposal, but it doesn't scale. It should be improved. Of course, it is a good start, but if you read more about it, you will notice, why people stopped using it. The main reason was poor scalability: you cannot have \"just 20 times easier difficulty, with 30 seconds per block\". Scale it 600 times, and you will get one block per second, which could be a disaster. Scale it even further, and your hardware will suffer, and won't be able to reach \"one block per millisecond\" (or faster).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "September 04, 2023, 02:50:32 AM",
      "body": "Quote from: ParaBoi on September 01, 2023, 04:26:07 PMA request is made, and a fee is then added, when someone wants to send some BTC to someone else. The sender can choose their own price or accept a preset amount. The recipient of transaction fees is?A Bitcoin transaction is between sender and receiver. The receiver will send a receiving address to the sender who will broadcast that transaction. Then Bitcoin miners will find blocks and confirm that transaction with priority from tip of mempools. Bitcoin nodes will verify blocks, transactions.Because miners will choose waiting transactions from tip of mempools, that means the sender has to broadcast a transaction with enough fee rate to be chosen by miners.Learnmeabitcoin.com: What is transaction fee?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "September 04, 2023, 06:35:47 AMLast edit: September 04, 2023, 06:46:17 AM by Wind_FURY",
      "body": "Quote from: vjudeu on September 03, 2023, 03:41:30 PMQuoteIt's Ordinals. There are issues with this approach, and this is quite serious in the current state of the network. If people use Ordinals, then they stop regular users from making on-chain payments. As long as you don't have transaction joining, it is a choice between putting Ordinals, and putting other payment-related transactions. If you have only payment-related transactions, then you can for example apply cut-through. Then, it doesn't matter that Alice send something to Bob, and later Bob sent it to Charlie. If after 20 transactions, it could be simplified into a transfer from Alice to Zack, then all that matters, is the amount of coins received in the end. But this is not true in case of Ordinals, because if they are cut in the middle, then you practically lose that data.Also, I wonder how Ordinals will respond to the cut-through. Because this method is something that can be used to specifically kill Ordinals, while leaving regular payments unaffected. However, as I told you previously, \"nobody tested that\", so I wonder what will happen, when some on-chain optimizations will kick in. So far, MimbleWimble was resistant to Ordinals, which means that weapon could be used to hit two birds with one stone: improve scalability, while killing Ordinals at the same time, because then on-chain users could at least have any weapon to compete with them.Not to mention that such approach will effectively force Ordinals' users to move into some second layers, exactly as they should from the very beginning. Because the problem with them is not that they want to put some data. The problem is that they want to store everything on-chain, and cut-through could be used to push them in a better direction.I'm confused. What's the \"cut-through?But from my viewpoint it's simple, which might probably also be the same as the miners' viewpoint. - Because the block size is regulated, and because there's a fee market, users will merely compete for block space, pay the fee they're willing to pay, and use the network in whatever way they want.No hard forks, no soft fork, just the incentive structure and the economics of the network.QuoteQuoteOne of the \"Something Else\" might probably be to encourage and stimulate \"the other uses\" of Bitcoin's base layer to increase the demand for block space.In case of Ordinals, it is just \"Enormous Block Size Increases\" path. Only in that case, you can actually store all of them on the first layer. They are not resistant to cut-through. Also, if you encourage people to put more things, then you will only flood mempools. Only a fraction of transactions will confirm, and obviously fees will rise, but then, implementing cut-through will be needed immediately, to transact on-chain at all.ELI-5 the cut-through? Users sending transactions directly to the miners?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "September 04, 2023, 10:56:34 AM",
      "body": "QuoteI'm confused. What's the \"cut-through?Topic about cut-through: https://bitcointalk.org/index.php?topic=281848.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 04, 2023, 11:10:22 AM",
      "body": "Quote from: ParaBoi on September 01, 2023, 04:26:07 PMI recently came across something when reading about transactions that I want to learn more about. A request is made, and a fee is then added, when someone wants to send some BTC to someone else. The sender can choose their own price or accept a preset amount. The recipient of transaction fees is? They appear to be independent of the incentive for finding a block, but as this becomes more expensive, will transaction fees be the only source of funding for BTC? as so, who will profit from them?The question is contradictory, because I don't comprehend the sentence very well in which I don't know if you are emphasising directly on the fee's to be pay during sending out bitcoin from your wallet to another wallet or you are emphasising on the recipient the amount of fee's that will reflect in the blockchain. But its quite understandable that when sending bitcoin the higher the fee's you include or put will determine how faster the transaction will process, because sometimes when your fee's is low and you are expecting the transaction to be confirmed very faster, it's obvious that it won't get confirmed as you may think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 04, 2023, 07:14:35 PM",
      "body": "Quote from: ParaBoi on September 01, 2023, 04:26:07 PMI recently came across something when reading about transactions that I want to learn more about. A request is made, and a fee is then added, when someone wants to send some BTC to someone else. The sender can choose their own price or accept a preset amount. The recipient of transaction fees is? They appear to be independent of the incentive for finding a block, but as this becomes more expensive, will transaction fees be the only source of funding for BTC? as so, who will profit from them?If you're making a transaction, first look in to the mempool to know the depth of how it appears from the tip, which is the transaction fee rate for each category of priority you wanted, after this, if you're using a wallet like electrum which support RBF function, then you can customize your fee or pump it as the case may be when you make a transaction, miners are the ones that receives the block reward and the transaction fees and rates are base on priority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "September 06, 2023, 08:20:14 AM",
      "body": "Quote from: vjudeu on September 04, 2023, 10:56:34 AMQuoteI'm confused. What's the \"cut-through?Topic about cut-through: https://bitcointalk.org/index.php?topic=281848.0I learned something new again! Thank you, ser, you're an asset in BitcoinTalk. I'll do some more reading, and I'll definiitely point Ordinals users to that information the next time someone argues for censorship-resistance of dick pics and fart sounds in the Bitcoin blockchain. It's not that I support the debate that Ordinals is an attack, it's that now I learned that Ordinals is poorly implemented, WITHOUT testing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}