{
  "id": "topic_5461651",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "August 01, 2023, 06:43:12 AM",
  "content": "Matunog nanaman ang airdrop, at madami din ang naghhunt ngaun dahil sa nangyare sa arkham kung saan madami ang kumita marami din ang sana all ang sinasabi.Isang babala lang na maari ninyong pagsisihan, ang pagppost ng email address ninyo ay delikado.Maaring magemail sa inyo ang mga hacker or isama kayo sa list ng mga pwede nilang spam ng mga messages kung saan maari ninyo itong aksidente na mapindot.Maari din itong  gamitin ng iba para ipangsignup kung saan hindi na kailangan ng confirmation sa emails may mga ganetong projectskung ikaw ay nasa crypto na maiintindihan mo ang post na ito dahil sa panahong yan 2016-17 ay laganat ang paggamit ng emails ng iba, para sa mga campaigns.dahil nagamit na nila ito sa signup hindi mo na ito magagamit kung sakaling sila ay mauna sa iyo na gamitin ito.maaring ito ay simple lang pero , ang ibang project kinocollect din ang emails.kaya dapat karing magingat at wag lang basta basta register dahil lang sa gusto mo kumita sa airdrop, kelangan mo ding magingat dahil baka sa huli umiyak nanaman dahil nahack ka or madaming nawala, iwasan din ang paggamit ng password mo na kapareho sa original or same password sa lahat.Simpling paalaala pero malaki ang impact pagnagkaproblema ka sa email mo.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461651",
  "comments": [
    {
      "author": "blockman",
      "created_time": "August 01, 2023, 09:59:50 AM",
      "body": "Kapag nai-post mo na publicly ang iyong email address, expect mo na maraming mag eemail sayo na kung sino sino lang na mga scammer at random attemps para lokohin ka. Tama at salamat sa paalala mo itong kabayan kasi kahit wala ka sa crypto, maaari kang mabiktima ng mga scammer na yan na nangongolekta ng mga email addresses tapos saka nila bobombahin ng mga scam emails yung mga kawawang posible nilang mabiktima. Ako dati wala pa sa crypto market at mahilig mag signup kung saan saang mga website at nagugulat nalang ako may mga random email na kesyo may pera daw silang papadala at may nawawala daw akong pera at need ko daw i-click iyong link. Naalala ko din may nireplyan pa nga ako na may milyon dollars daw ako at need ko daw mag bigay ng 50 dollars at ang sabi ko, i deduct nalang sa total amount haha. Pero sa kabutihang palad hindi pa ako nabiktima ng mga yan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 01, 2023, 12:01:40 PM",
      "body": "Tip: gumamit ng custom domain and multiple address aliases. Para hiwalay ang pang personal, hiwalay ang pang airdrops, hiwalay ang pang banking, etc etc. Para rin pag marami ng natatanggap na spam ang isang address alias mo, delete mo nalang un tapos gawa ka ng bago.Recommended: Skiff, Tutanota, Protonmail",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "August 01, 2023, 01:13:38 PM",
      "body": "Sobrang basic isipin pero may iba paring nagkakamali dyan yun bang ginawa nilanv all in one email nila at kung saan saan nila ito ni register o sa alin mang pampublikong gamit. Sa huli kasi ang realization kaya maraming nabiktima lalo na kung yung mga email na yun ang gamit sa bank account or alin mang online wallets kaya mainam talaga na gumamit ng dummy emails sa pampublikong bagay para iwas manakawan ng pera o di kaya ma kompromiso ang ating social media accounts.Quote from: mk4 on August 01, 2023, 12:01:40 PMTip: gumamit ng custom domain and multiple address aliases. Para hiwalay ang pang personal, hiwalay ang pang airdrops, hiwalay ang pang banking, etc etc. Para rin pag marami ng natatanggap na spam ang isang address alias mo, delete mo nalang un tapos gawa ka ng bago.Recommended: Skiff, Tutanota, ProtonmailSa nga bagohan medyo di pa nila alam gawin to kaya temporary solution muna ang paggawa ng dummy mail tsaka aralin nila ang custom domain addresses since napaka helpful talaga nito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "August 01, 2023, 04:03:24 PM",
      "body": "Quote from: arwin100 on August 01, 2023, 01:13:38 PMSobrang basic isipin pero may iba paring nagkakamali dyan yun bang ginawa nilanv all in one email nila at kung saan saan nila ito ni register o sa alin mang pampublikong gamit. Sa huli kasi ang realization kaya maraming nabiktima lalo na kung yung mga email na yun ang gamit sa bank account or alin mang online wallets kaya mainam talaga na gumamit ng dummy emails sa pampublikong bagay para iwas manakawan ng pera o di kaya ma kompromiso ang ating social media accounts.Hindi naman kasi lahat ay aware sa mga ganitong scheme at kapag magba-browse ka sa social media lalong lalo na sa Facebook. Nakabalandra lang din yung mga gcash giveaway. Andun lahat ng mga number nakapost lang publicly kaya bukod sa email addresses, pati mga personal numbers na registered na nandun na. Kaya yari sila sa mga mahilig mangolekta niyan tapos ibebenta kung saan man nila naisin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoinislife09",
      "created_time": "August 01, 2023, 04:35:14 PM",
      "body": "Natural na talaga at kalat na ang mga hacker ngayon sobrang delikado lalo na kung nakasubscribe ang email mo sa kung ano anong mga cryptocurrency related na mga projects. Mahirap maitong maiwasan lalo na at gusto nating maging updated pagdating sa mga project kaya naman ay tayo mismo talaga ang kusang nagbibigay ng email naten. Kaya sa tingin ko ay dapat lamang ay alam natin kung paano natin mapoprotectahan ang sarili naten pagdating sa mga ganitong modus. Kung aware tayo sa mga gawain nila ay hindi tayo magiging biktima ng kanilang mga ginagawa but na lamang ay dito sa forum ay maraming mga member ay nagbibigay ng impormasyon tungkol sa mga bagong paraan ng mga hackers ngayon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "August 01, 2023, 05:00:11 PM",
      "body": "Quote from: tech30338 on August 01, 2023, 06:43:12 AMMatunog nanaman ang airdrop, at madami din ang naghhunt ngaun dahil sa nangyare sa arkham kung saan madami ang kumita marami din ang sana all ang sinasabi.Isang babala lang na maari ninyong pagsisihan, ang pagppost ng email address ninyo ay delikado.Maaring magemail sa inyo ang mga hacker or isama kayo sa list ng mga pwede nilang spam ng mga messages kung saan maari ninyo itong aksidente na mapindot.Maari din itong  gamitin ng iba para ipangsignup kung saan hindi na kailangan ng confirmation sa emails may mga ganetong projectskung ikaw ay nasa crypto na maiintindihan mo ang post na ito dahil sa panahong yan 2016-17 ay laganat ang paggamit ng emails ng iba, para sa mga campaigns.dahil nagamit na nila ito sa signup hindi mo na ito magagamit kung sakaling sila ay mauna sa iyo na gamitin ito.maaring ito ay simple lang pero , ang ibang project kinocollect din ang emails.kaya dapat karing magingat at wag lang basta basta register dahil lang sa gusto mo kumita sa airdrop, kelangan mo ding magingat dahil baka sa huli umiyak nanaman dahil nahack ka or madaming nawala, iwasan din ang paggamit ng password mo na kapareho sa original or same password sa lahat.Simpling paalaala pero malaki ang impact pagnagkaproblema ka sa email mo.Kahit naman hindi mo naipopost publickly yung email address mo ay madami parin ang mageemail sa spam message mo sa email. Basta ang importante ay hindi mo ikiclick basta-basta ang link na mababasa mo sa iyong email para hindi aka mapasukan ng hacker.Dahil ang ginagawa ko lang naman kapag may mga spam na pumapasok sa email ko ay binubura ko na agad, kagaya ng kamakailan lang ang daming pumasok na message sa spam section ng email ko puro Iam metaverse iba iba name halatang phishing link.. kaya erase ko agad at block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 01, 2023, 06:24:59 PM",
      "body": "Just create throw away emails kung sasali sa mga bounties at ang personal email nyo ay itago sa public.Kung gusto nyong i check ang email nyo kung na leaked na to, go to https://haveibeenpwned.com/.I type nyo lang ang email nyo at lalabas kung na leaked na to o hindi pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 01, 2023, 07:20:04 PM",
      "body": "Quote from: tech30338 on August 01, 2023, 06:43:12 AMMatunog nanaman ang airdrop, at madami din ang naghhunt ngaun dahil sa nangyare sa arkham kung saan madami ang kumita marami din ang sana all ang sinasabi.Isang babala lang na maari ninyong pagsisihan, ang pagppost ng email address ninyo ay delikado.Maaring magemail sa inyo ang mga hacker or isama kayo sa list ng mga pwede nilang spam ng mga messages kung saan maari ninyo itong aksidente na mapindot.Maari din itong  gamitin ng iba para ipangsignup kung saan hindi na kailangan ng confirmation sa emails may mga ganetong projectskung ikaw ay nasa crypto na maiintindihan mo ang post na ito dahil sa panahong yan 2016-17 ay laganat ang paggamit ng emails ng iba, para sa mga campaigns.dahil nagamit na nila ito sa signup hindi mo na ito magagamit kung sakaling sila ay mauna sa iyo na gamitin ito.maaring ito ay simple lang pero , ang ibang project kinocollect din ang emails.kaya dapat karing magingat at wag lang basta basta register dahil lang sa gusto mo kumita sa airdrop, kelangan mo ding magingat dahil baka sa huli umiyak nanaman dahil nahack ka or madaming nawala, iwasan din ang paggamit ng password mo na kapareho sa original or same password sa lahat.Simpling paalaala pero malaki ang impact pagnagkaproblema ka sa email mo.Never ako nag lapag ng email addresses ko in public for the sake of airdrop. Hanggang ngayon marami pa rin na mga kababayan natin sa Facebook, X, Reddit at iba pang platform na kailangan pa rin mag reply with email address or iba pang mga importante na detalye.Never na rin ako nag click links sa email at saka nag double check na rin ng email handle if official ba or not. Kaya extra ingat na tayo lahat dahil the hackers and scammers are getting smarter, creative na at nangin innovative pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 01, 2023, 08:02:54 PM",
      "body": "Tama naman talagang hindi dapat kung saan saan at kung kanikanino lang binibigay ang email address lalo na kung sa mga importanteng accounts into gamit. Madaming ways ang mga scammers at hackers ngayon para makuha ang password at mabuksan ang email accounts naten at mula dun madami na silang pwedeng gawin, gaya ng pag hack ang ating mga importanteng social media accounts at pati na rin online bank accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 01, 2023, 10:28:10 PM",
      "body": "Kung mayroon kang Cpanel pwede mong gamitin ang isa sa mga domain mo at i redirect mo ito sa isa sa iyong mga gmail ang kagandahan nito kapag na kakarereceive ka ng mga spam, pwede mo i redirect ito sa pekeng email o totally i disable mo na yung domain based email.Halimbawa gawa ka ng email sa Cpanel mo na airdrop@mydomain.com at redirect mo ito sa my@gmail.com o pwede namang gumawa ka ng email exclusive lang sa mga airdrop.pero neve rmong i eexpose ang iyong tunay na email sa airdrop at mga bounty hunting, mataas ang risk dito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "August 01, 2023, 10:45:35 PM",
      "body": "Quote from: bhadz on August 01, 2023, 04:03:24 PMQuote from: arwin100 on August 01, 2023, 01:13:38 PMSobrang basic isipin pero may iba paring nagkakamali dyan yun bang ginawa nilanv all in one email nila at kung saan saan nila ito ni register o sa alin mang pampublikong gamit. Sa huli kasi ang realization kaya maraming nabiktima lalo na kung yung mga email na yun ang gamit sa bank account or alin mang online wallets kaya mainam talaga na gumamit ng dummy emails sa pampublikong bagay para iwas manakawan ng pera o di kaya ma kompromiso ang ating social media accounts.Hindi naman kasi lahat ay aware sa mga ganitong scheme at kapag magba-browse ka sa social media lalong lalo na sa Facebook. Nakabalandra lang din yung mga gcash giveaway. Andun lahat ng mga number nakapost lang publicly kaya bukod sa email addresses, pati mga personal numbers na registered na nandun na. Kaya yari sila sa mga mahilig mangolekta niyan tapos ibebenta kung saan man nila naisin.Kulang na kulang din naman kasi ang kaalaman ng ibang kababayan natin sa iba't-ibang modus kaya may nabibiktima parin kahit hanggang ngayon na makukuha mo ang impormasyon kung pano ingatan ang iyong sarili kahit saan. Tingin ko kulang parin ang warnings ng gobyerno ukol dito kaya kailangan pa nila maging aggresibo sa kanilang approach tungkol sa scamming lalo na ngayon online na lahat at naglipana dun ang mga scammer.Kaya maganda talaga na nakakabasa tayo ng ganitong topic dahil maging mas maalam pa tayo sa iba pang paraan pano tayo maging mas secure pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xenxen",
      "created_time": "August 01, 2023, 11:46:28 PM",
      "body": "mahirap din kasi yung gagamit ka nang maraming email address parang hustle din yun sa pag lologing logout pwera lang kung dami mong gadget. nasa pag iingat lang talaga kung paano natin gamitin yung email natin dagdag nalang tayo nang mga securities buti meron na dyang authy para kahit access man nila kailangan mo parin nang authenticator para mabuksan mo ito or ma confirm yung email...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chrisculanag",
      "created_time": "August 02, 2023, 01:24:43 AM",
      "body": "Dahil sa kadahilan na kumita sa online ay nagagawa namin na isapubliko yung aming mga email address lalong lalo na sa mga group chat na kung saan ay totoong ginagamit ng iba sa mga kakaibang aktibidades ang masama pa ay sa isang malaswang site niya ito ginamit. Hindi rin talaga dapat magtiwala kahit na kababayan natin , ng ichineck ko yung ip ay sa ating Bansa ang gumamit. Basta usapang email ay mas magandang isend na lang pa-pm para hindi niyo ito sapitin. Kahit na medyo nakakainis ay ginawa ko na lang katatawanan sa pinoy GC namin ang nangyari. Buti na lang at kahit papaano ay makakaiwas yung iba sa tulong ng mga paalala mo kabayan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "August 02, 2023, 05:33:11 AM",
      "body": "Quote from: tech30338 on August 01, 2023, 06:43:12 AMWag ibandera ang email address kung saan saanSimple lang yan bro, wag mo lang gamitin yung email na ginamit mo sa mga financial account mo sa kahit na anong purpose. Kahit sa trabaho or any social media accounts. Keep it separated sa lahat para maiiwasan mo yung mga links na sinsend sayo na nag lalalaman ng phishing websites at mga hacking tools na pinapadownlonad sayo. Kahit naman hindi mo e bandera yung email address mo para sa airdrop kung connected ito sa mga accounts mo especially sa social media ay may mga mag sisend parin ng mga phishing links, kaya best advice talaga is to create a dummy email intended for airdrops and other give aways at yung email ng mga financial account mo is separated din exclusively for that purpose only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "August 02, 2023, 03:24:47 PM",
      "body": "Quote from: arwin100 on August 01, 2023, 10:45:35 PMQuote from: bhadz on August 01, 2023, 04:03:24 PMHindi naman kasi lahat ay aware sa mga ganitong scheme at kapag magba-browse ka sa social media lalong lalo na sa Facebook. Nakabalandra lang din yung mga gcash giveaway. Andun lahat ng mga number nakapost lang publicly kaya bukod sa email addresses, pati mga personal numbers na registered na nandun na. Kaya yari sila sa mga mahilig mangolekta niyan tapos ibebenta kung saan man nila naisin.Kulang na kulang din naman kasi ang kaalaman ng ibang kababayan natin sa iba't-ibang modus kaya may nabibiktima parin kahit hanggang ngayon na makukuha mo ang impormasyon kung pano ingatan ang iyong sarili kahit saan. Tingin ko kulang parin ang warnings ng gobyerno ukol dito kaya kailangan pa nila maging aggresibo sa kanilang approach tungkol sa scamming lalo na ngayon online na lahat at naglipana dun ang mga scammer.Kaya maganda talaga na nakakabasa tayo ng ganitong topic dahil maging mas maalam pa tayo sa iba pang paraan pano tayo maging mas secure pa. Mas maganda kasi may pondo ang gobyerno para diyan tapos magkaroon sila ng mga events at campaigns para mas lalong maging aware lahat ng mga Pilipino. Sa ibang bansa binibigyan nila ng importansya yan pero dito kasi sa atin basta politika, kurakot lang ang laging kalalabasan kahit na sana may mga magandang hangarin yung iba ang kaso naman may mga iba na pera lang ang tinitignan at hindi kapakanan ng madami. Kaya saludo ako doon sa mga indibidwal saka mga organizations na may initiative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "August 02, 2023, 03:43:49 PM",
      "body": "This is why as a bounty hunter dapat may specific email para dito at specific wallet. Never use your main email or wallet kase the moment you provide your email to any project kahit hinde ito nakapost publicly, expect that you are already exposed to those hackers and scammers.Technically, walang safe not unless you do precautionary measure before downloading any files or clicking any links. Uso ang bounty hunter and if you will use your extra email account, you'll have your peace of mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 02, 2023, 04:33:05 PM",
      "body": "Quote from: Johnyz on August 02, 2023, 03:43:49 PMThis is why as a bounty hunter dapat may specific email para dito at specific wallet. Never use your main email or wallet kase the moment you provide your email to any project kahit hinde ito nakapost publicly, expect that you are already exposed to those hackers and scammers.Technically, walang safe not unless you do precautionary measure before downloading any files or clicking any links. Uso ang bounty hunter and if you will use your extra email account, you'll have your peace of mind. Tama naman. Kahit yung mga simpleng pag fill in ng mga emails sa mga forms that can be seen publicly delikado na rin ngayon. Alam kasi ng nakakararami na halos lahat ng importanteng account ay naka connect sa email. Kaya magandang idea din talaga na may alternative email tayo na pwede natin gamitin which hides our personal information upang mas safe para saten gamitin lalo na sa mga random things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 02, 2023, 10:44:26 PM",
      "body": "Tama ka wag ibandera ang email na personal na ginagamit.  If ever na may pagkakagamitan ng email outside sa personal na gamit, mas mabuting gumawa ng dummy email account at iyon gamitin para lahat ng mga spam message ay dun bumagsak.Isang pagkakamali ko ito dati since hindi pa ako well-verse about sa paggamit ng emails at possible annoyances na pwedeng mangyari kapag ginamit ito sa online activities outside important matters.  Natadtad ng spam message iyong email ko kaya napilitan tuloy akong gumawa ng bago at ideactivate iyong dati.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "August 03, 2023, 12:34:46 AM",
      "body": "Quote from: xenxen on August 01, 2023, 11:46:28 PMmahirap din kasi yung gagamit ka nang maraming email address parang hustle din yun sa pag lologing logout pwera lang kung dami mong gadget. nasa pag iingat lang talaga kung paano natin gamitin yung email natin dagdag nalang tayo nang mga securities buti meron na dyang authy para kahit access man nila kailangan mo parin nang authenticator para mabuksan mo ito or ma confirm yung email...Para sakin mas maganda yung hindi lang isang email ang gamit. Siguro nga hassle pero for safety na rin ito lalo na at uso ang hacking. Katulad sakin, iba yung personal email na naka connect sa bank ko at iba pang log in details sa mga importanteng sites. Iba rin yung email ko para sa gambling at exchanges. Mas maganda na yung nag iingat kesa magsisi sa huli. Basta kailangan lang tandaan yung password (much better isulat at itago) para hindi rin malito at makalimutan.Tama si op hindi maganda ibandera ang ating email. Sa panahon ngayon maraming hacker at scammer. Kaya kung ayaw mong maging isa sa biktima nila, dapat aware ka sa kailangang gawin para ma secure mo ang iyong account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}