{
  "id": "topic_5422946",
  "title": "barto123",
  "author": "barto123",
  "created_time": "November 24, 2022, 07:14:11 AM",
  "content": "The world is only getting crazier.Hyperinflation, wars, supply chain issues, shortagesI know a decent percentage of the network runs on renewable energy, there's the blockstream satellite, keys are offline etcHow bad would it have to get to stop the chain & would that kill Bitcoin?Personally I'm not worried, because if it gets that bad, money probably won't matter. Food, water & shelter will be more valuable.I often speculate. I not a gloom & doomer - just a realist.Interest to hear thoughts.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422946",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 24, 2022, 07:43:21 AM",
      "body": "Quote from: barto123 on November 24, 2022, 07:14:11 AMHow bad would it have to get to stop the chain & would that kill Bitcoin?Nothing can stop, hinder or kill bitcoin now or in the future to come as long as bitcoin does not kill itself, this economic cramps you're talking about are what the fiat role has placed to the world to inflict centralization such that every system will be under a single control of the economy by government and their policies, bitcoin is entirely different here, it plays a decentralized role and stand against inflation and other economic setback policies that got us all into slavery over years without having financial freedom, the solution that lies is with bitcoin and it's never too late to begin and have a new start, bitcoin isn't dying but rather resurrecting every other dead situations associated with the world economy development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LegendaryK",
      "created_time": "November 24, 2022, 07:48:37 AM",
      "body": "Quote from: barto123 on November 24, 2022, 07:14:11 AMThe world is only getting crazier.Hyperinflation, wars, supply chain issues, shortagesI know a decent percentage of the network runs on renewable energy, there's the blockstream satellite, keys are offline etcHow bad would it have to get to stop the chain & would that kill Bitcoin?Personally I'm not worried, because if it gets that bad, money probably won't matter. Food, water & shelter will be more valuable.I often speculate. I not a gloom & doomer - just a realist.Interest to hear thoughts.Hyperinflation will kill bitcoin, because the energy costs of the PoW miners would grow faster than the price of bitcoin causing all the miners to shut down.Not to mention the interest of the loans to buy the asics would crush them.War will kill bitcoin on the losing side, by depriving the miners of a functional power grid.Not to mention a missile blowing up a warehouse full of asics ends mining at that spot.Lack of Power means less people use bitcoin , as they have no way to transact it.Supply chain  as long as the power is on and steady, this would be a non-issue.Energy shortages however will provoke the local government to enact PoW mining bans. (Which is the real reason China Ban PoW mining.)Which if the reason of the energy shortages is not corrected within 1-2 years, then the local governments will ban PoW mining permanently , once the majority of countries do that bitcoin price verse fiat will collaspe even before the last miner shuts down forever.PoW is a dead end, the bitcoin community refuses to see the end of PoW is already written.BTC community want to pretend that the world is still in a energy abundance , all one has to do is look at China & Europe to see energy is becoming a scarcer commodity by the day.Therefore anything that does not directly keep people alive will be excluded from accessing resources that are in a tighter supply by the day.Solar won't fix anything with only 4 hours daily of peak energy in the summer only, Hydoelectric is useless when the rivers dry up, Wind is too random and region specific for base-load power.Natural Gas prices have went too high, and is required more to be burned for heat than converted to electricity.Most Coal & Nuclear plants have been shut down because of the failed green agenda.It will take a decade to rebuild them to reach a stable baseload.Plus electric cars are increasing and straining the grids even more.So PoW is DOA, and their is no one that leads btc to convert to energy efficient solutions.The only way bitcoin survives the coming PoW bans from the US/ Canada/ Europe is by becoming a token on the ethereum or cardano blockchains, it has no other survival option because of the lack of leadership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "November 24, 2022, 07:54:59 AM",
      "body": "Quote from: barto123 on November 24, 2022, 07:14:11 AMThe world is only getting crazier.Hyperinflation, wars, supply chain issues, shortagesI know a decent percentage of the network runs on renewable energy, there's the blockstream satellite, keys are offline etcHow bad would it have to get to stop the chain & would that kill Bitcoin?Personally I'm not worried, because if it gets that bad, money probably won't matter. Food, water & shelter will be more valuable.I often speculate. I not a gloom & doomer - just a realist.Interest to hear thoughts.Would Bitcoin survive the apocalyse? Thats quite an easy question to answer. NO.Why? Because without people, Bitcoin exists only until the networks, the servers, every single computer, every single harddrive and so on decomposes into rust and other stuff. Up until then it will be data stored as long as it can. But nobody will ever read that data again so basically, for all intents and purposes it will be dead. Just like the human race. As long as people survive, so will Bitcoin. Everything else is a tad unrealistic and not worth thinking about, to be completely honest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 24, 2022, 08:19:48 AM",
      "body": "Quote from: barto123 on November 24, 2022, 07:14:11 AMThe world is only getting crazier.Hyperinflation, wars, supply chain issues, shortagesI know a decent percentage of the network runs on renewable energy, there's the blockstream satellite, keys are offline etcHow bad would it have to get to stop the chain & would that kill Bitcoin?Personally I'm not worried, because if it gets that bad, money probably won't matter. Food, water & shelter will be more valuable.I often speculate. I not a gloom & doomer - just a realist.Interest to hear thoughts.The main triggers of the current global problems are Covid-19 and the war in Ukraine. The world was gradually recovering from the effect of the pandemic before Russian invaded Ukraine. The world have gone through worst things than these and survived. We have had great depressions that was predicted to end the world but live kept going on. As long as the world keep existing, Bitcoin would survive. There would always be alternative to areas of challenge. Miners can move to areas that are friendly for their mining activities. There are mass uncultivated lands that can boast food production. The end of the war in Ukraine would usher in the gradual recovery of the world. Bitcoin would end, when the world ends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 24, 2022, 08:52:36 AM",
      "body": "It's like operations will be stopped if no miners left anymore, the network will be there but if there will be no one validating and confirming transactions then that doesn't make sense anymore.The network might be stopped at that time and when someone does to reactivate it then that's it. It could be stopped temporarily but then likely will go back when there are people that will continue to mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "November 24, 2022, 09:13:39 AM",
      "body": "Quote from: barto123 on November 24, 2022, 07:14:11 AMThe world is only getting crazier.Hyperinflation, wars, supply chain issues, shortagesThis is not the first time the world is going through such crazier moments due to outbreaks of wars, hyperinflation, and shortages of food, and yet survived successfully for the past 2022 years till today and it still has the potential in doing so, and same as Bitcoin been through a lot since it's 13 years of existence (i.e series of exchange hacks,  government unfavourable policies, and attack on miners) and yet still survived successfully. So to answer your question, I believe Bitcoin can still survive this, because the market was good not until the war against Russia and Ukraine started, causing the price of Bitcoin to fall from $30,000 to around $20,000 for quite a long time, not until the issue about FTX came up, leading to another fall in value from $20,000 to around $16,000.So the worst thing that can happen is for its value to keep depreciating, but it can never die",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "November 24, 2022, 09:13:53 AM",
      "body": "Bitcoins survived the pandemic and it even reached a new ATH record during that time. the crypto market is unpredictable, who knows maybe when the apocalypse happened fiat will no longer be needed and what's important is cryptocurrencies which you don't need any banks to keep nor any vault to bring when you have a huge amount of BTC in you. Just a sane mind to memorize your details and you are good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 24, 2022, 09:32:06 AM",
      "body": "Bitcoin will stop when people stop using this chain, and this will happen quickly if a fundamental defect is found in this technology, such as breaking the encryption, or there is an alternative, cheaper and more efficient, otherwise the network will weaken until it is centralized or managed by only some people.Wars and other problems are not sufficient reasons to deal the death blow to Bitcoin, but uniform regulatory legislation around the world will be sufficient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 24, 2022, 10:21:52 AM",
      "body": "As long as there be humans that can survive then am sure that Bitcoin will also survive. Now, in case all of humanity will be wiped out from the face of the planet then unless a colony in the moon or in Mars can be establish then maybe we will not be talking on Bitcoin anymore...unless again you believe in the afterlife but then again who needs Bitcoin in heaven, hell or purgatory maybe. Talking on problems like inflation and anything related to economy, that can be reasons why we have Bitcoin. That's why we should not be discouraged even with the FTX collapse contagion because this is just another bad episode - helmed by Sam and Caroline - in the crypto history and months from now this can be a forgotten one though we are learning many lessons from this one. Long live, Bitcoin!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "November 24, 2022, 10:27:52 AM",
      "body": "Bitcoin is least of your worries when the apocalypse happened. Probably people will stop thinking about any material things or money when apocalypse or catastrophe hits humanity hard. Even if Bitcoin survive after an apocalypse, I doubt that people will be interested on it during the initial days since human instinct will tell us to secure necessities and slowly develop again. Bitcoin might be revive again but it will take time or it might be belong to the loss technology which old civilization always experienced when there is a reset in humanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "November 24, 2022, 10:58:39 AM",
      "body": "The converse question is are we going to take care of money in the end? going to deal with non-lifesaving things?I was wondering why this ridiculous question had to be asked. Because if you're a rationalist or a realistic then that question definitely doesn't fall into any category. Comparing sentences of events that happened to all humans with one small part of the particle. The answer is of course not!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 24, 2022, 12:54:37 PM",
      "body": "Okay, just to keep saying; Nobody exists forever...Like, Bitcoin will soon die for some reason and that is the thing that we never know. If we talk war, inflation, government regulations, etc... I'd just stop thinking about it because these are not enough to stop Bitcoin. Because the only thing that will stop Bitcoin is when no one will ever use it, buy or trade. Something like people abandoned Bitcoin totally,  but for now that we see adopters, users, investors, and traders growing which is really impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 24, 2022, 12:55:29 PM",
      "body": "Don't only talk about Bitcoin, do you think banks, fiat, economy and people will survive during apocalyse? it's a nightmare situation and everyone will really hard to get food, which make any asset is worthless as no one need it. It's a global problem and I don't think we will suffer apocalyse, except World War III will happen. It's ridiculous how you want to link a worst problem to Bitcoin while it's already has significant effect to everything around the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "November 24, 2022, 12:55:44 PM",
      "body": "Quote from: LegendaryK on November 24, 2022, 07:48:37 AMQuote from: barto123 on November 24, 2022, 07:14:11 AMThe world is only getting crazier.Hyperinflation, wars, supply chain issues, shortagesI know a decent percentage of the network runs on renewable energy, there's the blockstream satellite, keys are offline etcHow bad would it have to get to stop the chain & would that kill Bitcoin?Personally I'm not worried, because if it gets that bad, money probably won't matter. Food, water & shelter will be more valuable.I often speculate. I not a gloom & doomer - just a realist.Interest to hear thoughts.Hyperinflation will kill bitcoin, because the energy costs of the PoW miners would grow faster than the price of bitcoin causing all the miners to shut down.Not to mention the interest of the loans to buy the asics would crush them.In your opinion, what is hyperinflation? inflation hits 10% or 15%. Like the inflation we are experiencing is also said to be the worst in 40 years. But I see everything is going normally, bitcoin price is stable, just looking at the hashrate it is at a record high shows that the miners are still doing well. Hyperinflation or crisis, recession does not mean that everyone will have difficulties, there will still be people getting rich from inflation. Like we are in a bear market, some people lose and sell in panic but others think this is an opportunity and I am also the one who has been waiting for this for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 24, 2022, 01:00:46 PM",
      "body": "If I were to guess — it's a safe assumption that by such an event, all money, precious metals, and all cryptocurrencies including bitcoin would likely be worth next to nothing. As for if Bitcoin would survive or not — it would totally depend on how bad the \"apocalypse\" is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "November 24, 2022, 01:38:09 PM",
      "body": "Let's take a look, I don't know what's going on. But if I imagine all of your stories happening maybe people would prefer basic necessities. They will try to sell their assets to make ends meet. For several periods of reaching ATH Bitcoin does not seem to have been at the level of a severe economic crisis. The hope is that this problem does not happen, because major countries have tried to prevent it from happening through raising bank interest rates. Although it also has an effect for investors investing in crypto. Most importantly if all still believe in crypto, then he will continue to maintain his value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrongoz_imut",
      "created_time": "November 24, 2022, 01:45:50 PM",
      "body": "Quote from: naira on November 24, 2022, 10:58:39 AMThe converse question is are we going to take care of money in the end? going to deal with non-lifesaving things?I was wondering why this ridiculous question had to be asked. Because if you're a rationalist or a realistic then that question definitely doesn't fall into any category. Comparing sentences of events that happened to all humans with one small part of the particle. The answer is of course not!Very true, as you said, we think too much about questions that are not too important, because the apocalypse is not our business, maybe bitcoin will survive when the world economy is collapsing, bitcoin can also survive when the government prohibits mining, but if the apocalypse occurs, it is certain that bitcoin will not survive, because the person holding the bitcoin is dead, it is certain that the bitcoin will also be buried along with the person holding the bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "November 24, 2022, 01:48:29 PM",
      "body": "Quote from: Antonas1 on November 24, 2022, 12:35:07 PMQuote from: barto123 on November 24, 2022, 07:14:11 AMHow bad would it have to get to stop the chain & would that kill Bitcoin?It would be much worse than you think, so just sell all your BTC now! Haha!Why do people always ask similar questions like this? You can see there are lots of questions like BTC vs nuclear, BTC vs inflation, BTC vs world war 3, BTC versus disasters, etc.Don't think too much, just enjoy the moment now. Gather all your profits to preparing when the worst happens. Because if the worst thing happens you won't think whether bitcoin will survive, but you will be busy looking for ways to survive.Very true, too many questions relating to this topic show how little the OP's know about btc or how pessimistic they are regarding btc in general.The war is still ongoing, inflation is still high, natural disasters will not stop happening and btc keeps surviving in the midst of it all. About time people understood that btc is part of us now, this tech is not going anywhere, and people should stop thinking about the worst that could happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 24, 2022, 02:33:49 PM",
      "body": "Quote from: sunsilk on November 24, 2022, 08:52:36 AMIt's like operations will be stopped if no miners left anymore, the network will be there but if there will be no one validating and confirming transactions then that doesn't make sense anymore.The network might be stopped at that time and when someone does to reactivate it then that's it. It could be stopped temporarily but then likely will go back when there are people that will continue to mine. As soon as some miners stop mining, the difficulty will fall and the existing miners will start getting a bigger proportion of the block subsidy as rewards. This will incentivize the existing miners to stay put or encourage new miners to join in the network. Therefore this will not be a problem at all.What becomes a problem is that when bitcoin prices fall some weak hands start to lose their interest in bitcoin and panic sell. They make the market price drop even more. There is no such thing as apocalypse happening. Bad times and bad economies happen every few months but price has been stable at the 16k USD level for about a week now. I think we might see upward movements by December, once the FTX news gets saturated and people start buying again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}