{
  "id": "topic_5474794",
  "title": "Waldorf77",
  "author": "Waldorf77",
  "created_time": "November 20, 2023, 05:38:57 PM",
  "content": "Dlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474794",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 20, 2023, 06:02:19 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? I do not know if many people are paying for signals, but if we conduct a survey on 100 traders, if 50 are newbies and 50 are old traders. The traders that make use of signals most would be newbies while hardly will use see old traders still using signals, because signals will fail and they will understand why not to use signals. So do not bother to use signals, learn how to trade and use the amount of money that you can afford to lose to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "November 20, 2023, 06:51:02 PM",
      "body": "I personally don't use any kind of signal services. So paying for it is not an option for me. I don't know why people still trust this \"signals\". Learning is one thing but to trading using information provided by someone else is not a very wise decision. Even if it's done by a professional with 80 to 90 percent winnings, that 20 to 10% is what you need to look out for. That small percentage could lead to 100% loss. That's what happened when you follow signals. And the key thing to notice here is the market does not always move based on technical analysis. The market sometimes moves based on sentiments. Signals are created based on past data and calculations of many other things which does not include sentiments. Also, not having emotions, it cannot calculate market movement based on sentiments.Whatever you do, even if you are a beginner or a pro trader, following others should not be an option for any of you. Learn it on your own and that's the best way to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "November 20, 2023, 07:05:55 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? Even though I don't trade often, I am very much against paying for trading signals. Instead of paying for signals, get a successful trading mentor, this will give you access to their signals to achieve wealth. Also, instead of paying for signals, learn the basics of trading, including opening and closing trades, setting profit and stop-loss, risk management, and understanding analysis techniques.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 20, 2023, 07:11:54 PM",
      "body": "I suggest avoid them paying for signals if you find a service that offers signals it doesn't guarantee making a good profit.Most people who sell signals are scams if someone PMs or you come across someone on Telegram offering such services avoid them because it's a scam.Why not, learn how to trade you can start learning about TA and FA from this link below.- https://github.com/SpiralDevelopment/Awesome-Crypto-Trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distinctin",
      "created_time": "November 20, 2023, 07:12:58 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ?  To be honest, paid trading signals are not reliable as they are. They can be tempting for beginners because most of them would want quick profits, but as what I've heard, they are not working but only push these newbies to still lose in the end. The reason why I don't pay any trading signals even before and just decide to trade using my own developed trading signals which I think will certainly work on my trades.However, there might be some paid trading signals that may be working but they are only good at first, and they do not guarantee that you will not end up losing to most of your trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "November 20, 2023, 07:14:53 PM",
      "body": "I pay 0$. The reason: If trading signals would work, the owners would use it for themselves. Otherwise they sell them. So the chance to buy useless garbage is quite high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "November 20, 2023, 07:21:06 PM",
      "body": "Signals? Did you see someone ever selling a money printer machine? Simply it's a scam! And stay away of anyone pretending to be that profitable in trading and shows you fake results.To answer your questions, I did really purchase a subscription of trading signals earlier in my first days. With time, I have learned that it's just random signals without any basics..lost hundreds of dollars before realizing that signals are from scammers that want to steal people's money.Even most brokers of forex are scam, and steal users money beside advertising about earning money and becoming rich with trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "November 20, 2023, 07:21:15 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? You Are taking about paid signal groups made on Telegram mostly but some provide these groups on Facebook and on Discord too. The answer to your question is, no I don't pay for any paid signal group but if you pay for it the price ranges from 10$ to 100$ to $1000. You can find many with different price tags but till now I did not find any group pricing $1000. Monthly and yearly prices for signal groups are different because most of the groups's owner provide huge discount on yearly plans. You can calculate the yearly price for a group on the basis of above prices I gave.In my opinion if you are newbie you should not join these groups by paying money because most of these groups give future trades which are highly risky and most of the newbies don't even know the risk involves in future and secondly these group's results are not always accurate so why trusting your money on them. I will say do your own research and make trades on your own. In crypto you should never depend on anyone but if you plans to join a group which gives case study also.Then joining such groups worth a to get knowledge of things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 20, 2023, 07:40:57 PM",
      "body": "I don't know, I never rely on trading signals and many people say premium signals are unreliable with more manipulation in them.It varies that I know it can start from 50$/month or even more if it's yearly, they used to have 50% discount if it's yearly subscription but that should never be believed it will only benefit the trading signal owner.If you don't pay then in the future don't do it, it's better to trade yourself, but involve the signal because now there are many procedures for trading on the internet you can probably learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "November 20, 2023, 07:48:50 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? The customers of all these signal groups are mostly new traders who fear taking entry with their own judgment. They think a signal group can help them generate profits for them but they don't think if someone is that good at trading then he needs to sell his signal in a private community. He has already made millions of dollars with his highly valued analysis. All these groups are a form of scam as their owners charge dollars for monthly subscriptions and use small altcoins that can be moved by a small community. When they post a signal in their community it pumps for few hours and they show that as evidence of their successful trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "November 20, 2023, 07:59:16 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? None! Not ever in my trading career!Yes, you have heard right on which there are people who do really pay up for trading signals or even pay up just to join with those so called VIP trading groups which i dont really seefor it to be worth on spending up money because we know that its never been that worth in the first place. Why? All of those things or taught is really just that pure speculationon which this is something that you could really know for yourself too on which its never be needing someones help or tips.It would really be just that a waste of money and time on trying out to follow them but somewhat if we are really that speaking about to those free groups that having those kind of sharing then its not bad to consider on joining out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 20, 2023, 08:10:49 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? Nope.Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMWhat's your monthly expenses for trading signals? Yearly?None.Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMI don't pay but i read alot people pay for signals so how good results If this ? Better not to pay and never get interested on it. Those people that are paying for these signals are just telling you to join their signals group for you to have that encouragement as well and be one of their members to pay for a premium membership. Don't be too hasty on joining such because you don't need one. Trade, look at the market and the news and study analysis if you want to be successful in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 20, 2023, 08:11:02 PM",
      "body": "Trading signals are trash. NEVER pay to join such group.If you want to trade safely, learn some principles for the very basics. How much of your balance you should risk, what amounts to use to enter into a position, how and when to close positions or improve your positions. Finding the perfect entry is never feasible even for the most experienced traders. Repositioning or exiting positions is very common and the best practice to beat the market. Signals are never going to offer that. No matter how basic it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "November 20, 2023, 08:21:11 PM",
      "body": "Quote from: alani123 on November 20, 2023, 08:11:02 PMTrading signals are trash. [...]I wouldn't generalize that. There are indeed signal providers who specialize in medium- and long-term prospects and have their justification there. However, these signals are not found in the crypto market but almost exclusively in real estate and equities. So you need to be more specific in your statement: Crypto signals are trash. However, this is mainly due to the fact that there is a very dominant reserve currency (BTC) in the crypto sector, which determines the movement of almost all other coins. there is no such thing in other markets either ... or only to a very limited extent with gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "November 20, 2023, 09:27:35 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? Actually, there's no reason to do so. I learned to trade without being able to pay because of the collection of signals.You'll just conduct the research you haven't finished yet, buddy. You may learn about Bitcoin and cryptocurrency in a variety of ways. There are numerous options if you persevere. However, you should not be in a hurry to make money in this market because doing so will expedite the loss of your wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "November 20, 2023, 09:54:33 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ?  As a trader, I only rely on my own trading signals and chose not to follow any trading signal groups or channels that requires fees. Obviously, it's not for our own advantage because if they really aim to help us most especially those beginner traders, they will offer it as free and has nothing to pay. But the fact that they require payment in exchange for trading signals which we aren't sure if they are working, then for me it's already a big red flag.My advice is never take these trading signals that aren't free. Instead, focus yourself on studying the market and create good market analysis, that way you will develop your own trading signals based on how you understand the trading market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "November 20, 2023, 10:22:17 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? Let's say people pay $100 per month for 12 months. This is a big money which anyone would have used to learn trading themselves. I haven't used signals and I don't know how it works, this doesn't mean I don't believe in signals.But I will advise anyone who wants to used signals to know how to trade on their own first in order that they may understand when the market is going bad.After raising this topic, people will come to your dm for some good requests, you may decide to ignore them and only make public engagements and agreements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 20, 2023, 10:52:07 PM",
      "body": "Another, pay to lose. The influence of the signal is very big, even if we have discussed it repeatedly and there is still someone who is interested, asks questions and so on. Yes, I will not go to great lengths to prohibit or give advice because the other members above have given some advice about signal happiness and its ineffectiveness. However, if you still stick with the trading signal then follow the trading signal, if you experience a loss then don't complain or whine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "November 20, 2023, 11:13:06 PM",
      "body": "Quote from: Waldorf77 on November 20, 2023, 05:38:57 PMDlyou pay for signals? And how much ? What's your monthly expenses for trading signals? Yearly?I don't pay but i read alot people pay for signals so how good results If this ? There are free tradings signals out there there are a lot of groups that offer them you can search, if you don't want to pay or avail their subscription then you can rely on their free signals, BUT, I warn you not all groups you see will give reliable signals, paid or free, free signals ate the worst, I once rely on trading signals when I'm a beginner in trading when I notice that I don't get much in free signals and the signal has a lot of flaws and a large margin to lose, so I avail some subscription it did go well from the start but not for too long, so If your thinking of doing trading signals then choose the right groups as there is also a lot of scammers taking advantage of someone like you finding a signals, anyway trade on own risk, It's just that relying in trading signals is not recommended, it will not help your grow also it is very risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}