{
  "id": "topic_5449965",
  "title": "Aisorjo27",
  "author": "Aisorjo27",
  "created_time": "April 24, 2023, 08:05:23 AM",
  "content": "I'm looking for a gift card marketplace with lower fees than buysellvouchers for trading with crypto. Any suggestions?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449965",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "April 24, 2023, 08:14:40 AM",
      "body": "Are you referring to the site's fees for selling and buying? or the rates?With the shutdown of Paxful, I'm afraid there are no other good alternatives. Most P2P platforms left don't support gift cards.If you want to eliminate the fees, then you could use the Digital Goods board here in the forums. As for the rates, then the ones on the site you mentioned seem quite reasonable. Anything higher than 20% discount is a red flag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "handgrip",
      "created_time": "April 24, 2023, 09:01:47 AM",
      "body": "Do you want to buy and sell gift cards with cryptocurrency?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 25, 2023, 11:13:32 AM",
      "body": "Since you're not looking to build your own marketplace, moving this to Service Discussion might be a good idea. I've tried looking through Google and it seems like the majority of them are limited to Bitcoin only. What alternatives you've tried before? I also suggest doing P2P with an escrow on this forum if your problem is the platform fee, although your trade process might be a bit slower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zanezane",
      "created_time": "April 25, 2023, 04:45:58 PM",
      "body": "Quote from: Aisorjo27 on April 24, 2023, 08:05:23 AMI'm looking for a gift card marketplace with lower fees than buysellvouchers for trading with crypto. Any suggestions? I think I know some that you can check out like bitrefill, paxful, and coincards. Bitrefill is very popular platform that allows you to purchase gift cards with cryptocurrencies. The platform has a wide range of gift card options available and charges a relatively low fee for its service. https://www.bitrefill.com/Quote from: OmegaStarScream on April 24, 2023, 08:14:40 AMWith the shutdown of Paxful, I'm afraid there are no other good alternatives. Most P2P platforms left don't support gift cards.as he/she said paxful already shut down. The platform charges 1% fee on all transactions, which significantly lower than buysellvouchers' fees. but i can still drop the link if you are gonna check it out. https://paxful.com/lastly, coincards a platform that specializes in selling giftcards for cryptocurrencies. But this platform charges a 4% fee for their service unlike paxful for 1%. still lower than buysellvouchers. https://coincards.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 25, 2023, 04:58:39 PM",
      "body": "Quote from: zanezane on April 25, 2023, 04:45:58 PM-snip-This is not what OP is looking for. The platforms you mentioned don't sell for a discount, it's either 1:1 for more, and they don't let users sell their own gift cards either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "April 25, 2023, 08:00:03 PM",
      "body": "Quote from: Aisorjo27 on April 24, 2023, 08:05:23 AMI'm looking for a gift card marketplace with lower fees than buysellvouchers for trading with crypto. Any suggestions? You can find this type of service on the Binance marketplace but they mostly gift cards for Amazon, JD, steam, Apple, eBay, etc.Another marketplace I trusted and its privacy marketplace is the Arcadia marketplace but it's available on the UtopiaP2P ecosystem and their payment system is CRP or UUSD. However, their service is affordable and if you are lucky to have a voucher can pay less for the gift card you want to purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}