{
  "id": "topic_5432651",
  "title": "bitcoindata21",
  "author": "bitcoindata21",
  "created_time": "January 01, 2023, 09:28:37 PM",
  "content": "I created this on glassnode using onchain data. Only 3-4 signals till date but seems effective.I break it down in my latest video https://www.youtube.com/watch?v=scGCWlSwAQA&t=185sIf you use glassnode you can replicate this for your own use too.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432651",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "January 02, 2023, 04:14:07 AM",
      "body": "There are a lot of indicators that are pointing to a bottom right now. So it might be reliable however keep in mind that many of these signals went off when we were at the $25K range area.Many assumed that 200 WMA would hold because it always worked in the past and this time it didn’t work. So this is proof that none of these signals or indicators are fully accurate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 02, 2023, 05:50:29 AM",
      "body": "Indicators aside, my gut instinct based on my investing experience also tells me that we have either hit bottom or are very close. My instinct may fail just as the indicators fail, but at the end of the day I think there is a consensus that we can't fall much further now, coupled with the fact that this year should have positive returns, if we look at what happened in 2019, 2015 and 2011.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 02, 2023, 11:11:44 AM",
      "body": "Just pointing out that long-term investors don't really need trading indicators -- unless you're looking at significant and cyclical buying... in which case the first 75% drop post-ATH or the one post-halving are pretty much the \"perfect\" top-up periods.DCA takes care of that stress of watching though",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "January 02, 2023, 09:02:30 PM",
      "body": "Quote from: buwaytress on January 02, 2023, 11:11:44 AMJust pointing out that long-term investors don't really need trading indicators -- unless you're looking at significant and cyclical buying... in which case the first 75% drop post-ATH or the one post-halving are pretty much the \"perfect\" top-up periods.DCA takes care of that stress of watching though That is what exactly I do, I do 50% unfortunately and that was a wrong move on my behalf, loaded up around 30-35k range myself and got some more at 22-24k range as well, so I am not doing amazing for the recent ones but I got some from 2018 so it is doing not bad at all and I am fine about it.But at the end of the day, it is not going to be something huge for me until we have another ATH and I am not checking any trading indicators or anything like that, it doesn't matter to me at all because it is not going to be that much of a big thing at all. It will be as decent as it gets and as normal as it gets and why would I need indicators for long term that will result like that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 03, 2023, 04:32:53 PM",
      "body": "Quote from: doomloop on January 02, 2023, 09:02:30 PMQuote from: buwaytress on January 02, 2023, 11:11:44 AMJust pointing out that long-term investors don't really need trading indicators -- unless you're looking at significant and cyclical buying... in which case the first 75% drop post-ATH or the one post-halving are pretty much the \"perfect\" top-up periods.DCA takes care of that stress of watching though That is what exactly I do, I do 50% unfortunately and that was a wrong move on my behalf, loaded up around 30-35k range myself and got some more at 22-24k range as well, so I am not doing amazing for the recent ones but I got some from 2018 so it is doing not bad at all and I am fine about it.Nah, 50% from ATH isn't a wrong move at all (think of those who bought at 10k after the 2017 ATH, they're all still very much in the black at today's prices, no? So maybe you're in the red now, but wait for the next cycle -- that's kind of the whole point of DCA, giving us time to recharge and accumulate, and to be okay in the very long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "January 03, 2023, 07:10:25 PM",
      "body": "Quote from: doomloop on January 02, 2023, 09:02:30 PMQuote from: buwaytress on January 02, 2023, 11:11:44 AMJust pointing out that long-term investors don't really need trading indicators -- unless you're looking at significant and cyclical buying... in which case the first 75% drop post-ATH or the one post-halving are pretty much the \"perfect\" top-up periods.DCA takes care of that stress of watching though That is what exactly I do, I do 50% unfortunately and that was a wrong move on my behalf, loaded up around 30-35k range myself and got some more at 22-24k range as well, so I am not doing amazing for the recent ones but I got some from 2018 so it is doing not bad at all and I am fine about it.But at the end of the day, it is not going to be something huge for me until we have another ATH and I am not checking any trading indicators or anything like that, it doesn't matter to me at all because it is not going to be that much of a big thing at all. It will be as decent as it gets and as normal as it gets and why would I need indicators for long term that will result like that?It was not the best possible move you could have made but this does not make it a bad move, in fact anyone that fails to invest in bitcoin at the bottom is in theory making a subpar move, but at the end what matters is that you invested in bitcoin which is a good asset and you did so at a reasonable price, now there are only two things left for you to do, and those are to keep investing if your financial situation allows it and to hold your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 04, 2023, 08:11:55 PM",
      "body": "Key years for bitcoin, which show it's a good long term investment: 2012, 2016, 2020... Next must be 2024, although fruits may be gathered only in 2025. It's early to say, but I guess this year is going to be more of the same for bitcoin. It's a year of preparations for the next bullish cycle, so I'm not expecting anything expressive yet. Many people can't wait anymore, as they are excited to see bitcoin reverting the negative tendency, so the impatience is understandable. 2021's scenario let many people nostalgic and they want to live it again as soon as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "January 04, 2023, 11:32:58 PM",
      "body": "Quote from: Poker Player on January 02, 2023, 05:50:29 AMIndicators aside, my gut instinct based on my investing experience also tells me that we have either hit bottom or are very close. My instinct may fail just as the indicators fail, but at the end of the day I think there is a consensus that we can't fall much further now, coupled with the fact that this year should have positive returns, if we look at what happened in 2019, 2015 and 2011.I have the same feeling, although I had that feeling when we were at 30k, last year. My prediction was that there's a small chance that we'd go to 20k if things went really bearish, but best case scenario was to settle in the 30s for the second time and start another rally. I stood by my prediction and kept buying at 30k, then 25, 20, until I ran out of money. On one hand, charts are showing that it was a bad prediction. On the other we couldn't have known that a scammer would be buying bitcoin to pump up the price of his scam token and one of the biggest exchanges was a fraud from the beginning. Therefore, in a normal world, where no black swan event happens, we should've bottomed at 20k, even 22k and at the current state should've bottomed at 15k, but the world is far from perfect. I remember watching indicators a year ago and many were showing that the ultimate bottom for bitcoin in this cycle should be between 19k and 25k, which tells us that at 40-50k range none of those charts were taking into account the possibility of FTX being a scam. One of the indicators was the famous 200WMA that used to show bitcoin bottoms since 2012. This year it failed for the first time. It used to sit almost exactly at 20k. The unrealized loss chart has also been showing capitulation since July 2022, so before FTX. Some people also followed the logarithmic growth curves, which bitcoin fell out of for the second time in history (first being the covid crash in 2020), so if that was a black swan event, we're currently in another one. Growth curves may not be a trader's tool, but they are great at showing abnormalities and according to them bitcoin wasn't doing this bad in the last 10 years.It's almost impossible to predict the price of bitcoin. It's like a ship at sea during a storm, heading for an unknown land, and your job is to estimate how many people will survive the journey. All I can say this ship is robust, it can take it and there's a land waiting somewhere. How long it will take and how beat up it will be when it gets there? I'm ready to wait and find out",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "January 05, 2023, 04:00:16 AM",
      "body": "Quote from: buwaytress on January 02, 2023, 11:11:44 AMJust pointing out that long-term investors don't really need trading indicators -- unless you're looking at significant and cyclical buying... in which case the first 75% drop post-ATH or the one post-halving are pretty much the \"perfect\" top-up periods.DCA takes care of that stress of watching though Exactly, they don't need indicators because they don't want to time the market, either top or bottom price. They are 'too' smart with this all of technical analysis and will just invest whatever they can, or used DCA simply as that.Although we have nothing against TA, but most of the time it's a hit or miss. So just uses our gut feeling if you are a long term holder and just accumulate as much as you can in the bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 05, 2023, 12:37:59 PM",
      "body": "Watched your video and i want to thank you that you actually explained this. However this post could be so much better if you would just include screenshots and explanations in it, instead of having to use external youtube video. I know it's a little bit more work, but it would be worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "January 05, 2023, 12:49:32 PM",
      "body": "Well, the post might have been to lure us to make your views count. I think an article explaining things might be enough but still credit you for the work you've done. Anyways, I think fundamentals can still play a crucial role here, there are too many factors in the market right now that can lead to either break it on the downside more on the upside though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "January 05, 2023, 04:10:48 PM",
      "body": "Long-term bitcoin holders don't need a lot of indicators to hold their bitcoins because they just need to hold the bitcoins in their wallets and do nothing but buy more. They just need to wait until the price can reach the peak price and sell at that price to get the biggest profit. And when the price has exceeded the last ATH price, it's time for them to get ready to place a sell order. And every investor must have their own way of going through the process of waiting for bitcoin prices to increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "January 05, 2023, 09:58:35 PMLast edit: January 06, 2023, 02:19:02 AM by Gozie51",
      "body": "This thread is suppose to be finding it way to trading discussion because of the things discussed in the thread. Indicator is the tool of a trader because hodlers are not professional traders and may not be analyzing indicators. . So you need a thread where you have people ready to discuss the indicators and help you to a solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "January 06, 2023, 02:42:00 PM",
      "body": "Actually for a long term investment in Bitcon you don't need a lot of indicators or anything, you already know what you will get if you hold BTC for a long time, that is profit, that's all. Because the adoption of Bitcoin will be more massive in the future and it can't be avoided. With the increasing adoption of Bitcoin, of course this will increase its price. The current market conditions that are less stable are natural, that's to make the crypto market healthier and it won't last long, surely market conditions will improve and the price of Bitcoin will get better. But if you still believe in indicators, that is also good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "January 07, 2023, 10:52:30 AM",
      "body": "Quote from: adaseb on January 02, 2023, 04:14:07 AMThere are a lot of indicators that are pointing to a bottom right now. So it might be reliable however keep in mind that many of these signals went off when we were at the $25K range area.Many assumed that 200 WMA would hold because it always worked in the past and this time it didn’t work. So this is proof that none of these signals or indicators are fully accurate. Agreed there is bunch of indicator like this, we can take a look example of bitcoin rainbow chart and many more Techinal Analysis is good but not gonna predict the future precisely but still can guide us to know how the market move. In backtest most indicator look good but if you have more money you can test it with DCA by using your indicator",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "January 07, 2023, 03:14:01 PM",
      "body": "Quote from: retreat on January 06, 2023, 02:42:00 PMActually for a long term investment in Bitcon you don't need a lot of indicators or anything, you already know what you will get if you hold BTC for a long time, that is profit, that's all. Because the adoption of Bitcoin will be more massive in the future and it can't be avoided. With the increasing adoption of Bitcoin, of course this will increase its price. The current market conditions that are less stable are natural, that's to make the crypto market healthier and it won't last long, surely market conditions will improve and the price of Bitcoin will get better. But if you still believe in indicators, that is also good.Are sure about the future of Bitcoin?Well, I hope you're right but we can't just draw that assumption because these indicators are a huge help to us in order to have some insights into what will possibly happen a few years from now. As what I said, we can't tell that Bitcoin will still exist 10 years from now though there is a big chance. Yes, we can see a huge adoption by now but we're not sure about the future. Because this is not just a simple adoption as it needs support from the government as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "January 08, 2023, 01:15:18 PM",
      "body": "Quote from: uneng on January 04, 2023, 08:11:55 PMKey years for bitcoin, which show it's a good long term investment: 2012, 2016, 2020... Next must be 2024, although fruits may be gathered only in 2025. It's early to say, but I guess this year is going to be more of the same for bitcoin. It's a year of preparations for the next bullish cycle, so I'm not expecting anything expressive yet. Many people can't wait anymore, as they are excited to see bitcoin reverting the negative tendency, so the impatience is understandable. 2021's scenario let many people nostalgic and they want to live it again as soon as possible.2017 and 2021 were also very good for bitcoin and other cryptocurrency. So 2023 could also be a good year, although no one is expecting a new ATH, personally I am expecting at least a bounce like it was in 2019. The only thing that worries me is that bitcoin has not yet faced a global crisis, so it is hard to guess how it will affect bitcoin now that there is a lot of unstable in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "January 08, 2023, 01:38:29 PM",
      "body": "Long term investors are actually looking for the fundamentals and not on the technical, they are investing on a good project that have a potential for long term investing so they didn't care that much about its current value because they are willing to take the risk of holding in long term. There's actually no perfect indicator for long term investing, you can use any indicator where you think can help you identify your buying price, if that works for you then much better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "January 08, 2023, 02:37:12 PM",
      "body": "Quote from: o48o on January 05, 2023, 12:37:59 PMWatched your video and i want to thank you that you actually explained this. However this post could be so much better if you would just include screenshots and explanations in it, instead of having to use external youtube video. I know it's a little bit more work, but it would be worth it.Let's just consider nothing is free in this world, so instead of the OP sharing full explanation of his analysis then I guess he was expecting support for his channel and videos as well. I don't really care, the OP is free to do so but it would be nice if he could also explain it here while referencing the video and the channel.On another post, I've been convinced that the bottom was reached and maybe it was. So even if the people and the analysis say that there will be a deeper decline, then I guess I just need to believe the recovery will come soon. After all, no indicator is completely accurate but the cycle is very sure to repeat itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}