{
  "id": "topic_5520816",
  "title": "Jating",
  "author": "Jating",
  "created_time": "November 27, 2024, 12:18:07 PM",
  "content": "https://contents.xj-storage.jp/xcontents/AS08938/7062f264/1079/4803/a2de/86e89b14b5e5/140120241125528416.pdfAnd so I try to used Google Translate to understand the context of the statement from Remix point,1. They mentioned that they are going to invest because of the result of the US election, (so talk about Trump's influence after winning the election.)They already purchased 3 billion yet, and now another 500 million totaling to 3.5 billion yen, = $23 million, if my math is right.2. They are going to complete the purchase by the end of the year3. They've already assets the risk of buying crypto and they have followed \"\"Notice regarding the purchase of cryptocurrencies\" dated September 26, 2024\"4. Future outlook Cryptocurrency holdings will be evaluated at market value every quarter, meaning they will have to fully disclosed everything if they are in the net positive as far as their investment goes.The company specifically mentions the US election as one reason why they are going to continue to buy Bitcoin. So perhaps this is another effect of Trump winning the US election. But most likely, since Yen is falling against USD, and to overcome the Yen devaluation crisis, the company is hedging their assets on BTC.Good move by Remixpoint?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5520816",
  "comments": [
    {
      "author": "Botnake",
      "created_time": "November 27, 2024, 12:49:42 PM",
      "body": "I used a translation tool on that picture too, and it says they’re buying \"15 units of Bitcoin trust.\" I’m not sure if that equals the $3.3 million worth of Bitcoin you mentioned. Can you help clarify? Maybe we can calculate it based on how much Bitcoin each trust unit represents and the current BTC price.As for whether it’s a smart move by Remixpoint ... ..absolutely! They’re running a local crypto exchange, so believing in Bitcoin’s future makes sense. Their investment shows they’re in it for the long term, and it aligns with their business vision. It’s like putting their money where their trust is, literally...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "November 27, 2024, 01:03:31 PM",
      "body": "In conclusion they only purchase additional 500 Million Yen.This is small, but it's not about the number, but how The US influencing other countries. It will make Bitcoin become more trusted for Average Joe and people will not think it's scam or scared to invest in Bitcoin.Quote from: Botnake on November 27, 2024, 12:49:42 PMI used a translation tool on that picture too, and it says they’re buying \"15 units of Bitcoin trust.\" I’m not sure if that equals the $3.3 million worth of Bitcoin you mentioned. I get the same meaning like @OP, I think you can start to pointing me where you can get the \"15\" number because there's no 15 in the press.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PremiumcryptoHub",
      "created_time": "November 27, 2024, 01:07:53 PM",
      "body": "Quote from: Botnake on November 27, 2024, 12:49:42 PMI used a translation tool on that picture too, and it says they’re buying \"15 units of Bitcoin trust.\" I’m not sure if that equals the $3.3 million worth of Bitcoin you mentioned. Can you help clarify? Maybe we can calculate it based on how much Bitcoin each trust unit represents and the current BTC price. I think this is bullish bitcoin news.As you can see here on Twitter, Japanese energy and automotive company RemixPoint will be buying 500M yen (about $3.2 million) worth of bitcoins in their country's local currency. Quote from: Jating on November 27, 2024, 12:18:07 PMThey already purchased 3 billion yet, and now another 500 million totaling to 3.5 billion yen, = $23 million, if my math is right. According to today's market, 1 Japanese yen = 0.0066 US dollars. Accordingly, 500 million yen is 500 × 10,00000 = 500,000,000 yen.Converting 500,000,000 yen to US dollars is 500,000,000×0.0066=$3300,000 dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "November 27, 2024, 02:01:10 PM",
      "body": "Quote from: Helena Yu on November 27, 2024, 01:03:31 PMQuote from: Botnake on November 27, 2024, 12:49:42 PMI used a translation tool on that picture too, and it says they’re buying \"15 units of Bitcoin trust.\" I’m not sure if that equals the $3.3 million worth of Bitcoin you mentioned. I get the same meaning like @OP, I think you can start to pointing me where you can get the \"15\" number because there's no 15 in the press. I think my translation tool is wrong as it's 2 versus one..  Anyway, @PremiumcryptoHub have answered it bring the article that says $3.3 million, so it's already confirm on my side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "November 27, 2024, 09:31:52 PMLast edit: December 02, 2024, 06:09:04 PM by AmoreJaz",
      "body": "Quote from: Helena Yu on November 27, 2024, 01:03:31 PMIn conclusion they only purchase additional 500 Million Yen.This is small, but it's not about the number, but how The US influencing other countries. It will make Bitcoin become more trusted for Average Joe and people will not think it's scam or scared to invest in Bitcoin.Quote from: Botnake on November 27, 2024, 12:49:42 PMI used a translation tool on that picture too, and it says they’re buying \"15 units of Bitcoin trust.\" I’m not sure if that equals the $3.3 million worth of Bitcoin you mentioned. I get the same meaning like @OP, I think you can start to pointing me where you can get the \"15\" number because there's no 15 in the press. They are anticipating that there will be positive approach towards crypto specifically btc owed to Trump's winning this election. This will give them good reason to invest more as they are looking of course for the positive profit on this venture. Positive approach towards this market by a leading economy will indeed be influential in this market. As we are already heading on a positive direction, more crypto-related programs will further fuel its strong adoption to the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 28, 2024, 04:49:42 AM",
      "body": "Quote from: AmoreJaz on November 27, 2024, 09:31:52 PMThey are anticipating that there will be positive approach towards crypto specifically btc owed to Trump's winning this election. This will give them good reason to invest more as they are looking of course for the positive profit on this venture.The news of big companies and even the government buying Bitcoin will keep rolling in because of Donald Trump's victory in the elections. Other skeptic investors are waiting for him to be sworn in and fulfill his promise of making the US a crypto capital and Bitcoin a reserve currency before they start investing. Japan’s Remixpoint has been diversifying its assets to the crypto since September, and Trump's victory is giving them more confidence to put in more funds. After Monday, January 20, 2025, everything will become clearer about the new new US government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "November 28, 2024, 05:26:56 AM",
      "body": "not big amount, but can definitely set example for surrounding countries in the same continent that there's no harm in investing in bitcoin and maybe it's worth to put some crypto into their portfolio.moving forward I expect crypto dominates 20% of many companies' portfolio to be the norm, we're still early for this though, but the bold companies that are willing to innovate at least already invested big amount of money already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "November 28, 2024, 05:58:55 AM",
      "body": "Quote from: Jating on November 27, 2024, 12:18:07 PMhttps://contents.xj-storage.jp/xcontents/AS08938/7062f264/1079/4803/a2de/86e89b14b5e5/140120241125528416.pdfAnd so I try to used Google Translate to understand the context of the statement from Remix point,1. They mentioned that they are going to invest because of the result of the US election, (so talk about Trump's influence after winning the election.)They already purchased 3 billion yet, and now another 500 million totaling to 3.5 billion yen, = $23 million, if my math is right.2. They are going to complete the purchase by the end of the year3. They've already assets the risk of buying crypto and they have followed \"\"Notice regarding the purchase of cryptocurrencies\" dated September 26, 2024\"4. Future outlook Cryptocurrency holdings will be evaluated at market value every quarter, meaning they will have to fully disclosed everything if they are in the net positive as far as their investment goes.The company specifically mentions the US election as one reason why they are going to continue to buy Bitcoin. So perhaps this is another effect of Trump winning the US election. But most likely, since Yen is falling against USD, and to overcome the Yen devaluation crisis, the company is hedging their assets on BTC.Good move by Remixpoint?Great move by Remixpoint. It’s hard not to think that every company today isn’t at least thinking about forming some form of their own Bitcoin treasury after seeing the benefits and how positively it has increased other companies stock prices etc. It’s a new age! This is the age and era of Bitcoin and the market turner here is that every company & rich & even middle to poor are all behind and there is only so much Bitcoin to go around. This is why we see all these predictions for 13 million per coin 10 years out etc. This next decade will be insane for crypto, AI, computing, and complex technologies. Innovation age / Bitcoin age. We’re going to see another planet colonized in like 30-40 years maybe even sooner this day and age we are living in man isn’t it just wild to even wrap your head around?? Times change so fast and the whole world is shifting right before our very eyes! It’s incredible to be witnessing this transformation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 28, 2024, 06:27:22 AM",
      "body": "Quote from: Jating on November 27, 2024, 12:18:07 PM1. They mentioned that they are going to invest because of the result of the US election, (so talk about Trump's influence after winning the election.)They already purchased 3 billion yet, and now another 500 million totaling to 3.5 billion yen, = $23 million, if my math is right.well they did the perfect decision here because it is indeed that since Trump wins the election then this will bring better result for the coming years  of holding and keeping those bitcoin .this may not be a big amount but knowing that this is Japan that we are talking here for sure they will serve as signal for others to follow such action .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 28, 2024, 07:06:04 AM",
      "body": "According to stock analysis data[1], Remixpoint has a market cap or net worth of 24.54 billion as of November 18, 2024. Thus, the amount of 3 million does not represent a lot of investments or at least less than 5% which is generally used as part of the risk diversification policy. Therefore, the company still classifies Bitcoin as a high-risk investment.[1] https://stockanalysis.com/quote/tyo/3825/market-cap/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 28, 2024, 11:05:23 AM",
      "body": "At a time when no one is making too much of a fuss about one company buying around $10 billion worth of BTC in just ten days, why was it relevant that another company invested a few million dollars? If you want to buy 10 BTC right now you need about $1 million. Those who today pay a lot for BTC, and 10 years ago said it was a scam, are the best in the whole story - investing with regret for the past, which of course they cannot return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}