{
  "id": "topic_5437038",
  "title": "Lee Dynamo",
  "author": "Lee Dynamo",
  "created_time": "January 27, 2023, 06:39:12 PM",
  "content": "The price consolidation is getting longer in a narrow range.The bears are still holding the bullish barrier of $23,400.BitcoinBTC price is struggling in the consolidation phase to maintain a healthy bullish trend in the market. The bulls wait patiently to buy bitcoin if a range breakout occurs. Although trading volumes have declined in the past few days, this was due to a reduction in short positions from the market.The $23300 to $24400 support-resistance range is considered to be a defensive zone for the bulls and bears after the bullish gains of January 20. If a bullish breakout occurs before the end of January, bitcoin price is likely to reach the $25K level soon. https://www.tradingview.com/x/HsuNUdbE/Due to the continued price rally, BitcoinBTC speculators consider the $20,000-conceptual round level as key support. This rapid rally turned the scenario into a sell-off at higher highs and till now the bulls are leading the market.Some key facts that could push the price of BitcoinBTC upwardsThe overall market valuation crossed $1 trillion.The price of bitcoin is well above the crucial round level.There is consolidation below $22,300 to $23,400 for another bullish move.Technical indicators heat up the market.Final ThoughtsLong positions are increasing in the market in view of the higher-low formation. Market leader-Bitcoin may soon break this box pattern due to positive market sentiment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437038",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "January 27, 2023, 08:54:14 PM",
      "body": "We have a day ahead of the weekly closing, which, if the price fails, means that we are closer to testing the support at $19,000 than the resistance at $24,000.Data for the month of February will be decisive in many files, such as the Ukrainian war, the Fed's decisions, and speculators' appetite for more risks.All we need is an additional $1,500 within the next 24 hours to test $28,000 levels for the first time in several months.- Yamane",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 28, 2023, 01:16:35 PM",
      "body": "The market will never be predictable, and never has been. At least, to a fine degree. Now, over the long term I'd be pretty confident in predicting that Bitcoin will continue to be adopted, and less Bitcoin will be injected into circulation, and therefore the price of Bitcoin will increase. However, that's a pretty vague prediction, but is the most accurate. When, users start getting into the nitty gritty, and trying to accurately determine price movements in the short term, often it's not based on anything, but correlation. Which, has proven to be a rather suspect metric to base predictions on. So, in short no the market can't be accurately predicted, despite all these analysis' going on. Now, I'll admit they're fun to read, and to sort of come up with your own speculation. However, they often aren't that accurate. Although, having said that the long term outcome of Bitcoin I think is fairly predictable without making any price assumptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "January 28, 2023, 02:19:08 PM",
      "body": "We are still above the $1 Trillion threshold so that is good.The price is still in the consolidating phase at $23k, and then we have to maintain it to go to the next level. This is how it's been since we touch $20k, very difficult barrier as first but when we breach it, just a matter of time before we maintain that price and then it was sustainable until $23k.So that might be the next move, $23k, for about a week or two and maintain it before we surge to the next price level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitgolden",
      "created_time": "January 28, 2023, 06:01:31 PM",
      "body": "Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMThe $23300 to $24400 support-resistance range is considered to be a defensive zone for the bulls and bears after the bullish gains of January 20. If a bullish breakout occurs before the end of January, bitcoin price is likely to reach the $25K level soon.If breaking of resistance level will not happen within this January then it will happen after testing the support levels one more time. So, it does not mean that if $24.4k levels will not be broken within this January, then we may not see $25k levels in this bullish wave. In my analysis, we are going to end this month below $23k levels but you will see fireworks by the first week of February which may lead the bitcoin market into next resistance levels which will be around $27k to $28k levels or up to the psychological barrier of $30k levels.As of now, bulls are trying to gather more power and this time they may fail hence a pull back may happen. But, next attempts of bulls will definitely will take them up to $30k levels as per market sentiments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "January 28, 2023, 07:08:03 PM",
      "body": "Quote from: bitgolden on January 28, 2023, 06:01:31 PMQuote from: Lee Dynamo on January 27, 2023, 06:39:12 PMThe $23300 to $24400 support-resistance range is considered to be a defensive zone for the bulls and bears after the bullish gains of January 20. If a bullish breakout occurs before the end of January, bitcoin price is likely to reach the $25K level soon.If breaking of resistance level will not happen within this January then it will happen after testing the support levels one more time. So, it does not mean that if $24.4k levels will not be broken within this January, then we may not see $25k levels in this bullish wave. In my analysis, we are going to end this month below $23k levels but you will see fireworks by the first week of February which may lead the bitcoin market into next resistance levels which will be around $27k to $28k levels or up to the psychological barrier of $30k levels.Price has attempted some upward movement towards the resistance level on the 26th/Jan. by heating a high of $23.2k and even today, it has managed it to $23.4k. The consolidation market has been a challenging one and from what we see now with the bears, it's unlikely that the bulls might be able to break the resistance level. February perhaps but, January looks already done for but, we could expect price to rally once more towards $28k and consolidate some more before giving way for the bears to push price further down to create a support at $23k. It's quite hard to make any accurate prediction as no one could actually be so sure but, based on what price on bitcoin has been doing in the market lately, this is my mouth on possible expectation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 28, 2023, 07:47:23 PM",
      "body": "Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMThe $23300 to $24400 support-resistance range is considered to be a defensive zone for the bulls and bears after the bullish gains of January 20. If a bullish breakout occurs before the end of January, bitcoin price is likely to reach the $25K level soon.There are no strong resistance points between $24400 and $25K, you are talking about $600, and if the price succeeds in breaking the $24K hurdle, we are talking about the next resistance level at 28K.And what is the relationship of January with these prices? The closure of Bitcoin is not linked to the months, so if this does not happen by the end of January, it will happen by the beginning of February.Personally, I lean towards the effect of the end of the week, when trading is at its peak, and therefore, if we do not break the 24,000 barrier before the end of the day, we will not see $25K during the next week.Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMThe overall market valuation crossed $1 trillion.This is a useless metric that has proven to fail in predicting price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "January 28, 2023, 08:00:22 PM",
      "body": "Quote from: bitgolden on January 28, 2023, 06:01:31 PMAs of now, bulls are trying to gather more power and this time they may fail hence a pull back may happen. But, next attempts of bulls will definitely will take them up to $30k levels as per market sentiments.Having some sort of understanding that not every move is bear market, and not every up is a bull market is critical. I agree that bottom is gone and we won't see anything lower, but that doesn't mean that we are going to end up with a big increase any time soon, it doesn't even mean that we are going to end with no drop, we could still drop a bit, but just not big enough for a bottom.I could see us going to 21k levels soon for example, not that it will happen, but it's a possibility, and that's what we should be careful against. So, remember that it's not always a bull or bear, it's sometimes up and down small amounts that will turn into a bull or bear eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "January 28, 2023, 10:06:37 PM",
      "body": "Short-term price can never be predicted with good enough accuracy. Regardless if it's in bull market, bear market, trading sideways, consolidating, etc. Long-term trends tied to halvenings, also known as cycles, are the best thing we have for predicting Bitcoin price. So by applying it here, it seems like the most likely trend for this year is trading sideways until the halvening. We will see a lot of local ups and downs until the bull market starts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "January 28, 2023, 11:54:00 PM",
      "body": "Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMLong positions are increasing in the market in view of the higher-low formation. Market leader-Bitcoin may soon break this box pattern due to positive market sentiment.Thats what if on Bitcoins price trend whether it would be breaking up some ceilings or resistances or would fail out on doing so and keeps on making some retracement.The hardest thing that we could able to see out is that on the time that it would really be making some sideways movement or making out some consolidation then this is what makes things more hard.Market cant really be predicted no matter what and no matter how good your analysis whether fundamentals or technicals, it couldnt really assure out that it wouldprecisely happen.This is why expect the unexpected as always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 29, 2023, 06:01:49 AM",
      "body": "It was in a consolidation phase but right now it started to rally and it’s not called consolidation any more. A big consolidation phase was in 2015 where it traded sideways for 9 months. Same with early 2019 where it traded sideways for 4 months. We had a fairly quick consolidation phase.Does it mark the bottom? Hard to say but possibly. I think those that wanted to sell already sold. Even if FTX goes bad, they don’t have any BTC to dump anyways. Only ones I would worry about are SOL and SRM coins, which might get dumped by the bankruptcy committee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "January 29, 2023, 07:28:27 AM",
      "body": "Over the last 12 years I think Bitcoin has shown itself to be one of the most predictable assets there is. The 4-year cycle has repeated itself in a near perfect fractal pattern with the FTX scam acting like the only divergence. That doesn’t mean the next four years will be just like the last 4-year cycles, but it does give a good chance that it will be similar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 29, 2023, 10:54:28 AM",
      "body": "Bitcoin price can be predicted as a trend or a price curve, but it is next to impossible to predict a specific price range, especially if it is narrow or between $1,000 to $3,000 in the medium and long term.During the first years, it was easy to predict that the price would not reach $10, and therefore the range would be between $1 to $5. - Over time, the price reached 100, and thus the range of change from $20 to $50. - Then to 1000 dollars, and thus the range of change from $200to $500. - And to 10,000 dollars, and thus the range between $2000 to $5000. - And now at $100,000, so the range is between $20,000 to $50,000.Perhaps the cycle will continue for the next few years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "January 29, 2023, 01:42:53 PM",
      "body": "Predicting the market will be quite difficult. I know Bitcoins are struggling in this price segment for past few days. But guess what it’s comparatively better than the 18k usd range. If Bitcoin touches anyhow 25k usd by the end of the January, then definitely February will be big for the coin. Bitcoins just need some more time, till that we can oppose the whales who are manipulating the market by buying more and more Bitcoins. Let’s increase the demand of the coin, so that the price will increase as soon as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 29, 2023, 03:00:20 PM",
      "body": "Quote from: Welsh on January 28, 2023, 01:16:35 PMThe market will never be predictable, and never has been. At least, to a fine degree.I agree that in the short term, many are just speculating and guessing, especially those who are not very good at interpreting TA, which is not a reliable source of information anyway, although it can give some good indications in which direction the market could move. For those who trade on a daily basis, it will always be a challenge to predict what will happen in such a short period of time, and because of this, most of them mostly make losses.Quote from: Welsh on January 28, 2023, 01:16:35 PMNow, over the long term I'd be pretty confident in predicting that Bitcoin will continue to be adopted, and less Bitcoin will be injected into circulation, and therefore the price of Bitcoin will increase. However, that's a pretty vague prediction, but is the most accurate. When, users start getting into the nitty gritty, and trying to accurately determine price movements in the short term, often it's not based on anything, but correlation. Which, has proven to be a rather suspect metric to base predictions on. I think that this is one assumption that most people agree on, because everything stems from the fact that Bitcoin has a limited supply, that every 4 years a halving occurs, which reduces the flow of new BTC by 50%, and that the demand should increase over time, and available coins for trading should be in smaller and smaller amounts. I would venture to say that some things will be much clearer in less than 10 years when 99% of all BTC will be mined, although the ratio of what is already in circulation and what is still left is far on the side of already mined coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "January 29, 2023, 03:13:02 PM",
      "body": "Speculated, yes. But if prediction? Nope. Investors or traders may use technical analysis on this industry but that won't mean certainty with market behavior. The market price is solely dependent with the demand from users. And demnd on the other hand simply moves in accordance with the majority. Many factors are affecting the demand from people; either negative or positive. That is also why there are sudden increase on the market price of cryptos which could be resulted by a news adopting to this technology or new projects which are using catching the eyes of investors. There's too much to ask.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 29, 2023, 03:26:39 PM",
      "body": "Quote from: Lucius on January 29, 2023, 03:00:20 PMI think that this is one assumption that most people agree on, because everything stems from the fact that Bitcoin has a limited supply, that every 4 years a halving occurs, which reduces the flow of new BTC by 50%, and that the demand should increase over time, and available coins for trading should be in smaller and smaller amounts. I would venture to say that some things will be much clearer in less than 10 years when 99% of all BTC will be mined, although the ratio of what is already in circulation and what is still left is far on the side of already mined coins.Yeah, I'm basically talking facts there, with a little speculation sprinkled in. However, realistically if Bitcoin is still being adopted, then we should see the deflationary aspect of Bitcoin kick in, and the price should increase. I can't tell you if it'll increase much or by how much, I just know it should theoretically increase. You should see this after each halving specifically. Yeah, you're right. When the block rewards don't exists anymore or are significantly reduced that they don't impact the market as much, then the price of Bitcoin will be more stable, and therefore more predictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 30, 2023, 10:33:11 AM",
      "body": "@Welsh, our thinking makes sense, although we should always take into account that the future certainly holds some (at this moment) hard-to-predict events that can significantly influence how the price will be formed in relation to how it is formed today. We can predict some things to a certain extent, but let's say we can't know if there will be a few new Saylors in the future who will decide to transfer all their wealth to Bitcoin, which at first looks like a positive adaptation to some, but it also hides a potential danger in the form of the fact that each of them can sell at any time and thus influence the price. In addition, any such individual or company can be hacked at any time, which can also cause panic among all other investors.I can think of another element that can play a significant role, which is a physical ETF that has not yet come to life in the US, and which could significantly affect the price of BTC in a positive but also a negative sense. You may have already read it, but there is an interesting reflection on that topic by Antonopolous, where our admin @theymos also gave his answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "February 02, 2023, 08:03:44 PM",
      "body": "Predictions are possible but will not be accurate. Bitcoin repeats its circle every four years,therefore analyst can use this,to work on the market price when it will be bullish or bearish. Hodlinng your btc for long will not make you think about the price because you will definitely make huge profit from your investment. The resistance price of 24k is still on and we just started a new month. This means that we should relax and watch if the price will hit 24k before mid month and if it does,I might say that there will be hope that at the ending of February to March the price might hit 30k. Btc will hit the bull run this year. The recent up movement in the price this January can't be used to predict the actual amount will be move to the February.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "February 02, 2023, 08:57:15 PM",
      "body": "Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMThe $23300 to $24400 support-resistance range is considered to be a defensive zone for the bulls and bears after the bullish gains of January 20. If a bullish breakout occurs before the end of January, bitcoin price is likely to reach the $25K level soon.Price resistance or at least considered to be defensive zone are round numbers, so it might be $30k in our case.Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMDue to the continued price rally, BitcoinBTC speculators consider the $20,000-conceptual round level as key support. This rapid rally turned the scenario into a sell-off at higher highs and till now the bulls are leading the market.Definitely, but we have broken that already, and we are around the $24k-$25k, so that will be the support for now. But I do agree that bulls is in control, and if you short bitcoin, then you are going to lose money here.Quote from: Lee Dynamo on January 27, 2023, 06:39:12 PMLong positions are increasing in the market in view of the higher-low formation. Market leader-Bitcoin may soon break this box pattern due to positive market sentiment.Yes, that's what I said, we should go long here, although the price is increasing by day, it still make sense to accumulate, still very cheap, no need to buy 1 bitcoin right away, steady is the name of the game, do DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}