{
  "id": "topic_5464988",
  "title": "Cullinantime",
  "author": "Cullinantime",
  "created_time": "August 29, 2023, 05:00:11 PM",
  "content": "I need loan 500-1000$ no collateral i can verify with ID i have little difficult times i need some help.I just payed my 2 old debts to clear out my credit history Loan purpose: i pay my few Loans and i pay you back once i can get to apply again loan i have to wait like few weeks to 3 months.Here is works that way just how to apply for the loan.Let me know thanks you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464988",
  "comments": [
    {
      "author": "DireWolfM14",
      "created_time": "August 29, 2023, 05:06:34 PM",
      "body": "No collateral, no loan.Quote from: DireWolfM14 on July 23, 2023, 05:35:43 AMID and Proof of Income:Identification documents, paycheck receipts, proof of income, and written or verbal contracts promising to pay are worthless to a lender.  There are no documents you can provide that will secure your loan request.  All forms of identification and documentation can easily be forged or faked, and no lender here has the ability to authenticate anyone's identity.  The prevailing theory is that no one would willingly disclose their personal information to a stranger on the internet for a few hundred dollars, unless of course it's not their identity to begin with.  Honest or not, such a request will appear to be a scam attempt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 29, 2023, 05:58:48 PM",
      "body": "You look like a person who has a high affinity for loans and debtsSo you are now seeking a loan to pay the previous debts (loans) after which you will a get a new loan in the future to pay this one... right?ID of any for is not valid collateral. Once you default the loan, the lender is not going to be able to recover his with your ID. Look for something more valuable, like high market cap altcoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "August 29, 2023, 06:10:59 PM",
      "body": "Even if I tried really hard to squint and pretend that this story makes any sense, how could one possibly not know how much they need to borrow?500... or 1000. But I think even $5 would be profitable for a zero-effort newbie loan scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cullinantime",
      "created_time": "August 29, 2023, 06:40:42 PM",
      "body": "Quote from: suchmoon on August 29, 2023, 06:10:59 PMEven if I tried really hard to squint and pretend that this story makes any sense, how could one possibly not know how much they need to borrow?500... or 1000. But I think even $5 would be profitable for a zero-effort newbie loan scam.It depends how much i need to pay % . I estimate 500-1000 If i can get it soon i can pay a lot debts so my credit history will be clean and i can bigger loan.One of my PLANS Are to invest in crypto little by little with borrowed money after 3 months when i can apply for sure again for Loans.The idea generally would be to keep my credit history clean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "August 29, 2023, 07:15:11 PM",
      "body": "Quote from: Cullinantime on August 29, 2023, 06:40:42 PMIt depends how much i need to pay % . I estimate 500-1000 If i can get it soon i can pay a lot debts so my credit history will be clean and i can bigger loan.One of my PLANS Are to invest in crypto little by little with borrowed money after 3 months when i can apply for sure again for Loans.The idea generally would be to keep my credit history clean.If someone is in your shoes and you have the Amount of loan the person requested will you offer it to the person vwith out no collateral and no reputation on bitcointalk will you still give the person the loan? No I don't think you can because you will definitely have in mind that the person is a big scammer and sorry to say this no body will offer you such loan, firstly you made a very big mistake, you are supposed to go through the lending board to see what ranked members and the amount of loans that are been given.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cullinantime",
      "created_time": "August 29, 2023, 07:37:36 PM",
      "body": "Quote from: rachael9385 on August 29, 2023, 07:15:11 PMQuote from: Cullinantime on August 29, 2023, 06:40:42 PMIt depends how much i need to pay % . I estimate 500-1000 If i can get it soon i can pay a lot debts so my credit history will be clean and i can bigger loan.One of my PLANS Are to invest in crypto little by little with borrowed money after 3 months when i can apply for sure again for Loans.The idea generally would be to keep my credit history clean.If someone is in your shoes and you have the Amount of loan the person requested will you offer it to the person vwith out no collateral and no reputation on bitcointalk will you still give the person the loan? No I don't think you can because you will definitely have in mind that the person is a big scammer and sorry to say this no body will offer you such loan, firstly you made a very big mistake, you are supposed to go through the lending board to see what ranked members and the amount of loans that are been given.You can really say bad things about me sure Im newbie but i tell you Im ready to proof how i use loan how i can pay back ... To be honest i  can even make money back with trading Im not bad futures trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "August 29, 2023, 08:36:30 PM",
      "body": "Quote from: Cullinantime on August 29, 2023, 06:40:42 PMOne of my PLANS Are to invest in crypto little by little with borrowed money after 3 months when i can apply for sure again for Loans.Anyway this story is not clear enough to me, what do you mean?You want to use borrowed money to invest in crypto currency   which means you are planning to risk someone's money and also risking your reputation too.Now if you loss all the borrowed money on crypto currency how will you pay back? Will you still borrow from somewhere else to pay or you will run away since you have no collateral for loan?Moreover holding someone's money for over 3 months that's means the interest too will also add and if you can't meet up to pay the 3 months another interest will add.  Quote from: Cullinantime on August 29, 2023, 07:37:36 PMYou can really say bad things about me sure Im newbie but i tell you Im ready to proof how i use loan how i can pay back ... To be honest i  can even make money back with trading Im not bad futures trader.I don't mean to say you are a bad person, but your request is something nobody might consider unless the person just want to take that risk, that's just the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "August 29, 2023, 10:31:46 PM",
      "body": "Quote from: Cullinantime on August 29, 2023, 07:37:36 PMYou can really say bad things about meYou're a goat herding asthmatic and your feet smell like the fear of possum in a room full rocking chairs.Come back anytime, and I'll taunt you some more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "August 30, 2023, 03:10:34 AM",
      "body": "Quote from: DireWolfM14 on August 29, 2023, 10:31:46 PMQuote from: Cullinantime on August 29, 2023, 07:37:36 PMYou can really say bad things about meYou're a goat herding asthmatic and your feet smell like the fear of possum in a room full rocking chairs.Come back anytime, and I'll taunt you some more.Archived for future reference.@Cullinantime - don't feed the DT trolls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}