{
  "id": "topic_5436859",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "January 26, 2023, 10:41:03 AMLast edit: May 25, 2023, 10:42:15 AM by DdmrDdmr",
  "content": "Mirando una página de resultados de una búsqueda en Google sobre bitcoin, me encontré con una noticia que llama la atención:No parece nada que no haya sucedido antes, y sí un recordatorio de que, de vez en cuando, las cuentas en las RRSS son hackeadas para promocionar timos de una u otra naturaleza, muchos de ellos relacionados con las criptomonedas.El fragmento mostrado por el buscador de Google habla 117K $ en BTC obtenidos mediante esta estafa ... Lo que sucede es que el fragmento del artículo ha código parte del último párrafo del artículo, y donde el contexto ya habla de manera retrospectiva sobre casos del 2020. El fragmento destacado en la búsqueda, no obstante, da la sensación de ser un resumen del titular de la noticia, y no lo es …No tengo claro cómo se generan estos extractos. He visto alguna fuente donde se indica que es el autor el que puede hacerlo, y otros que dicen que son algoritmos de IA (puede que si no hay uno se use el otro). En todo caso, está claro que no se ha atinado mucho en esta ocasión. Por cierto, que duckduckgo elige un fragmento del primer párrafo del artículo para mostrar en los resultados de su buscador, acertando mejor el contenido destacado en relación al titular de la noticia.Ver: https://decrypt.co/es/120000/hackean-cuenta-de-twitter-de-robinhood-para-promover-una-estafa",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436859",
  "comments": [
    {
      "author": "Porfirii",
      "created_time": "January 27, 2023, 08:31:03 PM",
      "body": "Pues me surge la duda DdmrDdmr, haciendo gala de mi legendaria tendencia a pensar mal, de si ha sido un error ya sea humano o artificial, o se trata de un click-bait. Lo que no queda duda es que desvirtúa por completo la magnitud de la noticia (de 8K a 117K hay un buen cacho).QuoteTwitter aún no ha respondido a Decrypt para hacer comentarios.Yo creo que a partir de aquí se quedaban cortos para cumplir con los parámetros de longitud estándar de sus publicaciones de cara a posicionamiento en motores de búsqueda y hilaron con lo otro. Pero no tiene nada que ver con la selección del fragmento que, efectivamente, es el que peor podría resumir la noticia. Tampoco me sorprende vistos muchos de los gazapos(?) que compartes últimamente. Cantidad antes que calidad, se ve que es la moda. No creo que hayamos llegado al punto en que la mayoría de estos errores sean malintencionados.P.D.: DuckDuckGo rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 28, 2023, 09:34:21 AM",
      "body": "Y no solo da la sensación de que el importe es netamente superior al de los hechos, sino que referencia que el botín de los timadores era en BTC, cosa que tampoco es cierto.No tengo ahora mismo una percepción de la frecuencia de este tipo de error en la selección del fragmento destacado de cara al buscado de Google, pero sí tengo la sensación de haber visto algo así últimamente varias veces, donde el contenido desarrollado de la noticia no cuadraba con el fragmento resaltado.Por cierto, que si acabo de darme cuenta de que el fragmento resaltado cambia en función de la búsqueda concreta que hago, lo que aboga por ser un automatismo del propio Google:Si busco por \"Decrypt bitcoin\" en Noticias, obtengo:QuoteTwitter aún no ha respondido a Decrypt para hacer comentarios. ... Las cuentas comprometidas empezaron a promocionar una estafa de Bitcoin que,...Y si busco \"Hackean Cuenta de Twitter de Robinhood Para Promover una Estafa\", sale:QuoteEn un tuit ya eliminado, la cuenta hackeada se utilizó para promocionar una estafa que ofrecía criptomonedas y NFTs en la cadena inteligente...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "January 28, 2023, 10:07:03 AM",
      "body": "Quote from: DdmrDdmr on January 28, 2023, 09:34:21 AM<...>Por cierto, que si acabo de darme cuenta de que el fragmento resaltado cambia en función de la búsqueda concreta que hago, lo que aboga por ser un automatismo del propio Google:Si busco por \"Decrypt bitcoin\" en Noticias, obtengo:QuoteTwitter aún no ha respondido a Decrypt para hacer comentarios. ... Las cuentas comprometidas empezaron a promocionar una estafa de Bitcoin que,...Y si busco \"Hackean Cuenta de Twitter de Robinhood Para Promover una Estafa\", sale:QuoteEn un tuit ya eliminado, la cuenta hackeada se utilizó para promocionar una estafa que ofrecía criptomonedas y NFTs en la cadena inteligente...Pues parece que confirma lo que se especula sobre Google (y redes sociales como especialmente Facebook, Twitter e Instagram): que en función de lo que quieras ver, te muestran la información que confirma tu sesgo.Podría ser peor: podrían directamente manipularte y hacerte cambiar de idea hacia lo que más les interese a ellos o a sus clientes (aunque ¿no se especulaba que en las pasadas elecciones habrían hecho eso respecto a Trump, pero con una minoría crítica de votantes indecisos?).O simplemente es que la versión n del algoritmo todavía da outputs chapuceros. Sea como sea, casi prefiero que funcione mal, fíjate lo que te digo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "January 28, 2023, 03:06:24 PM",
      "body": "Quote from: Porfirii on January 28, 2023, 10:07:03 AMQuote from: DdmrDdmr on January 28, 2023, 09:34:21 AM<...>...Pues parece que confirma lo que se especula sobre Google (y redes sociales como especialmente Facebook, Twitter e Instagram): que en función de lo que quieras ver, te muestran la información que confirma tu sesgo. ...Creo! Que dependiendo de las palabras involucradas el texto se busca y la mejor coincidencia sale, y el algoritmo genera un \"template\" que queda en la nube.Incluso, si el artículo se borra o se modifica según la combinación de palabras este aparece, de alguna manera es un caché que permanecen eternos y del cuál el algoritmo se apoya para hacer las búsquedas rápidas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}