{
  "id": "topic_5466080",
  "title": "odunybiz",
  "author": "odunybiz",
  "created_time": "September 08, 2023, 06:58:52 AMLast edit: September 08, 2023, 08:06:59 AM by odunybiz",
  "content": "I introduced Crypto payment to my farm some months ago when we were suffering from a NO CASH SYSTEM. During this period, there was a crisis with Nigeria currency as new naira note was introduced but this new note wasn't in circulation. This really affected alot of businesses as transaction was mostly done with bank transfer. Due to our bad banking system, sometimes most money transfer was delayed and this made business transaction to be abit difficult. With this, I thought of a solution and I came up with the use of crypto as part of my payment method. I decided to add crypto as part of my payment option on my flier.This was done because of two main reason, which includes:👉👉 Crypto are very fast when it comes to transfer. This will help to make my transaction fast therefore solving the bad Network system of some banks.👉👉It will help to make people aware about crypto especially Bitcoin in my localty.After the introduction of crypto, the no cash stuff ended and no purchase was made with crypto from me. I never give up, I keep advertising to people that I accept both fiat, BITCOIN and USDT as my payment options. With this people start asking me questions about crypto within the farm and was able to convince some into the crypto world. This has helped me to achieve my second aim of introducing crypto payment into my farming business.Recently, a customer made a purchase with USDT. This was the first purchase made with crypto since the introduction of crypto as part of my payment option and this made me so happy as my long term aim was achieved. I'm also full of joy as my aim of introducing crypto into my farming business was fully achieve. I decided to share this post to encourage others with similar issue.CONCLUSIONNever relent in anything you believe in. It may take sometimes for it to happen but if you believe and work towards it, it will definitely happen.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466080",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "September 08, 2023, 07:07:36 AM",
      "body": "Quote from: odunybiz on September 08, 2023, 06:58:52 AMRecently, a customer made a purchase with BITCOIN. This was the first purchase made with crypto since the introduction of crypto as part of my payment option and this made me so happy as my long term aim was achieved. I'm also full of joy as my aim of introducing crypto into my farming business was fully achieve. I decided to share this post to encourage others with similar issue.Could you give more details? I imagine he sent you the transaction through the blockchain. Or did he use LN?The bad thing is that it is more expensive for the customer to send you a transaction in bitcoin through the blockchain than to pay you in cash or cards. Even if it is little, and lately the fees have gone up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odunybiz",
      "created_time": "September 08, 2023, 07:23:08 AM",
      "body": "Quote from: Poker Player on September 08, 2023, 07:07:36 AMQuote from: odunybiz on September 08, 2023, 06:58:52 AMRecently, a customer made a purchase with BITCOIN. This was the first purchase made with crypto since the introduction of crypto as part of my payment option and this made me so happy as my long term aim was achieved. I'm also full of joy as my aim of introducing crypto into my farming business was fully achieve. I decided to share this post to encourage others with similar issue.Could you give more details? I imagine he sent you the transaction through the blockchain. Or did he use LN?The bad thing is that it is more expensive for the customer to send you a transaction in bitcoin through the blockchain than to pay you in cash or cards. Even if it is little, and lately the fees have gone up. Haa, I'm so sorry. A typographical error was made there. It was USDT I intend to write. I've made the correct boss. I just added Bitcoin to my payment option but I'm still learning on which wallet is highly save for this purpose. I will be glad if you can direct me or give me more guide on this. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 08, 2023, 07:32:13 AM",
      "body": "Quote from: odunybiz on September 08, 2023, 07:23:08 AMHaa, I'm so sorry. A typographical error was made there. It was USDT I intend to write. I've made the correct boss. I just added Bitcoin to my payment option but I'm still learning on which wallet is highly save for this purpose. I will be glad if you can direct me or give me more guide on this. ThanksWell, it doesn't really change my argument. What I was saying is that someone who pays you in cash or with a debit or credit card is not going to pay extra, but if they pay you in Bitcoin or USDT they are going to have to pay fees to send you the transaction. So, I think for this reason it will not become a very popular means of payment, although in some cases, someone who has a lot of Bitcoin or USDT may prefer to pay you with them. About guiding you, well, the only thing I recommend is to keep your Bitcoin and USDT in a Hardware Wallet, but other than that I can't think of much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "September 08, 2023, 07:47:42 AM",
      "body": "It is good to never quit on whatever we think that might help society. Bitcoin can help reduce stress in terms of Fiat network delays in some countries, like in Nigeria. Some banks don't have a strong network that can perform 100% for a few hours, but with the help of crypto currency (Bitcoin as number one) the stress can be reduced.Anyway, you have done well to spread the awareness of Bitcoin in your locality. Moreover, it would be nice if you told us the type of business you do. Maybe we might need your services here  . Most of us experienced that issue in Nigeria, and that redesign of the naira note helps Bitcoin to spread. People who have not used Bitcoin for the first time start using Bitcoin because transactions have been delayed and limited. The lightening network helps make Bitcoin transactions faster and unlimited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 08, 2023, 07:53:31 AM",
      "body": "This topic belongs more to the altcoin board because you are talking about USDT not bitcoin.This is your topic title:Quote from: odunybiz on September 08, 2023, 06:58:52 AMMy first sell with BITCOIN after some months of introducing crypto as a payment This is what you later post:Quote from: odunybiz on September 08, 2023, 06:58:52 AMRecently, a customer made a purchase with USDT. It is not your first sold with bitcoin, it is your first sold with a stable coin or altcoins or a cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 08, 2023, 08:27:41 AM",
      "body": "Have you use something like implement a system, to accept bitcoin or the payment made like for example, he will scan your QR code then sent in form of USDT or bitcoin, but how about the fee's, who will shoulder the fee's or its included on the payment transaction, that is also my argument, because they will be paying extra, if you add the fee's they might think that you are selling something more expensive than usual, and this might have negative thought about crypto as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "September 08, 2023, 08:43:36 AMLast edit: September 08, 2023, 08:57:52 AM by Mayor of ogba",
      "body": "Quote from: odunybiz on September 08, 2023, 06:58:52 AMI introduced Crypto payment to my farm some months ago when we were suffering from a NO CASH SYSTEM. During this period, there was a crisis with Nigeria currency as a new naira note was introduced but this new note wasn't in circulation. This affected a lot of businesses as the transaction was mostly done with a bank transfer. Due to our bad banking system, sometimes most money transfers were delayed and this made business transactions a bit difficult. With this, I thought of a solution and I came up with the use of crypto as part of my payment method. I decided to add crypto as part of my payment option on my flier.This was done because of two main reasons, which include:👉👉 Crypto is very fast when it comes to transfer. This will help to make my transaction fast therefore solving the bad Network system of some banks.👉👉It will help to make people aware of crypto especially Bitcoin in my locality.After the introduction of crypto, the no cash stuff ended and no purchase was made with crypto from me. I never give up, I keep advertising to people that I accept both fiat, BITCOIN, and USDT as my payment options. With this people started asking me questions about crypto within the farm and was able to convince some into the crypto world. This has helped me to achieve my second aim of introducing crypto payment into my farming business.Recently, a customer purchased with USDT. This was the first purchase made with crypto since the introduction of crypto as part of my payment option and this made me so happy as my long-term aim was achieved. I'm also full of joy as my aim of introducing crypto into my farming business was fully achieved. I decided to share this post to encourage others with similar issues.CONCLUSIONNever relent in anything you believe in. It may take some time for it to happen but if you believe and work towards it, it will happen.You have done a great job by creating a means of keeping your business going by accepting Bitcoin and USDT as a medium of payment in your business and also sending a positive impact on Bitcoin. When the new naira was redesigned in Nigeria people found it difficult to withdraw money and received money in their bank account, even the Binance exchange gave up to 48 hours of going to appeal if users from Nigeria did not receive their money in their bank account in Binance P2P trading. I believe those newbies who managed to pay with Bitcoin or USDT in your business have seen the benefits of Bitcoin when the government is not there to help its citizens and they will want to learn more about Bitcoin in case something like this happens again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "September 08, 2023, 10:21:06 AM",
      "body": "Quote from: odunybiz on September 08, 2023, 06:58:52 AMRecently, a customer made a purchase with USDT.OP, from your explanation it shows that you are accepting USDT and not bitcoin because you said that you don't know the right wallet to use. For this reason,you should move your topic to altcoin board. This board is only for bitcoin discussion and not any other cryptocurrency.i appreciate your determination to promote bitcoin but you should first learn the best wallet to use and dont forget not to keep your coins in an exchange because they are in control of your keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "September 08, 2023, 11:31:22 AM",
      "body": "It is not very clear to me what kind of transaction you are offering to the person in the place where you are. And another thing is that there are many people who do things like what you thought of doing in your community. Although the intention is good, you are introducing cryptocurrency from a different angle. Maybe I just need you to detail properly and completely why they will make a transaction with you in this matter that you are talking about. Continue to help others and at the same time help them; it's like a win-win solution without losing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 08, 2023, 12:03:46 PM",
      "body": "Quote from: odunybiz on September 08, 2023, 07:23:08 AMHaa, I'm so sorry. A typographical error was made there. It was USDT I intend to write. I've made the correct boss. I just added Bitcoin to my payment option but I'm still learning on which wallet is highly save for this purpose. I will be glad if you can direct me or give me more guide on this. ThanksSo what wallet you are using for your payment option when you received the usdt as payment. Or does it included in the terminal or device for payment? Not sure how it works on establishment or does an owner need a personal wallet for this or a machine has built in system for crypto payment. But some here on our country are using their own wallet to accept payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 08, 2023, 11:45:28 PM",
      "body": "Well, it's good that you have to accept crypto payments as a means of payment in your business, but if you want to create Bitcoin awareness among people while you are also accepting payments in Bitcoin, I think you should just be clear in your decision. You said you started accepting crypto which I think it should be \"started accepting Bitcoin payment.\" If your business has started accepting crypto payments, does that mean that even if I come to your shop and decide to pay you with XRP, ADA, or perhaps some new altcoins, you will accept them? In my shop, I accept Bitcoin payments, and my notice is only for Bitcoin payments, but I have also received BUSD and USDt payments based on requests the customer made. Someone can come to your shop and say they have some shitcoins they want to pay you with and buy your goods, but if you decline, they will ask why you then gave notice that you accept crypto payments, you should be specific.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "September 09, 2023, 02:22:47 AM",
      "body": "Quote from: odunybiz on September 08, 2023, 06:58:52 AMI introduced Crypto payment to my farm some months ago when we were suffering from a NO CASH SYSTEM. During this period, there was a crisis with Nigeria currency as new naira note was introduced but this new note wasn't in circulation. This really affected alot of businesses as transaction was mostly done with bank transfer. Due to our bad banking system, sometimes most money transfer was delayed and this made business transaction to be abit difficult. With this, I thought of a solution and I came up with the use of crypto as part of my payment method. I decided to add crypto as part of my payment option on my flier.This was done because of two main reason, which includes:👉👉 Crypto are very fast when it comes to transfer. This will help to make my transaction fast therefore solving the bad Network system of some banks.👉👉It will help to make people aware about crypto especially Bitcoin in my localty.After the introduction of crypto, the no cash stuff ended and no purchase was made with crypto from me. I never give up, I keep advertising to people that I accept both fiat, BITCOIN and USDT as my payment options. With this people start asking me questions about crypto within the farm and was able to convince some into the crypto world. This has helped me to achieve my second aim of introducing crypto payment into my farming business.Recently, a customer made a purchase with USDT. This was the first purchase made with crypto since the introduction of crypto as part of my payment option and this made me so happy as my long term aim was achieved. I'm also full of joy as my aim of introducing crypto into my farming business was fully achieve. I decided to share this post to encourage others with similar issue.CONCLUSIONNever relent in anything you believe in. It may take sometimes for it to happen but if you believe and work towards it, it will definitely happen.What are the goods and services you offer? because it is not clear from your story what products you offer for your customers to buy in your area. But you did a really good job. The only problem I see is that you seem to be the only person who is a little aware of Bitcoin or cryptocurrency, so it seems that it will be difficult to establish crypto users in the community you are in. I hope you also have a marketing strategy that can pique their interest in using crypto as a payment option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 09, 2023, 03:48:51 AM",
      "body": "I think this depends on the industry a bit as well. In an industry that is unrelated to crypto as a whole, I do not see what OP was selling, but like if you are selling apples obviously you are not going to sell it for crypto, farming stuff I mean, that doesn't mean he was selling that, I mean macbook would be hard too.However, what do you think people sell crypto trading bots with? Fiat? Of course not, they sell it for crypto almost exclusively, and that means depending on the product you are selling, crypto is normal sometimes and it doesn't really feel that different. I think it should be an important case to make and shouldn't really bother anyone about it neither, it could definitely be something good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "September 09, 2023, 06:45:20 AM",
      "body": "Quote from: odunybiz on September 08, 2023, 06:58:52 AMI introduced Crypto payment to my farm some months ago when we were suffering from a NO CASH SYSTEM. During this period, there was a crisis with Nigeria currency as new naira note was introduced but this new note wasn't in circulation. This really affected alot of businesses as transaction was mostly done with bank transfer. Due to our bad banking system, sometimes most money transfer was delayed and this made business transaction to be abit difficult. With this, I thought of a solution and I came up with the use of crypto as part of my payment method. I decided to add crypto as part of my payment option on my flier.This was done because of two main reason, which includes:👉👉 Crypto are very fast when it comes to transfer. This will help to make my transaction fast therefore solving the bad Network system of some banks.👉👉It will help to make people aware about crypto especially Bitcoin in my localty.After the introduction of crypto, the no cash stuff ended and no purchase was made with crypto from me. I never give up, I keep advertising to people that I accept both fiat, BITCOIN and USDT as my payment options. With this people start asking me questions about crypto within the farm and was able to convince some into the crypto world. This has helped me to achieve my second aim of introducing crypto payment into my farming business.Recently, a customer made a purchase with USDT. This was the first purchase made with crypto since the introduction of crypto as part of my payment option and this made me so happy as my long term aim was achieved. I'm also full of joy as my aim of introducing crypto into my farming business was fully achieve. I decided to share this post to encourage others with similar issue.CONCLUSIONNever relent in anything you believe in. It may take sometimes for it to happen but if you believe and work towards it, it will definitely happen.Yeah, faster if you use some other coins but not bitcoin. Most bitcoin transaction takes on average 10 minutes for a single confirmation. Since, I guess the amount isn't high, you wait for one confirmation or more? Or do you accept the payments without network confirmation (as long as you see they have paid enough fees of course)? But don't you go back to FIAT after selling something in bitcoin? I mean, don't you sell the crypto later so you can pay the bills and purchase necessary things for your business since I am almost pretty much sure you won't be able to use crypto. In this case, aren't you back facing the same issue with your local currency and banks?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "September 09, 2023, 07:53:29 AM",
      "body": "That's wonderful! You have the option to utilize Polygon USDT, which imposes minimal transaction fees. When comparing transaction costs, Bitcoin appears to be a more expensive alternative than USDT. What's particularly noteworthy is that we receive cryptocurrency payments promptly, in contrast to the time it takes for bank transactions. I must say, your exceptional use of cryptocurrency in your country and your efforts to inspire others to embrace crypto are truly commendable achievements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "September 09, 2023, 08:43:41 AM",
      "body": "Success is never achieved in an instant. It may take some time but I know the result will be worth the wait. There will be less people at first who will embrace crypto but eventually it will become a hit in your country if you never stop from promoting it. Hopefully more customers will be interested to know about crypto and how it can be an edge when it comes to payment system. However, despite of the positive response you made out from crypto, still never stop from accepting fiat because if these crypto users will suddenly be out in the market, at least you still have customers left using fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "September 09, 2023, 10:02:10 AM",
      "body": "Quote from: odunybiz on September 08, 2023, 06:58:52 AMRecently, a customer made a purchase with USDT.When you say that you accept BTC as a medium of exchange for your trades, I think that this will result in higher prices for your customers than they should. Likewise with Bitcoin's volatility. I want to explain that but when you say that you have done transactions with USDT, I think that is the right thing that you did. In the future, if you want to transact with crypto, I suggest you use stable coins such as USDT or USDC. It's more profitable for you and your customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "September 09, 2023, 07:41:34 PM",
      "body": "Quote from: Godday on September 09, 2023, 10:02:10 AMQuote from: odunybiz on September 08, 2023, 06:58:52 AMRecently, a customer made a purchase with USDT.When you say that you accept BTC as a medium of exchange for your trades, I think that this will result in higher prices for your customers than they should. Likewise with Bitcoin's volatility. I want to explain that but when you say that you have done transactions with USDT, I think that is the right thing that you did. In the future, if you want to transact with crypto, I suggest you use stable coins such as USDT or USDC. It's more profitable for you and your customers.Indeed, we cannot jist force things out. As much as we want Bitcoin to be used as a mode of payment, that seems can't be especially with its current 'state'. Fees are still high and market price is still volatile and these factors would make you hesitate to do so, and that's just normal. For now stablecoins would be better with daily transactions if circumstances won't prohibit you in your area. Bitcoin and orher decentralized cryptos are being used with huge transactions 'coz in such way, paying extra would be fine in exchange for anonymity and avoidance with taxes. Many people are aware of this industry already but not everyone would be too eager to face losses and some disadvantages in exchange for vision for this industry. It will all take time so let us be patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "September 09, 2023, 09:39:47 PM",
      "body": "Of what need it is to pay with cryptocurrency that incure higher fees when I can make to same payment with zero fees with my debit or credits cards,  Bitcoin is not a networking investment that need you to invite people but Bitcoin/cryptocurrencies are for convenienceses and that is why their referred to at an alternative currencies. And from your explanations it then means the customer covers the fees of sending the payment,  do you make Bitcoin payment optional? Or do you give some form of discount to those that pay you with Bitcoin,  USDT or other crypts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}