{
  "id": "topic_5470550",
  "title": "totti67",
  "author": "totti67",
  "created_time": "October 16, 2023, 02:09:55 PM",
  "content": "Devletimizin kamudaki makam araçları ile ilgili yaptığı harcamalar hepimizin malumu. En yukarıdan en aşağıya genelde de bilindik lüks markaların son modelleri veya birkac yaşında olanlarına harcanan meblağlar çoğu zaman tartışma konusu bile oluyorken, az önce denk geldiğim bir habere göre artık kamuda TOGG dönemi başlıyormuş. Maliye bakanı Mehmet Şimşek in tasarruf tedbirleri kapsamında bu uygulamaya geçileceğini belirtilen haber bence eğer gerçekten uygulanacaksa eminim çok büyük bir kulfetten kurtuluruz ulkece.tabi bu uygulamanın nerede ne kadar hayata geçeceğini de görmek lazım çünkü mutlaka kapsam dışı kalanlar olacaktır. Bekleyip göreceğiz.https://www.patronlardunyasi.com/haber/kamuda-yerli-arac-devri-basliyor-/292851",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470550",
  "comments": [
    {
      "author": "mandown",
      "created_time": "October 16, 2023, 05:02:03 PM",
      "body": "Aksırıncaya tıksırıncaya kalar alsınlar durmasınlar evlerine kadar soksunlar şimdi tasarruf mu yapmış oldular. Önceki aldıkları araçlar ne olacak? Bu kadar keyifçi bir zihniyet duymadım görmedim etmedim.  Harcayın baba eskimeden her yıl alın binin yeri gelsin her yıl tasarruf yapıyoruz ayağına yeni model alın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "October 16, 2023, 05:08:26 PM",
      "body": "TOGG yerli ve milli diye pazarlandığından böyle bir adım atılmasını bekliyordum. Şimdi her şeyi eleştirmek bir kenara dursun, eleştirmek için de eleştirmeyelim bence. TOGG özelinde, genel olarak elektrikli araçların kullanımını destekliyorum. Hem yakıt tasarrufu açısından hem de çevreye zarar olarak bakarsak TOGG kullanımı, daha doğrusu elektrikli araç kullanımı daha doğru. Burada bir kaç sorun olabilir birincisi kaza olursa parça tedarik sorunu. İkincisi hız limiti düşük bildiğim kadarıyla. Üçüncüsü şarj süreleri. Bunları hallederlerse kamuda kullanımı çok doğru olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 16, 2023, 05:13:57 PM",
      "body": "Quote from: Silence Scream on October 16, 2023, 05:08:26 PMTOGG yerli ve milli diye pazarlandığından böyle bir adım atılmasını bekliyordum. Şimdi her şeyi eleştirmek bir kenara dursun, eleştirmek için de eleştirmeyelim bence. TOGG özelinde, genel olarak elektrikli araçların kullanımını destekliyorum. Hem yakıt tasarrufu açısından hem de çevreye zarar olarak bakarsak TOGG kullanımı, daha doğrusu elektrikli araç kullanımı daha doğru. Burada bir kaç sorun olabilir birincisi kaza olursa parça tedarik sorunu. İkincisi hız limiti düşük bildiğim kadarıyla. Üçüncüsü şarj süreleri. Bunları hallederlerse kamuda kullanımı çok doğru olur. Hocam stratejik olarak önemli makamlardakilerin mevcut TOGG ürün yelpazesindeki herhangi bir araca binmeyecekleri (ki binmemeleri de lazım güvenlik sebebiyle) malum. Ama sıradan bir daire başkanı, belediye başkanı vs için gayet güzel olur. Birçok açıdan tasarruf sağlar ayrıca. Birçok noktada başlangıç olarak eksiklikler var dediğiniz gibi, ya da en azından soru işaretleri mevcut ama bunlar bir şekilde halledilir, yeter ki kararın arkasında durup kararlılıkla uygulasinlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "October 16, 2023, 05:18:27 PM",
      "body": "Quote from: totti67 on October 16, 2023, 05:13:57 PMQuote from: Silence Scream on October 16, 2023, 05:08:26 PMTOGG yerli ve milli diye pazarlandığından böyle bir adım atılmasını bekliyordum. Şimdi her şeyi eleştirmek bir kenara dursun, eleştirmek için de eleştirmeyelim bence. TOGG özelinde, genel olarak elektrikli araçların kullanımını destekliyorum. Hem yakıt tasarrufu açısından hem de çevreye zarar olarak bakarsak TOGG kullanımı, daha doğrusu elektrikli araç kullanımı daha doğru. Burada bir kaç sorun olabilir birincisi kaza olursa parça tedarik sorunu. İkincisi hız limiti düşük bildiğim kadarıyla. Üçüncüsü şarj süreleri. Bunları hallederlerse kamuda kullanımı çok doğru olur. Hocam stratejik olarak önemli makamlardakilerin mevcut TOGG ürün yelpazesindeki herhangi bir araca binmeyecekleri (ki binmemeleri de lazım güvenlik sebebiyle) malum. Ama sıradan bir daire başkanı, belediye başkanı vs için gayet güzel olur. Birçok açıdan tasarruf sağlar ayrıca. Birçok noktada başlangıç olarak eksiklikler var dediğiniz gibi, ya da en azından soru işaretleri mevcut ama bunlar bir şekilde halledilir, yeter ki kararın arkasında durup kararlılıkla uygulasinlar.Elbette mesela Devlet başkanlarının kullanacağı araçların daha farklı olması gerekiyor ancak mevcut Cumhurbaşkanı mutlaka TOGG kullanır. Ona özel bir TOGG üretimi yapılabilir. Aynı şey diğer kritik makamlar için de olabilir. Özel motor seçeneği, ekstra güvenlikli, camları da kalın gibi seçeneklerle donatılıp ona göre bir TOGG üretilebilir. Eğer bir çalışma olacaksa baştan ayağa herkes aynı şeyi destekleyici hareket etmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 16, 2023, 05:32:20 PM",
      "body": "Quote from: Silence Scream on October 16, 2023, 05:18:27 PMQuote from: totti67 on October 16, 2023, 05:13:57 PMQuote from: Silence Scream on October 16, 2023, 05:08:26 PMTOGG yerli ve milli diye pazarlandığından böyle bir adım atılmasını bekliyordum. Şimdi her şeyi eleştirmek bir kenara dursun, eleştirmek için de eleştirmeyelim bence. TOGG özelinde, genel olarak elektrikli araçların kullanımını destekliyorum. Hem yakıt tasarrufu açısından hem de çevreye zarar olarak bakarsak TOGG kullanımı, daha doğrusu elektrikli araç kullanımı daha doğru. Burada bir kaç sorun olabilir birincisi kaza olursa parça tedarik sorunu. İkincisi hız limiti düşük bildiğim kadarıyla. Üçüncüsü şarj süreleri. Bunları hallederlerse kamuda kullanımı çok doğru olur. Hocam stratejik olarak önemli makamlardakilerin mevcut TOGG ürün yelpazesindeki herhangi bir araca binmeyecekleri (ki binmemeleri de lazım güvenlik sebebiyle) malum. Ama sıradan bir daire başkanı, belediye başkanı vs için gayet güzel olur. Birçok açıdan tasarruf sağlar ayrıca. Birçok noktada başlangıç olarak eksiklikler var dediğiniz gibi, ya da en azından soru işaretleri mevcut ama bunlar bir şekilde halledilir, yeter ki kararın arkasında durup kararlılıkla uygulasinlar.Elbette mesela Devlet başkanlarının kullanacağı araçların daha farklı olması gerekiyor ancak mevcut Cumhurbaşkanı mutlaka TOGG kullanır. Ona özel bir TOGG üretimi yapılabilir. Aynı şey diğer kritik makamlar için de olabilir. Özel motor seçeneği, ekstra güvenlikli, camları da kalın gibi seçeneklerle donatılıp ona göre bir TOGG üretilebilir. Eğer bir çalışma olacaksa baştan ayağa herkes aynı şeyi destekleyici hareket etmeli. Hocam bu ekstra ekstra guvenlikli araçların teknolojisini kısa zamanda temin etme şansımız yok ne yazık ki. Ama ilerleyen dönemlerde mutlaka dediğiniz gibi olmalı, yani a dan Z ye herkes yerli araca dönmeli. Ben araç yerli mi yersiz mi muhabbetine artık takılmiyorum çünkü biz ne dersek diyelim bize zaman kaybı. Bu iş en çok görgüsüz belediye başkanlarını ve bürokratları uzecektir bu arada, malum merco audiden inip TOGG a binmek zoruna gidebilir bazılarının.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "October 16, 2023, 05:45:19 PM",
      "body": "Quote from: totti67 on October 16, 2023, 05:32:20 PMQuote from: Silence Scream on October 16, 2023, 05:18:27 PMQuote from: totti67 on October 16, 2023, 05:13:57 PMQuote from: Silence Scream on October 16, 2023, 05:08:26 PMTOGG yerli ve milli diye pazarlandığından böyle bir adım atılmasını bekliyordum. Şimdi her şeyi eleştirmek bir kenara dursun, eleştirmek için de eleştirmeyelim bence. TOGG özelinde, genel olarak elektrikli araçların kullanımını destekliyorum. Hem yakıt tasarrufu açısından hem de çevreye zarar olarak bakarsak TOGG kullanımı, daha doğrusu elektrikli araç kullanımı daha doğru. Burada bir kaç sorun olabilir birincisi kaza olursa parça tedarik sorunu. İkincisi hız limiti düşük bildiğim kadarıyla. Üçüncüsü şarj süreleri. Bunları hallederlerse kamuda kullanımı çok doğru olur. Hocam stratejik olarak önemli makamlardakilerin mevcut TOGG ürün yelpazesindeki herhangi bir araca binmeyecekleri (ki binmemeleri de lazım güvenlik sebebiyle) malum. Ama sıradan bir daire başkanı, belediye başkanı vs için gayet güzel olur. Birçok açıdan tasarruf sağlar ayrıca. Birçok noktada başlangıç olarak eksiklikler var dediğiniz gibi, ya da en azından soru işaretleri mevcut ama bunlar bir şekilde halledilir, yeter ki kararın arkasında durup kararlılıkla uygulasinlar.Elbette mesela Devlet başkanlarının kullanacağı araçların daha farklı olması gerekiyor ancak mevcut Cumhurbaşkanı mutlaka TOGG kullanır. Ona özel bir TOGG üretimi yapılabilir. Aynı şey diğer kritik makamlar için de olabilir. Özel motor seçeneği, ekstra güvenlikli, camları da kalın gibi seçeneklerle donatılıp ona göre bir TOGG üretilebilir. Eğer bir çalışma olacaksa baştan ayağa herkes aynı şeyi destekleyici hareket etmeli. Hocam bu ekstra ekstra guvenlikli araçların teknolojisini kısa zamanda temin etme şansımız yok ne yazık ki. Ama ilerleyen dönemlerde mutlaka dediğiniz gibi olmalı, yani a dan Z ye herkes yerli araca dönmeli. Ben araç yerli mi yersiz mi muhabbetine artık takılmiyorum çünkü biz ne dersek diyelim bize zaman kaybı. Bu iş en çok görgüsüz belediye başkanlarını ve bürokratları uzecektir bu arada, malum merco audiden inip TOGG a binmek zoruna gidebilir bazılarının.Siyasi baskılar olmazsa itibardan tasarruf olmaz mantığıyla gider hepsi. Ancak genel merkez onlara bunu zorunlu kılarsa kullanırlar çünkü Audi kullanan belediye başkanı Audi’yi beğenmiyor. Audi beğenmediği için Mercedes alıp görgüsüzlüğe devam ediyorlar bu her parti için geçerli. TOGG için de böyle bir durum söz konusu. TOGG zorunlu olmadıkça belediye başkanları kullanmaz. Bakanlar ise Cumhurbaşkanı talimatıyla kullanırlar veya kullanmazlar bence. Elektrikli kullansınlar da TOGG şart değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 16, 2023, 06:36:18 PM",
      "body": "Quote from: Silence Scream on October 16, 2023, 05:45:19 PMQuote from: totti67 on October 16, 2023, 05:32:20 PMQuote from: Silence Scream on October 16, 2023, 05:18:27 PMQuote from: totti67 on October 16, 2023, 05:13:57 PMQuote from: Silence Scream on October 16, 2023, 05:08:26 PMTOGG yerli ve milli diye pazarlandığından böyle bir adım atılmasını bekliyordum. Şimdi her şeyi eleştirmek bir kenara dursun, eleştirmek için de eleştirmeyelim bence. TOGG özelinde, genel olarak elektrikli araçların kullanımını destekliyorum. Hem yakıt tasarrufu açısından hem de çevreye zarar olarak bakarsak TOGG kullanımı, daha doğrusu elektrikli araç kullanımı daha doğru. Burada bir kaç sorun olabilir birincisi kaza olursa parça tedarik sorunu. İkincisi hız limiti düşük bildiğim kadarıyla. Üçüncüsü şarj süreleri. Bunları hallederlerse kamuda kullanımı çok doğru olur. Hocam stratejik olarak önemli makamlardakilerin mevcut TOGG ürün yelpazesindeki herhangi bir araca binmeyecekleri (ki binmemeleri de lazım güvenlik sebebiyle) malum. Ama sıradan bir daire başkanı, belediye başkanı vs için gayet güzel olur. Birçok açıdan tasarruf sağlar ayrıca. Birçok noktada başlangıç olarak eksiklikler var dediğiniz gibi, ya da en azından soru işaretleri mevcut ama bunlar bir şekilde halledilir, yeter ki kararın arkasında durup kararlılıkla uygulasinlar.Elbette mesela Devlet başkanlarının kullanacağı araçların daha farklı olması gerekiyor ancak mevcut Cumhurbaşkanı mutlaka TOGG kullanır. Ona özel bir TOGG üretimi yapılabilir. Aynı şey diğer kritik makamlar için de olabilir. Özel motor seçeneği, ekstra güvenlikli, camları da kalın gibi seçeneklerle donatılıp ona göre bir TOGG üretilebilir. Eğer bir çalışma olacaksa baştan ayağa herkes aynı şeyi destekleyici hareket etmeli. Hocam bu ekstra ekstra guvenlikli araçların teknolojisini kısa zamanda temin etme şansımız yok ne yazık ki. Ama ilerleyen dönemlerde mutlaka dediğiniz gibi olmalı, yani a dan Z ye herkes yerli araca dönmeli. Ben araç yerli mi yersiz mi muhabbetine artık takılmiyorum çünkü biz ne dersek diyelim bize zaman kaybı. Bu iş en çok görgüsüz belediye başkanlarını ve bürokratları uzecektir bu arada, malum merco audiden inip TOGG a binmek zoruna gidebilir bazılarının.Siyasi baskılar olmazsa itibardan tasarruf olmaz mantığıyla gider hepsi. Ancak genel merkez onlara bunu zorunlu kılarsa kullanırlar çünkü Audi kullanan belediye başkanı Audi’yi beğenmiyor. Audi beğenmediği için Mercedes alıp görgüsüzlüğe devam ediyorlar bu her parti için geçerli. TOGG için de böyle bir durum söz konusu. TOGG zorunlu olmadıkça belediye başkanları kullanmaz. Bakanlar ise Cumhurbaşkanı talimatıyla kullanırlar veya kullanmazlar bence. Elektrikli kullansınlar da TOGG şart değil. Hocam bu hamlenin ülkenin mevcut ekonomik durumu gereği yapılan bir hamle olduğunu savunanlar da var ki ben de bunlardan biriyim. Kemer sıkma olayı hep vatandaşın başına patlarken, üst mertebelerin kendi şartlarından ödün vermemesi durumu epeydir vardı, şimdi ister zorunluluktan olsun ister başka sebepten, ortadaki olumsuz havanın herkese sirayet etmesi gerekiyor ki böyle de olacak.Halkın refahı yönetenlerin refahindan hep önde olmalıdır, yönetilenler seçtiklerini bunun için seçerler, halkın refahı yükseldikçe yonetenin itibarı güçlenir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "October 16, 2023, 07:06:29 PM",
      "body": "Koruma ordularını da minimum seviyeye çekmeleri daha iyi olur sonuçta onlar da araba kullanıyorlar. Üstelik o görevlilerin de maaşları var ve giderleri var. Atıyorum 50 kişi yeterse 51 kişi olmamalı bence. TOGG zorunluluğu ile güzel bir adım atılmış. Bilmem kaç motorlu benzini lıkır lıkır içen arabalar olmayacak en azından. Daha önce alınması gereken bir karardı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "October 17, 2023, 02:33:07 PM",
      "body": "Umarım uyarlar bu zorunluluğa ama çok uyacaklarını da sanmıyorum, o güveni vermiyorlar yani.Umarım bütün araçlar yerli olur devletteki en azından paralar dışarıya gitmemiş olur.En üst kademedeki kişiler almasa da olur bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 17, 2023, 03:18:33 PM",
      "body": "Olaya sadece araç bakımından bakmamak gerekir bu işin yakıt boyutunuda düşünürsek çok daha ekonomik olacaktır ama göstermelik 3-5 kuruma değil bütün kurumlar yerli otomobile geçmeli. Gerçekte ise durumun şöyle gerçekleşeceğini düşünüyorum, mevcut araçlar kalsın ekstradan yerli araçta olsun zihniyeti olacaktır böyle olursa tasarruftan söz etmek mümkün olmaz hatta israf olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 17, 2023, 04:58:43 PM",
      "body": "işin aslı üst düzey memurlar dışında zaten kamuda yerli araç kullanma zorunluluğu var. (belli kısmı ülkemizde üretilmiş şekilde.) tabii bunu uygulayan kaç tane bakanlık var orası ayrı bir konu. togg'un üretimi şu an için yeterli değil, mevcut üst düzey yöneticilere bile yetmez. yukarıda yakıt kısmında tasarruf denilmiş ama bu araçlar az yaktığı için millet köyüne bu arabayla gider artık.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "October 17, 2023, 06:25:05 PM",
      "body": "Quote from: gospodin on October 17, 2023, 04:58:43 PMişin aslı üst düzey memurlar dışında zaten kamuda yerli araç kullanma zorunluluğu var. (belli kısmı ülkemizde üretilmiş şekilde.) tabii bunu uygulayan kaç tane bakanlık var orası ayrı bir konu. togg'un üretimi şu an için yeterli değil, mevcut üst düzey yöneticilere bile yetmez. yukarıda yakıt kısmında tasarruf denilmiş ama bu araçlar az yaktığı için millet köyüne bu arabayla gider artık.Herkesin TOGG kullanmaya geçme aşaması nasıl olacaktır acaba. Üst düzeyler en son mu geçecek. Kamuda normal araç kullananlar TOGG alarak araçlarını yükseltecekler mi yoksa sadece üst seviye araçlar mı satılacak. Habere göre kamuda TOGG derken ayrım yapılmamış gibi görünüyor ama illa ki ayrım yapılacaktır. Birçok üst düzey yetkililer için ise TOGG teknik açıdan yeterli olmayacaktır. Bakalım bu süreç nasıl olacak. Yakıt tasarrufu açısından sevindirici bir karar olmuş. O kadar çok aracı düşününce yakıtta büyük bir maddi değer artı olarak kalıyor.En basit görevde olanlar da TOGG kullanırsa eğer o dediğiniz olabilir. Mahalle aralarında resmi plakaları görebiliriz. Eğer görev dahilinde değilse bildirenler oluyor ve hemen gereken yapılıyor diye biliyorum. Şimidi TOGG olduğunda daha çok ilgi çeker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "October 17, 2023, 07:08:52 PM",
      "body": "Valla şu zamana kadar dünyanın masrafı yapıldı. Sırf koruma araçlarına harcanan paraların miktarını hayal bile edemiyorum. Hep son model Audiler vs. görüyorduk yani milyar liralar gitti bu israfa. Bunun telafisi zor belki ama en azından bu gereksiz harcamaların miktarı azaltılabilir ki biraz bir rahatlama olsun. Sözlerinde de durarak hepsi TOGG'a geçer umarım. Lütfen artık şu gereksiz harcamalara giden parayı ülkenin kalkınması için kullansınlar da fazladan katkıları dokunsun. Vatandaş vergiyi böyle harcamalara kullanılsın diye vermiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 17, 2023, 07:42:48 PM",
      "body": "Kamu elinin alında bir dünya araç çürümeye terk edilmiş durumda yada kendi içlerinde model yükseltme derdindeler aslında sorun kamunun kendisi gideceksin abi kamuya diyeceksinki araç mı alıyorsun aracın ekonomik resmi amortisman tarihi neyse o tarihten önce araç değiştiremezsin. Bak bakalım togg'a mogg'a ihtiyaç kalıyormu. Sanki şimdi tasarruf yapmış olacaklar. EEE kardeşim öncekine verdin para buna verdin para eskisini satsan ne satmasan ne bunlar milli servetler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "October 18, 2023, 04:56:03 AM",
      "body": "Quote from: mandown on October 17, 2023, 07:42:48 PMKamu elinin alında bir dünya araç çürümeye terk edilmiş durumda yada kendi içlerinde model yükseltme derdindeler aslında sorun kamunun kendisi gideceksin abi kamuya diyeceksinki araç mı alıyorsun aracın ekonomik resmi amortisman tarihi neyse o tarihten önce araç değiştiremezsin. Bak bakalım togg'a mogg'a ihtiyaç kalıyormu. Sanki şimdi tasarruf yapmış olacaklar. EEE kardeşim öncekine verdin para buna verdin para eskisini satsan ne satmasan ne bunlar milli servetler.Aslında normalde olması gereken bu. Ama bizim siyasetçilerimiz ve devlet kurumunda çalışan personellerimiz her zaman şatafat peşinde olduğumuz için en son model ve lüksünü almaya peşindeyiz. İş işten geçti demeyeceğim fakat biraz geç kalındı sanki devlet kurumlarında israf yapmamak için. Ha aldıkları önlemler şuanda pek etkili kalacak mı tabiki kalmayacak. Araba değiştirip milli arabayı makam aracı yapmakla ne yazık ki hiçbirşey çözülmüyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 18, 2023, 05:56:55 AM",
      "body": "Böyle bir şeyin kolayca olması kesinlikle mümkün değil çünkü Togg fabrikasının üretim hacmi şu anda oldukça az. Yıllarca sadece devlete araç üretmesi falan gerekiyor. Bakın daha müşteri olup satın alıp araç bekleyenler var. Bence devasa makam araçları ancak değişir. Zaten birçok kurumda togg tan çok daha alt model araçlar kullanılıyor bunların yerine Togg satın alınması için ne kadar dolar bütçe gerekeceğini de siz hayal edin sonuç olarak mümkün olmadığını anlarsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "October 18, 2023, 08:46:33 AM",
      "body": "Quote from: Pierre 2 on October 18, 2023, 05:56:55 AMBöyle bir şeyin kolayca olması kesinlikle mümkün değil çünkü Togg fabrikasının üretim hacmi şu anda oldukça az. Yıllarca sadece devlete araç üretmesi falan gerekiyor. Bakın daha müşteri olup satın alıp araç bekleyenler var. Bence devasa makam araçları ancak değişir. Zaten birçok kurumda togg tan çok daha alt model araçlar kullanılıyor bunların yerine Togg satın alınması için ne kadar dolar bütçe gerekeceğini de siz hayal edin sonuç olarak mümkün olmadığını anlarsınız.Kararın uygulanması uzun yıllar alabilir ama kararlı bir şekilde devam edildiği sürece her kamu aracı togg’a geçmiş olur. Bahsettiğiniz süreçleri hızlı bir şekilde yapabilmek zor olacaktır çünkü sizin bahsettiğiniz sorunlara ek olarak her yere servislerin de kurulması ya da diğer tamirci işletmelerin togg’dan anlaması gerekiyor. Eleştirilecek birçok şey olabilir ama ben her kamu kurumu aracının az yakan ve lüks olmayan bir şekilde olmasını isterim. Giderlerin azaltılması ve kamu kurumlarındaki tasarrufu azaltmak için atılan adımların artırılması gerekiyor. Togg’a geçişin maliyeti olacaktır o konuda bilgi sahibi değilim yani diğer araçların satılmasıyla yerine togg’lara geçmenin arasındaki maliyet ne kadardır acaba.Sonuç olarak devletin kamu yararını gözeterek atacağı adımların kararlı bir şekilde atılmasını ve bu şekilde devam etmesi gerektiğini düşünüyorum. Yani böyle işlerin dönemlik değil de devletin yararını her zaman gözetecek şekilde olması gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "October 18, 2023, 06:04:58 PM",
      "body": "Mehmet Şimşek ile her alanda tasarruf tedbirleri alınıyor.Halka vergi olarak gelmeyecek tedbirleri desteklerim.Şu an devletin makam araçları ve diğer araçları büyük akaryakıt pahalılığına sebep oluyor.Üstelik tamirleri de pahalı.Düşünün Mercedes’in makam aracının masrafı ile Türkiye’de üretilen TOGG’un masrafı aynı olur mu?Kamuda sıkılaşmaya gidilmesi olumlu bu konuda daha fazla adımı desteklemek gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "October 18, 2023, 08:07:41 PM",
      "body": "Quote from: W Jr. on October 18, 2023, 06:04:58 PMMehmet Şimşek ile her alanda tasarruf tedbirleri alınıyor.Halka vergi olarak gelmeyecek tedbirleri desteklerim.Şu an devletin makam araçları ve diğer araçları büyük akaryakıt pahalılığına sebep oluyor.Üstelik tamirleri de pahalı.Düşünün Mercedes’in makam aracının masrafı ile Türkiye’de üretilen TOGG’un masrafı aynı olur mu?Kamuda sıkılaşmaya gidilmesi olumlu bu konuda daha fazla adımı desteklemek gerekiyor.Evet kağıt üstünde baktığımızda çok mantıklı bir hareket. Fakat yapmaya çalıştıkları şeyin bir göz boyama olduğunu düşünüyorum.Kamuda yüksek mevkiye sahip yöneticiye TOGG verip etrafındaki 40 koruma yine başka marka arabalar ile turladıktan sonra yapılacak hamle bana samimi gelmez.Her yerde parayı saçıyorlar, sonra kamuda tasarruf adı altında şov yapıyorlar. Zihniyetin komple değişmesi lazım. Yoksa yabancı marka araçlara ve benzine para saçmaktansa elektrikli bir otomobil çok daha mantıklı tabi ki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}