{
  "id": "topic_5408849",
  "title": "Samrean",
  "author": "Samrean",
  "created_time": "August 05, 2022, 04:18:00 PM",
  "content": "I saved a message in draft (and not posted it) and now i want to post it ? I could not find where i can access draft and how to post from drafts ?  Can you give me step by step procedure ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408849",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "August 05, 2022, 04:19:19 PM",
      "body": "You can find your drafts here: https://bitcointalk.org/index.php?action=draftsJust copy and paste whatever you want to post again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 05, 2022, 04:35:00 PMLast edit: May 14, 2023, 05:03:43 PM by Charles-Tim",
      "body": "Quote from: Samrean on August 05, 2022, 04:18:00 PMI could not find where i can access draft and how to post from drafts ?  Can you give me step by step procedure ?If you want to post, you will see 'draf't under 'post'' and 'preview', click on draft as OmegaStarScream said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 05, 2022, 04:41:29 PM",
      "body": "You should also note that your drafts are limited and not saved Infinitely.It contains your last 100 saved texts (drafts are saved when you preview or post) and is only saved for 7 days. So drafts saved over a week ago would not be available anymore.  They can however be stored indefinitely on the forum databaseDo not use drafts as a permanent storage for text content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 05, 2022, 05:01:50 PM",
      "body": "Drafts is for your posts, PM, Preview. If you type your post or PM but never click on Preview or Post it, the draft page does not store the draft of your post or PM.Draft page - Pros & Cons. It only stores your last 100 drafts or 7 days.If you have draft of your post in draft page, you can copy and paste it in the topic you want to join. If you write a draft for your topic, you should do it on word, notepad and save a file on your computer. When you finish, you can post it on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "August 05, 2022, 07:17:50 PM",
      "body": "I don't think there's a way to post drafts directly from the drafts page.There are probably a few reasons I can think of for this but I'm not sure if there's anything else: 1. To discourage spam/posting the same post multiple times 2. To encourage writing the start of topics this way but not actual responses (and you might end up posting a response that is similar to one that has been posted before or that's out of context of the new discussion).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 06, 2022, 01:34:17 AM",
      "body": "Quote from: jackg on August 05, 2022, 07:17:50 PMI don't think there's a way to post drafts directly from the drafts page.The forum does not provide it but with a user script, you can becausePost content is saved in draft pageThere is link to that topic and it can be used to direct you to where you will publish your drafthttps://bitcointalk.org/index.php?topic=5408849.msg60697192#msg60697192 is where I will publish my post from a draft I savedGo to that topic and paste the content from a draftCode:[quote author=jackg link=topic=5408849.msg60697192#msg60697192 date=1659727070]I don't think there's a way to post drafts directly from the drafts page.There are probably a few reasons I can think of for this but I'm not sure if there's anything else: 1. To discourage spam/posting the same post multiple times 2. To encourage writing the start of topics this way but not actual responses (and you might end up posting a response that is similar to one that has been posted before or that's out of context of the new discussion). [/quote]ExampleWhen I am trying to make this example, I discover that if I click on Preview multiple times, there will be different drafts even the content is the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}