{
  "id": "topic_5401662",
  "title": "lenaza2022",
  "author": "lenaza2022",
  "created_time": "June 07, 2022, 09:15:47 AM",
  "content": "This is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401662",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "June 07, 2022, 09:20:10 AM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.Actually no. This is no different time from any other.It's nice that you try to get people moving, but it's just another price drop in just another mid-cycle low/bear market.So while more bitcoin related activities are (always) welcome, let's be honest with ourselves, ok?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 07, 2022, 09:22:56 AM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMI think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. This is already being done in a lot of places where crypto prices are displayed. It's done on exchanges and some live price checkers (not sure about cmc and sites like that though).  I think time is going to prove itself again as being one of the best price amplifiers (providing crypto remains strong and secure).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "June 07, 2022, 10:33:49 AM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.Nah, unfortunately this is not a good approach, I know it's painful to see how slow the adoption is. But remember the market is barely 10 years old, so it doesn't need to be compare to stocks and other traditional markets that has existed for decades already. Let crypto grow in a natural course and process, just consider yourself lucky because you have been here as compare to others whose chances to have bitcoin is slim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P2PECS",
      "created_time": "June 07, 2022, 10:48:42 AM",
      "body": "The best way to drive up the price of BTC was done by Satoshi when he created it. He made such a good, decentralized, supply-limited currency with a limit to its total production as an alternative to potentially unlimited-production, on-demand, fully centralized fiat currencies that the price cannot stop rising due to a double effect: the inflation of fiat currencies and the decreasing supply of bitcoin. The price cannot be constantly rising, zoom out a little and think about where it will be in a few years.What you intend to do with websites, even if you managed to mobilize some people, would have minimal, if any, effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lenaza2022",
      "created_time": "June 07, 2022, 10:58:10 AM",
      "body": "I think that it is possible to build a civilization of cryptocurrencies and develop it. This will help the cryptocurrency to strengthen in its positions. Organic development can be up and down. Any of our steps will also be a step of organic development.Today, not only bitcoin, but also other cryptocurrencies are developing well. In the future, we will come to multicurrency in cryptocurrencies. It's time to prepare platforms for working with cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 07, 2022, 11:12:11 AM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.I feel that Bitcoin became much more like a commodity than a currency for most people, investors and the mainstream media. Although we in bitcointalkuse it as a currency , that is not the reality for most people.Everyone looks much more worried about price than real adoption. I think adoption will come, and everyone knows bitcoin now, much more than 5 years ago in the last bull . Banks and funds are using and investing in it. We are in a bear market just like the rest of the world's markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 07, 2022, 11:13:14 AM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.You do not have to think about how to sustain bitcoin growth, bitcoin is decentralized and not for a single person, the world is adopting it and it is known all over the world already. Just like gold and other decentralized asset, we like it or not, bitcoin will increase in price and value.Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMI think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.There are over 400 crypto exchanges that are centralized, there are still other types of exchanges, they are all websites. All these have happened in the past. It is just like you reverting situations back to the past when all these have not been created like many years ago. I see this your post not to necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ninis45",
      "created_time": "June 07, 2022, 11:14:25 AM",
      "body": "but optionQuote from: lenaza2022 on June 07, 2022, 09:15:47 AMI think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. is not one that can contribute to the growth of bitcoin because every market has provided it, especially the local market which provides the value of bitcoin in state money. it seems that that is not all that is needed to grow bitcoin and crypto civilization in the future but several other problems must be solved for a clean and safe civilization",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "June 07, 2022, 12:02:30 PM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMI think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.It doesn't make much sense for a website owner to display prices in terms of different cryptocurrencies because customers haven't yet mastered the skill of thinking in terms of something that is not a widely-adopted unit of account to measure exchange rates between various types of goods. Even more, being a unit of account is the last stage of the evolution of a digital good that is being monetized in the process of economic interactions, so we should find other solutions that would help hasten this process of monetization. To popularize cryptocurrency, we should first promote its usage as a store of value and only then as a medium of exchange or unit of measurement. Store of value is the most important factor since it allows people to alleviate the influence of the modern financial system, which is known to be based on credit creation and uncontrolled inflation. Once people realize the importance of saving and keeping their cash balances intact, they will start moving gradually towards the asset that best performs such a function of preserving wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 07, 2022, 12:14:27 PM",
      "body": "I think there are enough websites with prices in different currencies, and most people I know use only one of them: Coingecko or Coinmarketcap. New websites, even when they seem alright, don't get popular because they are unnecessary (perhaps some in local languages exist and are locally popular, but it's a different thing).As for BTC growth, I think it's potentially possible to bring about change if one succeeds at starting community action (like with Gamestop). It won't work as effectively because of Bitcoin's huge marketcap, but it could lead to some positive price movement. However, I don't think there's a good enough motive to inspire people to take part in it because Bitcoin is just volatile, and low prices are a good opportunity to invest. Also, it doesn't matter in the long run that Bitcoin is currently at a low point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 07, 2022, 12:24:27 PM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC?well to the best of my knowledge bitcoin in cryptocurrency is sustainable on itself except for other cryptos, the global growth for. adoption of it use keep increasing daily despite many of use don't know how and why but the whole world of internet has been dominated by the search of the word bitcoin, this has gone wide because of the system built for it and that's what exactly the need of the people, now you can see why i said bitcoin growth is sustainable by itself through the system built for it, another good example is when someone has quality things to offers, men begins to go after such person for their service role. [/quote]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "June 07, 2022, 12:35:45 PM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.I think there are more than enough websites across the globe that show the price of bitcoin in different currencies, I don’t think that’s any part of the “issue” at all. I think much of bitcoins drop simply has the same thing to do with what’s going on with traditional financial markets in that the war and and the corona virus play the largest part, as well as the fall of the markets themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 07, 2022, 12:46:14 PM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.First of all this is about the rise the price of BTC because it is in red for long time or we are talking about increasing the adoption?There are lot of websites accept cryptocurrency payments but it didn't bring the change we all wanted because people really don't want to spend their BTC because we call it as asset not as medium of exchange so if the condition remain same then the BTC will never be able to reach the main stream payment mode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "June 07, 2022, 12:53:28 PM",
      "body": "Quote from: ChiBitCTy on June 07, 2022, 12:35:45 PMQuote from: lenaza2022 on June 07, 2022, 09:15:47 AMThis is the time to look around and ask: What else can be done to sustain BTC growth? How to increase interest in BTC? Everything possible is already being done on the stock exchange. Where are the other growth points? Growth points in increasing demand and interest. Experienced people and beginners love to play. Therefore, growth points can be in expanding people's awareness and offering new tools.I think it's time to make websites with prices in different currencies: dollars, euros and crypto. It seems to me that this will contribute to the popularization of cryptocurrencies. Strengthening the popularity of cryptocurrencies would lead to an increase in their rate, to more lively trading, and as a result, to strengthening the status of cryptocurrencies.I think there are more than enough websites across the globe that show the price of bitcoin in different currencies, I don’t think that’s any part of the “issue” at all. I think much of bitcoins drop simply has the same thing to do with what’s going on with traditional financial markets in that the war and and the corona virus play the largest part, as well as the fall of the markets themselves. Issues on what happen in the world somehow what make people base on what will be the movement of the market that's why we see heavy sentiments once there is a crisis happening in the world just like the issue of covid and the war in Russia. This is why I don't really convinced on people who say about bull run is coming since if the war will still occur for sure this one hit badly on the global markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 07, 2022, 12:53:54 PM",
      "body": "Its a huge hurdle in driving more investors to BTC because of its volatility. Even when there will be more popular stores willing to accept BTC, only few people are willing to spend it to them. Which is why only halving somehow drives its price up.Bitcoin is already popular but the release of CBDCs linked to wallets like Chivo, Revolut, Stripes I think will help make it possible for regular Joes to try it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 07, 2022, 01:07:59 PM",
      "body": "Quote from: lenaza2022 on June 07, 2022, 10:58:10 AMToday, not only bitcoin, but also other cryptocurrencies are developing well. In the future, we will come to multicurrency in cryptocurrencies. It's time to prepare platforms for working with cryptocurrency.Are other cryptocurrencies developing well? I would not say that this is any meaningful development in the sense of bringing some benefit to the world, but that individuals get rich on false promises that they have created something better than Bitcoin. You have about 20 000 cryptocurrencies/tokens today, and 99% are completely useless and will not exist in the future - what kind of world are you talking about then and what kind of preparations?Honestly, your ideas don't make sense to me personally, and I can't say whether it's because of your language barrier or you're a complete beginner living in some kind of illusion?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "June 07, 2022, 01:09:09 PM",
      "body": "I guess there is no issue with the current price of Bitcoins.You need to just change the way of your thinking.This is actually the crucial point, where many new investors have the chance to buy Bitcoins and can be part of the eco system.Regarding the price rise thing, then you need to just wait and give time to market.Eventually when the time pass, people will see the true value of Bitcoins, and will start to buy as much as they can. This will no doubt increase the hype for Bitcoins, and soon it will rise.Moreover in the game of Bitcoin investment, you need to show always the patience and wait for long term.Will be glad to hear more people’s thought on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "June 07, 2022, 06:01:27 PM",
      "body": "What is happening with cryptocurrency price regulations, now is not the first time or second we experience the falling of cryptocurrency. So from my perspective, their is not wrong with the price depreciations but it's an avenue for buyers or who wants to invest into cryptocurrency to purchase and hold for period of time. The challenge we have right now is the market structure. The determination of the market is be activated through the gravity of the demand and supply for it's speed in price decrement and increments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lenaza2022",
      "created_time": "June 07, 2022, 06:05:06 PM",
      "body": "The rapid growth of bitcoin in the future will activate the demand for other cryptocurrencies too  . We have a future ahead of us with different cryptocurrencies probably for different purposes . If we constantly use the exchange into ordinary currencies for payment, then crypto will have a constant dependence on ordinary currencies. If crypto has its own tools, then there will be less dependence on tools of ordinary currencies. Payment systems for crypto seems to be good idea  So far bitcoin has been considered as an investment asset. Banks, funds and people use it for investments. Initial environment for storing and exchanging currencies has been built for crypto. Ordinary currencies have tools for storage, exchanges and also instruments such as payment for goods and services. The question today is about that status of crypto. Is it asset or is it going to be a currency?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}