{
  "id": "topic_5463504",
  "title": "Bureau",
  "author": "Bureau",
  "created_time": "August 16, 2023, 03:56:07 PM",
  "content": "Hello everyone!This is my first time on this board. I have a simple question for all the active members of this board. I know some members here are struggling with gambling addiction as I have read multiple threads which you can relate to the issue of addiction. My question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe if such a resources is available it should be on the pinned message. The next thing would be to always update it regularly, as things change quickly in gambling. As addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463504",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 16, 2023, 04:03:02 PM",
      "body": "This can be helpful: [Self-moderated]Bitcointalk Gambling Problem Support Grouphttps://www.gatewayfoundation.org/addiction-blog/how-to-stop-gambling/Quote from: Bureau on August 16, 2023, 03:56:07 PMAs addiction is a serious issue, if anyone here has been able to overcome it? I was once an addict, I am no more an addict when I knew that gambling can not be used to earn. Earning from gambling made me to be addicted to it. Knowing the cause of the addiction is important for the addict to know how to address the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "August 16, 2023, 04:23:04 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMMy question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe if such a resources is available it should be on the pinned message. The next thing would be to always update it regularly, as things change quickly in gambling. As addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? This is related to the psychology of addiction and there are many cases where it is quite difficult to cure it. I've heard some people say about rehabilitation related to healing gambling addiction, almost many people who take advantage of healing use the method of rehabilitation succeed. This cannot be achieved simply if after rehabilitation the control by the closest people is not emphasized more seriously and most importantly the individual's desire to heal himself from addiction because this is also very influential in playing on the subconscious mind to stop gambling.After this step is carried out break the gambling chain from his life by blocking all forms of access to gambling, removing access to financial control from that person. For example, all forms of money that are owned must be held by other people as trust in the family and must be given a more controlled portion of the use of money to be spent every day, and vice versa provide positive work so that someone who is addicted can leave gambling slowly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 16, 2023, 04:37:09 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMAs addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? The same initial therapy for all kind of addictions (having anything to do with substances or not) is to realize one is in danger and need to achieve to make chances in life, from there it is about getting support and then professional help.To be honest, I have not had to deal with addiction (Thank God) and I have not personally met anyone who had suffered from it (as far as I am aware, people can hide addictions); however if I had reached a point where I realize I have become addicted to anything, I would seek for support in a church, in my own family and even try to find help groups in my city. Unfortunately, gambling addiction often means one does not have money to pay for psychological help, so that is why I would first suggest to get spiritual help and recover from there, until eventually being able to pay for a psychologist or a psychiatrist. Good luck, to anyone facing these kind of demons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 16, 2023, 04:49:01 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMHello everyone!This is my first time on this board. I have a simple question for all the active members of this board. I know some members here are struggling with gambling addiction as I have read multiple threads which you can relate to the issue of addiction. My question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe if such a resources is available it should be on the pinned message. The next thing would be to always update it regularly, as things change quickly in gambling. As addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? Thanks. You can read most of the addiction threads, each has its own way on how to deal with the addiction. Since it's your first time here I guess you are yet not addicted.The internet is a much bigger world I think one could find a way to entertain himself without gambling, by just watching updates from your Facebook feed I think you can spend more than hours reading and commenting on your friend's wall. This I guess will stray a gambler from gambling at least for hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 16, 2023, 04:59:57 PM",
      "body": "As lizarder said rehabilitation is the only way to help a gambler overcome his addiction. Let the person stay away from gambling and during that process the persons needs a professional assist him change his thoughts over gambling. I could remember a friend that was an addict some years ago that he almost gambled off his father's building and when the parents noticed his plan, he was on house arrest for some months and he was deprived from everything that give him access to gambling. Presently,he doesn't gamble anymore but occasionally and with maximum caution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "August 16, 2023, 05:04:02 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMMy question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member.People use to say that heaven helps those who helped themselves, have you considered the gambler involved in tgis first, if he's willing and ready to adapt a chance for a change, there are are many ways to help oit in such if his answer remains yes.1. I will employ that all suggested ideas and recommendations already presented to this thread should be considered abd tried, we often make discussions abd make recommendations but only few take actions over them.2. Avoid exposure to a gambling enabling environment, what we often see could easily get our attention.3. Avoid iddle time, always find yourself something quality enough to keep yourself busy with4. Get an alternative to replace your addiction, anything that is of quality sustainability and worth taking tour time instead of gambling and avoid having money on your casino.5. Read careful for other means to help your addiction tackled here https://www.psychguides.com/behavioral-disorders/gambling-addiction/how-to-help/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 16, 2023, 05:05:16 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMMy question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe if such a resources is available it should be on the pinned message. The next thing would be to always update it regularly, as things change quickly in gambling. Seek professional opinion and schedule therapy if you are already has a sign of addiction. Reading source material on how to deal addiction is very hard to do if you already have the addiction since you will just be lazy to read and just gamble instead on your free time. Most of the user here can give opinion but none of them or very rare that actually deal gambling addiction. I really suggest to go with professional to properly deal with the addiction problem since we have different trigger and traits to solve our addiction problem.Welcome the gambling discussion board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 16, 2023, 05:09:49 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMAs addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? Talking. I talked about my struggle with gambling with the one person in the world who I knew  understands me and wouldn't judge me, my father. I spoke to him like a son speaks to a father, seeking advice, help, counsel, comfort, and support. And he was there for me for the 6 long months. He didn't tell me to quit gambling because he knew that was like shooting myself in the foot. Rather he helped me design a program to control it. During those long months, I remembered calling him at the dead of the night when the urge was strong because something had triggered it. He'll pick up the phone and talk me out of it, sometimes for an hour or more. There are many solutions to gambling addiction and one of them is talking to someone who you trust. Someone who wouldn't judge you or tell others about your struggle. I can tell you that it helps one hundred percent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 16, 2023, 05:20:44 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMMy question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe If anyone is addicted to gambling, there is a room and an opportunity to talk to create a topic and share your story, your triggers and challenges so that other members of this community will be able to share useful resources and suggest ways to help yourself out of the situation. Many members of this community were once addicts to gambling, but now they have been able to overcome that addiction. They are always willing to share tips and strategies that helped them through the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "August 16, 2023, 05:20:55 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMHello everyone!This is my first time on this board. I have a simple question for all the active members of this board. I know some members here are struggling with gambling addiction as I have read multiple threads which you can relate to the issue of addiction. Addiction is not something that happens overnight. It takes time before it gets instilled into someone. Just like it takes time to be an addict, so it’ll take time when you want to leave it forever. The process of leaving addiction is always harder than when having it instilled in you. Some people suggest staying away from gambling and maybe rehabilitation but I feel it’s way beyond that. For an addicted person, he needs to be enclosed in a place where he won’t have access to the happenings outside, no device to access the internet or anything that’ll make him think about gambling. This is more like making everything uncomfortable for him but with time he’ll adapt to that. Just hiring a therapy or going for therapeutical session won’t solve it all of the addict still has access to internet, it can only reduce it but can’t stop it. It is necessary for one to know when to stop, pause, wait, continue and start in this type of situation of being an addict. If that is not taken into account, it can lead to destruction of the persons mental health, especially those that don’t get to earn anything after gambling many times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 16, 2023, 05:25:49 PM",
      "body": "What do you need?In-the forum we already have a thread for (addiction-thread), suggestion,s and some of what you should need. IMO, talking online / get a advice from online it's not really effective better to talk with someone face to face (maybe psychiatristor / psychology) about your problem.Discuss with your family, to get the best result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "August 16, 2023, 05:33:50 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMHello everyone!This is my first time on this board. I have a simple question for all the active members of this board. I know some members here are struggling with gambling addiction as I have read multiple threads which you can relate to the issue of addiction. My question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe if such a resources is available it should be on the pinned message. The next thing would be to always update it regularly, as things change quickly in gambling. As addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? Thanks. Addiction cannot be eradicated from the system, but it can be managed and decreased to a manageable degree. It's really as simple as using appropriate approaches and never becoming excessively attached to gambling. There are multiple mechanisms to sort oneself out, presumably by surfing the internet, and the necessary solutions are provided, we all have problems we're dealing with, and it's preferable to obtain your answers from someone close who understands what you're going through. Gambling addiction is one of the worst things that can happen to a gambler. We should do everything we can to avoid doing anything that would jeopardize our chances of winning and keep us frustrated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "August 16, 2023, 05:38:49 PM",
      "body": "Why, if we claim to be a supportive space for enthusiasts, aren't there resources pinned for those struggling with addiction? It's practically negligentI'm an ardent supporter of the gambling world, but every economy, digital or not, MUST account for the well-being of its participants. If this forum is genuinely a hub for exchanging ideas and supporting each other, there should be a system in place to help members in crisis.Regarding the therapies, no, I don't agree. Addiction might look the same from the outside, but the underlying reasons for a gambling addiction could be vastly different from, say, substance abuse. Just because the symptoms look similar doesn't mean the treatment should be generic!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "August 16, 2023, 06:05:34 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMHello everyone!This is my first time on this board. I have a simple question for all the active members of this board. I know some members here are struggling with gambling addiction as I have read multiple threads which you can relate to the issue of addiction. My question to everyone here is that if a member is hooked to this addiction, is their any resources to help that member. If not then what exactly is this community offering? I believe if such a resources is available it should be on the pinned message. The next thing would be to always update it regularly, as things change quickly in gambling. As addiction is a serious issue, if anyone here has been able to overcome it? Why not share how to overcome with such an addiction. As per my understanding all of these addiction have the same initial therapy. Do you agree with me? Thanks. First I would say forum doesn't moderate addiction or in anyway control of those who are addicted in gambling and beside how do we all know that Mr. B is gamble addicts and who to testify is true or false and anyone could come over to say his is an addicts and for that he needs help, help can only come from reading resourceful material that could help them limits their gambling exercise and this doesn't mean the forum would work hand in hands with such person to make sure such attitude are being stopped. Even as that no one cares about your well-being or how you do and how your survive, so whatever life you chooses to lived on depends on you and not entirely relying on the forum. So it's ideally you work on your character and attitudes towards gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "August 16, 2023, 06:33:55 PM",
      "body": "Quote from: Oshosondy on August 16, 2023, 04:03:02 PMThis can be helpful: [Self-moderated]Bitcointalk Gambling Problem Support Grouphttps://www.gatewayfoundation.org/addiction-blog/how-to-stop-gambling/Quote from: Bureau on August 16, 2023, 03:56:07 PMAs addiction is a serious issue, if anyone here has been able to overcome it? I was once an addict, I am no more an addict when I knew that gambling can not be used to earn. Earning from gambling made me to be addicted to it. Knowing the cause of the addiction is important for the addict to know how to address the issue.Communities would be a huge help but if things got out of hand, asking professionals would be the best thing to do. It is never bad to have a consultation. In such case they would be able to address the problem in a more systematic way to help you recover faster.  Consultations won't cost us that much and that is for long term already especially if you are seeking for changes real bad. Problem with social relations and support groups is that some people aren't okay with sharing things with peers; some tend to keep it in private. Gambling addiction is not something we should take lightly. It involves money and our health which is why it should be taken seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "August 16, 2023, 06:52:28 PM",
      "body": "Quote from: Bureau on August 16, 2023, 03:56:07 PMHello everyone!This is my first time on this board. I have a simple question for all the active members of this board. I know some members here are struggling with gambling addiction as I have read multiple threads which you can relate to the issue of addiction. I don't think there are a few here who struggles with gambling addiction, but most of the members in this community loves to tackle this topic. I'm not sure what would be the purpose, is it whether to make everyone aware of or just trying to check for themselves, but a correct way of using the search button could be helpful to eliminate additional more topics regarding gambling addictions. IMO, no one would actually willing to reveal himself as a gambling addict or admit to himself or even aware of himself that he's been dragging into a worse addiction. So, I think any resources could help someone if one is not willing to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 16, 2023, 06:54:30 PM",
      "body": "As a family member the best you can do is to talk to the addicted fellow and hear him at first place. Let him tell you what is happening, what he is suffering and then tell him you want to help somehow, so you would like him to tell you how you can do this. This way you are adopting an approach in the most friendly way as possible. It's important to avoid hostility on this moment, otherwise the addicted person can get fearful and introspective to continue sharing what he is facing with you and other family members.Step by step you will developing a strategy to treat his addiction. Also, don't neglect the possibility of asking for the help of a professional from the health sector of your community. A reliable psychologist or social worker can offer a relief not only for the addicted individual, but also for the family suffering with this situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "August 16, 2023, 06:56:27 PM",
      "body": "Fighting gambling addiction is not easy and will be a long process for a highly addicted gambler and for his family and friends who love him. And indeed the help of family, friends, professionals can help reduce addiction.But it's going to be a very slow process and actually the most effect is. The gambling addict must make a firm decision to stop, nothing more. Family members may really want him to quit, but then again, it all depends on the addict. If he firmly decides to quit, he will win the battle against his illness and be helped by the people who love him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "August 16, 2023, 06:57:32 PM",
      "body": "To get things done, the person that is having the addiction must be ready to help himself or help all attempt will not work. Working on addiction and trying to drop the urge of one leaving the past life of gambling too much is all about doing things gradually. We can't just decide to leave gambling immediately without us doing it gradually in a way that will make things very easier for us like reducing the way we gamble. I believe that consistency is the key and if we are passionate about calling it a quit as a gambling then it will not be hard for us to stop gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}