{
  "id": "topic_5441322",
  "title": "OmegaStarScream",
  "author": "OmegaStarScream",
  "created_time": "February 26, 2023, 05:15:28 PM",
  "content": "كنت أفكر في عمل بوت أو قناة تلغرام بسيطة التي يتم فيها ارسال أخر أخبار البيتكوين و العملات المشفرة فور صدورها. هل فيكم من قد يجد هذا الأمر مفيدا؟ لا أدري ان كان هنالك قنوات مماثلة؟ خاصة بالنسبة للأخبار باللغة العربية (Arab-BTC, CoinTelegraph, الخ)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441322",
  "comments": [
    {
      "author": "Ulven",
      "created_time": "February 26, 2023, 07:47:18 PM",
      "body": "إنشاء البوت الأخبار أعتقد أنه سيكون مشروع جيد للمستخدم العربي الذي يجد صعوبة في العثور على الأخبار المتعلقة بالتشفير، شخصيا كنت منظم إلى إحدى هذه البوتات على تطبيق ديسكورد فهو جيد، على فكرة هذا البوت قسم الأخبار إلى ثلاثة أقسام إحدى الأقسام كان متعلق بالبتكوين و أحدهما الأخر كان يجمع العملة البديلة و الثالث لا أتذكره لأن البوت في الوقت الحالي أصبح مدفوع في البداية قام صاحب المشروع بعرض إنتاجه مجاناً و لكن في ظرف سنتين قام بتخصيص مبلغ سنوي للإستفادة من الأخبار.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 27, 2023, 01:44:50 AM",
      "body": "فكرة جميلة أخي أوميغا، أنا أهتم بهذه البوتات التي تعطي أخبار البيتكوين وكريبتو وأيضا بعض أخبار العملات المهمة الصالحة للتداول. أنا مشترك في قناة أخبار كوينتليجراف بالعربي، قناة جميلة جدا وتبقيني مطلع على آخر الأخبار المهمة بشكل عام وأخبار كريبتو في المنطقة العربية بشكل خاص.سيكون من الجميل وجود بوت أو قناة للمنتدى تعطي آخر أخبار البيتكوين وأيضا بعض العملات المشفرة المهمة وقت حدوثها، بعض الأخبار أحيانا تكون مهمة جدا خاصة التي تتعلق بالحوادث المؤسفة في كريبتو مثل حوادث انهيار المنصات أو انهيار بعض العملات المهمة حتى يتمكن الناس من تجنب وقوع خسائر كبيرة. لذلك أنا أشجعك أخي أوميغا على إنشاء مثل هذا البوت أو القناة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "February 27, 2023, 07:34:21 PM",
      "body": "Quote from: OmegaStarScream on February 26, 2023, 05:15:28 PMكنت أفكر في عمل بوت أو قناة تلغرام بسيطة التي يتم فيها ارسال أخر أخبار البيتكوين و العملات المشفرة فور صدورها. هل فيكم من قد يجد هذا الأمر مفيدا؟ لا أدري ان كان هنالك قنوات مماثلة؟ خاصة بالنسبة للأخبار باللغة العربية (Arab-BTC, CoinTelegraph, الخ)أمر مفيد أخى الحبيب, أنا صراحة مشترك فى قناه CoinTeregraph لى تليجرام لكنها بالانجليزية فلو كان هناك قناه تليجرام أو بوت يتم من خلال نشر هذه الأخبار بالعربية فور نشرها فى الموقع فسيكون فكرة جيدة مع ذكر مصدرهم بالطبع, لكن الامر بحاجة اعتقد الى فريق عمل وليس شخص واحد حتى تنجح القناه ولا يكون ضغط النشر على شخص واحد, لاننى ايضاً مشترك فى قنوات عربية على تليجرام لكن لا ينشرون بإستمرار حصريات وجديد الأخبار ولكن كل فترة معينة وهذا امر حقاً ليس جيد, فالأفضل أن لا تتوقف قناه التليجرام هذه عن النشر وتقوم بالنشر على مدار اليوم والاسبوع كل ما هو جديد, حتى لا يفوت المستخدم اخبار جديدة وجديد الأحداث الحاصلة فى السوق.ايضاً نشر الخبر يتم عن طريق تلخيصه ونشره على القناه لتكون هى المرجع وذكر النقاط الهامة للخبر دون الإكتفاء بنشر رابط الخبر فقط.أتمنى ان تقوموا بذلك والأهم ان يكون مصدركم مدونات ومواقع إنجليزية رائدة فى مجال الكريبتو واخبارها. بالتوفيق",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 02, 2023, 10:57:12 AM",
      "body": "Quote from: Ulven on February 26, 2023, 07:47:18 PMإنشاء البوت الأخبار أعتقد أنه سيكون مشروع جيد للمستخدم العربي الذي يجد صعوبة في العثور على الأخبار المتعلقة بالتشفير، شخصيا كنت منظم إلى إحدى هذه البوتات على تطبيق ديسكورد فهو جيد، على فكرة هذا البوت قسم الأخبار إلى ثلاثة أقسام إحدى الأقسام كان متعلق بالبتكوين و أحدهما الأخر كان يجمع العملة البديلة و الثالث لا أتذكره لأن البوت في الوقت الحالي أصبح مدفوع في البداية قام صاحب المشروع بعرض إنتاجه مجاناً و لكن في ظرف سنتين قام بتخصيص مبلغ سنوي للإستفادة من الأخبار.مشكور أخي، هل يمكنك مشاركتي رابط البوت؟ أريد معرفة خصائصه بكي تكون عندي فكرة أفضل عما يمكنني عمله.Quote from: yhiaali3 on February 27, 2023, 01:44:50 AM-snip-أنا لا أتطلع كثيرا على النسخة العربية للموقع، لكن هل عندك بكرة عما اذا كانت الأخبار العربية هي نفسها الأخبار الانجليزية فقط مترجمة؟ أو هي مختلفة تماما.Quote from: albon on February 27, 2023, 07:34:21 PMأمر مفيد أخى الحبيب, أنا صراحة مشترك فى قناه CoinTeregraph لى تليجرام لكنها بالانجليزية فلو كان هناك قناه تليجرام أو بوت يتم من خلال نشر هذه الأخبار بالعربية فور نشرها فى الموقع فسيكون فكرة جيدة مع ذكر مصدرهم بالطبع,-snip-في الحقيقة الفكرة من تطوير البوت هي عدم الحاجة الى أي فريق لكي يتم عمل كل شئ بطريقة أتوماتكية، بعد برمجة البوت، يمكني وضعه في سيرفر رخيص لكي يقوم بتفقد المواقع من دون توقف، و فور ايجاده لمقال جديد، يقوم بارسال اشعار في التلغرام لكل أعضاء القناة.الفكرة يمكن تطويرها بطبيعة الحال، لاضافة مختلف الخصائص، لكن أردت أن أعرف كبداية ان كان هنالك أي اهتمام",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "March 02, 2023, 11:03:12 AM",
      "body": "أجل أخي أوميغا هذا رابط البوت:https://discord.gg/WpvCEVbaيمكنك الإطلاع عليه",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 02, 2023, 11:34:28 AM",
      "body": "Quote from: OmegaStarScream on March 02, 2023, 10:57:12 AMأنا لا أتطلع كثيرا على النسخة العربية للموقع، لكن هل عندك بكرة عما اذا كانت الأخبار العربية هي نفسها الأخبار الانجليزية فقط مترجمة؟ أو هي مختلفة تماما.نفس الأخبار تقريبا أخي أوميغا مع صياغتها باللغة العربية. لكن الأمر المهم في القناة العربية هو التركيز على أخبار المنطقة العربية تحديدا، يعني في الفترة الماضية كان هناك الكثير من الأخبار عن البحرين والإمارات والسعودية وعمان ورأس الخيمة. لذلك أتوقع أنه سيكون مفيد لك في فكرتك كونه سيساعدك في جلب كل جديد عن كريبتو في المنطقة العربية . رابط البوت إذا أحببت: https://t.me/CointelegraphAr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 15, 2023, 12:46:37 PM",
      "body": "لقد قمت بانشاء البوت/القناة، و تجربتها لمدة 3-4 أيام و لم تكن هنالك أي مشاكل تذكر. هذا هو الرابط لمن أراد استخدامها.القناة حاليا تدعم المواقع الاتية: Coindesk, Cointelegrpah, Blockworks, Decrypt.coلم أقم باضافة موقع Arab-BTC لأني لاحظت أن الموقع عادة ما يأخذ وقت أكثر  لمشاركة المعلومات، مقارنة بالمواقع الأجنبية.هذه هي الخصائص التي أود اضافتها في المستقبل:- ارسال رابط الخبر مع تلخيص للمقال كما اخترح الأخ ألبون.- اضافة مواقع أخرى  ان وجدت (حاولت اضافة المواقع المعروفة و التي عادة تكون سريعة في اطلاق الخبر)- قد يكون الأمر صعب بعد الشئ و لا أدري ما هو رأيكم في الفكرة، لكن أريد اضافة خاصية بحيث لا يتم ارسال نفس الخبر من مواقع مختلفة، يعني في حال تمت تغطية خبر ما من طرف موقع \"أ\"، لا داعي لارسال المقال مرة أخرى ان تمت تغطيته من طرف الموقع \"ب\".بالنسبة لارسال الأخبار التي تخص العالم العربي فقط، فسوف أقوم بانشاء قناة مختلفة و مشاركتكم اياها عن قريب ان شاء الله.المهم، و باختصار: القناة حاليا تعمل بشكل جيد و تقوم بارسال الأخبار فور توفرها في الموقع. أتمنى أن تكون ذو فائدة لكم. في حال كانت عندكم أي استفسارات أو اقتراحات، فتفضلو بها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 15, 2023, 08:03:03 PM",
      "body": "جميل جدا أخي أوميغا، مشكور على الجهد لقد انضممت للقناة وسأتابعها باستمرار إن شاء الله. أتمنى أن نرى بوت الأخبار العربية في القريب إن شاء الله.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "March 15, 2023, 09:02:20 PM",
      "body": "مشكور على الجهد أخي أوميغا، إنضممت إلى القناة على ما يبدو جيدة للغاية بمجرد نشر الخبر على مواقع الأخبار يتم مشاركته على القناة و هذا المراد منه. أييد بشدة خاصية تكرار الخبر فهذه الميزة فريدة من نوعها إذا كان البوت يشارك الخبر مرة واحدة فقط خصوصاً إذا تم تناول الخبر على مصادر مختلفة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 19, 2023, 11:51:17 AM",
      "body": "نسخة الأخبار العربية أصبحت متوفرة الانالبوت هو نفسه، الفرق هنا هو أن هذه القناة سوف تقوم بالبحث عن بعض الكلمات المفتاحية في عنوان المقال أو في الوصف (اسم بلد عربي، اسم منصة عربية، الخ..) قبل ارسال الخبر.لقد قمت أيضا باضافة موقع news.bitcoin.com الاخباري لكل من النسخة العربية و الانجليزية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "March 19, 2023, 03:48:32 PM",
      "body": "Quote from: OmegaStarScream on March 19, 2023, 11:51:17 AMنسخة الأخبار العربية أصبحت متوفرة الانالبوت هو نفسه، الفرق هنا هو أن هذه القناة سوف تقوم بالبحث عن بعض الكلمات المفتاحية في عنوان المقال أو في الوصف (اسم بلد عربي، اسم منصة عربية، الخ..) قبل ارسال الخبر.لقد قمت أيضا باضافة موقع news.bitcoin.com الاخباري لكل من النسخة العربية و الانجليزية.مشكور على المجهود صديقي أوميغا. لقد انضممت الان الى القناة بما انني لم الاحظ هذا الموضوع سابقا بصراحة.. فقط لا اعرف كيفية تفعيل البوت لتصلني الاشعارات من خلالها. أتساءل أيضا ان كان هناك مشروع للترويج للقناة خارج القسم العربي لزيادة عدد المشتركين. مثلا اطلاق اعلان رسمي في القسم الرئيسي الانجليزي و لما لا قنوات على مختلف الوسائط الاجتماعية بشكل يسمح للاعضاء هنا مثلا او اعضاء معيينين بمواصلة العمل على التحديثات (بشكل تطوعي طبعا(. اقترح ايضا وضع اعلان ثابت pinned post على القناة تكون بها تعريف للقناة و اهدافها و قوانين التعامل مع المجموعة.يمكن فتح باب الاقتراحات للجميع للاضافة .أرجوك لا تتردد بطلب المساعدة لدعم القناة و انا متأكد أنها ستكون قيمة مضافة للقسم العربي و ستساهم في دعمه.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "March 19, 2023, 10:49:38 PM",
      "body": "Quote from: OmegaStarScream on March 19, 2023, 11:51:17 AMنسخة الأخبار العربية أصبحت متوفرة الانالبوت هو نفسه، الفرق هنا هو أن هذه القناة سوف تقوم بالبحث عن بعض الكلمات المفتاحية في عنوان المقال أو في الوصف (اسم بلد عربي، اسم منصة عربية، الخ..) قبل ارسال الخبر.لقد قمت أيضا باضافة موقع news.bitcoin.com الاخباري لكل من النسخة العربية و الانجليزية.قمت بالاشتراك في القناة والفكرة رائعة خصوصا انه ليس لدينا اي بوت او قناة مخصصة للاخبار حول البيتكوين رغم وجود العديد من القنوات الاجنبية. اتمنى ان نرى المزيد من الاشخاص المهتمين في هذا المجال لانه ومع الاسف لا زلنا لم نصل للمستوى والتوعية المطلوبين في عالمنا العربيولدي نفس تساؤل الاخ Kavelj لا اضن اني قمت بتفعيل البوت فقط بالاشتراك في القناة لانه لا توجد اي اشعارات او اخبار حاليا في تلك القناة اتمنى وضع شرح لكيفية اشتغال البوت والمصادر التي. يعتمدها",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 20, 2023, 08:19:31 AM",
      "body": "Quote from: Kavelj22 on March 19, 2023, 03:48:32 PM-snip-Quote from: GxSTxV on March 19, 2023, 10:49:38 PM-snip-بالنسبة للنسخة الانجليزية، فهنالك الكثير من الأخبار. و أما عن النسخة العربية فلا يوجد أي داع لتفعيل القناة أو البوت. لقد تم اطلاق البوت البارحة فقط، و لحد الان لا توجد أي أخبار متعلقة بالدول أو المنصات العربية و لهذا لم يتم ارسال أي أخبار بعد.أما بالنسبة للترويج للبوت في القسم الانجليزي، فلقد قمت بانشاء موضوع في قسم تطوير المشاريع و سوف أقوم مشاركته في ريديت أيضا، بعد العمل على التعديلات و اضافة الخاصيات التي ذكرتها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "March 20, 2023, 11:39:19 PM",
      "body": "شكرا على المجهود اخي اوميغا. قمت بالاشتراك بالقناة و اتمنى ان تواصل العمل على مثل هذه المشاريع.بالنسبة لفلترة الاخبار لحذف المواضيع المكررة فذلك يبدو صعبا بعض الشيئ فكل موقع يعتمد عنوان مختلف و الكلمات المفتاحية لن تكون مفيدة هنا و لا يمكن الاعتماد عليها.البوت يعمل بشكل ممتاز، فقط لاحظت ان هناك أحد الاخبار من نفس الموقع تم تكراره مرتين متتاليتين و لا أعلم سبب ذلك!هذا هو الخبر:Microsoft Edge Testing Built-In Ethereum Crypto Wallet, Screenshots Show",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 21, 2023, 10:09:13 AMLast edit: March 21, 2023, 11:49:20 AM by OmegaStarScream",
      "body": "Quote from: khaled0111 on March 20, 2023, 11:39:19 PMشكرا على المجهود اخي اوميغا. قمت بالاشتراك بالقناة و اتمنى ان تواصل العمل على مثل هذه المشاريع.بالنسبة لفلترة الاخبار لحذف المواضيع المكررة فذلك يبدو صعبا بعض الشيئ فكل موقع يعتمد عنوان مختلف و الكلمات المفتاحية لن تكون مفيدة هنا و لا يمكن الاعتماد عليها.البوت يعمل بشكل ممتاز، فقط لاحظت ان هناك أحد الاخبار من نفس الموقع تم تكراره مرتين متتاليتين و لا أعلم سبب ذلك!هذا هو الخبر:-snip-نعم الأمر صعب بعض الشئ، لكني بدأت بالفعل بتجربة بعض الخوازميات و أعتقد أنه يمكن القيام بهذا الأمر بحيث أنه حتى و ان لم تكن نسبة النجاح 100% سوف أتمكن من التقليل من المقالات.أما بالنسبة للمشكل الذي ذكرته، فالظاهر أن المشكل من الموقع الاخباري و ليس من البوت، لأنه تم ارسال رابطين مختلفين:Code:https://blockworks.co/news/microsoft-edge-testing-built-in-ethereum-crypto-wallet-screenshots-showhttps://blockworks.co/news/microsoft-edge-testing-crypto-walletو عند قيامنا بالاطلاع على الرابط الأول سوف نرى أنه لا يعمل لذلك أعتقد أنه تم مشاركة الخبر، حذفه ثم مشاركته مجددا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "March 26, 2023, 06:55:29 PM",
      "body": "Quote from: OmegaStarScream on March 20, 2023, 08:19:31 AMQuote from: Kavelj22 on March 19, 2023, 03:48:32 PM-snip-Quote from: GxSTxV on March 19, 2023, 10:49:38 PM-snip-بالنسبة للنسخة الانجليزية، فهنالك الكثير من الأخبار. و أما عن النسخة العربية فلا يوجد أي داع لتفعيل القناة أو البوت. لقد تم اطلاق البوت البارحة فقط، و لحد الان لا توجد أي أخبار متعلقة بالدول أو المنصات العربية و لهذا لم يتم ارسال أي أخبار بعد.أما بالنسبة للترويج للبوت في القسم الانجليزي، فلقد قمت بانشاء موضوع في قسم تطوير المشاريع و سوف أقوم مشاركته في ريديت أيضا، بعد العمل على التعديلات و اضافة الخاصيات التي ذكرتها.النسخة الانقليزية تعمل بشكل جيد و الاشعارات تصلني متواترة من مواقع الاخبار المختلفة. في الحقيقة لقد افادني هذا كثيرا لابقى مواكبا لاهم الاخبار بدل ان كنت اضطر الى البحث يدويا في مواقع الاخبار المختلفة بما لا افعل اي نوع اخر من الاشعارات سواء على المتصفح او على البريد الالكتروني.انا استعمل البوت منذ ايام و لا الاحق على قراءة كل الاشعارات. لا اعرف ان كان بالامكان للمستخدم تحديد مصادر اخبار معينة ليتلقى منها دون غيرها و اذا كانت مواقع الاخبار العربية المختصة في الكريبتو يمكن اضافتها الى قائمة المصادر.نشر الموضوع على ريديت سيزيد من عدد المستخدمين بالتأكيد و أعتقد انه سيكون من الجيد الابقاء على هذا الموضوع محينا باستمرار.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "March 26, 2023, 10:07:23 PM",
      "body": "Quote from: Kavelj22 on March 26, 2023, 06:55:29 PMالنسخة الانقليزية تعمل بشكل جيد و الاشعارات تصلني متواترة من مواقع الاخبار المختلفة. في الحقيقة لقد افادني هذا كثيرا لابقى مواكبا لاهم الاخبار بدل ان كنت اضطر الى البحث يدويا في مواقع الاخبار المختلفة بما لا افعل اي نوع اخر من الاشعارات سواء على المتصفح او على البريد الالكتروني.انا استعمل البوت منذ ايام و لا الاحق على قراءة كل الاشعارات. لا اعرف ان كان بالامكان للمستخدم تحديد مصادر اخبار معينة ليتلقى منها دون غيرها و اذا كانت مواقع الاخبار العربية المختصة في الكريبتو يمكن اضافتها الى قائمة المصادر.نشر الموضوع على ريديت سيزيد من عدد المستخدمين بالتأكيد و أعتقد انه سيكون من الجيد الابقاء على هذا الموضوع محينا باستمرار.نعم القناة الان تشتغل بشكل جيد وتم مشاركة الاخبار المتعلقة بالعالم العربي فقط واضن فكرة البوت جيدة لانه لا يقوم بنقل الاخبار عشوائيا واضافة مصادر الاخبار العربية لن يكون لها فائدة كثيرة لان اغلب اذا لم اقل جميع تلك الاخبار هي مترجمة فقط ولا تعني العالم العربي بل تتحدث بشكل عام ولا توجد فائدة من نقلها أساسا. ربما في المستقبل يمكن اضافة كلمات لكي تشمل جميع الاخبار المتعلقة بالدول العربية رغم قلتها مع الاسف. لاحظت ان القناة ليس لديها لوجو خاص بها بعد لهذا قمت بانشاء واحد بسيط واتمنى ان يعجبكم",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 26, 2023, 10:57:54 PM",
      "body": "نعم أخي أوميغا النسخة الإنكليزية تعمل بشكل ممتاز، لكن النسخة العربية ليست كذلك. ربما كانت بحاجة بعض التعديلات أو إضافة مواقع إخبارية إضافية للبوت. مثلا أنا مشترك ببوت قناة كوينتيليجراف النسخة العربية وفي الأيام الماضية كان هناك عدة أخبار تتعلق بالدول العربية وبالإمارات تحديدا لكن البوت العربي لم يرصدها. مثلا هناك خبر بتاريخ 21/3 بعنوان: The Sandbox تتعاون مع GCEX لإطلاق مبادرة تعليمية في Dubaiversehttps://ct.com/bgqqخبر آخر أيضا بتاريخ 23/3 بعنوان:بنك الأصول الرقمية السويسري Sygnum يحصل على ترخيص مصرفي في أبو ظبيhttps://ct.com/bgzeلا أدري إن كانت هذه الأخبار موجودة بالنسخة الإنجليزية لموقع كوينتيليجراف ولكن أرى أنه سيكون من الجيد إضافة الموقع الخاص بالنسخة العربية لأنه يجلب الكثير من الأخبار التي تتعلق بالمنطقة العربية. تحياتي وكل الشكر لك أخي أوميغا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 30, 2023, 09:01:50 AM",
      "body": "Quote from: Kavelj22 on March 26, 2023, 06:55:29 PMالنسخة الانقليزية تعمل بشكل جيد و الاشعارات تصلني متواترة من مواقع الاخبار المختلفة. في الحقيقة لقد افادني هذا كثيرا لابقى مواكبا لاهم الاخبار بدل ان كنت اضطر الى البحث يدويا في مواقع الاخبار المختلفة بما لا افعل اي نوع اخر من الاشعارات سواء على المتصفح او على البريد الالكتروني.انا استعمل البوت منذ ايام و لا الاحق على قراءة كل الاشعارات. لا اعرف ان كان بالامكان للمستخدم تحديد مصادر اخبار معينة ليتلقى منها دون غيرها و اذا كانت مواقع الاخبار العربية المختصة في الكريبتو يمكن اضافتها الى قائمة المصادر.نشر الموضوع على ريديت سيزيد من عدد المستخدمين بالتأكيد و أعتقد انه سيكون من الجيد الابقاء على هذا الموضوع محينا باستمرار.كما ذكرت سابقا، الان و بما أن البوت داخل القناة، لا يمكن القيام بالكثير، لكني بصدد تطوير بوت وحده أين يوف يتمكن المستخدمون من اختبار مصادر الأخبار ان شاء اللهأما بالنسبة للمواقع العربية، فالأمر ممكن لكن للأسف، وجدت أن معظم المواقع العربية تقوم بنشر الأخبار بعد فوات الأوان (يعني عدة ساعات أو حتى أيام بعد خروج الخبر)Quote from: yhiaali3 on March 26, 2023, 10:57:54 PMلا أدري إن كانت هذه الأخبار موجودة بالنسخة الإنجليزية لموقع كوينتيليجراف ولكن أرى أنه سيكون من الجيد إضافة الموقع الخاص بالنسخة العربية لأنه يجلب الكثير من الأخبار التي تتعلق بالمنطقة العربية. تحياتي وكل الشكر لك أخي أوميغا. تعم، الأخبار ليست متوفرة في النسخة الانجليزية، و لهذا السبب لم يرصدها البوت. لن يكون من الصعب اضافة الموقع، سوف أقوم بذلك في التحديث القادم.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}