{
  "id": "topic_5458670",
  "title": "hugeblack",
  "author": "hugeblack",
  "created_time": "July 05, 2023, 06:26:21 AMLast edit: July 05, 2023, 10:01:05 AM by hugeblack",
  "content": "Today, after seeing the news that the OKX platform requires KYC, I logged into my account, and from there a small notice appeared to me that there are limits of $ 1000 (lifetime) for deposits and withdrawals, so I decided to deposit $50 to try it for the last time. After deposits, they directly frozen my account and asked to verify ID/selfie before doing anything.Therefore, if you see a $1,000 limit notice, avoid depositing if you do not intend to complete KYC.Unfortunately, after all this time, this was the end of my experience with OKX.Currently, I do not have a way to withdraw that 50 dollars. I thought of withdrawing it via internal exchange. I do not know if it will succeed, but if there is someone who has a verified account, please PM me with his sub-account and I will try to send it to him.EDIT: here is the answer from technical support:QuotePlease note that previous withdrawals and deposits made prior to the recent rule update also affect the current limit. In other words, for example, if you had 500 USD left within the lifetime limit before the rules update, then after the update you will also have 500 USD left, not 1000 USD. I hope I was able to clarify this issue for you.If you have any additional questions, we are always happy to support you. I wish you all the best!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458670",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "July 05, 2023, 07:01:05 AM",
      "body": "Quote from: Ratimov on July 05, 2023, 06:55:02 AMIf the account was inactive for a long time and then logging occurred from a different browser and from a different IP, then the exchange often blocks such accounts when sudden financial activity occurs on them. I wrote about this in my notes on using centralized exchanges:No, I log into the account from time to time, I haven't made a deposit for about two months, but everything is done through a dedicated IP, saving cookies, a clean operating system and a browser that I only use to access that account, so it's not a security problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 05, 2023, 07:17:25 AMLast edit: July 05, 2023, 07:38:13 AM by Oshosondy",
      "body": "Quote from: hugeblack on July 05, 2023, 07:01:05 AMNo, I log into the account from time to time, I haven't made a deposit for about two months, but everything is done through a dedicated IP, saving cookies, a clean operating system and a browser that I only use to access that account, so it's not a security problem.Have you not withdrawn up to $1000 before? It could be what that caused it. For anyone that do not want KYC exchange and they do not want an exchange to force them to get verified, such people should avoid OKX is what I think. OKX has gotten strict with KYC requirements. Identity documents are getting needed.Edit: I mean you should try and remember if you have deposited and withdrawn more than $1000. That amount is too small and you may not remember you have deposited and withdrawn more than that amount after you have deposited and withdrawn more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 05, 2023, 08:07:16 AMLast edit: July 05, 2023, 08:21:04 AM by BitMaxz",
      "body": "Are you Basic level 1 verified?It looks like a trap to those who do not want KYC and I think even you submit your documents to them they will still froze your account just like what happen to this man below.- https://twitter.com/Boukareey/status/1676130911161573376They also updated KYC requirements according to previous post here below- https://bitcointalk.org/index.php?topic=5458422.msg62497661#msg62497661",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 05, 2023, 08:11:42 AM",
      "body": "Quote from: Oshosondy on July 05, 2023, 07:17:25 AMHave you not withdrawn up to $1000 before? It could be what that caused it. No, the rate of withdrawal from the account is approximately 600 to 800 per month, and sometimes a month or two may pass without withdrawal.Quote from: BitMaxz on July 05, 2023, 08:07:16 AMAre you Basic level 1 verified?Yes, the problem is that the word 1000 dollars is misleading. I did not deposit or withdraw 1000 dollars after I got that notification, maybe during the last 6 months or within a year.For reference and future purposes, when you deposit, you will get this error.And when you want to withdraw, you will get this error, and you cannot withdraw to an internal address.Knowing that I did not deposit or withdraw $1,000 after I got this notification, but I deposited $50 and was not able to withdraw it.In short, there is no way without KYC after you get the $1000 restrictions.I will lock this topic because its purpose is to verify the possibility of withdrawing to an internal address, and you can discuss about OKX's KYC here ---> OKX enforcing KYC.and for updated list ----> Current list of exchanges without KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 05, 2023, 08:17:25 AM",
      "body": "Quote from: Ratimov on July 05, 2023, 08:14:09 AMJust in case, I tested my accounts, which I registered back in December last year. Deposit and withdrawal work stably, in accordance with the rules that the exchange has recently established:What are the deposit or withdrawal limits during the last 6 months or a year, was it more than $1,000 or less?  Is the deposit limit reduced from $1,000 to $990?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 05, 2023, 08:21:38 AM",
      "body": "Quote from: hugeblack on July 05, 2023, 08:17:25 AMWhat are the deposit or withdrawal limits during the last 6 months or a year, was it more than $1,000 or less?  Is the deposit limit reduced from $1,000 to $990?What country you are living? It seems they don't offer service in the US due to local law according to OKX support post below- https://twitter.com/OKXHelpDesk/status/1666989040971976704If you are not living in the US check the other restricted/prohibted country listed belowQuote from: https://www.okx.com/help-center/3600218136912.2 Note that we may not make all of the Services available in all markets and jurisdictions, and may restrict or prohibit use of all or a portion of the Services from Restricted Locations, which at this time include Hong Kong (specifically regarding our derivatives-related Services), Belgium, Cuba, Iran, Japan, North Korea, Crimea, Malaysia, Singapore, Syria, United States of America including all U.S.A. territories like Puerto Rico, American Samoa, Guam, Northern Mariana Island, and the US Virgin Islands (St. Croix, St. John and St. Thomas), the Bahamas, Canada, the Netherlands, the United Kingdom (specifically regarding our derivatives-related Services for retail users), Bangladesh, Bolivia, Donetsk, Luhansk and Malta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 05, 2023, 08:29:29 AM",
      "body": "Quote from: Ratimov on July 05, 2023, 08:21:27 AM In your case, most likely, past transactions were taken into account, which turned out to be more than $ 1000 in total (according to the new rules), and now any operations with your account have been frozen. From this we can conclude that if someone wants to use OKX now in the most secure way, he should create a new account 9while there is such a possibility), or use old accounts that have not had any operations before (as in my case above).I agree, I don't know why they didn't mention that, meaning they should have said, the deposit limit is $1000, you have $400 left.Quote from: BitMaxz on July 05, 2023, 08:21:38 AMWhat country you are living? It seems they don't offer service in the US due to local law according to OKX support post belowUK. But it seems that what happened is not local, but for all accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 05, 2023, 09:08:49 AM",
      "body": "Quote from: hugeblack on July 05, 2023, 08:29:29 AMUK. But it seems that what happened is not local, but for all accounts.That's what I think is the reason why your account froze and ended up forcing you to verify KYC your country is one of the restricted/prohibited locations according to their terms. They don't even have an announcement or inform their customers that they are going to update their terms.Quote from: Ratimov on July 05, 2023, 08:14:09 AMThere are no traps there.If this is not a trap why all posts similar to this issue are hidden and you can't see some posts of other customers from their Twitter you can only see them once you log in (Meaning it's not public).And they don't announce publicly or notify their customers through PM about the changes in KYC requirements and TOS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 05, 2023, 09:50:45 AM",
      "body": "Quote from: BitMaxz on July 05, 2023, 09:08:49 AMThat's what I think is the reason why your account froze and ended up forcing you to verify KYC your country is one of the restricted/prohibited locations according to their terms. They don't even have an announcement or inform their customers that they are going to update their terms.I do not think so. For example, I remember that I submitted my data (without sending documents) some time ago (I do not remember the date, but sometime between March and June) and I was allowed to withdraw up to $5,000. If there was a ban, the UK would not have been shown to me as an option and I would not have been asked to send data.In addition, the data that is required is a copy of the passport and a selfie, which is not related to the country because they did not ask me to prove the address. For example, a British citizen can use the platform if he was in a country that does not have restrictions.Quote from: https://www.okx.com/help-center/3600218136912.2 Note that we may not make all of the Services available in all markets and jurisdictions, and may restrict or prohibit use of all or a portion of the Services from Restricted LocationsNote regions/Locations, not nationalities.Quote from: Ratimov on July 05, 2023, 09:46:57 AMAnd here is the answer from technical support:Can you ask them about the period in which they imposed a $1,000 limit, is it the last 3 months, 6 months, a year, or the total deposits since the date the account was created?Why they didn't show the remaining amount? for example, you withdrew 700 dollars, you have 300 dollars left, please complete KYC L2 to increase the withdrawal limits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "July 05, 2023, 11:18:51 AM",
      "body": "Is it a red flag when in May, this user complained about a problem of withdrawal without KYC 2 level. Back then the lifetime KYC 1 withdrawal limit is $5,000, not $1,000.Quote@okx has frozen withdrawals for users without KYC 2 verification. The platform has implemented $5k lifetime deposit/withdrawal limit for KYC 1 users without prior notification. KYC 1 users can not withdraw their funds without KYC 2 verification.They did not admit any change on their platform in two replies for that tweet, it is vague.If they continued to shady change their Terms of service, change lifetime withdrawal limit for KYC1 from $5,000 to $1,000 and hide information that limit applied for past withdrawals too, they are very shady.Avoid OKX exchange when you have other centralized exchanges too use. This OKX drama reminds the Reminder: do not keep your money in online accountsThey rebranded from OKEX but did not change their shady operations. Wash trading accusationQuoteIt faced several accusations of shady practices in 2018. One is that 90% of the trade volume is fake – boosted by actions like wash trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "July 05, 2023, 01:55:32 PM",
      "body": "Quote from: hugeblack on July 05, 2023, 06:26:21 AMToday, after seeing the news that the OKX platform requires KYC, I logged into my account, and from there a small notice appeared to me that there are limits of $ 1000 (lifetime) for deposits and withdrawals, so I decided to deposit $50 to try it for the last time. After deposits, they directly frozen my account and asked to verify ID/selfie before doing anything.Therefore, if you see a $1,000 limit notice, avoid depositing if you do not intend to complete KYC.Unfortunately, after all this time, this was the end of my experience with OKX.OKX, I had used this platform a couple of times and I never expected the change in terms and conditions without public notice, anyway if they are really doing I won't be surprised if their native token dumps from the top 29th position to the list out of the top 100. The current market capitalization is around $2.5B let's wait and have a look at the changes in the coming days.$1K limit on the withdrawal clearly means they are forcing the KYC on the existing users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 06, 2023, 11:55:42 PM",
      "body": "I have never used them but it seems that this type of limit is going to be the replacement for those that don't really want to comply for KYC. This lifetime thing as a limit is crazy. In the end if you're a religious user of theirs, you'll eventually get to hit that limit and you have no option if you still got funds there but to comply. And based from the other posts about their behavior about changing terms unnoticingly, that's truly a red flag and inconvenience for most users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}