{
  "id": "topic_5400905",
  "title": "vladrel",
  "author": "vladrel",
  "created_time": "May 31, 2022, 07:06:51 PM",
  "content": "I started mining on the browsermine service and wanted to ask if this is a scam, please tell me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400905",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "May 31, 2022, 07:34:53 PM",
      "body": "I just visited the website in question to see how it works. It's a scam. Don't waste your money and time on that website. You can't mine bitcoin just with opening a website in your browser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "May 31, 2022, 08:37:26 PMLast edit: May 31, 2022, 09:49:16 PM by NotFuzzyWarm",
      "body": "FYI ALL 'browser mining' sites per-se are scams for the simple reason that BTC difficulty is far far too high to directly mine using any PC. IF - and that is a big if - a website does actually payout for using it, then they are using your PC for mining a very low difficulty - and very low value - coin such as Monero and convert your 'earnings' into Bitcoin once you have earned enough to do it. Be prepared to wait a very long time for any meaningful income...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 31, 2022, 09:33:23 PM",
      "body": "Scam and complete waste of time and resources. But put that time to go use, and you could earn way more than they promise to pay you. I see 2 negative reviews on their Trustpilot page from what seem to be their two victims so far.QuoteBig fake scam I open they blocked me from accessing my accountQuotecдeлaл зaявкy нa вывoд 40к pyблeй. в итoгe зaявкy oтмeнили и вce дeньги co cчётa cняли.Translated asQuotemade an application for the withdrawal of 40k rubles. As a result, the application was canceled and all the money was withdrawn from the account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 04, 2022, 08:06:12 AM",
      "body": "Quote from: Bitcoin_Arena on May 31, 2022, 09:33:23 PMScam and complete waste of time and resources. But put that time to go use, and you could earn way more than they promise to pay you. I see 2 negative reviews on their Trustpilot page from what seem to be their two victims so far.Making trustpilot negative reviews is usually a waste of time as these scam services are very careful to flood their page with positive reviews while reporting the actual negative reviews as personal threrats. Not sure if those reports ever get processed though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}