{
  "id": "topic_5415007",
  "title": "bitnatiker",
  "author": "bitnatiker",
  "created_time": "September 26, 2022, 07:49:02 PM",
  "content": "Guden liebe Crypto Crewe,der Bitcoin ist das Gold der Cryptoszene allerdings für das tägliche Geschäft auf Grund von Transaktionsgeschwindigkeit und Transaktionsgebühren nur bedingt als Zahlungsmittel und eher als Wertanlage geeignet. Daher meine Frage in die Runde welche Blockchain nutzt du für den Alltag?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415007",
  "comments": [
    {
      "author": "mole0815",
      "created_time": "September 26, 2022, 08:23:14 PM",
      "body": "Welcome back bitnatiker!Diese Frage könnte eine durchaus interessante Diskussion entfachen Aber zuerst musst du noch ein paar Details nennen. Was meinst du mit der Verwendung im Alltag? Kommt darauf an wo man einkauft.Oder meinst du was man selbst akzeptiert? Fragen über Fragen aber unpraktisch ist der BTC nicht",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnatiker",
      "created_time": "September 27, 2022, 12:57:20 AMLast edit: September 30, 2022, 07:15:46 AM by bitnatiker",
      "body": "QuoteDiese Frage könnte eine durchaus interessante Diskussion entfachenAber zuerst musst du noch ein paar Details nennen.Es geht mir vor allem um die Unterteilung der einzelnen Bitcoin Wallets im Alltag, vielleicht etwas falsch ausgedrückt mit Blockchain   eher Software Clients.Quote from: mole0815 on September 26, 2022, 08:23:14 PMWas meinst du mit der Verwendung im Alltag? Kommt darauf an wo man einkauft.Oder meinst du was man selbst akzeptiert?Beides, sowohl beim Einkaufen als auch Privat. Genau wann man z.B. Lightning benutzt usw.QuoteFragen über Fragen aber unpraktisch ist der BTC nichtKeinesfalls was dezentralität betrift unschlagbar. Es ist digitales Gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "September 27, 2022, 02:24:40 PM",
      "body": "Ich habe es mir erlaubt deinen Beitrag zu editieren da ein Zitat gefehlt hat... nicht wundern Und so ganz weiß ich noch nicht auf was es hier rauslaufen wird Also ich verwende im Alltag ehrlich gesagt keine Kryptos. Klar ich hodle BTC und zücke zwischendurch auch Mal die Wirex um ein paar Satoshi auszugeben aber mehr kann ich dazu nicht beitragen.Meine Geschäftspartner bzw. Dienstleister akzeptieren nur FIAT und daher gibt es quasi 0 Berührungspunkte und Erfahrungen im Alltag mit (irgendeiner) Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnatiker",
      "created_time": "September 27, 2022, 03:25:31 PM",
      "body": "Genau darum geht es warum nicht täglich mit Crypto zahlen, es gibt stable Coins (Euro Coin EUROC, wird sogar von der EZB gedeckt) und was manche Händler an Gebühren an Kreditkartenfirmen abdrücken ist auch nicht gerade wenig.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fronti",
      "created_time": "September 27, 2022, 03:48:26 PM",
      "body": "Quote from: bitnatiker on September 27, 2022, 03:25:31 PMGenau darum geht es warum nicht täglich mit Crypto zahlen, es gibt stable Coins (Euro Coin EUROC, wird sogar von der EZB gedeckt) und was manche Händler an Gebühren an Kreditkartenfirmen abdrücken ist auch nicht gerade wenig.Bitcoin Blockchain als Settlement und Lightning für die kleinen täglichen Zahlungen nutzen?Dann muss man sich nicht auf andere blockchains und deren oftmals geringere Sicherheit einlassen.Man bedenke, das bei POW, je schneller Blöcke hereinkommen desto weniger Arbeit wird reingesteckt um Blöcke zu generieren. Daher muss man dann länger abwarten bis alles gesettelt ist und man kann nicht auf z.b. eine Bestätigung bauen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnatiker",
      "created_time": "September 27, 2022, 04:49:25 PM",
      "body": "Du schreibst es, für große Beträge würde ich auch nichts außerhalb von Bitcoin nutzen, allerdings trägt man ja auch nicht sein komplettes Vermögen jeden Tag in der Brieftasche mit sich herum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fronti",
      "created_time": "September 27, 2022, 07:06:56 PM",
      "body": "Quote from: bitnatiker on September 27, 2022, 04:49:25 PMDu schreibst es, für große Beträge würde ich auch nichts außerhalb von Bitcoin nutzen, allerdings trägt man ja auch nicht sein komplettes Vermögen jeden Tag in der Brieftasche mit sich herum.Das Schöne bei Bitcoin ist ja auch, dass man so viele Wallets wie man möchte sich erstellen kann.Dann mach dir doch eine mit den BTC die du mit herumtragen willst / in Lightning binden möchtest und eine andere, vorzugsweise Cold Wallet, auf die du dein erspartest packst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}