{
  "id": "topic_5468024",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "September 25, 2023, 10:34:38 AM",
  "content": "Ever since I joined this forum for the past few months I have learnt alot about Bitcoin and the crypto space. The main reason why this was possible for me was I was always inquisitive and most importantly I also took corrections and sometimes did further research about some  things I was not clear on.This was because I noticed most legendary,Hero and some senior members on this forum don't make replies to threads based on something they read from a random article most times but based on their experience in that particular field of Bitcoin.However some newbies on the other hand lack the ability to settle down to understand the concept of Bitcoin and end up spamming the forum with unnecessary posts like ; https://bitcointalk.org/index.php?topic=5467765.msg62888686#msg62888686His reply https://bitcointalk.org/index.php?topic=5467765.msg62887896#msg62887896 even showed he didn't know what he was talking about but he still kept arguing instead of trying to figure out his errorsNewbies aways try to be inquisitive and take necessary corrections, remember that the easiest way to learn something is to believe you know nothing about it.and hence try to practice it..No one is perfect we all are just trying to get better subsequently.Like the title says ( it's just a friendly advice/reminder)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468024",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "September 25, 2023, 10:47:19 AM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMNewbies aways try to be inquisitive and take necessary corrections, remember that the easiest way to learn something is to believe you know nothing about it.and hence try to practice it..No one is perfect we all are just trying to get better subsequently.Like the title says ( it's just a friendly advice/reminder)One thing I learned from the forum is that once you sign up an account then you should be ready to learn, unlearn and re-learn things that you thought you were really good at. There are a lot of misconceptions out there on the internet and if you’re not properly guided you’ll end up accumulating them and when corrections starts coming you will want to argue and prove your point because of the wrong information you got. But here in the forum if you read some misconceptions and then try to teach it to others, when noticed you’ll be corrected and that’s another thing that makes the forum more interesting. If you’re the type that’s not ready to be corrected or criticized for doing something wrong then I guess Bitcointalk isn’t for you, because you’re surely going to experience some the earlier newbies realize this the better for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 25, 2023, 11:19:30 AM",
      "body": "So you mean everyone in this forum must forced to agree with majority opinions? remember this forum accept freedom of speech, being different isn't a crime.I wonder why you're using a newbie user as your example, when franky1 have been argued about lightning network since a long time ago, I guess scared of high merited account.If you don't like him, just ignore him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 25, 2023, 12:25:48 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMEver since I joined this forum for the past few months I have learnt alot about Bitcoin and the crypto space. The main reason why this was possible for me was I was always inquisitive and most importantly I also took corrections and sometimes did further research about some  things I was not clear on.This may be your own way of how you understand the forum and what you're here to learn, nevertheless, you should know that learning never ends and to whom much is given, also much will be requested back, secondly, know that you're just starting and yet to go far as well, the more you go the clearer you see, with time as you keep growing, much will be demanded of you to also give out to others to benefit from.Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMThis was because I noticed most legendary,Hero and some senior members on this forum don't make replies to threads based on something they read from a random article most times but based on their experience in that particular field of Bitcoin.If you looked in at what you've also said concerning this, that they make replies base onntheir years of experience, i don't know if you ever realized that to become a legendary member in rank, you will have to leave nothing less than 2 years of activeness on this forum together with quality contributions.Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMHowever some newbies on the other hand lack the ability to settle down to understand the concept of Bitcoin and end up spamming the forum with unnecessary posts It is also important to know that not all newbie come to distort the atmosphere of calmness in this, some are well determined to do well and join the lane to prospective future legendary members of The forum, anyone busy spamming or scamming is not going to help them they must get tired of it one day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "September 25, 2023, 12:35:07 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMNewbies aways try to be inquisitive and take necessary corrections, remember that the easiest way to learn something is to believe you know nothing about it.and hence try to practice it..No one is perfect we all are just trying to get better subsequently.Like the title says ( it's just a friendly advice/reminder)Just on how long I have been in this forum, you’re right in your own words and claim about some users and how they should be willing to learn and unlearn in the forum. Just like I agreed with your statement above, another user might disagree with you about it, that should be fine to you because this is a public group and no one is limited to what they can agree and disagree on. You can’t stop people from having different opinions or views about something. Just remember, take the one that works for you and neglect the rest that can’t solve your solution or not needed at that moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "September 25, 2023, 12:53:29 PM",
      "body": "You are very right there is and will always be arguments on different topics however the most important point is that both parties learn something",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 25, 2023, 01:45:33 PM",
      "body": "You can write anything you like for discussions because forum allows freedom of speech. If you disagree, let's discuss. If you feel like it is a trolling thread, ignore it. Don't waste your time for non sense or trolling discussions because it does not go anywhere.I don't think it is necessary to compare you and that poster. Focus on yourself, keep learning and improving yourself. Forum members will notice your improvement if it is organically and naturally.Most knowledge basically can be found in Beginners & Help Encyclopedia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fuso.hp",
      "created_time": "September 25, 2023, 02:53:43 PM",
      "body": "Forum members of any rank can post good quality so you should only read the posts of legendary forum members or Hero, SR members carefully and never ignore the rest of the posts. Sometimes it is seen that even from junior members we get to know a lot of good things which the senior members do not have. Every member in this forum learns something from every other member. There is no age to learn or there is no end to learning. Since new members come to this forum to know or learn, their main focus should be on knowing or learning. It is not the case that a person with higher qualifications will post better than a less qualified person. You try to learn from your position of course you can learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "September 25, 2023, 03:28:52 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMEver since I joined this forum for the past few months I have learnt alot about Bitcoin and the crypto space. The main reason why this was possible for me was I was always inquisitive and most importantly I also took corrections and sometimes did further research about some  things I was not clear on.This was because I noticed most legendary,Hero and some senior members on this forum don't make replies to threads based on something they read from a random article most times but based on their experience in that particular field of Bitcoin.However some newbies on the other hand lack the ability to settle down to understand the concept of Bitcoin and end up spamming the forum with unnecessary posts like ; https://bitcointalk.org/index.php?topic=5467765.msg62888686#msg62888686His reply https://bitcointalk.org/index.php?topic=5467765.msg62887896#msg62887896 even showed he didn't know what he was talking about but he still kept arguing instead of trying to figure out his errorsNewbies aways try to be inquisitive and take necessary corrections,  Remember that the easiest way to learn something is to believe you know nothing about it.and hence try to practice it..No one is perfect we all are just trying to get better subsequently.Like the title says ( it's just a friendly advice/reminder)Op you mention the right issue or problem that nowadays performing in the forum. Bitcoin is a very complex system and you can't learn it itself in fact you have to cooperate with your seniors on this forum and take benefits from them. I am especially recommending this to the newbie and to the Jr members before sharing anything on this forum make sure that is reliable and from an authentic source and DYOR before posting it here because many other beginners also read that and they may consider it right so what will happen if he is misguided and do the wrong things. So it's necessary to double-check what you are sharing and also not argue with the experienced one as they have more knowledge and experience than you so what they say maybe would be right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 25, 2023, 03:34:09 PM",
      "body": "Yup, I don't rarely share anything I post by looking at or reading from an article. I have been reading so many topics every day and the replies from some of the active forum members teach me so much that I no longer have to spend my time on Crypto Twitter or other news websites. And one can surely get their information improved for anything related to Crypto or Bitcoin by making a thread on the forum and people here will make sure you get your answer. The best Bitcoin community in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 25, 2023, 03:49:14 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMNewbies aways try to be inquisitive and take necessary corrections, remember that the easiest way to learn something is to believe you know nothing about it.and hence try to practice it..No one is perfect we all are just trying to get better subsequently.Like the title says ( it's just a friendly advice/reminder)The one who is stubborn and wants to stay on the path even if that's the wrong one then the total loss is of that stubborn person. You my friend have made a good choice of not becoming one. Because those who wish to learn new things have to eliminate the factor of introversion and also the factor of stubbornness. Both things, will not let one person (Newbie) learn new things and will stop them and will cause a lack or over confident respectively. I was also a newbie but I never stayed on my point which is wrong instead I was open to all mouths, and always listened to all opinions, not only on BTT but in my real life too. Because I have a cousin who used to say, listen to everyone but do only what you find more good for you. It also does not mean doing whatever you want even it's not good. You have made a good topic to help newbies to understand a critical point that they lack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 25, 2023, 03:58:52 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMHowever some newbies on the other hand lack the ability to settle down to understand the concept of Bitcoin and end up spamming the forum with unnecessary posts like ; https://bitcointalk.org/index.php?topic=5467765.msg62888686#msg62888686His reply https://bitcointalk.org/index.php?topic=5467765.msg62887896#msg62887896 even showed he didn't know what he was talking about but he still kept arguing instead of trying to figure out his errorsYou are trying to generalise by giving as an example the particular case of a particularly stubborn person who is determined to make a fool of himself by defending arguments on grounds that are obviously false to anyone who knows a little about how bitcoin transactions work. Humility and willingness to learn and share what you know I would say is the key to a good use of the forum but what you say is too exaggerated:Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMremember that the easiest way to learn something is to believe you know nothing about it.and hence try to practice it..NThere are many people who have a lot of knowledge before joining the forum and can start contributing from day one, look at people like n0nce or PowerGlove. The difference with the case you put is that they don't defend obviously false arguments to the point of hideous ridicule.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "September 25, 2023, 04:24:35 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMEver since I joined this forum for the past few months I have learnt alot about Bitcoin and the crypto space. The main reason why this was possible for me was I was always inquisitive and most importantly I also took corrections and sometimes did further research about some  things I was not clear on.This was because I noticed most legendary,Hero and some senior members on this forum don't make replies to threads based on something they read from a random article most times but based on their experience in that particular field of Bitcoin.However some newbies on the other hand lack the ability to settle down to understand the concept of Bitcoin and end up spamming the forum with unnecessary posts like ; https://bitcointalk.org/index.php?topic=5467765.msg62888686#msg62888686It is impossible for them to reply on every topic based on experience without reading every book and article. They definitely reply to every post based on these two factors. What's unique about them is that they don't force every reader of their topic to hear and agree with it.Activity + Trust + Earned Merit == The Most Recognized Users on BitcointalkThe factoids message that appears under your topic when I open it could be the answer for you in my opinion. I see myself as still a beginner in many disciplines of knowledge about bitcoin, crypto and forums compared to seniors with disciplines of knowledge who I can follow in every discussion.The number of activities and posts owned by those with the highest rankings are all useful - useful for users like me, except for a small percentage that are jokes between each other in discussions so it doesn't surprise me to see the amount of earned merit and trust attached to each profile account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "September 25, 2023, 06:07:42 PM",
      "body": "We argue to learn, not to prove that someone's word is incorrect or correct. A higher or lower rank member of the forum can stand to correct one another as far as crypto is concerned. Upon that, I have yet to see anyone saying that, he knows it all as far as crypto knowledge is concerned. From what I have gathered so far from crypto knowledge and exposure, We keep learning and never stop learning about crypto in a single day. In our process of learning, we keep impacting ourselves with the knowledge of crypto, irrespective of rank. You shouldn't take it that higher rank members' words about crypto are always correct and it is not to be argued upon to get more insight about the subject at hand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 25, 2023, 10:06:14 PM",
      "body": "If we just take what only the higher ranking users say as the truth alone about some subjects, then it shows we don't make our own research. No man's an island of information and ideas that's why we are on a platform like this to exchange and compare them.  One thing you should understand is that some newbies do not necessarily want to get the knowledge of crypto on this forum, some are after the bounty campaigns, and so focus more on creating threads that may fetch the merits more than ones that may expand their knowledge on crypto. Some go as far creating posts that say the same thing twice, only difference is the topic may not be the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "September 25, 2023, 10:12:32 PM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AM.This was because I noticed most legendary,Hero and some senior members on this forum don't make replies to threads based on something they read from a random article most times but based on their experience in that particular field of Bitcoin.Don’t only read the posts of high-ranking members; read other posts to acquire more knowledge. If you really want to learn something, you don’t need to specify who will teach you. As far as you are already in the learning process or in the learning environment, all you need to do is focus. However, you can also read what other ranks are posting here because they also have some content that is helpful for every rank here, so when you neglect some of their posts, you may learn something that you also need to know, and that is why you will see some threads created by newcomers but high rank members full of helpful Because nobody is perfect and you may know something another person will not, irrespective of age or time you have spent on the forum, we may have a newcomer that will know something about this crypto space that someone who has spent time here has not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 25, 2023, 10:41:13 PM",
      "body": "There are newbies that are literally new to the forum but not in specific niche and industries that they've been working it. I believe that it's okay to think that you've got no knowledge if you really are new to it. But let's also be open that many of the newbie ranks could have their own expertise somewhere that we don't know. The forum ranks and status are from here and how long we've been here but it doesn't mean that the newbies are also newbies in the fields that they're good from. It's good to see topics made by the new ones and giving lessons and learning based from their experience. What matter here is the respect from all types of ranks regardless of the discussions that they're engaging as long as it's not offensive and not hurting someone's feeling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 26, 2023, 11:28:52 AM",
      "body": "OP, in your case, it would be more correct to create a topic about not feeding the troll. But you presented yourself as superior and created a thread that only helps spread the troll's nonsense. On the other hand, everyone present here can create any topic and start discussion and debate. After all, where can we see the truth if not by arguing with other participants? The reminder in the thread for newbies to remember to study reminds me personally of a nursing home where they remind the elderly every hour to go to the powder room on time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "September 26, 2023, 11:43:19 AM",
      "body": "Quote from: Mia Chloe on September 25, 2023, 10:34:38 AMThis was because I noticed most legendary,Hero and some senior members on this forum don't make replies to threads based on something they read from a random article most times but based on their experience in that particular field of Bitcoin.To have experience, they had to read a lot articles, guides, analysis, on chain metrics and spent years for experience. They don't make posts without knowledge, experience and reading.Their posts can have links to articles, figures or onoy have text but it contains some facts about Bitcoin.If you leave a link to an article with low quality, it does not help your post to have better quality. Quality is from what you write.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "September 26, 2023, 12:40:27 PM",
      "body": "As a new beginner here, one must be very much inquisitive to know more as that is what steers one up to learn. Being inquisitive helps a lot because when you choose the right path to learning, you must definitely be gaining more knowledge and experience but you must be focused and pay attention when the learning.There are lots of things you could learn while you enjoy your stay here. Reading through this platform you could see for yourself alot of things to be learnt which is very much of benefit if you must continue your stay here and your journey into the Bitcoin ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}