{
  "id": "topic_5423846",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "November 27, 2022, 07:45:32 PM",
  "content": "Hi everyone,If you are a metamask wallet user, then I think it is important that you know this and know that your privacy is at-stake.MetaMask in its recent update to their privacy policy has announced to their users that soon, they will start collecting IP addresses as well as wallet address associated with the IP address. The company however explained that the collection of users’ data will only apply if they use MetaMask’s default Remote Procedure Call (RPC) application called Infura. ConsenSys added that individuals who use their own Ethereum node or a third-party RPC provider with MetaMask will not be subject to the changes in the privacy policy. NOW, HERE IS THE MOST IMPORTANT PART OF THIS DEVELOPMENT...The firm added that information gathered may be disclosed to affiliates, during business deals, or may be used to comply with Know Your Customer and Anti-Money Laundering requirements.MY OPINION This is a total breach of users privacy and I think it is time to Uninstall metamask if your privacy is paramount to you - My personal opinionDetails went further, Read more Here.Are you a metamask user? What is your opinion about this development?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423846",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 27, 2022, 08:23:20 PM",
      "body": "Meramask is an altcoin wallet that does not support bitcoin at all, which means this thread supposed to be on an altcoin board, not bitcoin board.Is metamask wallet not a light client wallet? Even it is a web extension. I do not know much about how altcoin works, if you are not running your own node, no privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 27, 2022, 08:33:15 PM",
      "body": "Heh... open-source wallet succumbing to KYC and data harvesting? Did they not learn anything from the mass exodus from exchange accounts ever since the FTX crash?The KYC part would be difficult to enforce since Metamask is a non-custodial wallet. But it is also a terribly insecure one at that, because it is built right into the browser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "November 27, 2022, 11:36:50 PM",
      "body": "They have been collecting people's data anyway the whole time they have been operating, only that people didn't notice it, perhaps.Look at the archived version of the privacy policy from last year for example (http://web.archive.org/web/20210414104013/https://consensys.net/privacy-policy/)They probably just made a few specifications that whoever uses their default RPC will have their data collected",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 29, 2022, 07:15:49 AM",
      "body": "Looks like I need to stop using it. I never use / trade altcoin anyway these days, so it doesn't really bother me. I just hope interaction with a hardware wallet will be easier in the future so retail users will use hardware wallets directly instead of connecting to a wallet like MetaMask. Privacy is not an equal exchange to convenience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 30, 2022, 04:54:15 PM",
      "body": "One simple thing that I hope people should have concerned about is that if you did not own or control fully the way you access your cryptocurrency, you should be expected that there is a degree of privacy to be taken out. For example, one must know that by design if you did not own the node or RPC, there is no technical way to prove they did not violate user privacy, in another word, they technically can log your interaction.Contrary to your opinion, theoritically it's not a breach of user privacy, instead, it's rather a user awareness that they should comprehend the privacy issue about themselves, without regard to any app/tools/third-party RPC that they use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nola Gloria",
      "created_time": "December 01, 2022, 02:48:52 AM",
      "body": "They also argue that it (collecting IP) will not collect personal data such as credit card details and passwords. In addition, it added that it will not sell user data to third parties. However this is unbelievable.I think this wrong step could result in a sharp decrease in the number of users of MetaMask on Google Chrome, which is widely regarded as one of the most secure browser extensions for cryptocurrency wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 01, 2022, 02:14:45 PM",
      "body": "Quote from: Fivestar4everMVP on November 27, 2022, 07:45:32 PMAre you a metamask user? What is your opinion about this development?. Yes, I have been a user of the MetaMask wallet for many years, and this development has sparked controversy among the users of the wallet. Some of them see that MetaMask’s privacy has become exposed after they claimed that MetaMask collects IP addresses. Those responsible for the MetaMask wallet have confirmed that the new update does not contain very private information, only information is collected related to the mechanism of WEB3 work. Frankly, I see that after this development, MetaMask will lose its popularity and users’ trust in it, and users will transfer their cryptocurrencies to a cold wallet or another wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "merekamo",
      "created_time": "May 24, 2023, 07:41:08 AM",
      "body": "I don't problem about that. Recent update to MetaMask's privacy policy regarding the collection of IP addresses and wallet addresses can be concerning for users who prioritize privacy. While the company has explained that this data collection will only apply to those using MetaMask's default Infura RPC application, it still raises questions about the need for such information and how it may be used in the future.The point is, that users who utilize their own Ethereum node or third-party RPC providers will not be affected by these changes. However, the fact that collected information may be disclosed to affiliates or used for KYC and AML requirements can be alarming for some users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}