{
  "id": "topic_5423456",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 26, 2022, 11:27:29 PM",
  "content": "QuoteACCRA (Reuters) -Ghana's government is working on a new policy to buy oil products with gold rather than U.S. dollar reserves, Vice-President Mahamudu Bawumia said on Facebook on Thursday.The move is meant to tackle dwindling foreign currency reserves coupled with demand for dollars by oil importers, which is weakening the local cedi and increasing living costs.Ghana's Gross International Reserves stood at around $6.6 billion at the end of September 2022, equating to less than three months of imports cover. That is down from around $9.7 billion at the end of last year, according to the government.If implemented as planned for the first quarter of 2023, the new policy \"will fundamentally change our balance of payments and significantly reduce the persistent depreciation of our currency,\" Bawumia said.Using gold would prevent the exchange rate from directly impacting fuel or utility prices as domestic sellers would no longer need foreign exchange to import oil products, he explained.\"The barter of gold for oil represents a major structural change,\" he added.The proposed policy is uncommon. While countries sometimes trade oil for other goods or commodities, such deals typically involve an oil-producing nation receiving non-oil goods rather than the opposite.Ghana produces crude oil but it has relied on imports for refined oil products since its only refinery shut down after an explosion in 2017.Bawumia's announcement was posted as Finance Minister Ken Ofori-Atta announced measures to cut spending and boost revenues in a bid to tackle a spiraling debt crisis.In a 2023 budget presentation to parliament on Thursday, Ofori-Atta warned the West African nation was at high risk of debt distress and that the cedi's depreciation was seriously affecting Ghana's ability to manage its public debt.The government is negotiating a relief package with the International Monetary Fund as the cocoa, gold and oil-producing nation faces its worst economic crisis in a generation.https://finance.yahoo.com/news/ghana-plans-buy-oil-gold-150718243.html....It seems the FOREX exchange rate between the US dollar and native ghana ceti is widening. Ghana is opting to purchase refined oil products using gold, to avoid losses associated with a strong dollar and their weakening native currency. I'm not certain if that can accurately be labeled a decline of the petro dollar. That may be a clickbait headline moreso than an accurate one.While many nations have sought to implement so called \"de dollarization\" strategies over the years. Ghana's motive here appears to be avoiding FOREX exchange rates rather than de coupling from the US dollar.But it does raise a question of whether economies of foreign nations are also being hurt by exchanges rates as the US dollar remains strong on FOREX markets, while other currencies devalue.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423456",
  "comments": [
    {
      "author": "jackg",
      "created_time": "November 27, 2022, 01:08:26 AM",
      "body": "The dollar looks like it's only doing well against the euro (unless I've missed something).The dollar against the pound and the yuan are either at the same levels they've been over the past 5 years (the pound) or much stronger (the yuan).The Petro dollar might not be holding to its title quite like it'd have expected (I'm not sure why the pound shot back up or why the yuan is bullish but they're probably both linked to China, Japan and countries following them trying to decouple themselves from the US economy by selling bonds).I'd expect Danish Krona and Norwegian Krona to have been particularly bullish now since they've both got reliable and strong energy supplies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "November 27, 2022, 02:19:23 AM",
      "body": "Quote from: jackg on November 27, 2022, 01:08:26 AMThe dollar against the pound and the yuan are either at the same levels they've been over the past 5 years (the pound) or much stronger (the yuan).I know someone who travelled to colombia maybe 6 months ago. In the time they've been there the FOREX exchange rate between the US dollar and colombian peso has plummeted.https://www.xe.com/currencycharts/?from=COP&to=USDWhile it works in favor of US travellers, it is terrible for foreign businesses and nations on the losing side of the exchange.Here's the exchange rate for the ghanian ceti is anyone is interested:https://www.xe.com/currencycharts/?from=GHS&to=USD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "November 27, 2022, 03:38:43 AM",
      "body": "QuoteIf implemented as planned for the first quarter of 2023, the new policy \"will fundamentally change our balance of payments and significantly reduce the persistent depreciation of our currency,\" Bawumia said.They aren't alone. It simply is not moral for a country to hold any assets which depreciate at near double digits. USD was alleged to have been the stable asset when the reality of such \"stable asset\" like fiats are a fixed depreciation rate of 1-2% on a good year, and near double digit depreciation on a bad year.Gold is better than USD, crypto is better than them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "November 27, 2022, 04:06:27 AM",
      "body": "Quote from: Gyfts on November 27, 2022, 03:38:43 AMGold is better than USD, crypto is better than them all.Cryptocurrency is not better than gold and USD in this case, it is a volatile asset so it is only suitable for investment and speculation, not suitable as a means of payment. A country's budget should be stored with a stable asset to avoid unexpected fluctuations.Ghana is doing the right thing by choosing gold as an alternative to the USD, hopefully other countries will do the same in the future. The world needs a certain balance, it is impossible for one country to rule everything. They are using the strength of the dollar to export inflation around the world, that needs to stop soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 27, 2022, 04:20:21 AM",
      "body": "With everything that is happening, it's a good move to move away from USD to make sure that the value that you have for your money is maximized. I'm expecting a lot of other countries to follow suit regarding this. Since it's pretty uncommon right now, I don't expect it to be done immediately, but once they see the effects, it's worth it if that's the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 27, 2022, 06:38:41 AM",
      "body": "I'm not sure with other nations, but my country is surely hurt by the rising US dollar. The bullish USD means rising import costs for us. And since my country highly relies on imports, we're strongly hit. This is one of the main reasons why the prices of goods here are rising no end. We're an import-reliant country; even the most basic of food here we import from other countries. We import rice. We import fish. Hell, we even import sugar and salt. And we also import oil. If the cost of oil rises, everything follows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "November 27, 2022, 09:40:44 AM",
      "body": "Ghana was once called Gold Coast, maybe they still have large deposits of gold. The dollar has been a weapon of imperialism and a medium of control. If the government of Ghana sees the prospect of gaining the economic advantage of trading with gold they should go ahead with the policy. If this policy favors Ghana other countries might also adopt the policy and it might weaken the dollar. But the Ghanaian government should be ready for attacks, blackmail, and opposition if this policy affects the dollar negatively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "November 28, 2022, 09:22:07 AM",
      "body": "This move by the Ghanian government is a wise move because it would be quite foolish to still use the dollar to purchase oil with the dollar since alongside the naira, it is rated as the worst performing currency; losing 55% of its value. The gold used to purchase oil could help restore their economy and also tackle dwindling foreign currency reserves and at least guard against exchange rate from affecting the price of fuel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "November 28, 2022, 03:57:54 PM",
      "body": "There is an important question. Does Ghana have an agreement with the US to only use US dollars? If they do, and if the agreement hasn't been broken by the US already, they might be in trouble with the US military.Notice how the US, and particularly the CIA, infiltrated the Ukrainian government starting in 2014, so that they could steal the government from the people through election fraud. In the same way Ghana governing officials might be threatened without their knowing it if they break an agreement with the US.And it's the same with any nation.Russia has their former KGB people, one of which is Putin, who know how to thwart the CIA. But other nations don't have this strength.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "November 28, 2022, 08:34:37 PM",
      "body": "Quote from: Fiatless on November 27, 2022, 09:40:44 AMGhana was once called Gold Coast, maybe they still have large deposits of gold. The dollar has been a weapon of imperialism and a medium of control. If the government of Ghana sees the prospect of gaining the economic advantage of trading with gold they should go ahead with the policy. If this policy favors Ghana other countries might also adopt the policy and it might weaken the dollar. But the Ghanaian government should be ready for attacks, blackmail, and opposition if this policy affects the dollar negatively.I don't even understand exactly what you are saying so if I should do understand it is the difference of your explanation that means will you have to break it down stanza by stanza I have seen Ghana and goldcoaster and I found it very difficult to understand the simple explanation of yours I think I need a brief explanation concerning this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}