{
  "id": "topic_5420652",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "November 12, 2022, 10:24:35 AM",
  "content": "A quick update about FTX exchange.There is an hack going on with FTX apps right now, pls do not update.Hackers are moving out funds using eth domain names.People's fund are now showing zero.What do you think is happening? Here is my thought.This looks like an inside job, Sam might be the culprit here, trying to take what he still can and run away. I already heard he is on the run with his private jet. Centralised Finance have failed horribly, it's time to get used with DeFi, do danger 🚸 still lurks in DeFi world too, always DYOR. I feel so sad for everyone that got caught in this mess, and we that never used FTX for trading shouldn't consider ourselves as smart ass, this can happen to anyone, stay strong and build, I mean it's crypto, you can still get your money back in other ways.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420652",
  "comments": [
    {
      "author": "Accardo",
      "created_time": "November 13, 2022, 01:26:50 PM",
      "body": "“Behind every great fortune there is a crime\" - Balzac. The CEO of FTX is a con star, he had an interview last year that portrayed him as frugal and a giver to the needy. I'm surprised to see he has a private jet, but in the video, when he was asked why he drives a small car, he claimed that he preferred owning a Toyota corrolla car to buying a Ferrari. On the whole, he created the video to deceive people and lured them to see him as an accountable man. Therefore, gaining trust. There is more to this Scam! It'll unravel soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 13, 2022, 02:46:13 PM",
      "body": "There are at least 20 threads on this topic all over the forum, and you opened another one in a board that should have nothing to do with the specific case - does that make sense to you?It's not that no one warns that it's not smart to keep your coins on exchanges, or invest in worthless tokens - why should you or I feel bad that someone makes stupid decisions? Most of these people will repeat the same thing as soon as some new super crypto exchange opens and some new genius starts printing his miracle tokens out of nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "November 13, 2022, 03:03:42 PM",
      "body": "a similar thread has also been created on the Bitcoin Discussion board. and I think the contents of the discussion will remain focused on the same discussion. and looks like it's going to be repeated over and over again.FTX has been hacked, delete the app, don't go to websiteI understand this news is huge and it is still a hot topic of discussion in the crypto community. that's why members are also interested in bringing up the same topic.but I suggest the OP lock this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 14, 2022, 08:25:15 AM",
      "body": "Quote from: Crypt0Gore on November 12, 2022, 10:24:35 AMThis looks like an inside job, Sam might be the culprit here, trying to take what he still can and run away. I already heard he is on the run with his private jet. I doubt that he will be in jail or crucify by the government. As far as I know Sam is also one of the donor on Bidens campaign fund during before time. As much as we wanted it, there could be some hindrance for it. They will definitely not touch their cow right?With ftx hacked. You could say this is a plan motive as well. We dont know what would happened. But the victims here are the users of FTX got trapped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "November 14, 2022, 08:39:55 AM",
      "body": "Quote from: Lucius on November 13, 2022, 02:46:13 PMThere are at least 20 threads on this topic all over the forum, and you opened another one in a board that should have nothing to do with the specific case - does that make sense to you?It's not that no one warns that it's not smart to keep your coins on exchanges, or invest in worthless tokens - why should you or I feel bad that someone makes stupid decisions? Most of these people will repeat the same thing as soon as some new super crypto exchange opens and some new genius starts printing his miracle tokens out of nothing.How do you expect me to know that others have created this type of topic already? After getting the information on Twitter I quickly rush on here to post this. Sigh! I was only trying to warn those that still have FTX app on their phone, hoping and waiting that someone will come to FTX's rescue, this comment is mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 14, 2022, 08:49:32 AM",
      "body": "Quote from: Crypt0Gore on November 14, 2022, 08:39:55 AMHow do you expect me to know that others have created this type of topic already? After getting the information on Twitter I quickly rush on here to post this. Sigh! You're not the fastest user who give update about FTX, this user is more faster 3 hours than your post and he's always giving update from the early news where CZ want to liquidate FTT tokens. Also this forum actually doesn't allow user who create same discussion that has been posted before, the other thread except the first one should be locked.You can bump the other thread that discuss about FTX issue, there's no problem with it rather than create a new thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 14, 2022, 08:51:45 AM",
      "body": "Quote from: Crypt0Gore on November 14, 2022, 08:39:55 AMHow do you expect me to know that others have created this type of topic already? After getting the information on Twitter I quickly rush on here to post this. Sigh! You can use the forum search option, or just look in the Bitcoin discussion board/Exchanges board or any other board - what do you think if everyone acted exactly the way you do? Don't get me wrong, your intention is good, but considering that we already have dozens of discussions on the same topic, this one was not necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "November 14, 2022, 10:22:16 AM",
      "body": "Quote from: Crypt0Gore on November 14, 2022, 08:39:55 AMHow do you expect me to know that others have created this type of topic already? After getting the information on Twitter I quickly rush on here to post this. Sigh! If you want to find out if other people have posted similar topics, simply search for them using the forum search option or Google.The following two topics may be useful:A Complete Guideline to use forum search button properly[Tips] Guide for forum searchBesides, many topics related to the FTX fiasco are featured on the first page of their respective boards. It only takes a few seconds to glance through existing topics before starting a new one.Quote from: Crypt0Gore on November 14, 2022, 08:39:55 AMI was only trying to warn those that still have FTX app on their phone, hoping and waiting that someone will come to FTX's rescue, this comment is mean. But you just repeated what was already known while adding some unconfirmed details (for example, according to currently available information SBF is reported to be under house arrest; and not considered a fugitive). Please don't consider this comment mean-spirited; it is intended as sincere advice and as encouragement to make the most of your participation in this community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}