{
  "id": "topic_5412415",
  "title": "gm786",
  "author": "gm786",
  "created_time": "September 05, 2022, 06:51:39 AM",
  "content": "Seeing the presence condition of world many people are working online and earning alot money as compair to physical job. some people who dont know online skill, Is there any future for them?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412415",
  "comments": [
    {
      "author": "_act_",
      "created_time": "September 05, 2022, 06:55:14 AM",
      "body": "There are still many offline jobs, the world can not completely go online, that is not possible. But better jobs are for the literates, not those that are not literate, anyone that goes to school would know how to handle a computer and also know about any online job he or she is involved in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 05, 2022, 07:21:25 AM",
      "body": "Quote from: gm786 on September 05, 2022, 06:51:39 AMSeeing the presence condition of world many people are working online and earning alot money as compair to physical job. some people who dont know online skill, Is there any future for them? Are you talking about entrepreneurship (which is not for everyone), or gimmicks like completing surveys and watching ads, dropshipping, etc which won't make a profit for everybody?I don't see people being jobless to automation. People learned to work with mechanical machines as part of their job skills, it's a no-brainer that they will need IT skills to work with the computers as part of their jobs as well. We just have to make it easier for them to learn IT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "September 05, 2022, 07:54:33 AM",
      "body": "The world and life are not always rosy. You must have explore the world, experience your life with ups and downs.To prepare for bad days, you must make your preparations for it when life is easy and rosy. You will have more time to learn more knowledge, practice more skills etc. It will be your advantage than others who don't have such preparations.When black swan events like Covid-19 or Russia-Ukraine war occur, you have advantage to find jobs than others if you have enough skills to do multiple tasks at the same time. Employers would like to hire employees who can do multiple things rather than people who can do only one type of task.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 05, 2022, 08:14:10 AM",
      "body": "we are humans and dependent physically. anyone without a skill will easily learn it in just a week with some tutorials they could find on youtube. when a person hit rock bottom, he won't care what other people say.  he'll just do all he can to make money even a little as possible. it may be hard to shift offline to online though. it just a matter of time to get by. it they can't make it online, go back to offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 05, 2022, 03:20:09 PM",
      "body": "Quote from: NotATether on September 05, 2022, 07:21:25 AMAre you talking about entrepreneurship (which is not for everyone), or gimmicks like completing surveys and watching ads, dropshipping, etc which won't make a profit for everybody?I don't see people being jobless to automation. People learned to work with mechanical machines as part of their job skills, it's a no-brainer that they will need IT skills to work with the computers as part of their jobs as well. We just have to make it easier for them to learn IT.In the UK quite a lot of the high paid skilled jobs went remote pretty quickly at the onset of the pandemic and a lot of them still seem to be remote (it's cheaper and less effort for both the employer and the worker). There's a lot of rumours around that many employers of lower skilled jobs are trying to keep them in offices though to artificially make the commodity worthwhile and saught after to other investors if they want to sell or have a large portfolio of offices that can't be used for anything else.There will most likely always bee offline work needed though as has been said above. The pensioner's who don't want to use an app will still go up to the bar and want to be served by a person.Hotels will still need security and concierge staff too that have to work at the premises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}