{
  "id": "topic_5435965",
  "title": "Edwardard",
  "author": "Edwardard",
  "created_time": "January 19, 2023, 02:32:45 AM",
  "content": "According to a report made by cointelegraph a few hrs ago, Genesis (a cryptocurrency lending firm) is about to file for bankruptcy as early as the upcoming week.What would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?Eager to know what most of the ppl think.Personally I didnt use genesis ever myself",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435965",
  "comments": [
    {
      "author": "LDL",
      "created_time": "January 19, 2023, 02:48:03 AM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMWhat would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?Eager to know what most of the ppl think.Personally I didnt use genesis ever myself It would not be wrong to consider 2022 as a bloody chapter in cryptocurrency.  But at the beginning of the new year 2023, there was a massive correction in the Bitcoin market. The Bitcoin market went from $16,000 to about $21,800.  But the Genesis Bankruptcy is undoubtedly going to be the first cryptocurrency-related disaster of 2023.After last year's FTX scandal, there is generally a fearful situation between holders and investors.  Generally investors and holders have lost faith in centralized exchanges.  Now if an unexpected event like Genesis Bankruptcy happens then the crypto currency market will have a huge impact.Genesis Broker has already filed all bankruptcy filings.  Various news portals have already carried this news on their headlines.coindeskBloombergMarketWatch",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "January 19, 2023, 02:49:24 AM",
      "body": "The impact of FTX collapse on its ecosystem and related companies is not new. Genesis was predicted to be one of victims of FTX fiasco. What happened with Genesis is not surprising at all. I believe the impact of FTX and FTT collapses were already reflected on cryptocurrency market in generally.News like this will not have big impact like months ago because people are already prepared about that. Who lost money already lost. Who caught the falling knife already did it and had their loses too.Bitcoin after 2 weeks of a mini bull run has come to a time for correction. Such news related to FTX, Genesis or any kind of fud released in this time are only helpful reasons to make Bitcoin corrections more legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "January 19, 2023, 03:34:09 AM",
      "body": "Quote from: hd49728 on January 19, 2023, 02:49:24 AMThe impact of FTX collapse on its ecosystem and related companies is not new. Genesis was predicted to be one of victims of FTX fiasco. What happened with Genesis is not surprising at all. I believe the impact of FTX and FTT collapses were already reflected on cryptocurrency market in generally.News like this will not have big impact like months ago because people are already prepared about that. Who lost money already lost. Who caught the falling knife already did it and had their loses too.Bitcoin after 2 weeks of a mini bull run has come to a time for correction. Such news related to FTX, Genesis or any kind of fud released in this time are only helpful reasons to make Bitcoin corrections more legit.This is the right way to understand this, if this has happened months ago its impact would have been stronger, but since the confidence in centralized businesses has been lost already and many investors predicted that Genesis will be in trouble and they will go bankrupt due to the collapse of FTX this should diminish the impact of this news in a significant way.Right now the price seems to be mostly unaffected as we are still above 20k, however it will be interesting to see if the current price can be maintained once the bears launch their attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "January 19, 2023, 04:09:50 AM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMAccording to a report made by cointelegraph a few hrs ago, Genesis (a cryptocurrency lending firm) is about to file for bankruptcy as early as the upcoming week.What would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?Eager to know what most of the ppl think.Personally I didnt use genesis ever myself Nah, I think it's better to just continue to hodl and accumulate, although the price goes on a bit of correction from $21,500 to $20,600-$20,700, I don't see it as the main reason for this minor correction.It could be that $21k is the barrier that we need to break again and maintain.We know that the market reacts to negative news, but I don't think this is as big as the FTX collapse, as you have said, you didn't used genesis and I think majority here as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "January 19, 2023, 04:31:35 AM",
      "body": "Impact on btc? Obviously btc will survive like how it did before in similar circumstances. However the prices may take a big hit. Maybe $15k happens again in the upcoming weeks. It is probably a good idea to wait for a better price if you are thinking about making purchases nowadays.Genesis, ftx, mtgox, cryptsy these companies come and go but btc outlives them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 19, 2023, 05:00:47 AM",
      "body": "Unless Genesis has some coins to sell, I don't think this would affect the markets that much knowing that people were pretty much expecting this anyway.And yes, while we had a red day, I think it wasn't necessarily caused by this news. We simply just had a good price increase in a week that this might just be a good correction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NicNacCoin",
      "created_time": "January 19, 2023, 05:19:51 AM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMAccording to a report made by cointelegraph a few hrs ago, Genesis (a cryptocurrency lending firm) is about to file for bankruptcy as early as the upcoming week.What would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?Eager to know what most of the ppl think.Personally I didnt use genesis ever myself I ended the year 2022 with a lot of dumping. 2022 has seen some unexpected events in this cryptocurrency. First came the massive dumping of the cryptocurrency market with the Luna platform scandal. Investors and traders suffer huge losses in this Luna platform scam. As the bad market conditions continued, FTX bankruptcy came again. Investors and traders are also the most affected by the FTX exchange platform bankruptcy. After ending the year 2022 with so many losses, we got some good side of the market by closing the curtain in 2023. Every time the market started to pick up a bit, another piece of bad news came. And the bad news is Genesis Bankruptcy. This definitely has some impact on the market. And because of this, the market has been somewhat dumping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "January 19, 2023, 05:41:05 AM",
      "body": "A whole industry does not collapse when a single exchange or broker goes bankrupt ...and this was not a sudden development, so the markets will have been aware of this for months already. The bankruptcy will be in the news when it actually happens and the markets would have factored it in, before it happens. The competitors will have a field day with this... and they will spread \"DOOMSDAY\" predictions to feed their agenda... as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 19, 2023, 06:12:57 AM",
      "body": "Quote from: hd49728 on January 19, 2023, 02:49:24 AMThe impact of FTX collapse on its ecosystem and related companies is not new. Genesis was predicted to be one of victims of FTX fiasco. What happened with Genesis is not surprising at all. I believe the impact of FTX and FTT collapses were already reflected on cryptocurrency market in generally.News like this will not have big impact like months ago because people are already prepared about that. Who lost money already lost. Who caught the falling knife already did it and had their loses too.correcta genesis bankruptcy has always been in the planning for monthsDCG just needed a few months to shuffle assets around and make DCG a future creditor of genesis(genesis owes DCG). genesis loaned DCG funds which previously would have needed to be clawed back(DCG pay back to genesis). but they wrote a promissory note to take on fictitious genesis debt to make DCG the creditor(DCG no longer owes genesis, but now genesis owes DCG) should genesis die thus making genesis then owe DCGonce all shuffling is done to put all debt into genesis and make DCG be owed sums. ofcourse they were going to bankrupt genesis rather then funding genesis.. Quote from: hd49728 on January 19, 2023, 02:49:24 AMBitcoin after 2 weeks of a mini bull run has come to a time for correction. Such news related to FTX, Genesis or any kind of fud released in this time are only helpful reasons to make Bitcoin corrections more legit.incorrect.. its too early to call a bull nor mini bull or a correction from said minibullits just normal sea level tides of normal waves..until the whales stop their small resistance lines which are preventing normal speculative price growth. its just small waves between $15k-$24k.. like the last 9 monthsthese small movements of the tide are nothing in comparison to real bull and bear market movementsdont get emotional/trying to find reasons for a small tide change from $21.5k to $20.5k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "January 19, 2023, 06:14:24 AM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMAccording to a report made by cointelegraph a few hrs ago, Genesis (a cryptocurrency lending firm) is about to file for bankruptcy as early as the upcoming week.What would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?Eager to know what most of the ppl think.Personally I didnt use genesis ever myself Better hodl.Why is it that just when Bitcoin started a positive movement, news broke that one of the crypto lenders Genesis Global Kapital, a subsidiary of Digital Currency Group, is planning to file for bankruptcy.The reason behind this bankruptcy filing plan is also related to the FTX collapse last year.I suspect that many companies or interest groups are afraid that Bitcoin will continue to move higher so simultaneously such issues arise. The impact remains on the price of Bitcoin even though the Genesis bankruptcy plan did not really make people panic because people already had preparations after the Luna and FTX incidents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "January 19, 2023, 06:15:43 AM",
      "body": "It looks like the impact is already starting to be seen even if it's only a small part. but Bitcoin just had a pump and was corrected again. if another severe dump occurs, it will be quite difficult for some traders and asset holders in the market.long-term holders may not care about this. and maybe the situation won't have much of an impact. but if a publication from the media like that is enough to make the market respond negatively. it could be so bad for the market that we will likely be stuck at $17k again.the decision to sell part of the portfolio or keep holding I think all depends on you. but I will hold on to it. and maybe will buy again if there is a decline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "January 19, 2023, 06:19:34 AM",
      "body": "I wasn't able to use Genesis as well, but the fact that they are getting ready for filing would significantly impact the people invested and using their service. I don't think the effect is too much because they are not like FTX, which is very well known, but there would be a significant bump IMO. I believe that you should be able to take advantage of this short-term news(not investment advice) that probably many people might be shilling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "January 19, 2023, 08:07:23 AM",
      "body": "This crash will definitely have an impact on bitcoin, but this time, I don't think it will have too much of an impact, as news of Genesis has been circulating since the FTX crash. If DGC collapses, it will be a real problem for bitcoin and the whole market as they are not only the parent company of Genesis but also the largest bitcoin holding fund in the world. Not only did Genesis declare bankruptcy, but DGC is also selling news site Coindesk, coindesk itself being the first to report on FTX problems  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 19, 2023, 08:25:34 AM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMWhat would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?The news came out yesterday. Was it the news on Genesis, or it was the news about more targeted regulations to come in US, I don't know, but the price has got a correction.Should we sell and buy back? I am against such moves because they're overly risky. You simply don't know how low the price goes, you don't know when the price jumps back and how fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "January 19, 2023, 08:28:08 AM",
      "body": "Need to observe what the scenario will be in the upcoming weeks because maybe it won't affect the crypto market in a worse way. If we want to get to the point where we wanted to save our money, we could have sold out BTC when the time price was 30k+ but most people prefer not to sell it right now or convert it to any other altcoins right there because it's preferable always to wait when it comes for bitcoins and we already know it always recover no matter how bad the situation was in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "January 19, 2023, 10:32:37 AM",
      "body": "If that affects the bitcoin price, we should be able to hold bitcoin and not panic and don't even sell it at a low price. But we will also get an opportunity to buy more bitcoins because usually the price will go into a deep dump and that will be an advantage for us because we can buy bitcoins at a low price. But we still have to analyze before deciding to buy because, who knows, it won't affect bitcoin and instead allows it to survive the case. This will be even more interesting because whatever happens in the market, we have to be able to take advantage of it for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "January 19, 2023, 02:35:54 PM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMWhat would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?The impact of any news on BTC price cannot be known before the event happens, people will surely speculate on what will likely happen and it may or may not be correct, in order to know what will happen, we have to wait for Genesis to go bankrupt. If it is BTC you have in your portfolio and you didn't invest with money you need in the short term, then don't sell anything, wait out and see what the impact of this will be, if the market crashes you can buy more BTC, if it doesn't, you continue to hold and dca.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 19, 2023, 02:46:07 PM",
      "body": "Quote from: hd49728 on January 19, 2023, 02:49:24 AMThe impact of FTX collapse on its ecosystem and related companies is not new. Genesis was predicted to be one of victims of FTX fiasco. What happened with Genesis is not surprising at all. I believe the impact of FTX and FTT collapses were already reflected on cryptocurrency market in generally.News like this will not have big impact like months ago because people are already prepared about that. Who lost money already lost. Who caught the falling knife already did it and had their loses too.That's what I think, the news was already foreseen and as they say 'discounted by the market'. When a foreseen event happens it has no impact, in any case it had an impact beforehand.What we do know is that bitcoin will continue to be strong and that the next halving is getting closer and closer, so it is better to keep accumulating and forget about this noise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "January 19, 2023, 02:54:04 PM",
      "body": "Quote from: Edwardard on January 19, 2023, 02:32:45 AMAccording to a report made by cointelegraph a few hrs ago, Genesis (a cryptocurrency lending firm) is about to file for bankruptcy as early as the upcoming week.What would be the impact on bitcoin's price? Should we be worried and sell a part of our portfolio to buy back a bit lower after the news ? Or better hodl?Eager to know what most of the ppl think.Personally I didnt use genesis ever myself Afaik, This bankruptcy will take some time to take effect also there’s a process which they sell all the assets to the willing companies that will take over it so unless Genesis will be pushed to sell there crypto assets as is. I believe this bankruptcy will not gonna matter in technical perspective. The only factor that make this new give negative impact on crypto is when people panic without knowing the whole process of filing a bankruptcy form.Many crypto companies like Binance that willing to takeover this kind of bankrupt business for a cheap price. This kind of act saves crypto market for a possible sell off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}