{
  "id": "topic_5436354",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "January 22, 2023, 01:09:11 PM",
  "content": "QuoteGambling in Japan is not black and white. In fact, gambling is considered a criminal offence and is generally banned across the country.Those that are found gambling can face large fines and even serve jail time.However, there are exceptions to this rule. Betting on horse racing and the lottery are two forms of gambling that are accepted in Japan.To me, this seems hypocritical. You claim that gambling is illegal, but you may bet on horse racing, Pachinko, bicycle racing, boat racing, and Mahjong, which baffles me. I do not seem to understand. Why is that so? You claim it is unlawful, yet wagering on games that are overseen by the government is not unlawful. Is this not hypocritical? What does the government fear?https://gamblingnewsmagazine.com/gambling-in-japan/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436354",
  "comments": [
    {
      "author": "Cryptomiles1",
      "created_time": "January 22, 2023, 01:17:16 PM",
      "body": "At first it's totally ban and now there are exception. How?I think those laws needs to be properly reviewed others I would suggest those one also should be entirely ban since they found sport betting as a sin and what isn't lawful to their country.I buy your ideas to say it's Hypocrite. Why would ban others and only those mentioned are allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "January 22, 2023, 01:20:06 PM",
      "body": "I believe there are many reasons why gambling is allowed in Japan. First, it probably depends on how much people can be prone to addiction.If you were to compare the two, slots and horse racing, the latter would have more on the entertainment side and wouldn't lead to an addiction compared to slot machines, which many people are addicted to. It depends on how the government sees it. For sure, there are more reasons for it. I think it's about the deep cultural roots of horse racing in Japan that made it to the \"legal list\" of gambling.They also have regulations, and the government makes money from the operators' taxes. Unlike if it's in underground gambling or something, they probably don't pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "January 22, 2023, 01:26:32 PM",
      "body": "Aren't those sports and games that you mentioned served a huge part in Japan's culture? Maybe that's the reason why. While it may seem like it's hypocrisy, these events and sports that you mentioned doesn't also seem to push lots of gamblers to the edge and into addiction hence why they allow them under the direct supervision of the government. Dice, slots, cards, roulettes, most of these casino games finish fast, and people lose money fast with these games too, and they are more prone into addiction and getting into debt compared to those games/sports you just mentioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 22, 2023, 02:06:10 PM",
      "body": "Quote from: Davidvictorson on January 22, 2023, 01:09:11 PMTo me, this seems hypocritical. You claim that gambling is illegal, but you may bet on horse racing, Pachinko, bicycle racing, boat racing, and Mahjong, which baffles me. I do not seem to understand. Why is that so? You claim it is unlawful, yet wagering on games that are overseen by the government is not unlawful. Is this not hypocritical? What does the government fear?The Japanese government tends to use the prohibition law on gambling to fully regulate all gambling institutes or activities in the country, which is why the law prohibits other forms of gambling that seem to be out of their control. For many years, any form of gambling activity operated by the private sector, either on land or digitally, was prohibited in Japan and tagged as a criminal offense under the penal code, but between 2016 and 2018, the integrated resort law (IR) and the integrated resort implementation law were passed. With the new laws, only licensed gambling activity and licensed casinos conducted on land were legalized under the Integrated Resort Law. Like you said, @OP, you may bet on horse racing, pachinko, bicycle racing, boat racing, and Mahjong because they are operated by the public sector under the licensing and regulation of the Integrated Resort (IR) Promotion Law and Integrated Resort Implementation (IRI) Law.This doesn't bother me though, perhaps because I am not an indigene of the country, but such regulations in my mind seem unfair to the citizen, or hypocritical, as you said, but the reason for such regulation is to enable their government to have full regulatory authority over gambling. Read here about gambling and it's regulations as it concerns japan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "January 22, 2023, 02:17:30 PM",
      "body": "Quote from: Davidvictorson on January 22, 2023, 01:09:11 PMTo me, this seems hypocritical.Actually 'Ishihara' has proposed several ideas about the development of casinos in Japan, However, the proposal of the former mayor was not approved by the Japanese government for various reasons, one of which could plunge people who don't gamble and can cause addiction.However, types of gambling such as lotteries, horse racing or traditional gambling can be carried out, but are still under supervision and especially local government laws, as well as for the category of entertainment and local assets.I think there is no hypocrisy about gambling in Japan, the fact is that Japan has several legal gambling licenses, for example: Yokohama and Osaka, although Japan formed a committee to oversee the casino and has a limit of 10X per month and a fee of 6,000 yen, but japan can still gamble legally, Such as Las Vegas Sands casinos, Melco, Genting Singapore, and others. the goal is to limit addiction, overall i think there is nothing hypocritical about gambling in japan, my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "January 22, 2023, 02:53:25 PM",
      "body": "Quote from: Davidvictorson on January 22, 2023, 01:09:11 PM~snip~As far as I know Yakuza own underground casinos in Japan. Of course their casino offers a very narrow range of entertainment, but you have to remember that even if gambling is completely banned in your country you can play online casino. So I do not think that the Japanese authorities are oppressing gamblers. Besides you can always invite your friends to visit and play poker or other card games of chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "molsewid",
      "created_time": "January 22, 2023, 03:02:27 PM",
      "body": "Quote from: madnessteat on January 22, 2023, 02:53:25 PMQuote from: Davidvictorson on January 22, 2023, 01:09:11 PM~snip~As far as I know Yakuza own underground casinos in Japan. Of course their casino offers a very narrow range of entertainment, but you have to remember that even if gambling is completely banned in your country you can play online casino. So I do not think that the Japanese authorities are oppressing gamblers. Besides you can always invite your friends to visit and play poker or other card games of chance. I agree, if the OP really want to play in casino then why don't he use or play via online? there's a lot of casino or gambling site that he may visit and he can easily bet on it. Although the feeling is not the same but still you may gamble without the government only if those website can still be access in your country,every country has their own rules and set of standards we don't have a choice but to obey it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "January 22, 2023, 03:04:41 PM",
      "body": "Japanese is known for being hard worker and due to their history of rise and fall, There government might want people to focus on working alone instead of wasting time on gambling which we all know how this activity affects work force when a person get addicted.Those gambling that only allowed was games that is not a quick game. Only pachinko is the only quick result game but it’s not allowed to use money as reward. Japan is very disciplined which is why government wants to protect their culture away from addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "January 22, 2023, 03:15:49 PM",
      "body": "Quote from: molsewid on January 22, 2023, 03:02:27 PMQuote from: madnessteat on January 22, 2023, 02:53:25 PMQuote from: Davidvictorson on January 22, 2023, 01:09:11 PM~snip~As far as I know Yakuza own underground casinos in Japan. Of course their casino offers a very narrow range of entertainment, but you have to remember that even if gambling is completely banned in your country you can play online casino. So I do not think that the Japanese authorities are oppressing gamblers. Besides you can always invite your friends to visit and play poker or other card games of chance. I agree, if the OP really want to play in casino then why don't he use or play via online? there's a lot of casino or gambling site that he may visit and he can easily bet on it. Although the feeling is not the same but still you may gamble without the government only if those website can still be access in your country,every country has their own rules and set of standards we don't have a choice but to obey it. Believe me, sometimes the government introduces absurd things and people who value their freedom of choice are simply forced to overstep the law. Fortunately nowadays there is no problem to visit any websites even in countries where the state forbids it and strongly opposes it. People in China, for example, have to bypass their domestic firewall to visit many websites, so I think there is no problem with gambling in Japan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "January 22, 2023, 03:16:09 PM",
      "body": "Maybe what they want to release is that horse racing is legal gambling for them and nothing else, it's just that simple based on what I can see.But you can also see the hypocrisy of Japan as if they contradicted what they said, that's the truth. It's like Japan turned a blind eye to what they implemented.At this point, it's their territory and there's nothing we can do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "January 22, 2023, 03:22:15 PM",
      "body": "Quote from: Davidvictorson on January 22, 2023, 01:09:11 PMQuoteGambling in Japan is not black and white. In fact, gambling is considered a criminal offence and is generally banned across the country.Those that are found gambling can face large fines and even serve jail time.However, there are exceptions to this rule. Betting on horse racing and the lottery are two forms of gambling that are accepted in Japan.To me, this seems hypocritical. You claim that gambling is illegal, but you may bet on horse racing, Pachinko, bicycle racing, boat racing, and Mahjong, which baffles me. I do not seem to understand. Why is that so? You claim it is unlawful, yet wagering on games that are overseen by the government is not unlawful. Is this not hypocritical? What does the government fear?https://gamblingnewsmagazine.com/gambling-in-japan/Gambling was totally banned not after considering gamblers in the country, the government decided to accept only land based gambling companies that have licensed so that the government can control the gambling activities of their citizens. Those aforementioned games are the ones which they are used to before gambling in the country was banned. Maybe as time goes they might introduce other games for gambling. I don't like those games and I don't think I will love to place my bet on any.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "January 22, 2023, 03:33:49 PM",
      "body": "Quote from: Davidvictorson on January 22, 2023, 01:09:11 PMQuoteGambling in Japan is not black and white. In fact, gambling is considered a criminal offence and is generally banned across the country.Those that are found gambling can face large fines and even serve jail time.However, there are exceptions to this rule. Betting on horse racing and the lottery are two forms of gambling that are accepted in Japan.To me, this seems hypocritical. You claim that gambling is illegal, but you may bet on horse racing, Pachinko, bicycle racing, boat racing, and Mahjong, which baffles me. I do not seem to understand. Why is that so? You claim it is unlawful, yet wagering on games that are overseen by the government is not unlawful. Is this not hypocritical? What does the government fear?https://gamblingnewsmagazine.com/gambling-in-japan/It's kind of intriguing that they allowed an exception but Japan is a unique country with its unique interest, laws, and culture, horse racing, and bicycle racing can be considered skill based, but for all the other events where it is legal, I cannot consider it skill-based.Every country has a law that governs what is legal and illegal, there are countries where owning a gun is illegal and other countries where it is legal, we just have to respect it, just like the saying when in Rome do as the Romans do, we have to abide to their rules when we are in their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "January 22, 2023, 03:45:48 PM",
      "body": "We should understand that a government won't just wake up and take decisions without a prior event. There was a criminal case that led to the prime minister placing a ban on gambling still with a few exceptions. Laws are subject to reviews and amendment. If the Japanese comport themselves throughout this period of Ban there might be a high chance of reviewing and amending the panel code act.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "January 22, 2023, 04:00:20 PM",
      "body": "Not just in Japan though, governments prevent some things to happen before it's too late. The thing with the government is that the illegal today can be deemed legal in the next decade if it favors them. Aren't weed illegal years ago?Lottery and Horse racing are centralized and regulated by the government and they get money/tax collection from these kinds of gambling. It's much needed for the government to have funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "January 22, 2023, 04:04:32 PM",
      "body": "Quote from: robelneo on January 22, 2023, 03:33:49 PMIt's kind of intriguing that they allowed an exception but Japan is a unique country with its unique interest, laws, and culture, horse racing, and bicycle racing can be considered skill based, but for all the other events where it is legal, I cannot consider it skill-based.Every country has a law that governs what is legal and illegal, there are countries where owning a gun is illegal and other countries where it is legal, we just have to respect it, just like the saying when in Rome do as the Romans do, we have to abide to their rules when we are in their country.The gun example isn't a good one because in most countries guns are allowed to an extent. Some countries don't allow you to carry it with you outside, but will allow you to keep a gun at home, some will require you to go through a lot of psychological testing, and in some countries you can buy a gun after showing an ID and that's it. With Japan they have strange rules like you can gamble but you can't pay for gambling and exchange your chips for cash in the same building so people buy tickets in another part of the city, go play pachinko somewhere else and then get a receipt that they can exchange for money in that other place. It's just stupid, it doesn't discourage people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "January 22, 2023, 04:06:47 PM",
      "body": "I guess it's the control, that's why they only allowed certain games that they can manage and check and be charge of. And then there is the reason of this form of gambling as a means to just have fun and enjoy and not to get addicted. And then for tax purposes as well. So for them there is no hypocrisy here, it's more of an exception to the rule. And it seems that Japanese are also ok with this form of gambling, no one gets addicted. So there is a balance for their people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "January 22, 2023, 04:20:08 PM",
      "body": "Quote from: Davidvictorson on January 22, 2023, 01:09:11 PMQuoteGambling in Japan is not black and white. In fact, gambling is considered a criminal offence and is generally banned across the country.Those that are found gambling can face large fines and even serve jail time.However, there are exceptions to this rule. Betting on horse racing and the lottery are two forms of gambling that are accepted in Japan.To me, this seems hypocritical. You claim that gambling is illegal, but you may bet on horse racing, Pachinko, bicycle racing, boat racing, and Mahjong, which baffles me. I do not seem to understand. Why is that so? You claim it is unlawful, yet wagering on games that are overseen by the government is not unlawful. Is this not hypocritical? What does the government fear?https://gamblingnewsmagazine.com/gambling-in-japan/I think that most likely the government thinks that by betting in these games the risk of people and entire generation of becoming addicted is much lower than if they let absolutely every type of gambling out there.In fact that maybe right because usually the people most addicted are those playing table games like roulette,slots,dice and other type of such games,I rarely have seen somewhat becoming truly addicted to Mahjong or boat racing for example,these are rare games preferred by the gamblers so to me this is not hypocrisy,it is just the government letting available only games with lower risks of becoming addicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "January 22, 2023, 04:29:59 PM",
      "body": "Quote from: swogerino on January 22, 2023, 04:20:08 PMQuote from: Davidvictorson on January 22, 2023, 01:09:11 PMQuoteGambling in Japan is not black and white. In fact, gambling is considered a criminal offence and is generally banned across the country.Those that are found gambling can face large fines and even serve jail time.However, there are exceptions to this rule. Betting on horse racing and the lottery are two forms of gambling that are accepted in Japan.To me, this seems hypocritical. You claim that gambling is illegal, but you may bet on horse racing, Pachinko, bicycle racing, boat racing, and Mahjong, which baffles me. I do not seem to understand. Why is that so? You claim it is unlawful, yet wagering on games that are overseen by the government is not unlawful. Is this not hypocritical? What does the government fear?https://gamblingnewsmagazine.com/gambling-in-japan/I think that most likely the government thinks that by betting in these games the risk of people and entire generation of becoming addicted is much lower than if they let absolutely every type of gambling out there.In fact that maybe right because usually the people most addicted are those playing table games like roulette,slots,dice and other type of such games,I rarely have seen somewhat becoming truly addicted to Mahjong or boat racing for example,these are rare games preferred by the gamblers so to me this is not hypocrisy,it is just the government letting available only games with lower risks of becoming addicted.The games being restricted to gambling in Japan are in my opinion, games which might require attention on specific dates and is a profit stream to the government. Unlike other slot and roulette casino games being controlled by agencies not domiciled in Japan.Besides reasons of being addictive to its citizens, the government of most countries right now want to earn from them, where this ain't possible, they either ban it or enforce their own ideology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahmad2nd",
      "created_time": "January 22, 2023, 04:39:48 PM",
      "body": "I can't say it like you said. because, they have laws that become policies for their own people. the reason is, we don't know exactly what happened in that country. some points that other members have said before me, maybe they can be a reference for the answers from this thread.As @crtwth has said, what he said makes a lot of sense to me. especially the first point, \"depends on how much the person is prone to addiction\". Based on that, it makes sense to me that the Japanese government places restrictions on allowed and illegal types of gambling. regarding horse racing, I'm not too sure that this is part of their culture but for this type of mahjong, this type of game has become their culture from their previous ancestors, it's natural for mahjong games to be legal gambling. As for other types of gambling, I'm pretty sure that boat racing, bicycle racing, is part of their culture, with the exception being Pachinko.So that's how Japan regulates gambling for its people. maybe gradually, the rules and laws that prohibit some other types of gambling, will gradually be revised again. maybe, we don't know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}