{
  "id": "topic_5456351",
  "title": "SportScore",
  "author": "SportScore",
  "created_time": "June 14, 2023, 04:49:11 PMLast edit: June 14, 2023, 06:03:55 PM by SportScore",
  "content": "Delete pls",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456351",
  "comments": [
    {
      "author": "Agbe",
      "created_time": "June 14, 2023, 04:55:16 PM",
      "body": "You are welcome to the forum. English is not a barrier but how the others understand the communication is the matter. It is a nice project. But why can't you look for an investor or partner in your locality instead here. If you discussed with any of you friends they might buy the idea and join you. Because many people have come for such request and I don't think their request were having positive outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SportScore",
      "created_time": "June 14, 2023, 04:56:59 PM",
      "body": "Quote from: Agbe on June 14, 2023, 04:55:16 PMYou are welcome to the forum. Thanks friend!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 14, 2023, 05:17:13 PM",
      "body": "first of all ... I do not have this amount to invest (just to clarify).I also believe that it is right to clarify what guarantees you have on this project, if you have a business plan created and in general how you intend to manage the various licenses/countries in which you want to operate (for example, do you already have agreements? Have you received any proposals?). this Smart contract has been already developed/tested or it's completely new (even here did you have any proposal?) just my 2 cents sats",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SportScore",
      "created_time": "June 14, 2023, 05:21:40 PM",
      "body": "Quote from: bitbollo on June 14, 2023, 05:17:13 PMfirst of all ... I do not have this amount to invest (just to clarify).I also believe that it is right to clarify what guarantees you have on this project, if you have a business plan created and in general how you intend to manage the various licenses/countries in which you want to operate (for example, do you already have agreements? Have you received any proposals?). this Smart contract has been already developed/tested or it's completely new (even here did you have any proposal?) just my 2 cents sats Hi, we are on earlier stages of the Web development,  smart contract and testing not been made, but we have documentation everything.It's earlier to say that everything is ready but no, it will take long time for such big business, the thing is I put the link to the site and find someone who will like the idea behind it and help me bring it to live.About Sport betting license we already have one, and it not big issue to claim, also we have license for live streaming matches on some countries and we can expend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 14, 2023, 05:33:50 PM",
      "body": "how did you calculated this amount needed \"1 million $\" (now edited at 500K, or much better between 500k and 1M?)as you can well understand, there is a big difference in that request...I am wondering.... and if this figure will be not enough?other questions, why only 1 investor and not open to more people? have you tried to collect this amount from bank / friends/ relatives?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "June 14, 2023, 05:53:31 PM",
      "body": "Quote from: SportScore on June 14, 2023, 04:49:11 PM<snip>I'm looking for investor/partner that can be involve on the project, and live it.Request: 500k-1M$Why we need that much money?, APIS, Live stream licenses, Sport betting license, Developing, SEO and more things. together we consider any payment if need.my partner will earn as me from the project 50:50.I think you must also clarify if you have more funds except of that which you're asking from your potential investors. What are your investment to this project compared to your potential partner? Does it include anywhere around the amount you were asking for? Or only the idea, strat, etc.?With that great amount of money, are you ready to reveal your identity in case (s)he asks?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 14, 2023, 08:13:09 PM",
      "body": "looks like he deleted what he wrote on both of the threads he created(here and marketplace). I think he didn't like the questions bitbollo was asking or doesn't have an answer for them. makes me wonder how confident he was with his project, it also makes me think whether he is up to no good or not(no offense to OP), especially when he was asking for $500k-$1M from an investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}