{
  "id": "topic_5459100",
  "title": "Youngkhngdiddy",
  "author": "Youngkhngdiddy",
  "created_time": "July 09, 2023, 01:28:55 AMLast edit: July 09, 2023, 04:30:51 AM by Youngkhngdiddy",
  "content": "I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin, yes the bitcoin is considered a cryptocurrency but they're two things altogether, bitcoin is the supreme digital currency and all digital currencies around the world are known as cryptocurrency, it is an form of currency be it digitally or virtually that uses cryptography to secure it's transactions,whereas bitcoin uses a decentralized ledger called the blockchain to maintain and secure a transparent record of transactions. Let me bring it to layman's term for people to understand better, in a society there's a family and I'll use the family to represent cryptocurrency now, the family has a head and that is the father which I'll use to represent bitcoin, now inside that family there are other members like the mother, sister,brother  which forms the family, that's how their are other digital currencies that makes up the cryptocurrency as well, now you can say the father is a member and head  of the family but can't say the father and family are same thing, same way as saying bitcoin is the head and supreme cryptocurrency but can't say bitcoin and cryptocurrency is same thing, I hope these illustrations will help you understand my explanations better, also there other cryptocurrencies like etherium, bnb, cardano, polkadot etc.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459100",
  "comments": [
    {
      "author": "dzungmobile",
      "created_time": "July 09, 2023, 02:13:16 AM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoinAre you sure?I believe more people invested money in altcoins (alternate cryptocurrencies) and lost their money with altcoins than with Bitcoin. Altcoin communities are more noisy, actively shill their \"potential\" altcoins and if you check Coinmarketcap.com, Coingecko.com, thousands of altcoin will appear. It's hard to ignore them when you can buy them with cheaper prices.Quoteyes the bitcoin is considered a cryptocurrency but they're two things altogether, bitcoin is the supreme digital currency and all digital currencies around the world are known as cryptocurrency, it is an form of currency be it digitally or virtually that uses cryptography to secure it's transactions,whereas bitcoin uses a decentralized ledger called the blockchain to maintain and secure a transparent record of transactions.This sentence is too long but contains confusing information and incorrect too.Both Bitcoin and altcoins use blockchains, very few altcoins like DAG don't have a blockchain. Difference is Bitcoin network is decentralized whilst altcoin networks are centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "July 09, 2023, 03:11:39 AM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin, I am sure those who don't know about other cryptocurrencies than Bitcoin they don't know about the usecases of it and they just leaned that there is a virtual currency which name is Bitcoin. And one more thing, just understanding about Bitcoin that it's a crypto isn't enough at all. You have to know about the pros and cons and have some technical knowledge about how to use or spend.Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM Let me bring it to layman's term for people to understand better, in a society there's a family and I'll use the family to represent cryptocurrency now, the family has a head and the is the father which I'll use to represent bitcoin, now inside that family there are other members like the mother, sister,brother  which forms the family, that's how their are other digital currencies that makes up the cryptocurrency as well, now you can say the father is a member and head  of the family but can't say the father and family are same thing, same way as saying bitcoin is the head and supreme cryptocurrency but can't say bitcoin and cryptocurrency is same thing,This is a very common example and not too much informative. I believe that who has a very little knowledge about crypto or he is just starting must know about the common differences between Bitcoin and Altcoins. The word \"Altcoin\" means Alternative Coin. So it's an alternative of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "July 09, 2023, 04:19:00 AM",
      "body": "In other words, Bitcoin is a cryptocurrency and is the most famous of them all and maybe considered as the pioneering one in its present form - but not all cryptocurrency is Bitcoin. Just like saying that Paris is a place in France but not all France is Paris. Well, anyway, this is a very basic tenet and people who are into cryptocurrency got it from the very start of their crypto journey and for those people who still don't know it then maybe they are living in the caves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 09, 2023, 04:46:01 AM",
      "body": "Bitcoin = a currency/SoVCryptocurrency = the broader industry of coins/tokens with different purposes(pseudo-shares/equity, smart contract platforms, sometimes bitcoin competitors that are bound to fail, etc)It's that simple. No need for mommy/daddy analogies that pretty much just means that bitcoin is the biggest.Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AMbitcoin is the supreme digital currency and all digital currencies around the world are known as cryptocurrency, it is an form of currency be it digitally or virtually that uses cryptography to secure it's transactions,A currency using cryptography doesn't make it a cryptocurrency by definition.Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AMwhereas bitcoin uses a decentralized ledger called the blockchain to maintain and secure a transparent record of transactions.Also 90%+ of cryptocurrencies use blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "July 09, 2023, 05:18:04 AM",
      "body": "Your father is also human, and you, your sister, or your mother are also human, so what's the difference? Bitcoin is the first cryptocurrency and cryptocurrency, that's what I understand. As for the difference, bitcoin is entirely decentralized, while altcoins are mostly centralized. I saw someone on this forum claiming bitcoin is a cryptocurrency, and the rest are not. But that view comes from a bitcoin maximalist, so I think there's no arguing with them. Everyone will have different opinions, I hardly care about this, what I care about is what we are here for and how to achieve our goals, that's what we should care about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "July 09, 2023, 05:24:36 AM",
      "body": "Cryptocurrency is a technology that serves as a channel to facilitate the conducting of various financial transactions and ensure that costs are low and service is efficient. whereas Bitcoin aims to simplify and hasten the speed of transactions without government interference or restrictions.Bitcoin is just one out of so many cryptocurrencies out there but with it's high market cap, it's regarded as the best digital coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "July 09, 2023, 05:26:10 AM",
      "body": "Ops you need to unlearn what you presently carry as knowledge about cryptocurrency because from your writing you have deviated a lot from the reality and tried a definition of what cryptcucrency is and without having to make repetitive comments since most of the comments already point out your errors and where you have the misconceptions,  bitcoin is a cryptocurrency and all the cryptocurrencies uses blockchain unless those copy cats that are government own and other few ones e.g CBDC. But aside from that,  all other coins run on blockchain technology and there is nothing like Bitcoin vs cryptocurrency because cryptocurrency is the unified name for all the exciting cryptocurrencies we have both the centralized and the decentralized cryptocurrencyies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinremitter",
      "created_time": "October 13, 2023, 08:28:49 AM",
      "body": "Certainly, I appreciate your effort to clarify the distinction between Bitcoin and other cryptocurrencies. Your family analogy is indeed helpful in explaining this concept to a wider audience.It's crucial to grasp that Bitcoin is just one member of the larger family of cryptocurrencies. While Bitcoin holds a prominent position as the first and most well-known cryptocurrency, it's not synonymous with the entire category. In simpler terms, think of Bitcoin as the father in the family of cryptocurrencies. There are other members in this crypto family, like Ethereum, Binance Coin, Cardano, Polkadot, and many more, which together form the broader cryptocurrency landscape.Coinremitter, the crypto payment gateway, plays a vital role in facilitating transactions within this digital family. It ensures secure and efficient movement of various cryptocurrencies, much like how a financial service helps manage transactions within a household. https://coinremitter.com/?utm_source=rep&utm_medium=bitcointalks supports not just Bitcoin but also a wide range of other cryptocurrencies, making it a valuable resource for anyone navigating the crypto world.In essence, Bitcoin is the father of cryptocurrencies, but it's not the entire family. Coinremitter, as a crypto payment gateway, is here to simplify and enhance the use of this diverse digital currency family. Understanding these distinctions is key to embracing the full potential of the cryptocurrency ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 13, 2023, 09:06:49 AM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM Let me bring it to layman's term for people to understand better, in a society there's a family and I'll use the family to represent cryptocurrency now, the family has a head and that is the father which I'll use to represent bitcoin, now inside that family there are other members like the mother, sister,brother  which forms the family, that's how their are other digital currencies that makes up the cryptocurrency as well, now you can say the father is a member and head  of the family but can't say the father and family are same thing, same way as saying bitcoin is the head and supreme cryptocurrency but can't say bitcoin and cryptocurrency is same thing, I hope these illustrations will help you understand my explanations better, also there other cryptocurrencies like etherium, bnb, cardano, polkadot etc. a poor comparison in my opinion. It is much better to compare bitcoin to digital gold and altcoins to a digital form of stock shares. So Bitcoin is gold and etherum is equivalent to Apple shares, why? Because the value of bitcoin is based on low supply and desire to possess (like gold), and the value of ETH is based on the utilities built on it the value of BNB depends on what it can be used for (e.g. discount on binance, participation in laucpads, etc.) and so on. Comparison to mom and dad doesn't add much and seems infantile to me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "October 13, 2023, 09:13:47 AM",
      "body": "After reading the title of this topic, I actually hope there will be an explanation about the differences between Bitcoin and crypto.  But apparently this is only about Bitcoin and Altcoins. I think even a beginner in his early stages of learning will know that there are other digital currencies besides Bitcoin called Altcoins. And there are altcoins that have coins nested in their respective networks called Tokens.But beginners sometimes can't differentiate between tokens and coins (L1, L2 and so on). Because some time ago I still often misunderstood the difference between tokens and coins. Because I'm still a beginner at this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "October 13, 2023, 09:30:32 AM",
      "body": "You've clearly and wonderfully taken the time to grasp, analyze, and reframe this bitcoin discussion into a palatable and relevant fashion. Bitcoin—a constant presence, right? Its broad appeal and trustworthiness derive from being the first in a vast and sometimes scary digital money world. Coins like Ethereum, Cardano, and BNB have their own appeal and investment possibilities.A light but persistent concern remains: While we're wrapped in Bitcoin's considerable shadow, how do we take a moment to fully evaluate these other cryptocurrencies' capabilities? Can we detach our beliefs from Bitcoin and let our investment strategy sail into the unpredictable but potentially lucrative waters of other digital currencies? Its an issue, a difficulty, but worth considering, no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "October 13, 2023, 09:50:33 AM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin, yes the bitcoin is considered a cryptocurrency but they're two things altogether, bitcoin is the supreme digital currency and all digital currencies around the world are known as cryptocurrency, it is an form of currency be it digitally or virtually that uses cryptography to secure it's transactions,whereas bitcoin uses a decentralized ledger called the blockchain to maintain and secure a transparent record of transactions. Let me bring it to layman's term for people to understand better, in a society there's a family and I'll use the family to represent cryptocurrency now, the family has a head and that is the father which I'll use to represent bitcoin, now inside that family there are other members like the mother, sister,brother  which forms the family, that's how their are other digital currencies that makes up the cryptocurrency as well, now you can say the father is a member and head  of the family but can't say the father and family are same thing, same way as saying bitcoin is the head and supreme cryptocurrency but can't say bitcoin and cryptocurrency is same thing, I hope these illustrations will help you understand my explanations better, also there other cryptocurrencies like etherium, bnb, cardano, polkadot etc. Just don't get confuse about other technical words regarding to that since bitcoin is also a crypto and this is the most strongest adopted coin among any other listed on the market. But it also need those altcoin so that it can have healthy conversion especially if we want to earn some profits for exchanging it. But since you came up with those points then its still good that you correlate those things and think about such things. But try to dig more deeper important information since its more helpful for you if you search the technicalities of bitcoins and other altcoins since it can make you earn good profits. Some may not buy those fancy wordings you use but at least you came up with some topic that somehow cool to discuss since some newbie might find the topic you created interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "October 13, 2023, 10:01:11 AM",
      "body": "Quote from: Arenga pinnata on October 13, 2023, 09:13:47 AMAfter reading the title of this topic, I actually hope there will be an explanation about the differences between Bitcoin and crypto.  But apparently this is only about Bitcoin and Altcoins. I think even a beginner in his early stages of learning will know that there are other digital currencies besides Bitcoin called Altcoins. And there are altcoins that have coins nested in their respective networks called Tokens.But beginners sometimes can't differentiate between tokens and coins (L1, L2 and so on). Because some time ago I still often misunderstood the difference between tokens and coins. Because I'm still a beginner at this.I don't remember exactly which thread I saw it in but it was on this forum.  there are many people who say that only bitcoin is cryptocurrency and altcoin is not cryptocurrency, some even say that \"crypto\" is not \"cryptocurrency\", both words are different.   I'm actually quite funny and confused about how they view bitcoin and altcoins. For me, the cryptocurrency market has only 2 types, bitcoin is one and the other are altcoins, whether token or coin, they are altcoins and have the same risks, they cannot be safer than bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Easteregg69",
      "created_time": "October 13, 2023, 10:04:04 AM",
      "body": "Quote from: Texac on October 13, 2023, 10:01:11 AMQuote from: Arenga pinnata on October 13, 2023, 09:13:47 AMAfter reading the title of this topic, I actually hope there will be an explanation about the differences between Bitcoin and crypto.  But apparently this is only about Bitcoin and Altcoins. I think even a beginner in his early stages of learning will know that there are other digital currencies besides Bitcoin called Altcoins. And there are altcoins that have coins nested in their respective networks called Tokens.But beginners sometimes can't differentiate between tokens and coins (L1, L2 and so on). Because some time ago I still often misunderstood the difference between tokens and coins. Because I'm still a beginner at this.I don't remember exactly which thread I saw it in but it was on this forum.  there are many people who say that only bitcoin is cryptocurrency and altcoin is not cryptocurrency, some even say that \"crypto\" is not \"cryptocurrency\", both words are different.   I'm actually quite funny and confused about how they view bitcoin and altcoins. For me, the cryptocurrency market has only 2 types, bitcoin is one and the other are altcoins, whether token or coin, they are altcoins and have the same risks, they cannot be safer than bitcoin. You can have your bitcoin wrapped on several networks..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "October 13, 2023, 10:35:28 AM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AMI've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin,If you mean by many people is many people outside this forum then you may be right, but since we don't have any data so we can't be certain, but if you mean by many people is many people in this forum, then you probably wrong, most of the people in here is bitcoin and crypto enthusiast, they should know the basic like distinguishing between Bitcoin, Cryptocurrency, and Altcoin, they has their own section in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "October 13, 2023, 11:22:04 AM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin..........We all know that bitcoin was the first cryptocurrency invented by Satoshi in 2009 later other cryptocurrencies were also inventing till now and we called them cryptocurrencies but for the difference, we called bitcoin a cryptocurrency and the rest altcoins so if you have anycoin it means you have a cryptocurrency like if you have a bitcoin you have a cryptocurrency and if you have a cryptocurrency you may or maybe not a bitcoin. let me give you another example, Cash, credit cards, and Venmo are all forms of currency transaction in the same way Bitcoin Ethereum, and dogecoin are different coins but they are a form of cryptocurrency due to the popularity of Bitcoin we call Bitcoin a cryptocurrency and people are confused in this they think that both are different one but actually they are the same forms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "October 13, 2023, 11:33:37 AM",
      "body": "Quote from: JunaidAzizi on October 13, 2023, 11:22:04 AMWe all know that bitcoin was the first cryptocurrency invented by Satoshi in 2009What you knew and shared here is a misinformation.In fact, let's read Bitcoin prehistory to know Bitcoin is not a first cryptocurrency.Quotelater other cryptocurrencies were also inventing till now and we called them cryptocurrencies but for the differenceAltcoins are non-Bitcoin coins and a few altcoins were created before Bitcoin, major of altcoins were created after Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 13, 2023, 12:46:57 PM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin, So, what is cryptocurrency a form of digital medium of exchange, Bitcoin is a cryptocurrency aka a Digital medium of exchange and now at the same time other digital currencies in the crypto market except Bitcoin are Altcoins (Alternate coins), cryptocurrencies hold a few common characteristics as pre-described supply (tokenomics), Quote a mechanism used to regulate the creation of blocks and the state of the blockchain it can be Pow/Pos or any other consesus. Now here in the crypto world coins as Bitcoin & Altcoins driven by a new digital class called tokens (tokenization) they hold a different set of properties. The Discussion does not end here in Altocins, there are shitcoins, memes NFTS etc ... I'm sure every crypto beginner at least apprised of these terms.King is King BTCitcoin better to study it, avoid to waste most of your time on the shitcoins ..Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AMyes the bitcoin is considered a cryptocurrency but they're two things altogether, bitcoin is the supreme digital currency and all digital currencies around the world are known as cryptocurrency, it is an form of currency be it digitally or virtually that uses cryptography to secure it's transactions,whereas bitcoin uses a decentralized ledger called the blockchain to maintain and secure a transparent record of transactions. What?? Transactions are not secured by cryptography because there is no encryption on the transaction details except for the public addresses and private keys, Transections are secured by the proof of consensus whether it's POW POS or any other used on the blockchain. In other words, this public or private ledger is called blockchain which secures the transaction. It's too confusing OP is better to create topic after a good research and analysis (Count it as a suggestion, not an attack).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 13, 2023, 01:56:43 PM",
      "body": "Quote from: Youngkhngdiddy on July 09, 2023, 01:28:55 AM I've come to realise that many people still don't understand that there are other cryptocurrencies apart from the bitcoin, yes the bitcoin is considered a cryptocurrency but they're two things altogether,Actually I disagree with your statement, you must have written this when you had less knowledge on the industry because what's happening here is the misconception that all cryptocurency are Bitcoin as most investors think the shitcoins they're investing in are like Bitcoin that'll always bounce back up after getting hit down by the bear market. People know that we have different cryptocurency in the market and not just Bitcoin but they mistake them to belike Bitcoin which is where they all make mistake as what they're investing in are just garbage that won't exist in few years time. Most of them don't even survive the bear market. The difference between Bitcoin and cryptocurency is that Bitcoin is just one of the cryptocurency existing while cryptocurency is the general name we give to all cryptocurency. Bitcoin is also a cryptocurency but other cryptocurency aren't Bitcoin and can never be.QuoteI hope these illustrations will help you understand my explanations better, also there other cryptocurrencies like etherium, bnb, cardano, polkadot etc.Yea your illustration is perfect as Bitcoin is the head while the rest are just other part of the family that can be replaced anytime but just because we have other cryptocurency doesn't make them worthy of been invested into because many of them are just trash that would only make you to lose and not make you profit. Bitcoin controls the whole market so if you Invest in other altcoins doesn't save you when the market is having a correction and they all have to wait for Bitcoin to be having a bullish market for them to start giving you profits which you can't be certain about which one will get the market hype. Infact you should avoid the other part of the family (based on OP explanation) and focus of accumulation the head of the family which is Bitcoin. Just to add another difference, you can be guarantee of making profits with Bitcoin if the market is pumping because Bitcoin leads the pump but you can't with other cryptocurency as you won't know which one will have a good season. Ps not all cryptocurency are bullish during the bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}