{
  "id": "topic_5525925",
  "title": "suzanne5223",
  "author": "suzanne5223",
  "created_time": "January 09, 2025, 07:58:14 PM",
  "content": "A lot of Bitcoin enthusiasts were bullish about this year's market being one of the best we have ever seen which is normal due to the Bitcoin market's 4-year cycle that always provides new ATH prices.  However, the current 4years cycle market is different from the previous one we have experienced and we should be ready for any surprises because the major investors and holders in this current market are institutional banking, private investment organizations, and the government. This is what I pointed out some days ago not knowing that the US government would be the first to make a move by giving the DOJ the order to sell $6.5 billion in Bitcoin seized from Silk Road. However, the U.S. entities were said to hold 65% more Bitcoin than non-U.S. entities after Trump's national Bitcoin reserve announcement, and I believe they purposely doing selling of the BTC before Donald Trump's inauguration.Are they going to sell more BTC or use the remaining as their national Bitcoin reserve?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5525925",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 09, 2025, 08:31:31 PM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMA lot of Bitcoin enthusiasts were bullish about this year's market being one of the best we have ever seen which is normal due to the Bitcoin market's 4-year cycle that always provides new ATH prices.Obviously we still expect for more bullish trend for this month till maybe around March before we see a resentment the market price or change in season, but as for now, we are likely more going to see the bullish pattern till we achieve up to $130,000 plus or minus in bitcoin market price.Quote from: suzanne5223 on January 09, 2025, 07:58:14 PM However, the current 4years cycle market is different from the previous one we have experienced and we should be ready for any surprises because the major investors and holders in this current market are institutional banking, private investment organizations, and the government.You're right about this, that is why some of the investors of bitcoin were being more sensitive at this time because of the possible more highs, all the last year events and activities that happened were record breaking achievements and we expect that they should be a cause for more prolonged bull season than anticipated.Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?Isn't it more better to assume that US are not investors of bitcoin, because their holdings are not what they have invested, instead seizures in their numbers, but we may have a change in all these, if the new present elect had a second thought on the policies and consider bitcoin for an investment in US, of course, i don't expect them to make their current holding a reserve, because all these does not belong to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "January 09, 2025, 08:32:58 PM",
      "body": "Quote from: Aanuoluwatofunmi on January 09, 2025, 08:31:31 PMQuote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?Isn't it more better to assume that US are not investors of bitcoin, because their holdings are not what they have invested, instead seizures in their numbers, but we may have a change in all these, if the new present elect had a second thought on the policies and consider bitcoin for an investment in US, of course, i don't expect them to make their current holding a reserve, because all these does not belong to them.Agreed. It will be the same situation as with the seized Bitcoin in Germany. They simply don't have the right to use these Bitcoins we are talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 09, 2025, 08:37:12 PM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?From what I read in that picture, it's that DOJ can sell those bitcoins, not that DOJ must sell them.This being said, indeed, I would not be surprised if DOJ postpones the selling a little and then those bitcoins become the first batch in Trump's USA bitcoin reserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "January 09, 2025, 08:38:52 PM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMThis is what I pointed out some days ago not knowing that the US government would be the first to make a move by giving the DOJ the order to sell $6.5 billion in Bitcoin seized from Silk Road. However, the U.S. entities were said to hold 65% more Bitcoin than non-U.S. entities after Trump's national Bitcoin reserve announcement, and I believe they purposely doing selling of the BTC before Donald Trump's inauguration.Are they going to sell more BTC or use the remaining as their national Bitcoin reserve?I also had the same question and the answer I have for this is that maybe some of the members from the Biden administration or from any administration want to get rid of these BTC but who knows if this selling will give the most benefit to whom. As this money will still be going into the reserve in the form of bonds or fiat. But if they plan to add BTC to their reserve then why sell now? Why they did not wait for the 20th of January, maybe when Trump had been given full authority, he would have opposed it with full power and would not made it happen and maybe that's why they (who knows who) made this step now. Well, the market took the hit and dumped to $91.5k which is bad, and as of writing this post still dumping. I see it can dump more, but red is necessary to see green. So no worry it will recover but this dump was unexpected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "January 09, 2025, 08:44:03 PM",
      "body": "Quote from: fikrett on January 09, 2025, 08:32:58 PMQuote from: Aanuoluwatofunmi on January 09, 2025, 08:31:31 PMQuote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?Isn't it more better to assume that US are not investors of bitcoin, because their holdings are not what they have invested, instead seizures in their numbers, but we may have a change in all these, if the new present elect had a second thought on the policies and consider bitcoin for an investment in US, of course, i don't expect them to make their current holding a reserve, because all these does not belong to them.Agreed. It will be the same situation as with the seized Bitcoin in Germany. They simply don't have the right to use these Bitcoins we are talking about. Yeah just like every other fed around the world, they just take ownership of whatever proceeds of such crimes, and regardless of whether the government has the right to sell those seized Bitcoin or not what we are concerned about is the impact the sale will have on the price of Bitcoin in the short term bases, after all the government intends to open a reserve for Bitcoin I believe in the long run it will still bring us back to the same status quo, most times it just going to make all the noise in the news and we may likely not feel the impact of this sell on the market and I am a kind of tired of hearing government and the silk road thing, let them just offload all the seized Bitcoin at once so we get over this whole story with silk road.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "January 09, 2025, 08:45:26 PM",
      "body": "Quote from: Odusko on January 09, 2025, 08:44:03 PMQuote from: fikrett on January 09, 2025, 08:32:58 PMQuote from: Aanuoluwatofunmi on January 09, 2025, 08:31:31 PMQuote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?Yeah just like every other fed around the world, they just take ownership of whatever proceeds of such crimes, and regardless of whether the government has the right to sell those seized Bitcoin or not what we are concerned about is the impact the sale will have on the price of Bitcoin in the short term bases, after all the government intends to open a reserve for Bitcoin I believe in the long run it will still bring us back to the same status quo, most times it just going to make all the noise in the news and we may likely not feel the impact of this sell on the market and I am a kind of tired of hearing government and the sink road thing, let them just offload all the seized Bitcoin at once so we get over this whole story with sink road.Isn't it more better to assume that US are not investors of bitcoin, because their holdings are not what they have invested, instead seizures in their numbers, but we may have a change in all these, if the new present elect had a second thought on the policies and consider bitcoin for an investment in US, of course, i don't expect them to make their current holding a reserve, because all these does not belong to them.Agreed. It will be the same situation as with the seized Bitcoin in Germany. They simply don't have the right to use these Bitcoins we are talking about. You did a bit of a typo there regarding the quoting. Awaiting your answer  p.s. Good job. Never really got into the silk road stories, however - they were noisy for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "January 09, 2025, 08:46:03 PM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMThis is what I pointed out some days ago not knowing that the US government would be the first to make a move by giving the DOJ the order to sell $6.5 billion in Bitcoin seized from Silk Road. However, the U.S. entities were said to hold 65% more Bitcoin than non-U.S. entities after Trump's national Bitcoin reserve announcement, and I believe they purposely doing selling of the BTC before Donald Trump's inauguration.I'm sure of it. If they'll do it 2 weeks before he takes office it's going to be one of their last great sabotages. They simply want to sell at a loss so that Trump later has to buy it back. They know that buying it back is going to be harder than simply moving it from one government agency to another. On the other hand, I wouldn't be surprised if there were a few billionaires involved in that move. Just think about it. They know bitcoin is about to make a move up, if not this year than in 3 years. They know the US is going to keep printing, even if the FED says otherwise. Bitcoin is a great investment. If they could only spook the market and get it cheaper. Make it crash and bounce back, like it did numerous times before, for instance in 2021 to 30k and back to 70k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "January 09, 2025, 08:58:16 PM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?We don't know for sure, we don't even know if they are going to go ahead and sell this 69,370 BTC that was seized from the silk road after winning the case with Battle Born investment company. I believe we will get answers to these questions when Trump is sworn in, in about two weeks from now. If the U.S. BTC reserve becomes a reality, then these coins will be part of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "January 09, 2025, 08:59:34 PM",
      "body": "I don't think it changes much. Those coins would have been sold one way or the other because the issue has been in court for a while. The US has not even passed the bill to have a bitcoin reserve and I don't even think it will happen this year. I think most people just get ahead of themselves that's why they talk like bitcoin reserve will happen very soon. I am still very optimistic about this year, not because of anything other thing but because of the 4 years cycle. I understand that there are more factors involved this time around, but all factors involved want profit too so I don't see how their involvement changes anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "newb42",
      "created_time": "January 09, 2025, 09:00:48 PM",
      "body": "Has anyone seen anything more substantial on this news? From what I've researched, this isn't well sourced.  However, the current drop could suggest it maybe underway. Either way, a parting present for us all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "January 09, 2025, 09:25:51 PM",
      "body": "Quote from: NeuroticFish on January 09, 2025, 08:37:12 PMQuote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?From what I read in that picture, it's that DOJ can sell those bitcoins, not that DOJ must sell them.This being said, indeed, I would not be surprised if DOJ postpones the selling a little and then those bitcoins become the first batch in Trump's USA bitcoin reserve.I still agree to this, I think it will depend on what Trump may decide on once he takes charge this January but either ways, they selling everything may likely be a bad idea but since we are still much having a bullish sentiments, it won't be felt much once Trump is on sit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 09, 2025, 10:11:03 PM",
      "body": "Now, if they sell this, probably exchanges who will wants buy this will offer a much lower price at least 20-30% less on the current price, but of course, since it's bidding from different exchanges so highly likely at they want to get much higher price. The reason why bitcoin price won't get affected. Or chances are Taylor with his Microstrategy will get it instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "January 09, 2025, 11:16:24 PM",
      "body": "Quote from: Amphenomenon on January 09, 2025, 09:25:51 PMQuote from: NeuroticFish on January 09, 2025, 08:37:12 PMQuote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?From what I read in that picture, it's that DOJ can sell those bitcoins, not that DOJ must sell them.This being said, indeed, I would not be surprised if DOJ postpones the selling a little and then those bitcoins become the first batch in Trump's USA bitcoin reserve.I still agree to this, I think it will depend on what Trump may decide on once he takes charge this January but either ways, they selling everything may likely be a bad idea but since we are still much having a bullish sentiments, it won't be felt much once Trump is on sit.This is a more accurate description of why the market has been on a downtrend recently. This massive sell off they’re planing for will affect the market for a while even though the bullish market will take over after some time. What could have cause a lot of fear for this selling because of USA stance on bitcoin and now seeing that country they all wish will help strengthen bitcoin selling a large portion of them off, it’ll definitely create fear within the holders. Sooner we shall see what Trump’s policy will be and maybe if he’ll avert the sell of it once he’s sworn in as the president and kick off the bitcoin reserve as soon as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "January 10, 2025, 02:09:26 AM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMThis is what I pointed out some days ago not knowing that the US government would be the first to make a move by giving the DOJ the order to sell $6.5 billion in Bitcoin seized from Silk Road. However, the U.S. entities were said to hold 65% more Bitcoin than non-U.S. entities after Trump's national Bitcoin reserve announcement, and I believe they purposely doing selling of the BTC before Donald Trump's inauguration.Are they going to sell more BTC or use the remaining as their national Bitcoin reserve?There are some activities that the current President and adminstration team are doing as most unfriendly things and barriers as possible for the President Elect in very last days of their administration. This one, liquidation of seized bitcoins from Silk Road can be one of these actions for their unfriendly plans.If they want their plan to succeed, they will execute it before the President Elect Inaguaration Day. I believe probability for the liquidation is clear, because there is no doubt in my mind that they don't want to give Trump a good foundation to start his second Presidency within about one more week.If they are not boosting the progress of liquidation, Trump will stop this plan and reverse it because he many times said his intention to reserve bitcoin for the USA and rather than liquidation these seized bitcoins, he will hold it for the nation and even accumulate more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "January 10, 2025, 03:36:43 AM",
      "body": "Quote from: Alpha Marine on January 09, 2025, 08:59:34 PMI don't think it changes much. Those coins would have been sold one way or the other because the issue has been in court for a while. The US has not even passed the bill to have a bitcoin reserve and I don't even think it will happen this year. I think most people just get ahead of themselves that's why they talk like bitcoin reserve will happen very soon. I agree with you, these bitcoins will be sold one way or another even if the bitcoin reserve bill passes. I don't know much about the US Constitution but I don't think US law would allow for the use of property seized from criminals as national reserves. Like the German government, they have to sell those bitcoins and can't hold them for too long because it's the country's constitution and can't be broken. National Reserve: We are talking about constitutional change, a bill of a country, not a regulation of a company or organization. This is a very complex issue, but many people are naive to think that it can be easily changed with a single senator's proposal.I don't even believe this bill would pass during Trump's term even if he really wanted to and pushed for this.Quote from: Alpha Marine on January 09, 2025, 08:59:34 PMI am still very optimistic about this year, not because of anything other thing but because of the 4 years cycle. I understand that there are more factors involved this time around, but all factors involved want profit too so I don't see how their involvement changes anything. Although I am not bullish on bitcoin reserves, I am optimistic that the Trump administration will have a more open policy towards cryptocurrencies and that will be enough to fuel a bull market in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "January 10, 2025, 04:43:47 AMLast edit: January 10, 2025, 05:03:32 AM by headingnorth",
      "body": "If the Biden DOJ proceeds with the sale, the Trump administration can simply buy back the bitcoin at a lower price then they were sold or around the same price. Even at a bit higher price, it is worth it to buy back the bitcoin.Given that Trump is about to take office in just a few days, it would be dumb for the DOJ to sell at this time knowing Trump can simply buy back the bitcoin almost immediately at around the same price, by executive order. It would made more sense for them to dump the bitcoin months ago when the price was much different but now it doesn't make any sense given the current timeframe. Also makes them look bad because it can be seen as a purely political move just to spite Trump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amitsr",
      "created_time": "January 10, 2025, 04:50:18 AM",
      "body": "Does other Governments across the world also hold BitCoins? I wonder Govt. Of India holds any reserves.also Kingdom Of Bhutan also holds a lot of bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "January 10, 2025, 05:45:48 AM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMAre they going to sell more BTC or use the remaining as their national Bitcoin reserve?I don't think since the US government has decided the adoption of bitcoin for it Fed reserve and being the highest nation holding bitcoin, they would likely keep the recovered bitcoins that is worth $6.5 billion from the Silk and add up to their initial holding.The vision of the US government as Donald Trump emerges office is to accumulate infinite number of bitcoins which these seized recovered funds maybe channeled over to the Fed reserve account of their bitcoins.Knowing the friendly differences between Biden and Trump over bitcoin, we all we'd know how strong hold and supportive Trump had been over it speculative adoption to provide more to its values, I'd doubt if the DOJ attorney general would forward to sell them off because he'd be questioned to account what the funds was used for knowing the attorney general was Bidden's appointee to lead the DOJ. So I think he might end up in jail by Trump if sold the recovered Silk bitcoins instead would be added to the already national reserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "January 10, 2025, 07:11:37 AM",
      "body": "Quote from: suzanne5223 on January 09, 2025, 07:58:14 PMThis is what I pointed out some days ago not knowing that the US government would be the first to make a move by giving the DOJ the order to sell $6.5 billion in Bitcoin seized from Silk Road. However, the U.S. entities were said to hold 65% more Bitcoin than non-U.S. entities after Trump's national Bitcoin reserve announcement, and I believe they purposely doing selling of the BTC before Donald Trump's inauguration.There’s no clear law yet regarding holding Bitcoin as a reserve, so that’s still far from being a discussion.The DOJ’s decisions can’t be influenced by politics. If they decide to sell, it’s like a command that has to be executed - no diversions or delays.We also shouldn’t worry about this causing the market to bleed because the DOJ will ensure it’s not a one-time sell. They’ll likely time it well and sell it in portions to avoid disrupting the market.If, at some point, all of these Bitcoins are sold and the government decides to pass a law recognizing Bitcoin as a legal reserve, that’s a whole different story. In that case, they could start purchasing Bitcoin again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}