{
  "id": "topic_5473708",
  "title": "Vickky Rae",
  "author": "Vickky Rae",
  "created_time": "November 11, 2023, 01:01:43 PM",
  "content": "I am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473708",
  "comments": [
    {
      "author": "Mia Chloe",
      "created_time": "November 11, 2023, 01:21:29 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PM if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.Are you intending on investing in shit coins? If yes I do not advice you do so as they can dip exponentially at any time which can result in high losses.Also it is important for you Op to understand that crypto investment doesn't always turn out rosy like you see in the movies.Op I suggest if you want to invest invest in Bitcoin and invest what you can afford to lose because although Bitcoin has been the best so far it still is a crypto currency.lastly op do not rush into investing without first understanding what you are investing in .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "November 11, 2023, 02:05:56 PM",
      "body": "OP Bitcoin is the only coin that is trusted by everyone in the crypto space, even though there are a ton of intended coins one may consider investing against the year 2024. But if you would want to explore additional investing options through diversification, you can choose from the top 100 coins available on CMC. But keep in mind that you bear the risk(not that of another person) whenever you decide to invest in an altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "November 11, 2023, 02:42:26 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.You are here since June but now excited about bitcoin signal, I hope you are not excited about the new green candles all over the market.If you want to buy coins, you need to do a proper research about the coins you have in mind even if they make a suggestions for you. We have more than thousands of crypto available to loop out for but altcoins in specific gives more returns but are very risky and dangerous to invest because a month is too big to lose everything on them.Bitcoin I know and I understand very well, because we are going to have halving that happen every 4 years, people look forward to see increase in it's price because miners reward will be halve which means that their mining reward is going to half and conventionally bitcoin is going to pump but this is not a guarantee to why you should invest, its just safe to buy bitcoin than altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "November 11, 2023, 02:47:42 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.Do you always take advantage of other people's opinions and rely on others? If so, you are likely to lose your money and not even realize why it happened. As long as you don't understand where and why to invest, no one can help you. Yes, you can listen to someone, but you should make the decision to invest in this or that asset only yourself. The abbreviation DYOR exists for a reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 11, 2023, 03:01:44 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024.Your English is not good and you need to improve it first.QuoteWe need a good crypto analyst of wall street standard.Cryptocurrency market is different than Wall Street and stock market. If you want to hear opinion from Wall Street experts and use it for cryptocurrency market, you are on a serious wrong track.Each new market cycle will catch attention of new people who will bring new capital into this market. You must think of reasons why newbies join this market, it is because of Bitcoin growth with a new bull run. When they join the market, it's like too late to buy bitcoin, at least they think so and they choose altcoins.They must be in this market like 1 or 2 cycles (4 to 8 years or more) to understand that altcoins are very scam.Just in one bear market, How many cryptocurrencies failed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "November 11, 2023, 03:08:31 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.It seems you are looking for a coin that can give you maximum profit in a year period. If you are new in the crypto space, you are likely to get fooled by so-called crypto influencers who will suggest this and that. Do not rely on others' opinions. Do not expect too much from crypto when you are just a beginner. Most of the beginners made lose in their first investment. Stop caring about others opinion if you don't know anything about it. Do not rely on others or Eventually you will get busted. Bitcoin is the only crypto on the internet that is reliable in the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 11, 2023, 04:26:30 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world.I hope those spoken to will listen and adhere to what's said. These are priceless stuff being passed around here. It's one thing to take a horse to the river but no one can make it drink water if it doesn't intend to.QuoteWe need a good crypto analyst of wall street standard.There are several users here who give insightful analyses but we must come to the realization that we all speculate on price and no one holds the holy grail when it comes to cryptos. Surprises abound in this industry. Most times, overlooked cryptos are the ones that give better ROI. The best thing now is get enough Bitcoin you can lay your hands on and hodl for the bull run. The expectations are pitch high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "November 11, 2023, 04:55:26 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of Wall Street standard.Since you said you are a newbie then there is a need for me advice on several things that you need to know about cryptocurrency and its resultant risk, and that is the reason why you need to consider and manage your risk at all times, and at that also you need to place high regards stable assets, I stead risking your money on shit coins which may likely become scam where you lose your entire holding and this is what most must have to know before venturing into cryptocurrency investment.And if I may advise you, then I will say that you should hold bitcoin instead of altcoins, I know a lot of people are looking for cheap, and risky coins for short-term speculations, but I want to let you know that, altcoins are high-risk investment reasons why you need to concentrate on long term assets like Bitcoin, as the best form of investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "November 11, 2023, 05:34:36 PM",
      "body": "Quote from: Marykeller on November 11, 2023, 02:05:56 PMOP Bitcoin is the only coin that is trusted by everyone in the crypto space, even though there are a ton of intended coins one may consider investing against the year 2024. But if you would want to explore additional investing options through diversification, you can choose from the top 100 coins available on CMC. But keep in mind that you bear the risk(not that of another person) whenever you decide to invest in an altcoin. BTC is the first choice of everyone but there are many risk-takers who also exist in the market who want to take risks because they know with risk comes more profit and of course, more loss too but what remains there is risk without the fear of losing money.Op you should avoid listening to others and do your own research because that would be best for you, you don't even share your capital and the strategy like whether are you planning to hold or trade. But in my opinion, BTC is really the safest place to invest in because the future is bright.But if you are one of the risk taker then take the risk and invest in ALTs too because no doubt they are risky but also very beneficial too. In the end, the choice is all yours and the research is all yours, there will be no one to blame for your loss but only you so listen to our suggestions and do only what you think is right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 11, 2023, 05:39:34 PM",
      "body": "Lmao even those \"wall street standard\" analysts get things wrong all the time. What the smart investors recommend doing is always to just go with an S&P500 index fund; in which, in crypto terms, BTC pretty much acts as the de-facto S&P500 because of its heavy influence over the overall crytpo markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 11, 2023, 05:43:21 PM",
      "body": "Quote from: Mia Chloe on November 11, 2023, 01:21:29 PMAre you intending on investing in shit coins? If yes I do not advice you do so as they can dip exponentially at any time which can result in high losses.Also it is important for you Op to understand that crypto investment doesn't always turn out rosy like you see in the movies.Op I suggest if you want to invest invest in Bitcoin and invest what you can afford to lose because although Bitcoin has been the best so far it still is a crypto currency.lastly op do not rush into investing without first understanding what you are investing in .Hmm I am a movie lover, watched a lot of movies till now but never watched one in which one made huge money out of crypto as you said above. I was having the same mindset as you have now that ALTs are shitcoin and we should only go after BTC and should avoid trading or holding in ALTs.You might read my replies saying BTC is better than ALTs and I still have the same feelings but ignoring ALTs might be a mistake. Because ALTs are risky and more volatile than BTC and there is no doubt about it but think for another second, if you have already invested some funds in BTC and now you have more funds then giving ALTs a try is not so bad.As if you would have invested in ALTs you can make 2x in this recent pump of BTC where it goes from $25k to $37k while you can't make that in BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 11, 2023, 06:00:13 PM",
      "body": "I understand your desire to find someone to tell you or reassure you about a profitable investment that will earn you millions, but you will be the only one who will bear the loss. it is best for you to learn the basics of trading, technical analysis, how to choose the best platform for you according to your country, and then invest in the appropriate currency for the shortest possible to achieve success. and In the end, you will find that buying Bitcoin within next 12 months is the best investment if we ignore the risks or complications associated with investing in altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "November 11, 2023, 06:37:23 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.Knowledge is vital in the cryptocurrency market that's if you want to go far and you shouldn't let the opinion of others determine your investment decision always DYOR.Having said that, this current market trend will be determined by the Bitcoin halving block effect and aside from that, you should always make BTC your investment priority because it's the only true decentralized crypto in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "November 11, 2023, 07:17:30 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.The best coin that anyone can invest in in any year is Bitcoin, because from the past until now I have not found a better coin than Bitcoin so you can also consider Bitcoin as the best coin for you to invest in for the long term. You can make quite real comparisons with things like this where you try to research other coins and then try to compare them with Bitcoin which has been trusted by many people all this time. Surely you will find quite fundamental differences in each coin where Bitcoin will still be superior to any coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 11, 2023, 09:36:06 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.First bitcoin, then others, the ones i referred to as others are altcoins, which you have to take your time to make research about them before starting an investment, you also have to consider the risk that may be involved in making an altcoin Investment because anything can happen when we make decision on them, but when we choose bitcoin, all we need is to hold, have patience and safe keep our assert in a cold storage while waiting for market to pump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "November 11, 2023, 10:47:25 PM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.Can you be more specific in asking for advice on your topic because I'm confused about what answer to give you lol. 2024 is just around the corner, but not all traders pay attention to all assets in the crypto market, the majority only pay attention to 1 to 3 assets and the majority is bitcoin, I still advise you to only invest in assets that already have a good reputation and are immune to inflation. like Bitcoin, don't be easily fooled by marketing phrases, let alone get caught up in tokens that are just based on hype. if you want to listen to my advice then you will have a good 2024 but if you ignore my advice then there is a big possibility that you will get rug pulled by shit tokens lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "November 12, 2023, 07:55:14 AM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.I'm having a hard time understanding your post, but it's ok. I also have some difficulties in constructing English sentences as well. Overtime, as you read threads here, and share your opinion thru making a post, you will learn how to make proper, and better sentences like I am (though I'm still not good either) . Back to your post, why do we need an analyst of wall-street standard whatsoever? Hire me, I'm also an analyst. I make predictions base on what I see on the market.  Kidding aside, whether it's an analyst, an expert analyst or an Average Joe, they only do one thing in common, and that is to predict the market. The only differences is their explanation towards their prediction, but still they can't predict the market with 100% accuracy.Just focus on Bitcoin I guess, and if you will try to buy an Altcoin, go with Ethereum only. That is if you're a newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 12, 2023, 09:25:19 AM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.This is the Beginners & Help board and no one here will advise a beginner to invest in any altcoin aside from bitcoin which is dependable and has high tendency of profitable in the long run. If you want people to advise you on other altcoin to invest in, you can drop and ask the same question in the altcoin section. As a beginner, just focus on bitcoin and don’t invest in any altcoin, this is a candid advise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "November 12, 2023, 10:20:55 AM",
      "body": "Quote from: Vickky Rae on November 11, 2023, 01:01:43 PMI am so elated each time I come into this forum and see thousands of members who are already outside the matrix doing great things and doing everything possible to get the novice and beginners up in the crypto world. I want to put it out here Iro know if possible we can get to know the intending coins that one could invest into against 2024. We need a good crypto analyst of wall street standard.I will request OP that kindly rephrase your statement because It's very hard to understand,what you want to say. Regarding your searching about potential coins for investment leading up to 2024, I would like to tell you that Bitcoin is the only coin which is often regarded as the most safe and most established cryptocurrency. Some other coins like Ethereum,Matic etc also also good coins but these tokens can collapse any time just like Luna which BTC is the only totally decentralized coin and adopted by huge investors. Daily so many new coins are launching including meme coins and it's not easy task to find a profitable token amongst thousand of projects. It's possible that one project gives a huge Profit in less time like Shib, doge, floki etc given but you have to invest in more than 100 project and who care it. I will advise you to keep your fund in btc for long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}