{
  "id": "topic_5422536",
  "title": "PrivacyG",
  "author": "PrivacyG",
  "created_time": "November 22, 2022, 02:24:09 AM",
  "content": "As Bitcoin users, we get the chance to use our financial resources precisely the way we want.  You get to choose whether you want anyone else to be in control of your keys.  You get to choose whether you want to have enhanced privacy or not.  You get to choose where to pay fees from and who to send money to, without a third party's interference.  You get complete freedom over your own assets.Now let us focus for one moment particularly on the second thing I mention.  You get to choose whether you want to have enhanced privacy or not.As a community, no matter what aspect and subject we try to discuss we are going to be split.  Although some of us sit at the extremes, there are many who partially care and partially do not.  There are many who are trying to sustain their own mindset and not agree with the opposing view.  But I think privacy is something concerning each and every one of us.  You need privacy, I do as well.  Everyone needs at some point.  You have curtains in your rooms, you never shower in front of a clear window, you never share intimate conversations with anyone surrounding you, you probably have a passcode on your phone and you are maybe afraid of telling everyone about your Bitcoin holdings.You are doing all of this because you want privacy.  If there is anyone who says 'no' to everything I stated above, you are probably among the extremely few who truly do not care.  But truth is, almost everyone cares.  Whether it is subconsciously or not, there is this feeling of discomfort and / or fear surrounding this idea of having zero privacy.Bitcoin gives you freedom.  You choose if you want everything about your financial history to be public knowledge or you can choose to break the chain and make every single possible future 'spy' of your account lose your track.  I often hear this idea that zero privacy is not a big deal because you have nothing to fear if you have nothing to hide.  But this has been proved wrong multiple times in our history.  And if you have ever had your identity stolen, you know this saying is false.  Everyone has something to hide, which is not a bad thing.  Privacy exists for a reason and just because a Blockchain is public does not mean you should justify and publish information about you for everyone to see.Logically and morally, nobody should care about the things you do with your own money.  I am definitely against any kind of crime, but I am aware that if crime is prevented with Bitcoin, all the ex Bitcoin criminals will find an alternative.  Probably Monero.  Probably not.But realistically speaking, we have been taught to fear hiding anything.  I know, this may sound like I am getting this thread closer to some kind of conspiracy.  But we have all been pretty much brainwashed to believe having privacy is wrong.  Which is insane, because things used to be different only few years ago.  Nobody really cares what you have done with your cash bills, so why would they care about the track of your Bitcoin?  Is it because Bitcoin is not a private ledger?  Or is it just because they like collecting information on us and placing fear under the idea of privacy?Anyway.  I am personally sitting at the extreme of privacy seeking Bitcoin users.  I know, name checks out.  I am doing whatever I can to cover my footsteps, and I am not a criminal.  It is just so creepy to me knowing that someone out there is trying to untangle my financial records to find out what I am doing with my personal life.  I know what theft of identity is and it is very scary.  It freaks me out that Exchanges get to check out your history and steal your money for believing or pretending your assets come from an illicit source.  It is scary that for anything I do, there is a bot, an AI or a human being trying to link all sorts of meta data and information to my own actions.In consequence, I chose protecting my privacy and personal life.  I am using mixers and Coin Control to make sure my assets have no link to my identity.  It is a hard work to do because you have to carefully watch every single step you make, but it is worth it in the end since I feel free.  Nobody is watching me closely, which feels incredible.But I am very conscious there are a lot of you out here who simply do not give a damn.  Which begs the question for me, why is it that you do not give a single damn about your own privacy when using Bitcoin?  Why not protect yourself in front of all sorts of attacks if you have the chance to do so?  Also.  What do you think about us, who try their hardest to 'hide'?  Do you think we are suspicious or are you perfectly fine with our way of living?  Do you think the number of criminals is larger where there are more privacy enthusiasts?-Regards,PrivacyG",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422536",
  "comments": [
    {
      "author": "EvryIntl",
      "created_time": "November 22, 2022, 02:31:27 AM",
      "body": "Those that do not care about their own privacy are setting themselves up for slavery.  Everything else is irrelevant.  More crimes are committed in USD than anything else.  It makes no difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 22, 2022, 02:43:44 AM",
      "body": "bitcoin the network- privacy is good. bitcoin does not ask for your birth name or a log of products list or geo-location. bitcoin has no eyes or ears. it just doesnt care. because it has no brain. its just code. code that doesnt invade your privacythe ecosystem of businesses at the edges of bitcoin- privacy is bad when it comes to using services that require names and real life location datasuggesting to break the bitcoin network to break the anti-counterfeit security of showing origins back to the coin creation reward. just for the sake of lazy people that dont want to protect their privacy at the business gateways, is not a good planif you want to continue using businesses that ask for KYC and keep your product purchase list and your real life delivery address. but want to break bitcoin.. your priorities are scewedit should be:create busineses that dont ask for KYC to preserve privacystop using businesses that ask for KYC in situations where real life locations are not requiredEG a online game where real life location does not have any effect on the game play/content, should not be asking for real life location dataEG services where no goods are to be delivered to real life location again dont need to know real life locationpeople need to start making competing services to the ones that ask for KYC. rather than using existing businesses that ask for KYC and then trying to break bitcoin security feature of network wide audit of coin integritybecause if you cannot prove a coins origin back at its coin reward creation. it then becomes alot easier for people to counterfeit/copy/create new coin outside of the coin reward system. which is far more dangerous to every users bitcoin security. at the sake of people that want to keep giving their info away to services. and blaming bitcoin if their data gets passed arounddont blame bitcoin. blame the businessesagain the bitcoin network does not ask for your name/geo-locationso dont blame the bitcoin networkdont try to break the bitcoin networkthe issues are with the BUSINESSES that want to grab peoples names and geo location and product purpose lists. and also blacklist certain uses fundsdo something about the businesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 22, 2022, 03:53:15 AM",
      "body": "The reason why most people don't care with their privacy is:1. Modern culture, everyone really want to flex their wealth in front of anyone, they want to get respect and get a lot friends that also rich.2. Poor people, they're don't care with privacy since they're poor and only want instant money. They wouldn't mind to trade their KYC just for $5 because they're know they don't have anything, so any criminals wouldn't attack them.3. Careless people and low knowledge people, they're trust centralized exchanges because they leave their coins inside the exchanges. They think the only one who know their KYC is the exchanges and anyone wouldn't know since they're think Bitcoin is anonymous, while it's actually pseudonymous. We need to use mixer and dex that run in Tor to achieve complete anonymous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 22, 2022, 04:28:19 AM",
      "body": "The way I see it — knowing that privacy with Bitcoin (and on the internet in general) takes a good chunk of extra steps(and requires a good amount of knowledge) to achieve, people just end up turning a blind eye. This is why we need privacy by default(or at the very least to be as easy as possible).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "November 22, 2022, 04:36:16 AM",
      "body": "Convenience I guess if I were to name it? They choose to leave some aspects of their lives in the hands of a third party for a few immediate benefits that they can experience, one of which is the personal handling of their assets. It's linear, straight-up easy to use, and nothing complicated whatsoever to learn. The funny thing is it also sets them up to blame someone else when something happens instead of themselves when they can do something about it in the first place. Pretty sure setting up your privacy isn't really anything bad, as I've said before, it's simply an option that some people choose to abide by. It's also affected by the culture they grew up I guess? Some of my friends have that social media mindset where they have to share/brag about everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "November 22, 2022, 04:43:19 AM",
      "body": "You would likely not get an answer directly from those who do store their funds on an exchange, or you'll get the generic one of how it's being used to trade and it's expensive to transfer between exchange and wakey several times.Quote from: Wexnident on November 22, 2022, 04:36:16 AMConvenience I guess if I were to name it? They choose to leave some aspects of their lives in the hands of a third party for a few immediate benefits that they can experience, one of which is the personal handling of their assets. And this is only an imagined benefit which does not really exist in reality.I find it way more easier to create an electrum wallet and back it up securely, all of which can be done under a few minutes, than to create an account on exchange, toggle back and forth from my email to the exchange to verify that, and then have to pass a KYC process which could take anything from a few minutes to a couple of days. When making a transaction, one would also need to toggle back and forth from their email to the homepage.The perceived convince really does not exist in practice. I would be much safer handling my assets myself, than leaving it with a third-party, but that's just me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "November 22, 2022, 05:25:05 AM",
      "body": "Well, you basically have two kinds of people with very different views on privacy. On the one hand ...you have the people that believe in centralized authorities and the control that they must have over all citizens (Control freaks) .... and most of those people do not care about financial privacy. (Chinese / North Korea ....etc...) Then on the other hand.... you have the people that think out of the box ... those people that do not follow like a sheep... and those people that understand that financial freedom are important. I am not a Sheep... I can think for myself and I do not adhere to the norm. Personal information can be misused and manipulated by centralized organizations. Financial information can be used against you... (Do you donate to Wikileaks? .... can governments use that information against you?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 22, 2022, 05:48:37 AM",
      "body": "It's weird to think of a person who doesn't think of their privacy. It's either they are famous or just darn stupid to think of what they will do with their information. It's a good practice to take good care of privacy, but at the same time, it prevents people from doing evil acts that would affect many people. In essence, it's a matter of philosophy whether it's okay to share your information as long as it's for the greater good, KYC, and AML applications. And at the other end of the spectrum is the private person, who wouldn't want to participate in KYC and AML things because they want their information to stay personal with only them and not give up at all what they hold dear. It doesn't mean it's not essential; they want to comply because they are using services that would make life easier for them and be in the \"system.\" The stigma should be removed that if you are interested in protecting your privacy, it doesn't correlate immediately that you are a criminal. But that's the thing with the argument. If you have nothing to hide, why hide it? Is it for the greater good? This is a dilemma that is not going to be solved lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 22, 2022, 07:15:36 AM",
      "body": "If you ask me, around 90% of all Bitcoin/crypto users care only about the profit, not about their privacy. Maybe a small percentage cares about both the profits and their privacy.There are several reasons why the people neglect their online privacy:1. Laziness.2. Ignorance.3. The \"it's not doing to happen to me\" mentality, when it comes to getting scammed and/or doxxed.4. Putting way too much trust in the centralized crypto companies because they are \"regulated\". As if being a regulated company can protect the customers from getting scammed.There's no solution to this problem and the vast majority of the online users will keep neglecting their online privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 22, 2022, 07:33:45 AM",
      "body": "May be affected by the environment.If identity is something that is usually exchanged for something of value even though it is not actually comparable, then you will feel like you are missing something when other people do it. Moreover, they had never heard of the evil of leaking that information around them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "November 22, 2022, 08:47:07 AM",
      "body": "I think the answer is simple, because people have lost the edge between privacy and earning. For the majority, Bitcoin and cryptocurrency is no longer about privacy, but about how to earn. In addition, people always does not care about privacy much. They try to hide the amount of their salary, but if someone ask, they gladly share numbers. Or without hesitation make a proper mark next to \"from - to \" answer to a question \"how much do you earn\" in questionnaires. In the past, when cryptocurrency wasnt so much familiar, people cared much about privacy. Now, when crypto is known to masses, no one cares about privacy anymore. Specially when everything is transparent and every transaction is visible. I think people think that if everything is so visible, why try hiding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 22, 2022, 08:56:00 AM",
      "body": "Because they still not get any problem when they sold their identity or expose their identity to anyone, it just happen on other people and it's not on his country. It's similar like centralized exchange, everything is good and we can withdraw our coins from the exchange whenever we want, why we need to scare? But when the exchange got hacked and they loss all of their coins, they will learn after it. So we just need to wait until they got a problem after they expose their privacy to public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 22, 2022, 09:06:47 AM",
      "body": "Some people just want to get rich very fast with BTC and nothing else, that could be a reason not to care about privacy, but just the bucks and how fast it can come. I think it goes without saying that the reason or purpose why someone is using BTC will determine if they will care about certain things or not, for a person who is curious about the technology and how Satoshi was able to achieve it, such person will make research, and in doing so will learn about the importance of privacy when using Bitcoin, and would therefore implement it, but for a person who only wants to trade, make a few bucks, convert from BTC to various other altcoins and back just to make money only, without having any real knack for the BTC network, this person will likely not care about their privacy when using BTC, maybe unless they get burnt in one centralized exchange or token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "November 22, 2022, 09:32:28 AM",
      "body": "Quote from: Z-tight on November 22, 2022, 09:06:47 AMSome people just want to get rich very fast with BTC and nothing else, that could be a reason not to care about privacy, but just the bucks and how fast it can come. I think it goes without saying that the reason or purpose why someone is using BTC will determine if they will care about certain things or not, for a person who is curious about the technology and how Satoshi was able to achieve it, such person will make research, and in doing so will learn about the importance of privacy when using Bitcoin, and would therefore implement it, but for a person who only wants to trade, make a few bucks, convert from BTC to various other altcoins and back just to make money only, without having any real knack for the BTC network, this person will likely not care about their privacy when using BTC, maybe unless they get burnt in one centralized exchange or token.Certainly not just some people, it could be said that most of the market participants are in it for profit, and not many people care about privacy. I don't know how it is in your area, but in my area the people involved in cryptocurrency are young people and the youth goal is get rich quick not privacy. I asked some investors and they said that privacy is also necessary but if you don't have money then what's the use of privacy? So, the initial goal when entering this market is how to make money is the first thing they think of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "November 22, 2022, 09:32:58 AM",
      "body": "Privacy is a Right as long as we do it right. * My few advice to privacy conscious people. Be very transparent as possible unless bad people want to take advantage of your transparency to harm you or/& others. I think we can only keep things that are Safe/Good/Just private while exposing evil.You should only follow the privacy path in the public, dangerous or trustless environments. But make sure what you are hiding isn't evil or unjust. If you are in possession of hidden things that are evil or unjust make sure you expose them to those more trustworthy, moral and better than you. They would handle that better or guide you on how best to treat the secret for your sake. It's not right to say \"I have nothing to hide,  as you are probably hiding your private bodyparts, Bitcoin keys, digital/online passwords etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 22, 2022, 10:45:50 AMLast edit: November 22, 2022, 11:12:35 AM by franky1",
      "body": "you have the right to your personal self and your propertythis means your personal life and information and your property like bitcoinbut when it comes to FIAT finances.. that is not your property. yep fiat money is under patent and property of your governments central bank. they have the right to withdraw it out of circulation and control who gets to play with how much of it. yes bitcoin is different. it has no patent no owner of the network payments system, and so if you are the sole key holder of the coins signing feature. then you are its owner. its your property. no one elsesbitcoin does not ask for your personal information. so it is private.however as soon as you use a businesses service. you are entering the property of the business. where the business can set its policies on its property. dont blame bitcoin about privacy risk. blame the businesses that question, monitor and log customers information and transactionsagain for emphasis. for those that are using \"privacy\" to break the p2p bitcoin network. stop with your childish games of trying to break bitcoin to then promote altnets as solutions to things.if you are a true privacy advocate you would not be wanting to break bitcoin to then get people to use altnets that are managed by businesses you would instead be trying to start your own businesses or find people that want to have businesses that do not ask for information that is not required to use the serviceit does not matter what code the bitcoin network has or doesnt have,. if your giving information to businesses. those businesses swap data with each other and you end up in the same position as before you tried to wreck the bitcoin network.so go after the businesses asking you for the information. not after the network that doesnt ask for your information",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "November 22, 2022, 11:50:24 AM",
      "body": "From my point of view, the answer to the question of why most people seem not to care about privacy is very simple - they haven't yet realized they are being seen and used as a product. Adventurous and impudent personalities make money off of those who are passive and ignorant: their data is being sold to third parties, stolen or gathered, and shared without consent or proper warning. Once honest people realize that to live in today's world means striving to be or look like a \"useless\" product to others, they will start to care about their privacy, and they will want to protect it from invasions. Privacy is not a right, privacy is a goal that no individual will ever achieve completely, but it doesn't necessarily mean you should stop trying to fight for it. It is definitely worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "November 22, 2022, 12:37:56 PM",
      "body": "I think some of the people that had passed their details to some exchanges are in a rush and only found out the danger of sending their personal information to the internet, later on, most of them regret it. That is why before doing anything in the crypto industry, it's better for you to learn more and equip yourself with enough knowledge in order to avoid any danger that could damage your reputation in your community with a crime you haven't committed. Because if your KYC details will be sold to some notorious scammers and they will gonna use them for their crimes, you will get involved and it's a long process to explain to the cops that you are innocent about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 22, 2022, 12:47:15 PM",
      "body": "Quote from: mk4 on November 22, 2022, 04:28:19 AMThe way I see it — knowing that privacy with Bitcoin (and on the internet in general) takes a good chunk of extra steps(and requires a good amount of knowledge) to achieve, people just end up turning a blind eye.You can get a very good chunk of the way there by simply not handing out your KYC. That doesn't take any effort at all. Just don't do it. The vast majority of privacy which is lost is lost because it is given up voluntarily.Quote from: Wexnident on November 22, 2022, 04:36:16 AMConvenience I guess if I were to name it? They choose to leave some aspects of their lives in the hands of a third party for a few immediate benefits that they can experience, one of which is the personal handling of their assets.I'm yet to figure out what is convenient about losing all your coins because the centralized exchange you left them on has gone bankrupt or was just an outright scam all along.Quote from: crwth on November 22, 2022, 05:48:37 AMIf you have nothing to hide, why hide it? Is it for the greater good?If I have nothing I want to share, why should I be forced to share it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}