{
  "id": "topic_5460113",
  "title": "gospodin",
  "author": "gospodin",
  "created_time": "July 17, 2023, 04:45:09 PM",
  "content": "mehmet şimşek tarafından günün son haberi: https://www.aa.com.tr/tr/ekonomi/bakan-simsekten-kamu-kurumlarina-tasarruf-genelgesi/2947412kamu kurumlarına genelge gönderilmiş diyorlar. QuoteBütçelerde ilave yük oluşturacak şekilde faaliyet genişlemesine ve iş artışına gidilmemesi istenen genelgede, ilgili mevzuatta belirtilen faaliyet alanlarıyla doğrudan ilgili olmayan herhangi bir harcama veya taahhütte bulunulmaması, ihale şartname ve sözleşmelerine alım konusuyla ilgisi olmayan unsurların dahil edilmemesi ve yapılacak alımlarda ölçek ekonomisinden yararlanarak ihtiyaçların daha düşük maliyetlerle karşılanması amacıyla ortak alım yoluyla tedarikin yaygınlaştırılması için azami gayret gösterilmesi gerektiği vurgulanmıştı.Quotebahse konu genel ilkelerin yanında, kamu kurum ve kuruluşları, taşınmaz edinimi ve kiralanması, resmi taşıt edinimi ve kullanımı, haberleşme giderleri, personel görevlendirmeleri, basın ve yayın giderleri, kırtasiye ve demirbaş alımları gibi giderlerini tasarruf kurallarına uygun gerçekleştirecek.kırtasiye giderleri derken mesela neden bahsediliyor? çünkü o kadar büyük bir kalem ki buraya toner de giriyor kalemtıraş da. belirlenen bütçeye göre sanırım kesinti yapılacak. demirbaş konusunda da müdürlere en kral koltuklar çekilmeye devam ederken memura ise allah ne verdiyse şeklinde devam eder. bilgisayar, yazıcı, tarayıcı vs konusunda haklılar diyebilirim ama kullanılan eski makineler varsa bu işlerin yürütülmesi konusunda sıkıntı doğurabilir.QuoteBunun yanı sıra kamu kurumları, temsil, tören, ağırlama, tanıtım ve personel giderleri, enerji ve su alımları, personel servisi hizmetine ilişkin giderler ve diğer hususlarda genelgede belirlenen kurallara uymakla yükümlü olacak.tören, temsil vs kaleminin kesinlikle ortadan kalkması gerekiyor. direkt olarak bu kalemi yasaklasalar fena olmaz, gerçi bütçenin başka kalemlerine sokup işi hallederler ama en azından silinir tarihten.servis konusu büyük bir sıkıntı. artan maliyetler yüzünden gerçekten bütçede büyük bir yer tutuyor ama büyükşehirlerde toplu ulaşım gerçekten sıkıntı.enerji alımlarına dikkat edilmesi mantıklı. devletin malı bedava diye saçma sapan davranan insanların olduğu bir memleketiz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460113",
  "comments": [
    {
      "author": "Jossque",
      "created_time": "July 17, 2023, 05:46:16 PM",
      "body": "Nereden kısarsak kardır gözüyle tedbir almaya devam ediyorlar.Zamanında har vurup harman savrulmuş mevkilerde artık devir tasarruf devri bu açıklamalara bakılacak olursa.Müdürlere yine aynı şekil devam edebilir fakat bir alt sınıf memurlara zarar verdikleri şeylere karşılık parası istenebilir veya kendisinin yerine konması talep edilebilir.Her bölümün kendine göre bir bütçesi olabilir bu saatten sonra.O bütçeyi aşanlar kendi cebinden karşılayacak heralde bundan sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "July 17, 2023, 10:26:55 PM",
      "body": "Üst kademelere yansımayacak olan bir tasarruf tedbiri genelgesi hazırlanıyor herhalde. Bir yere giderken 40 araç konvoy olacağına 2 araçla giderse devlet erkanı zaten tedbirin en büyüğünü yapmış olacaklar. Hem araç bakım, hem yakıt, hem de diğer giderleri azaltacaklar. Bunun yanında gereksiz yanan lambaları bile söndürseler devlet kâra geçer. Devletin malı deniz, yemeyen keriz mantalitesinde giden tipleri tespit edip bunlara büyük cezalar kesilmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 18, 2023, 08:46:40 AM",
      "body": "Artık bundan sonra herkes servissiz işe gitmek zorunda kalacak desenize, masa başında klimaları da herhalde kısarlar, yalaka üst takım memurların hepsine sorun yaratırken kendilerinde yine değişen bir şey olmayacak, eğer kamunun tüm alanında baştan aşağı bir yenileme olursa ve bu yönde tasarruf tedbirlerini hallederlerse güzel karar, bakalım buna ne kadar uyacaklar,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "July 18, 2023, 03:35:39 PM",
      "body": "Kamuda pek tasarruf tedbiri varmış gibi görünmüyor. Vergilerimizle Mekke'ye giden gazetecimsi yandaş fulya umreyi beleşe getirmiş. Ne güzel iş di mi?Bu devlet bu kadar büyük olduğu sürece beslemek için vergiler artırılacaktır. Yıllardır aynı şeyleri söylüyoruz sorunun çözümü var ama çözmek isteyen yok. Anca geçici önlemlerle sömürü düzeninin devam etmesini sağlıyorlar. Oy verirken düşünmeliydiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 21, 2023, 06:04:40 PM",
      "body": "Quote from: LGD2Business on July 18, 2023, 03:35:39 PMKamuda pek tasarruf tedbiri varmış gibi görünmüyor. Vergilerimizle Mekke'ye giden gazetecimsi yandaş fulya umreyi beleşe getirmiş. Ne güzel iş di mi?Bu devlet bu kadar büyük olduğu sürece beslemek için vergiler artırılacaktır. Yıllardır aynı şeyleri söylüyoruz sorunun çözümü var ama çözmek isteyen yok. Anca geçici önlemlerle sömürü düzeninin devam etmesini sağlıyorlar. Oy verirken düşünmeliydiniz.Her devrin bu tarz kendi emelleri için devsirdigi isimleri mutlaka vardır, bu hanım abla deprem dönemi çok popüler oldu ama benim en sevmediğim şekilde gündemde kaldı, aile kızı tavrı, delikanlılik havaları falan bana yapmacık geldi.Gelelim kamu tasarruflarına, meclis lokantasından başlasinlar mesela en basiti, milletvekili cep telefonu faturalarından başlasinlar, ne bileyim işte en yukarısı önce bir başlasın, aşağıdakilerin harcamasının devede kulak bile olmadığı ortaya çıkar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 22, 2023, 06:48:22 AM",
      "body": "Quote from: LGD2Business on July 18, 2023, 03:35:39 PMKamuda pek tasarruf tedbiri varmış gibi görünmüyor. Vergilerimizle Mekke'ye giden gazetecimsi yandaş fulya umreyi beleşe getirmiş. Ne güzel iş di mi?Bu devlet bu kadar büyük olduğu sürece beslemek için vergiler artırılacaktır. Yıllardır aynı şeyleri söylüyoruz sorunun çözümü var ama çözmek isteyen yok. Anca geçici önlemlerle sömürü düzeninin devam etmesini sağlıyorlar. Oy verirken düşünmeliydiniz.Fulya rengini belli etti zaten ama şaşırdığım şey Ak Partiden milletvekili teklifi alıp bunu nasıl kabul etmedi? Bunu çoktan kabul edip meclise girerdi diye düşünüyordum ama kabul etmemesi beni şaşırttı. Tek övdüğüm ve başarılı bulduğum noktası deprem bölgesinde en uzun süre kalan gazetecilerden birisi ve sürekli oradan bilgileri aktarıyordu. Yaptığı bu olay ona hiç yakışmadı. Parasını verip cebinden gitseydi en azından takdir edilirdi. Bedavaya getirmesi devlet eliyle gitmesi çok yanlış oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 22, 2023, 09:13:05 AM",
      "body": "İstedikleri kadar kamu kurum ve kuruluşlarında tasarrufa gitsinler hiç birşey olmaz. Çünkü kamu kurum ve kuruluşlarının 1 yılda harcadığı parayı sadece 1 şehir ve ülke gezerek fazlasıyla harcıyorlar. Koruma ordusu, Aksarayın şatafatlı duruşu derken iyice mahvettiler güzel ülkemi. Kuruluşlara dokunmadan önce kendi israflarını önlesinler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 22, 2023, 08:07:37 PM",
      "body": "Besim Tibuk'un LDP başkanıyken yani 20 küsür yıl önce 'biz iktidara gelince Ankara'da her şeyi kapatıcaz' gibi söylemlerine eskiden gülüp geçerdik, hatta meme'i bile yapılmıştı. Ama şimdi işte adama biraz hak veriyorum. Özellikle çevremde de kpss'ye girip memur olan 2-3 kişi oldu. Biri mesela öyle gereksiz bir kuruma girmiş ki, tüm gün abartısız yatıyor, yaptığı işe göre acayip yüksek bir maaş alıyor. Bu sadece devletin çok çok uzak bir kolu. Ankara'da daha ohooo neler vardır. Kamuda verimlilik kesinlikle çok aşırı büyük bir sorun. Gene LDP sloganıydı galiba yanlış hatırlamıyorsam ama Ankara küçülmeden Türkiye büyümez gibi bir şey diyorlardı. Yani bu kamunun gereksiz şeylerinden kurtulup verimliliği de artmadıkça işimiz bence de zor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 23, 2023, 08:35:53 AM",
      "body": "Quotehttps://t24.com.tr/haber/kamuya-tasarruf-tedbirleri-gonderildigi-gun-aile-ve-sosyal-hizmetler-bakanligi-na-800-bin-liraya-arac-kiralanmis,1121172mesela burada çarpıtılan bir haber var. ihale henüz genelde gönderilmeden önce yapılmış. televizyonlarda öyle bir anlatılıyor ki sanırsınız ki maliye bakanının genelgesine inat yapılmış gibi. ha, ihaleyi iptal edebilirlerdi. ayrıca sedan araç için ödenecek tutar bence çok fazla. ekap'a girip bakmak lazım ama tahminim yıllık bakım, sigorta ve kasko işlemleri hariç şekildedir.edit: 2023/660372herhangi bir bilgi bulamadım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 17, 2023, 04:17:36 PM",
      "body": "Onlarca makam arabası kullanan sayın büyük gocaman yetkililerin bu genelgede muaflar galiba, yada birbirlerini karşılarken veya ikram verirken de muaflar. Büyük ihtimalle güvenilir kurumumuz TÜİK 'in açıkladığı enflasyon oranında maaş alıp büyük şehirlerde hayatta kalmaya çalışan memurları kapsar bu genelge. Artık bir pcyi 5 memura mi kullandirirlar yada yapılacak iş için evinden kağıt kalem mi getir derler. Maalesef bazı kurumlar memurlarından istekleri bu yönde. Kurumda ara kablosu olmadığı için, iş yapabilmek için kuruma kendi cebinden ara kablosu, ethernet kablosu, ram alan memur var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "August 17, 2023, 05:50:48 PM",
      "body": "Kamuda üst kesimlerden başlanarak top yekûn tasarruf tedbirleri uygulanmalı ama ne oluyor bakanlıklar illere iller kaymakamlıklara gönderiyor onlarda diğer kurumlara tebliğ ediyor sanki tasarrufu sadece alt kurumlar yapsın gibi oluyor üst kurumlarda tasarrufla alakalı bir şey olmuyor. Topluca tasarruf yapılırsa etkili olur yoksa değişen pek bir şey olacağını sanmıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 17, 2023, 06:02:34 PM",
      "body": "İtibardan tasarruf olmaz düsturu, en yüksek mertebede uygulayicisiyla birlikte yürürlükteyken, aşağıdakilerin kırtasiye vs giderlerinde tasarruf etmelerini istemeleri bana mantıklı geliyor, vergiyi tabana yayalım yukarısı rahatlasın, tasarrufu tabandan isteyelim yukarısı rahatlasın, oh mis gibi memleket valla. Halka örnek teşkil edecek tasarrufları miktar olarak koca koca rakamlara mal olan haklarından vazgeçmeyi vaadeden ne iktidar var memlekette ne de muhalefet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "August 18, 2023, 04:45:27 AM",
      "body": "Kırtasiye giderleri bildiğim kadarıyla ofiste tüketilebilen tüm malzemeleri dahil ediyor. Bu malzemeler evet söylediğiniz gibi kalem kalemtraş falandır muhtemelen ama ofis içinde çok hızlı tüketilir. Kağıt mesela anında harcanıyordur. Bunlardan tasarruf etmek baya zahmetli iş hani ne kadar edilir bilmiyorum. Bence orada asıl maliyetli şey ihalelerdir. Onlar galiba toplu ürün alımları oluyor. Klima mesela ihale ile alınır herhalde. E bozulduysa tamir de edilemiyorsa tekrar almak icap ediyor. Uzun iş yani.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 18, 2023, 05:38:50 AM",
      "body": "Quote from: Pierre 2 on August 18, 2023, 04:45:27 AMKırtasiye giderleri bildiğim kadarıyla ofiste tüketilebilen tüm malzemeleri dahil ediyor. Bu malzemeler evet söylediğiniz gibi kalem kalemtraş falandır muhtemelen ama ofis içinde çok hızlı tüketilir. Kağıt mesela anında harcanıyordur. Bunlardan tasarruf etmek baya zahmetli iş hani ne kadar edilir bilmiyorum. Bence orada asıl maliyetli şey ihalelerdir. Onlar galiba toplu ürün alımları oluyor. Klima mesela ihale ile alınır herhalde. E bozulduysa tamir de edilemiyorsa tekrar almak icap ediyor. Uzun iş yani.Kamuda bildiğim kadarıyla 10 sene önce resmi yazılar artık elektronik ortamda hazırlanıp imzalanıp birçok kuruma gönderilebilir olmuştu, vergi daireleri tapu vs hepsinde kullanılan bu sistem büyük kağıt toner tasarrufu sağladı yanılmıyorsam.bence okullarda da sınav işlerinin yöntemi değişmeli, kaç milyon öğrenci var, düşünsenize senede kaç milyon kağıt sinavlar ile heba oluyor, bunun da artık çağa uygun şekilde artık sınav anında tabletle mi olur nasil olur bilmem ama mutlaka halledilmesi lazim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "August 19, 2023, 02:26:55 PM",
      "body": "Quote from: totti67 on August 18, 2023, 05:38:50 AMQuote from: Pierre 2 on August 18, 2023, 04:45:27 AMKırtasiye giderleri bildiğim kadarıyla ofiste tüketilebilen tüm malzemeleri dahil ediyor. Bu malzemeler evet söylediğiniz gibi kalem kalemtraş falandır muhtemelen ama ofis içinde çok hızlı tüketilir. Kağıt mesela anında harcanıyordur. Bunlardan tasarruf etmek baya zahmetli iş hani ne kadar edilir bilmiyorum. Bence orada asıl maliyetli şey ihalelerdir. Onlar galiba toplu ürün alımları oluyor. Klima mesela ihale ile alınır herhalde. E bozulduysa tamir de edilemiyorsa tekrar almak icap ediyor. Uzun iş yani.Kamuda bildiğim kadarıyla 10 sene önce resmi yazılar artık elektronik ortamda hazırlanıp imzalanıp birçok kuruma gönderilebilir olmuştu, vergi daireleri tapu vs hepsinde kullanılan bu sistem büyük kağıt toner tasarrufu sağladı yanılmıyorsam.bence okullarda da sınav işlerinin yöntemi değişmeli, kaç milyon öğrenci var, düşünsenize senede kaç milyon kağıt sinavlar ile heba oluyor, bunun da artık çağa uygun şekilde artık sınav anında tabletle mi olur nasil olur bilmem ama mutlaka halledilmesi lazimAslında gerçek bir tasarruf yapılsa, çok fazla gereksiz kaynak var ve büyük bir getirisi olabilir. Boşa giden kağıtlar, tonerler bile tüm kamu kurumları hesaplandığında çok büyük gider oluyordur. Damlaya damlaya göl olur mantığıyla ilerlenirse bu tasarruf tedbirleri istenilen noktaya ulaşır. Fakat böyle bir çalışma yapılıyorsa devletin her kademesinde yapılmalı. Bir siyasi başka bir siyasiyi ziyarete gittiğinde bile o kadar çok yeme içme gibi masraf oluyor ki devlete. Bu bile kesilse büyük bir para devlet kasasında durur.Alınan kararlar doğru yani tasarruf yapmaya ihtiyacı var ülkemizin ama bunu herkes yapmalı. En küçük bir belediyede son model araba olmamalı. Araç almayanlar ise araç kiralamalarını son model araçlar için yaparsa tasarruf olmaz. Eğer gerçekten iyi bir şekilde tasarruf yapılırsa bu kararlar hedefine ulaşabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 20, 2023, 06:52:19 AM",
      "body": "Quote from: flyingcarpet on August 19, 2023, 02:26:55 PMQuote from: totti67 on August 18, 2023, 05:38:50 AMQuote from: Pierre 2 on August 18, 2023, 04:45:27 AMKırtasiye giderleri bildiğim kadarıyla ofiste tüketilebilen tüm malzemeleri dahil ediyor. Bu malzemeler evet söylediğiniz gibi kalem kalemtraş falandır muhtemelen ama ofis içinde çok hızlı tüketilir. Kağıt mesela anında harcanıyordur. Bunlardan tasarruf etmek baya zahmetli iş hani ne kadar edilir bilmiyorum. Bence orada asıl maliyetli şey ihalelerdir. Onlar galiba toplu ürün alımları oluyor. Klima mesela ihale ile alınır herhalde. E bozulduysa tamir de edilemiyorsa tekrar almak icap ediyor. Uzun iş yani.Kamuda bildiğim kadarıyla 10 sene önce resmi yazılar artık elektronik ortamda hazırlanıp imzalanıp birçok kuruma gönderilebilir olmuştu, vergi daireleri tapu vs hepsinde kullanılan bu sistem büyük kağıt toner tasarrufu sağladı yanılmıyorsam.bence okullarda da sınav işlerinin yöntemi değişmeli, kaç milyon öğrenci var, düşünsenize senede kaç milyon kağıt sinavlar ile heba oluyor, bunun da artık çağa uygun şekilde artık sınav anında tabletle mi olur nasil olur bilmem ama mutlaka halledilmesi lazimAslında gerçek bir tasarruf yapılsa, çok fazla gereksiz kaynak var ve büyük bir getirisi olabilir. Boşa giden kağıtlar, tonerler bile tüm kamu kurumları hesaplandığında çok büyük gider oluyordur. Damlaya damlaya göl olur mantığıyla ilerlenirse bu tasarruf tedbirleri istenilen noktaya ulaşır. Fakat böyle bir çalışma yapılıyorsa devletin her kademesinde yapılmalı. Bir siyasi başka bir siyasiyi ziyarete gittiğinde bile o kadar çok yeme içme gibi masraf oluyor ki devlete. Bu bile kesilse büyük bir para devlet kasasında durur.Alınan kararlar doğru yani tasarruf yapmaya ihtiyacı var ülkemizin ama bunu herkes yapmalı. En küçük bir belediyede son model araba olmamalı. Araç almayanlar ise araç kiralamalarını son model araçlar için yaparsa tasarruf olmaz. Eğer gerçekten iyi bir şekilde tasarruf yapılırsa bu kararlar hedefine ulaşabilir.ABD eski başkanlarından Obama'nın karısı Michelle Obama nin yazdığı bir kitap var, o kitapta beyaz saray giderlerinin ne kadarı devlet tarafından karşılanıyor, ne kadarı kişisel harcama olarak başkan ve  ailesine kesiliyor, biraz araştırdım, aynı bizdeki gibi demek çok isterdim ama maalesef uzaktan yakından alakası yok. Damlaya damlaya göl olur tabi ama aşağıda damla takip edilirken, yukarıda niagara şelalesi boşa akıyor hocam.😂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}