{
  "id": "topic_5458488",
  "title": "AsPhYiXiA",
  "author": "AsPhYiXiA",
  "created_time": "July 03, 2023, 11:28:26 PMLast edit: July 22, 2023, 05:15:09 AM by AsPhYiXiA",
  "content": "you can delete this because the issue has been resolved*i just want to thank Stake for being a awesome company and coming to an agreement with me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458488",
  "comments": [
    {
      "author": "Zoomic",
      "created_time": "July 03, 2023, 11:49:27 PM",
      "body": "Quote from: AsPhYiXiA on July 03, 2023, 11:28:26 PMI wrote everything on medium so ill just leave a link to the articlehttps://medium.com/@keithkaczenski81/stake-com-denies-100-000-payout-after-250-000-win-374dd417e509 long story short. i won $250,000 and i tried to withdraw 100k of it and stake froze my account and then shortly after disabled it completely.I think this thread is best fit in the scam accusation thread. I went through the link provided and I read through the 11 mins article but at a point I stopped read. I was just offended by Stake's statement to you.QuoteIn light of your long history of losses and sudden substantial winnings, we flagged your account for further investigation to ensure fair play.Just because you have lost severally and suddenly won big, Stake flagged your account. Do they actually wish you continue lossing till eternity?I will like to see what other experienced gamblers will say here if they gave experienced such before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 03, 2023, 11:59:11 PM",
      "body": "Quote from: AsPhYiXiA on July 03, 2023, 11:28:26 PMI wrote everything on medium so ill just leave a link to the articleYou signed up on Bitcointalk and made this post, then why don't you post the full article/accusation here? There is no way I am going to visit a medium link to read some external articles when I don't even have a medium account to comment on the issue. I believe this would be the same for most members. Post the full accusation here on Bitcointalk or forever hold your peace.Did you talk to the stake support on as to why your account was blocked?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Martingaleboy",
      "created_time": "July 04, 2023, 12:08:12 AM",
      "body": "Quote from: logfiles on July 03, 2023, 11:59:11 PMQuote from: AsPhYiXiA on July 03, 2023, 11:28:26 PMI wrote everything on medium so ill just leave a link to the articleYou signed up on Bitcointalk and made this post, then why don't you post the full article/accusation here? There is no way I am going to visit a medium link to read some external articles when I don't even have a medium account to comment on the issue. I believe this would be the same for most members. Post the full accusation here on Bitcointalk or forever hold your peace.Did you talk to the stake support on as to why your account was blocked?Who forced you to visit medium ? You wrote a 10 lines post jusy to blable on how you dont want to visit medium ? Sure you have some mental trouble like narcissim or stupidity.  The world is not all about you and nobody care you visit medium or not.  Nobody Care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 04, 2023, 12:19:52 AM",
      "body": "That was one long ass back and forth,  sadly the article did not include anything of the evidence itself, only the conversations. Heck, we ain't even sure if the conversation given is what exactly happened since it wasn't a screenshot or anything but eh, I'd like the proof stated in the conversation more than the conversation itself.Stakes investigation isn't anything weird, it is a sudden win after an onset of losses so they'd probably check that out, regardless of how gambling really works, just that as I said, there's lacking of proof actually involved in the case. Even the timestamps for the conversation isn't included. Op might want to share some more to prove this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 04, 2023, 12:22:47 AM",
      "body": "The rate at which scam accusation threads are popping up recently is alarming and at the same time suspicious, I do hope this is not some alt accounts creating multiple threads against a casino...Back to the Op, I have gone through your medium post ( excluding some parts of the email ) and if truly what you wrote there was what actually happened then it was a wrong move for them, it's more like they were expecting you not to ever win a large amount and if anyone should be lucky enough to win such amount he or she would be tagged as a scammer or a cheat. This is just an assumption that your medium post is the truth but we can't really judge a case completely by just hearing the story of one party without having to hear from the other party involved, you should try to PM stakes representative here in bitcointalk if they can throw more light on the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Martingaleboy",
      "created_time": "July 04, 2023, 12:33:36 AM",
      "body": "The fact there is no screenshots in the medium topic Only quotes of what supposed to be Email exchange.And the Donate to me link at the end of the topic Makes this accusation Odd.Also i see issue with stake but moat if them sportbookOr third party providers nerd to investigateIts the first scam accusation that will have something to di with an Original game of Stake.    ODD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stunna",
      "created_time": "July 04, 2023, 12:47:09 AM",
      "body": "Quote from: Martingaleboy on July 04, 2023, 12:33:36 AMThe fact there is no screenshots in the medium topic Only quotes of what supposed to be Email exchange.And the Donate to me link at the end of the topic Makes this accusation Odd.Also i see issue with stake but moat if them sportbookOr third party providers nerd to investigateIts the first scam accusation that will have something to di with an Original game of Stake.    ODDHave come back from months of inactivity just to say that this is total BS. Looks like a scheme to scam donations on his weird page he made. Just to clarify-We never held this user's money-It’s all fabricated, fake emails etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "July 04, 2023, 12:57:21 AM",
      "body": "From my viewpoint it looks like a classic he said, they said situation so I cannot conclude through the emails you posted alone that there has been any wrongdoing from either party. I would like to see a response from Stake. I would like for them to specify what the irregularities were that caused them to freeze your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "July 04, 2023, 01:03:31 AM",
      "body": "There's no way these emails came from stake.  Whole thing smells like bullshit.So you don't have to click on ops link:QuoteHere are the email exchanges between me and Stake.comFrom Stake.comTo <name removed for privacy>Dear <name removed for privacy>,We regret to inform you that your account has been frozen due to suspected fraudulent activity. Upon review of your recent winnings, we have discovered anomalies in your gameplay patterns and transactions.Our investigation indicates you won a large amount by using a third party program and the Stake.com API to bet on mines. This type of betting has triggered a audit of the bet in question and we may also look at passed bets at our discretion.To ensure the integrity of our platform and protect our users, we have temporarily frozen your account and denied your withdrawal request for $100,000. We will be conducting a thorough investigation into your account activity and transactions to determine if any fraudulent activities were involved.We understand that this may come as a shock to you, but we take such matters seriously. We strive to maintain a fair and transparent gambling environment for all our users. Rest assured that we will keep you updated on the progress of our investigation and provide you with a detailed report once it is concluded.If you have any supporting evidence or information that can help clarify the circumstances surrounding your winnings, please provide it to our support team as soon as possible. We appreciate your cooperation in this matter.Best regards,Stake.com Support TeamReply-From <name removed for privacy>To Stake.comDear Stake.comI am writing in response to the email I received regarding the freezing of my account and the denial of my withdrawal request for $100,000. I am deeply concerned and shocked by these actions, as they have left me feeling cheated and betrayed.Firstly, I would like to address the claim of fraudulent activity. I have been a loyal user of Stake.com since 2018, consistently depositing and losing my funds on a weekly basis. While it is true that I have had a long streak of losses, it is unfair to label my recent winnings as suspicious simply because they deviate from my previous pattern. Gambling outcomes are inherently unpredictable, and I believe I had a stroke of luck on July 2nd, 2023.I understand that you have a responsibility to ensure the integrity of your platform, but freezing my account without conducting a proper investigation or providing evidence of any wrongdoing on my part is unjust. I urge you to review my account activity thoroughly and transparently, taking into consideration my long history of losses and the element of chance that exists in gambling.Furthermore, I would like to emphasize the significant financial impact this decision has had on me. Winning $250,000 was a life-changing moment for me, and I had plans for the funds to improve my financial situation. By denying my withdrawal request, I am left in a state of uncertainty and distress. I kindly request that you reconsider your decision and release the funds owed to me.I am more than willing to cooperate with your investigation and provide any necessary information or evidence that can help clarify the circumstances surrounding my winnings. I trust that you will approach this matter with fairness, transparency, and promptness.I look forward to your prompt response and the resolution of this issue.Sincerely,<name removed for privacy>Reply-From Stake.comTo <name removed for privacy>Dear <name removed for privacy>,Thank you for your prompt response and for sharing your concerns regarding the freezing of your account and the denial of your withdrawal request. We understand that this situation has caused you distress, and we would like to address your concerns as thoroughly as possible.We apologize if our initial communication left you feeling unjustly treated. Our primary goal is to ensure the integrity of our platform and protect all users from potential fraudulent activities. In light of your long history of losses and sudden substantial winnings, we flagged your account for further investigation to ensure fair play.We appreciate your willingness to cooperate with our investigation and provide any relevant information or evidence. To proceed with the review, we kindly request that you provide any documentation or proof that can help us verify the legitimacy of your winnings. This may include transaction records, screenshots, or any other relevant details that can shed light on your gameplay.Once we receive the requested information, our team will conduct a thorough analysis to determine the authenticity of your winnings and conclude our investigation promptly. We will keep you informed throughout the process and provide a detailed report once our review is complete.We understand the impact this situation has had on you financially, and we apologize for any inconvenience caused. Please be assured that we are committed to resolving this matter fairly and transparently.Thank you for your patience and cooperation. We look forward to receiving the requested information and working towards a resolution.Best regards,Stake.com Support TeamReply-From <name removed for privacy>To Stake.comDear Stake.com Support Team,Thank you for your prompt response and understanding of my concerns. I appreciate your willingness to conduct a thorough investigation and reach a fair resolution. I am more than willing to provide any documentation or proof that can assist in verifying the legitimacy of my winnings.To aid in the investigation, I have gathered the following information and evidence:Transaction Records: I have compiled a detailed record of my deposits and losses on Stake.com since 2018. This will demonstrate my consistent gambling activity and the substantial amount of money I have deposited over the years.Gameplay Screenshots: I have taken multiple screenshots during my gameplay on July 2nd, 2023, specifically during my winning streak on the Mines game. These screenshots capture the sequence of events and serve as a visual representation of my winnings.Time and Date Stamp: I have obtained a time-stamped screenshot from my device, clearly indicating the date and time when I achieved the significant winnings on Stake.com. This timestamp aligns with the date specified in your initial email.I believe that reviewing these pieces of evidence will help clarify the circumstances surrounding my recent winnings and demonstrate that they were obtained through fair and legitimate gameplay. I am confident that a comprehensive analysis will confirm the authenticity of my winnings.Please let me know the preferred method and format for submitting the aforementioned evidence. I am ready to provide the information promptly to expedite the investigation process. Furthermore, I would appreciate regular updates on the progress of the review and when I can expect a resolution.Thank you once again for your attention to this matter. I look forward to working with you to reach a fair resolution and have my account reinstated.Sincerely,<name removed for privacy>Reply-From Stake.comTo <name removed for privacy>Dear <name removed for privacy>,Thank you for providing the requested information and evidence. We have thoroughly reviewed the documentation you submitted, including the transaction records, gameplay screenshots, and time and date stamp.Regrettably, our investigation has uncovered irregularities and inconsistencies in your gameplay patterns and associated transactions. Despite your history of consistent losses, the sudden and substantial winnings you achieved on July 2nd, 2023, raise significant concerns.After a careful analysis of the evidence and consultation with our internal team, we have concluded that your winnings cannot be considered legitimate. We have determined that your gameplay on that particular day involved a violation of our terms and conditions, specifically related to manipulation of the game outcome.As a result, we stand by our decision to freeze your account and deny your withdrawal request for $100,000. Please understand that we take such matters seriously, and our priority is to ensure a fair and transparent gambling environment for all our users.We understand that this outcome may be disappointing and distressing for you, and we apologize for any inconvenience caused. If you have any further questions or concerns, please feel free to reach out to our support team, and we will do our best to assist you.Best regards,Stake.com Support TeamReply-From <name removed for privacy>To Stake.comDear Stake.com Support Team,I am utterly shocked and deeply disappointed by the outcome of your investigation and the conclusion you have reached. Your claim that my winnings are illegitimate due to alleged manipulation is baseless and unfounded. I vehemently deny any wrongdoing on my part.Your decision to freeze my account, deny my withdrawal, and accuse me of manipulating the game outcome is not only unjust but also damaging to my reputation. I have been a loyal user of Stake.com for several years, faithfully depositing my hard-earned money and enduring consistent losses without complaint.The evidence I provided was meant to demonstrate the authenticity of my winnings and to clear any doubts regarding their legitimacy. Instead, you have chosen to ignore the facts and cast false accusations against me. This is an egregious breach of trust and a blatant disregard for your customers.I hereby demand a thorough and transparent reevaluation of my case. If necessary, I am prepared to take legal action to protect my rights and seek compensation for the financial harm and emotional distress caused by your unfounded allegations and refusal to release my winnings.Furthermore, I will not hesitate to share my experience with others, both within the online gambling community and through public platforms, to raise awareness of your unfair practices and mistreatment of customers. It is my hope that through public scrutiny, the truth will be revealed, and justice will prevail.I expect a prompt response addressing the serious concerns I have raised. Failure to provide a satisfactory resolution will leave me with no choice but to pursue legal remedies to rectify this gross injustice.Reply-From Stake.comTo <name removed for privacy>Dear <name removed for privacy>,We are sorry to hear that you are dissatisfied with the outcome of our investigation. However, we stand by our decision and findings based on the evidence presented.Your threats of legal action and attempts to tarnish our reputation with baseless claims are both unfounded and inappropriate. We have followed our protocols and conducted a fair investigation into your account activity.We would like to remind you that gambling involves risks, and we have a responsibility to protect the integrity of our platform and all our users. We have taken the necessary steps to ensure a fair and transparent gambling environment, and we will not be intimidated by your aggressive and unprofessional behavior.If you have any further inquiries or concerns that are within the bounds of respectful communication, we would be happy to address them. However, we will not engage in further correspondence that includes threats or unfounded accusations.Best regards,Stake.com Support TeamReply-From <name removed for privacy>To Stake.comDear Stake.com Support Team,I am appalled by the unprofessional and dismissive tone of your response. It is clear that you have chosen to disregard the gravity of the situation and the impact it has on me as a customer. Your refusal to acknowledge the validity of my concerns only further solidifies my belief that my rights as a user have been grossly violated.I have taken note of your unwillingness to engage in a respectful and constructive dialogue. Rest assured, the next communication you receive will be from my legal representation, who will advocate on my behalf to seek justice and restitution for the damages I have incurred.It is regrettable that it has come to this point, as I had hoped for a fair and amicable resolution. However, your dismissive attitude and failure to address my concerns leave me with no choice but to pursue legal remedies to rectify this unjust situation.Reply-From <name removed for privacy>To Stake.comDear Stake.com Support Team,I am writing to express my deep disappointment and concern regarding the recent disabling of my account. It has come to my attention that my access to Stake.com has been revoked, further exacerbating the already strained relationship between us.Disabling my account without any prior warning or justification is a clear violation of the trust and fairness that should be upheld between a service provider and its customers. This action further solidifies my belief that my rights as a user have been disregarded and my concerns have been met with indifference.I strongly urge you to reinstate my account immediately and provide a detailed explanation for this sudden and unwarranted action. I expect a prompt response to this matter, as your continued disregard for my rights and mistreatment only reinforces the need for legal intervention to protect my interests.And that was the last time i have spoken with them. They have been ignoring my emails and i am scared that they are just gonna keep my money and that will be the end of it. I am currently speaking to legal counsel and they should be reaching out to their gaming license provider Curaçao eGaming License under the License №1668/JAZ.I have to pay my legal team out of pocket and i don’t have very much money. I also cannot tell my family that i am addicted to gambling so i gotta go at this alone. If you want to help me fight these scammers please feel free to donate to the",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "July 04, 2023, 01:26:43 AM",
      "body": "he is asking for donation in that medium page usingv the nowpaymentsOP is the worse scammer. you couldn't just complain about your money not sent to you. even if its true that they don't send your win, you don't ask donation for that.  you are using the situation to scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "July 04, 2023, 04:44:00 AM",
      "body": "I know there are many people who complain against stakes.com who are mostly newbies, and we don't know if their stories about their experiences on the stakes platform are true that they had a winning amount and they couldn't take it out as the op says.Now the question is, can the author prove that the mistake and suspicious is really in stakes.com? this is the thing that no one can say yet whether the story is credible or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dudu8811",
      "created_time": "July 04, 2023, 05:22:09 AM",
      "body": "My first reaction was 'stake knows that there is a software out there that can manipulate theire games and waits tillsomeone is actually abusing it??? Holy...' but at the same second I felt strange over how this guy described and handled the situation while not showing any information he mentioned ie the screenshots and so on.In my opinion these kind of threads should only be allowed if the user is providing evidence if his claim, otherwise we are indirectly promoting him to damage the casinos reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 04, 2023, 05:36:32 AM",
      "body": "Wall of texts can easily be done and you could just copy past and edit the necessary things for you to make it a \"somewhat\" legitimate looking thing. But that's not gonna work unless there are actual evidence that would help your case and not a wall of texts. The first thing I expected is the screenshots from your account or some SEED id or TX that points to your winnings etc. But you didn't have that. Which made it look even more suspicious. This isn't a legit post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 04, 2023, 05:42:16 AM",
      "body": "Now, I am not the conspiracy theory type.... but the latest increase in FUD towards Stake.com had me thinking that it is a campaign to discredit the top dog in the online Crypto currency gambling scene. So, Stunna already confirmed that it is fake .....so why would someone do this? Yes, the donations are one thing, but I doubt that people will donate anything based on the lack of evidence that were posted there. I think this is a orchestrated FUD campaign from Stake's competitors to bring them down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 04, 2023, 06:30:52 AM",
      "body": "I think that Stake have paid out without questions asked when people have been KYC level 3 and above even 1000 ETH which is much more than the amount claimed here and that is about 2 million dollars payout.Another reason is Stake gives huge bonuses during the year and they would have not the slightest problem paying the OP with that amount of money if that win is valid,show us some proofs that your win is valid,usually people who play with these huge amounts make records of their sessions just to avoid what described here but I am not seeing anything related this part here and that email definitely is not from Stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 04, 2023, 09:36:44 AM",
      "body": "More likeSon: I going broke because gamble.Mom: Here you go son (Blackmailing & Open Donation). No screenshot, no gameplay proof, and no link for the history game while you're winning 250,000$. It's actually funny, while in the end the @OP asking for some donation ~LOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "July 04, 2023, 09:57:28 AM",
      "body": "Quote from: AsPhYiXiA on July 03, 2023, 11:28:26 PMI wrote everything on medium so ill just leave a link to the articlehttps://medium.com/@keithkaczenski81/stake-com-denies-100-000-payout-after-250-000-win-374dd417e509long story short. i won $250,000 and i tried to withdraw 100k of it and stake froze my account and then shortly after disabled it completely.This is very hard to believe because they support details and your details are being removed, I will prefer you make another clean post showing the evidence of the support names either on screenshot in way people should understand because having posting it on medium then gets us link is just like a paid post to tarnished the good image of stake.com. I am not in support of any bad action taken by stake.com but I urge you to make your complaint straight and pure. Then lastly posting it is not also ideal so I think you should buy the idea of those people already suggested you should move to proper place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "July 04, 2023, 10:36:20 AM",
      "body": "Quote from: ryzaadit on July 04, 2023, 09:36:44 AMMore likeSon: I going broke because gamble.Mom: Here you go son (Blackmailing & Open Donation). No screenshot, no gameplay proof, and no link for the history game while you're winning 250,000$. It's actually funny, while in the end the @OP asking for some donation ~LOL.After this he will create another new account on bitcointalk by looking for other ways how to bring down a site as big as Stake on this forum and also get the attention of the forum community to feel sorry for him then donate for him but unfortunately he did not learn from the case that was in the casino ever is in this forum, the importance of screenshots is also other stronger evidence to confirm the case.I just take this as a new way to cheat so never take it seriously and I'm sure everyone knows how to believe any accusations people are new to the casino, but I also think a lot of active Stake users on this forum they have never had any issues with withdrawals if never break the rules, anyway I'm afraid this thread will become full of taunts to the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "July 04, 2023, 11:01:56 AM",
      "body": "Quote from: piebeyb on July 04, 2023, 10:36:20 AMQuote from: ryzaadit on July 04, 2023, 09:36:44 AMMore likeSon: I going broke because gamble.Mom: Here you go son (Blackmailing & Open Donation). No screenshot, no gameplay proof, and no link for the history game while you're winning 250,000$. It's actually funny, while in the end the @OP asking for some donation ~LOL.After this he will create another new account on bitcointalk by looking for other ways how to bring down a site as big as Stake on this forum and also get the attention of the forum community to feel sorry for him then donate for him but unfortunately he did not learn from the case that was in the casino ever is in this forum, the importance of screenshots is also other stronger evidence to confirm the case.I just take this as a new way to cheat so never take it seriously and I'm sure everyone knows how to believe any accusations people are new to the casino, but I also think a lot of active Stake users on this forum they have never had any issues with withdrawals if never break the rules, anyway I'm afraid this thread will become full of taunts to the OP.  He just want to create a fake scenario which people can see and also for sure his accusation against stake will not proceed due to lack of evidence. But for sure his main intention is to disturb the stake representative since this feed up their ego to do more account and create the same accusation to create another discussion to be discuss by many people. This is how trolls work so I guess its not good to entertain any accusation if they cannot bring a solid proof to support their claims against those casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}