{
  "id": "topic_5468589",
  "title": "kawser05",
  "author": "kawser05",
  "created_time": "September 29, 2023, 08:27:01 PMLast edit: September 30, 2023, 04:56:06 PM by kawser05",
  "content": "Let me know!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468589",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "September 29, 2023, 10:05:24 PM",
      "body": "From the title of this thread it looks so missguiding but what attracted me to the thread is because I thought you where seeking and asking for ways to earn $50 on the internet when I opened the thread I saw that you were redirecting us to join a link that may take us to and external apps which is not safe for anyone in the forum unless for the gullible and greedy ones. Because,  whatever detail you want to share in what so ever group you shared it link,  can also be shared here for all to see instead of involving another external link or app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bambiturnhau",
      "created_time": "September 30, 2023, 10:26:46 AM",
      "body": "If you truly want to share, please skip the step of navigating to the blog, which means write a sharing post on the forum directly, as going to the website serves that purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic-Money",
      "created_time": "October 04, 2023, 08:35:33 AM",
      "body": "The future of cryptocurrency is in your hand, because crypto has been created for future financial services, which one have as a digital assets, therefore, it is the best time to invest on cryptocurrency market as market is on bearish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barhavsky",
      "created_time": "October 04, 2023, 12:39:53 PM",
      "body": "Quote from: kawser05 on September 29, 2023, 08:27:01 PMLet me know!in my opinion, there will be many companies that accept cryptocurrency as a payment and of course cryptocurrency will also become a legal currency, but of course in the future regulations regarding cryptocurrency will become more numerous and stricter, so there will only be a few cryptocurrency that can survive and I only recommend you to investing in Bitcoin for the long-term investment (safer and will definitely survive in the future).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "October 04, 2023, 05:30:29 PM",
      "body": "Quote from: Magic-Money on October 04, 2023, 08:35:33 AMThe future of cryptocurrency is in your hand, because crypto has been created for future financial services, which one have as a digital assets, therefore, it is the best time to invest on cryptocurrency market as market is on bearish.No, the future of crypto-currency isn't in his hand or our hands because most of the crypto-currencies are controlled by the whales and exchanges and they can manipulate the price of those coins anytime. Only a few altcoins and Bitcoin can not be controlled by others but still if someone has huge holdings of any of the currency and he/she/they decide to sell those holdings in short term then that crypto-currency can face a huge dump. Investing in crypto-currencies can be profitable but only when you invest in reputed ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlockaFett",
      "created_time": "October 04, 2023, 06:22:36 PM",
      "body": "Hard question but I can say for sure a lot of things will be tokenized and made as NFT's.We can see pictures, art in general, real estate, watches, coins, jewelry, maybe even cars soon.And banks are creating wallets for customers, just a matter of time when all the money will be digital.So, when you calculate 2+2, you should know what will happen, or at least, presume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 04, 2023, 07:49:13 PM",
      "body": "Your question is open and can go in any direction. However the future is very bright for cryptocurrency and bitcoin being the king already adopted by El Salvador few years back is a sign that it is coming to global recognition. More adoption by institutions and conglomerates will boost the market, already I read on   this thread that Honda motors is accepting payment of their cars in bitcoin. This is a big adoption waiting to be followed by other big private investors. It is a great value that has been added to cryptocurrency in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "October 04, 2023, 08:17:55 PM",
      "body": "Lol this is a broad subject.  Well since this is in altcoin discussion I will reply as to the future of altcoins.  They will be niche needed in our market and be useful as a testbed for future bitcoin requirements.  Things like game based coins used on a certain platform might be useful as well.  Otherwise bitcoin should stand out loud and proud getting more and more use",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "October 04, 2023, 08:58:44 PM",
      "body": "Quote from: Gozie51 on October 04, 2023, 07:49:13 PMYour question is open and can go in any direction. However the future is very bright for cryptocurrency and bitcoin being the king already adopted by El Salvador few years back is a sign that it is coming to global recognition. More adoption by institutions and conglomerates will boost the market, already I read on   this thread that Honda motors is accepting payment of their cars in bitcoin. This is a big adoption waiting to be followed by other big private investors. It is a great value that has been added to cryptocurrency in general.3 word posted. lolFuture is something that cant be determined and we know that the main factor which determines whether this market survive or not, then it would really be on DEMAND!We didnt even had anticipated that this crypto market did really expand out that much or getting that kind of popularity and recognition.This is why i is really that safe to assumethat we would really be that still running that long and would really be expanding even more and as long recognition and demand is there then there's no doubt thatfuture of this market would be looking good.The main key or in concern on here is that you should really just only invest on what you can afford to lose because we know that there's no assurance on what the future would really looks like.If you do make that all in kind of investment and this market turns out to be that a disaster then recovery would really be so hard compared if you do have just simply put up someamounts which you can afford to lose then it wont really be that much of an issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 04, 2023, 09:29:24 PM",
      "body": "Quote from: kawser05 on September 29, 2023, 08:27:01 PMLet me know!The future remains bright despite of the market trend and I know this is just a temporary bear market sooner or later we will rise again so better to make your investments active now before its too late. Why are you still questioning this one? Can’t you see how good crypto is for the past years? Invest what you can afford to lose and don’t miss this opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Psynthax",
      "created_time": "October 04, 2023, 10:33:16 PM",
      "body": "i mean you already know that bitcoin is always growing from year to year,even though there is correction and dump along the way but overall its always growing.the future is obvious in this case, though for altcoin its always dynamically changing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nur1labs",
      "created_time": "October 05, 2023, 12:54:08 AM",
      "body": "Future cryptocurrency is cryptocurrency using for people project not greed one since satoshi made that for people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ahyadinnn",
      "created_time": "October 05, 2023, 01:13:57 AM",
      "body": "everyone will not know the future of altcoins, but so far I have invested in altcoins and made a profit, while altcoins can make a profit I think the future will be even better, because there will be new companies that will follow other companies that have been in the blockchain world, all we do is wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FahriZah",
      "created_time": "October 05, 2023, 01:46:23 AM",
      "body": "I'm planning In future on my life i will try to my best for holding more & more crypto currency coins & tokens because i know if crypto right now not give me a good profit than i believe in my futures is gains easily It's my personal opinion and this analyses from my side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 05, 2023, 03:44:40 AM",
      "body": "The future of cryptocurrency will likely be shaped by a combination of technological advancements, regulatory developments, market dynamics, and societal acceptance, and it is likely to continue to generate significant interest and debate in the years to come.I believe that cryptocurrency has the potential to become a major part of the global financial system in the future. However, I also believe that it is important to be aware of the risks involved before investing in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "huu78",
      "created_time": "October 05, 2023, 11:25:28 AM",
      "body": "I think the future of cryptocurrency is bright and will be widely adopted, it's just a matter of time.and for now because the market is sluggish and there are some people trying to manipulate the market in the near future it seems like it is time for us to enter the bull run phase, but some people also say the bear will continue until the end of this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rupok",
      "created_time": "October 05, 2023, 11:42:37 AM",
      "body": "I think in the future cryptocurrency will be legalized in all countries and most companies will accept cryptocurrency as payment.Also all banking systems will integrate cryptocurrency transactions.  The future of cryptocurrency is bright and its demand will continue to grow day by day. Bitcoin is expected to become a major part of the global financial system in the future.I am heavily dependent on Bitcoin in the future to fulfill my dreams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ije07",
      "created_time": "October 05, 2023, 12:13:33 PM",
      "body": "Quote from: huu78 on October 05, 2023, 11:25:28 AMI think the future of cryptocurrency is bright and will be widely adopted, it's just a matter of time.and for now because the market is sluggish and there are some people trying to manipulate the market in the near future it seems like it is time for us to enter the bull run phase, but some people also say the bear will continue until the end of this year.If we think that the bear market will continue until the end of the year then this is a good opportunity to pocket some of the top altcoins when prices are low and within your capital too. prioritize investing in bitcoin and some of the top altocin (eth, bnb according to your choice). I am also sure that next year crypto will improve again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "October 05, 2023, 12:39:11 PM",
      "body": "Quote from: Quidat on October 04, 2023, 08:58:44 PMQuote from: Gozie51 on October 04, 2023, 07:49:13 PMYour question is open and can go in any direction. However the future is very bright for cryptocurrency and bitcoin being the king already adopted by El Salvador few years back is a sign that it is coming to global recognition. More adoption by institutions and conglomerates will boost the market, already I read on   this thread that Honda motors is accepting payment of their cars in bitcoin. This is a big adoption waiting to be followed by other big private investors. It is a great value that has been added to cryptocurrency in general.3 word posted. lolFuture is something that cant be determined and we know that the main factor which determines whether this market survive or not, then it would really be on DEMAND!We didnt even had anticipated that this crypto market did really expand out that much or getting that kind of popularity and recognition.This is why i is really that safe to assumethat we would really be that still running that long and would really be expanding even more and as long recognition and demand is there then there's no doubt thatfuture of this market would be looking good.The main key or in concern on here is that you should really just only invest on what you can afford to lose because we know that there's no assurance on what the future would really looks like.If you do make that all in kind of investment and this market turns out to be that a disaster then recovery would really be so hard compared if you do have just simply put up someamounts which you can afford to lose then it wont really be that much of an issue.The future, its a weird one, right? Nobody knows where its headed. You mentioned DEMAND. Well, yep, its like the heartbeat of this whole thing. If people want it, it thrives; if they dont, it dies. Simple as that.What if, just what if, our understanding of \"demand\" changes? Like, right now, people want it because its the “in” thing. But tomorrow? Who knows? Maybe people will want it for totally different reasons.Totally agree with you on the investment part. Only play with the money you're ready to lose. Its like going to a casino, but with fancier charts. But here’s a thing: if everyone is ready to lose their investment, does that make the market more or less stable?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}