{
  "id": "topic_5472010",
  "title": "SaepulMT",
  "author": "SaepulMT",
  "created_time": "October 28, 2023, 01:09:10 PMLast edit: October 30, 2023, 12:14:22 AM by SaepulMT",
  "content": "Pertama-tama saya ingin menyampaikan bahwa di sini saya tidak atau belum menentukan pilihan siapa calon presiden yang akan saya pilih nantinya (netral).Dengan banyaknya isu yang berkembang akhir-akhir ini , bahwa keputusan Mahkamah Konstitusi itu sudah memihak salah satu atau dua kelompok saja ,di sini saya hanya bisa mencari bagaimana rentetan kejadian isu yang berkembang , saya ingin berdiskusi dengan teman-teman semua di forum ini. 1.Apakah dengan dicalonkannya Gibran Rakabuming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?2.Apakah keputusan Mahkamah Konstitusi yang membolehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahanan saat ini?3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Sebagai informasi tambahan saya mencari tahu apa itu politik dinasti dan NepotismePolitik dinasti dapat diartikan sebagai sebuah kekuasaan politik  yang dijalankan oleh sekelompok orang yang masih terkait dalam hubungan keluarga. Dinasti politik lebih indenik dengan kerajaan. sebab kekuasaan akan diwariskan secara turun temurun dari ayah kepada anak. agar kekuasaan akan tetap berada di lingkaran keluargasumberSedangkan,Pengertian Nepotisme berasal dari bahasa Latin yaitu “Nepos” yang memiliki arti sebagai keponakan atau cucu. Jadi, arti dari nepotisme ini yaitu suatu tindakan dalam memilih seseorang tanpa berdasar pada kemampuannya, akan tetapi berdasarkan kedekatan atau hubungan keluarga saja.sumberSilahkan berkomentar , apa pendapat kalian?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472010",
  "comments": [
    {
      "author": "Renampun",
      "created_time": "October 28, 2023, 03:43:16 PM",
      "body": "sebenarnya permasalahan yang terjadi di indonesia sekarang ini (terutama KKN) sudah sulit untuk di perbaiki, semua presiden yang pernah memimpin indonesia pasti kepingin sangat anak mereka juga bisa menjadi presiden indonesia suatu saat nanti, apalagi presiden itu ibaratkan produk yang di pilih orang warga negara indonesia.secara pribadi saya juga menentang hal hal yang berbau dengan KKN, pasti ada maksud terselubung yang di rencanakan oleh para pengatur di indonesia ini, kegaduhan jelang mendekati pemilu sekarang ini sangat menjadi sorotan, apalagi MK mengubah batas usia capre dan cawapres menjadi di perbolehkan di bawah usia 40 tahun.bagaimana pun pemilu masih panjang, kita lihat saja kandidat mana yang bisa meyakinkan kita untuk memilih mereka, selain itu ketiga capres dan cawapres sudah mendaftarkan diri ke KPU, kita lihat saja apakah bakal ada drama drama lain ke depannya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "October 28, 2023, 08:25:58 PM",
      "body": "Quote from: SaepulMT on October 28, 2023, 01:09:10 PMSilahkan berkomentar , apa pendapat kalian?Sebenarnya tidak ada masalah anak-mantu presiden  ikut mencalonkan diri menjadi kepala daerah dan terpilih. Konstitusi membolehkan itu, tidak melarang. Dan lagi, kepala daerah itu pemilihan langsung oleh rakyat bukan seperti jabatan menteri yang ditunjuk langsung oleh presiden. Yang terpenting, tidak melakukan penyelewengan, korupsi atau menggunakan fasilitas negara untuk kampanye. Keluarga presiden juga memiliki hak politik untuk memilih dan dipilih. Ini dasarnya.Tapi yang masalahnya dinasti yang di bangun oleh Pak Jokowi bisa di katakan sangat berbahaya untuk demokrasi kita kedepan. Karena dengan mudahnya berkhianat pada partai yang membesarkannya, tentu ini tidak baik jika terang-terangan di perlihatkan kepada masyarakat, dimasa mendatang pasti dengan mudahnya akan mengkhianati bangsa dan Negaranya. Dia juga merusak tatatan hukum dengan menggunakan kekuasaannya, ini jelas sangat buruk untuk demokrasi kita kedepan. lihat saja MK (Mahkamah Keluarga) dengan gampangnya mengotak-ngatik syarat jadi wapres belum lagi nanti hasil pilpres tentu ini juga bisa salah gunakan. MK telah melegalkan KKN dinasty keluarga sengaja merusak demokrasi dan menghianati amanat reformasi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "October 29, 2023, 12:04:40 AM",
      "body": "Quote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Buming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?Raka[/b] ?Tidak juga, karena kita negara demokrasi dimana pemimpin itu dipilih oleh rakyat, kecuali penunjukan langsung, maka itu disebut politik dinasti. Namun karena ini (sistem) dan MK seperti sedang (diobok-obok) untuk memuluskan jalan sang pangeran, maka betul jika ada tuduhan ini seperti dinasti yang diturunkan secara tidak langsung ke anak.Quote from: SaepulMT on October 28, 2023, 01:09:10 PM2.Apakah keputusan Mahkamah Konstitus yang memboehkan batas usia capres dan cawapres dibawah 40 tahun,sudah tepat dengan keadaan pemerintahanan saat ini?MK tidak membolehkan capres dan cawapres dibawah 40 tahun ya. perlu diingat, dan ente musti baca lagi tuh putusan. jadi mengapa Gibran di bawah 40 tahun, kok bisa jadi cawapres?, karena Dalam keputusan MK tersebut, ada keputusan setelah itu yaitu: berpengalaman sebagai kepala daerah, dalam hal ini Gibran sebagai walikota solo bisa mencalonkan diri jadi cawapres. Nah ini yang jadi persoalan, padahal di awal-awal MK tampak seperti menolak, namun karena seperti ada tekanan, maka terjadilah kuputusan kontroversi tersebut di akhir sidang yang membuat Sadli Isra sedih setelahnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaepulMT",
      "created_time": "October 29, 2023, 02:10:49 AM",
      "body": "Quote from: Renampun on October 28, 2023, 03:43:16 PMbagaimana pun pemilu masih panjang, kita lihat saja kandidat mana yang bisa meyakinkan kita untuk memilih mereka, selain itu ketiga capres dan cawapres sudah mendaftarkan diri ke KPU, kita lihat saja apakah bakal ada drama drama lain ke depannya.Ya saya setuju dengan pendapat ini, saya sampai sekarang masih belum menentukan siapa yang akan saya pilih nantinya, saya akan melihat apa visi dan misi mereka terlebih dahulu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaepulMT",
      "created_time": "October 29, 2023, 03:00:24 AMLast edit: October 29, 2023, 05:25:39 AM by SaepulMT",
      "body": "Quote from: blue Snow on October 29, 2023, 12:04:40 AMQuote from: SaepulMT on October 28, 2023, 01:09:10 PM2.Apakah keputusan Mahkamah Konstitus yang memboehkan batas usia capres dan cawapres dibawah 40 tahun,sudah tepat dengan keadaan pemerintahanan saat ini?MK tidak membolehkan capres dan cawapres dibawah 40 tahun ya. perlu diingat, dan ente musti baca lagi tuh putusan. jadi mengapa Gibran di bawah 40 tahun, kok bisa jadi cawapres?, karena Dalam keputusan MK tersebut, ada keputusan setelah itu yaitu: berpengalaman sebagai kepala daerah, dalam hal ini Gibran sebagai walikota solo bisa mencalonkan diri jadi cawapres. Nah ini yang jadi persoalan, padahal di awal-awal MK tampak seperti menolak, namun karena seperti ada tekanan, maka terjadilah kuputusan kontroversi tersebut di akhir sidang yang membuat Sadli Isra sedih setelahnya.Tentu saja ane sudah membaca berita atau keputusan tersebut gan  , yang isinya \" Mahkamah Konstitusi (MK) mengabulkan syarat calon presiden dan wakil presiden atau capres-cawapres berusia paling rendah 40 tahun atau berpengalaman sebagai kepala daerah \".  Sumber Berita yang ane baca",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xcode7",
      "created_time": "October 29, 2023, 07:58:16 AM",
      "body": "Quote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Buming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?IYAQuote2.Apakah keputusan Mahkamah Konstitusi yang memboehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahanan saat ini?Tidak, ketua MK saat ini adalah keluarga Jokowi, jadi keputusan yang di ambil ini seakan menguntungkan kelurganya jadi saya meragukan kalau keputusan yang di ambil ini tepat untuk rakyat.Quote3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Masyarakat Indonesia sudah pintar sekarang, apa yang dilakukan secara terang terangan ini tentu tidak bisa di tutupi dengan dalil apapun.Persentasenya sangat minim orang orang yang berpikir kalau ini tidak ada unsur Nepotisme ataupun mereka yang fanatik ataupun buta ketika mendukung suatu hal.Quote from: blue Snow on October 29, 2023, 12:04:40 AMMK tidak membolehkan capres dan cawapres dibawah 40 tahun ya. perlu diingat, dan ente musti baca lagi tuh putusan. jadi mengapa Gibran di bawah 40 tahun, kok bisa jadi cawapres?, karena Dalam keputusan MK tersebut, ada keputusan setelah itu yaitu: berpengalaman sebagai kepala daerah, dalam hal ini Gibran sebagai walikota solo bisa mencalonkan diri jadi cawapres. Nah ini yang jadi persoalan, padahal di awal-awal MK tampak seperti menolak, namun karena seperti ada tekanan, maka terjadilah kuputusan kontroversi tersebut di akhir sidang yang membuat Sadli Isra sedih setelahnya.Yang intinya MK mengeluarkan keputusan tersebut seakan memuluskan langkah Gibran Buming Raka untuk maju sebagai Cawapres yang sebelumnya padahal aturan Cawapres harus berusia setidaknya 40 tahun namun hanya sedikit di pelintir dengan tambahan berpengalaman sebagai kepala daerah, bukankah itu jelas merujuk pada Gibran Buming Raka.Keputusan MK memang tidak bisa di ganggu gugat, namun pandangan publik saat ini banyak yang negatif karena apa yang telah di lakukan seakan mencoreng demokrasi di negara ini, semua hal tersebut juga karena berkesinambungan, Gibran Buming Raka sebagai anak presiden dan ketua MK juga keluarga mereka jadi wajar saja jika banyak pandangan negatif di masyarakat saat ini, dan perihal isu  politik dinasti saya tidak bisa membantahnya, memang kita negara Demokrasi yang pemimpinnya di pilih langsung oleh rakyat akan tetapi cara dan langkah langkah yang di lakukan oleh pemerintah sekarang seakan memuluskan jalan mereka untuk membuat politik dinasti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "October 29, 2023, 12:46:31 PM",
      "body": "Quote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Buming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?2.Apakah keputusan Mahkamah Konstitusi yang memboehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahanan saat ini?3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Kalau dari kacamata ane yang sudah tidak antusias dengan politik di Indo, sudah cape nyoblos tapi Indo ga jadi negara maju, mulai dari nyoblos cuma beringin sampe nyoblos capres:1. Yes.Bukan berarti yang lain ga ada yang kek gini: Puan, AHY, dll., jadi apa mereka kalo emak/bapaknya bukan orang penting? Ada yang koar-koar politik dinasti ketika misalnya Pilkada DKI kemaren?2. Tepat.Ini biar meratakan lapangan permainan, semuanya boleh nyalon! Jangan ada aturan yang menekel pihak manapun sebelum peluit dibunyikan. Ntar kalo ini dipakai bisa jadi ada kongkalikong usia harus tepat x tahun agar hanya meloloskan capres tertentu.3. Ada.Nepotisme ada di mana-mana bung, itu cuma yang disorot aja di MK, masih banyak istri/anak pejabat x trus jadi pejabat juga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "October 29, 2023, 01:02:41 PM",
      "body": "Quote from: blue Snow on October 29, 2023, 12:04:40 AMMK tidak membolehkan capres dan cawapres dibawah 40 tahun ya. perlu diingat, dan ente musti baca lagi tuh putusan. jadi mengapa Gibran di bawah 40 tahun, kok bisa jadi cawapres?, karena Dalam keputusan MK tersebut, ada keputusan setelah itu yaitu: berpengalaman sebagai kepala daerah, dalam hal ini Gibran sebagai walikota solo bisa mencalonkan diri jadi cawapres. Nah ini yang jadi persoalan, padahal di awal-awal MK tampak seperti menolak, namun karena seperti ada tekanan, maka terjadilah kuputusan kontroversi tersebut di akhir sidang yang membuat Sadli Isra sedih setelahnya.Keputusan ini tidak cukup kontroversial karena ini sudah saatnya anak muda untuk berani tampil sebagai seorang pemimpin nasional. Hanya saja dalam pengambilan keputusan ini sangat singkat bahkan sampai tidak diperlukannya tinjau ulang terkait kepeutusan tersebut dan nampak persis bahwa keputrusan MK ini adalah pesanan. Dan sepertinya kita juga tau siapa yang memesan keputusan ini, saya hanya terheran-heran kok semua ini terjadi dalam waktu yang singkat dan mendadak. Seperti membuat tahu bulat saja.Yang cukup kontroversial itu adalah berangkatnya Gibran sebagai cawapres dari partai yang berbeda yang sementara itu pada posisinya Gibran ini sampai sekarang masih menjadi kader aktif dari partai PDIP-Perjuangan. Dan yang dimana Gibran hanya membutuhkan beberapa hari saja untuk bisa bersanding dengan pak prabowo sebagai capres dan cawapres serta dengan mudahnya menggeser posisi Erick Tohir, Ridwan Kamil, Khofifah dan Yusril yang digadang-gadang sebagai kandidat yang kuat untuk mendampingi pak probowo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "October 29, 2023, 06:27:56 PM",
      "body": "Quote from: mu_enrico on October 29, 2023, 12:46:31 PMQuote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Buming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?2.Apakah keputusan Mahkamah Konstitusi yang memboehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahanan saat ini?3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Kalau dari kacamata ane yang sudah tidak antusias dengan politik di Indo, sudah cape nyoblos tapi Indo ga jadi negara maju, mulai dari nyoblos cuma beringin sampe nyoblos capres:1. Yes.Bukan berarti yang lain ga ada yang kek gini: Puan, AHY, dll., jadi apa mereka kalo emak/bapaknya bukan orang penting? Ada yang koar-koar politik dinasti ketika misalnya Pilkada DKI kemaren?2. Tepat.Ini biar meratakan lapangan permainan, semuanya boleh nyalon! Jangan ada aturan yang menekel pihak manapun sebelum peluit dibunyikan. Ntar kalo ini dipakai bisa jadi ada kongkalikong usia harus tepat x tahun agar hanya meloloskan capres tertentu.3. Ada.Nepotisme ada di mana-mana bung, itu cuma yang disorot aja di MK, masih banyak istri/anak pejabat x trus jadi pejabat juga.Sekalipun tidak antusias om, tapi memang kita perlu ikut andil, sekalipun tidak berdampak pada negara juga menjadi negara maju, hal-hal yang mendingan harus di perjuangkan, karena kalo jatuh ke orang yang lebih buruk mungkin malah akan sebaliknya dan akan berbahaya bagi keturunan kita kedepannya. Saya sepakat bahwa memang politik dinasti secara pemahaman dasar itu berada di indonesia sendiri dan itu tidak menjadi masalah seperti halnya yang sudah banyak terjadi sampe akar rumput, selagi pemilihannya memalui proses demokrasi maka itu tidak menyalahi aturan. IMOya pandangan saya sendiri untuk jika melihat tepat dan juga tidak tepatnya ini memang sudah tepat, sedikit mengganjal sebelumnya karena memang ini banyak propaganda isu-isu yang di mainkan di media. Yang menjadi masalah ini berdekatan dengan tanggal pendaftaran capres-cawapres, dan Prabowo menjadi pendaftar terakhir seperti dia menunggu sesuatu untuk melakukan tindakan, dan beberapa waktu keputusan telah di buat beberapa hari setelahnya mengambil keputusan, seakan-akan ini seperti terstruktur dalam rencana.Unutuk no 3 saya sepakat dengan anda, hanya karena perang politik semuanya saling di buka, padahal sangat banyak nepotisme yang telah terjadi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "October 29, 2023, 07:35:49 PM",
      "body": "Quote from: khiholangkang on October 29, 2023, 06:27:56 PMQuote from: mu_enrico on October 29, 2023, 12:46:31 PMQuote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Buming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?2.Apakah keputusan Mahkamah Konstitusi yang memboehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahanan saat ini?3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Kalau dari kacamata ane yang sudah tidak antusias dengan politik di Indo, sudah cape nyoblos tapi Indo ga jadi negara maju, mulai dari nyoblos cuma beringin sampe nyoblos capres:1. Yes.Bukan berarti yang lain ga ada yang kek gini: Puan, AHY, dll., jadi apa mereka kalo emak/bapaknya bukan orang penting? Ada yang koar-koar politik dinasti ketika misalnya Pilkada DKI kemaren?2. Tepat.Ini biar meratakan lapangan permainan, semuanya boleh nyalon! Jangan ada aturan yang menekel pihak manapun sebelum peluit dibunyikan. Ntar kalo ini dipakai bisa jadi ada kongkalikong usia harus tepat x tahun agar hanya meloloskan capres tertentu.3. Ada.Nepotisme ada di mana-mana bung, itu cuma yang disorot aja di MK, masih banyak istri/anak pejabat x trus jadi pejabat juga.Sekalipun tidak antusias om, tapi memang kita perlu ikut andil, sekalipun tidak berdampak pada negara juga menjadi negara maju, hal-hal yang mendingan harus di perjuangkan, karena kalo jatuh ke orang yang lebih buruk mungkin malah akan sebaliknya dan akan berbahaya bagi keturunan kita kedepannya. Anda benar dengan itu semua dan bagaimanapun kita sebagai masyarakat dan juga orang yang berpendidikan itu perlu ikut andil terhadap keadaan negara. Bagaimanpun agar sebuah negara berjalan dengan semestinya dan sebuah sistem pemerintahan bisa berjalan sesuai dengan tugasnya maka harus ada pihak yang mengawasi dan kitalah masyrakat yang harus berperan untuk mengawasi semua itu, jika tidak mungkin yang namanya kesejahteraan dan keadilan tidak akan pernah bisa terwujud. Dan mungkin saja dampak yang diberikan akan lebih buruk lagi daripada itu, karena jika sistem pemerintahan ini tidak ada yang mengawasi maka pemerintah tersebut akan bertindak semena-mena tanpa harus memikirkan segala sesuatu yang terjadi pada rakyatnya.Quote from: khiholangkangSaya sepakat bahwa memang politik dinasti secara pemahaman dasar itu berada di indonesia sendiri dan itu tidak menjadi masalah seperti halnya yang sudah banyak terjadi sampe akar rumput, selagi pemilihannya memalui proses demokrasi maka itu tidak menyalahi aturan. IMOMeskipun kita ini adalah negara demokrasi bukan negara dinasti seperti kerajaan, akan tetapi demokrasi di negara kita ini sangat mahal harganya. Memang setiap orang itu berhak untuk dipilih dan memilih, namun lagi-lagi karena ongkos politik yang sangat mahal hal ini menjadikan orang-orang yang bisa duduk kursi pemerintahan itu adalah mereka yang memiliki cukup banyak uang  ataupun kekuasaan. Quote from: khiholangkangya pandangan saya sendiri untuk jika melihat tepat dan juga tidak tepatnya ini memang sudah tepat, sedikit mengganjal sebelumnya karena memang ini banyak propaganda isu-isu yang di mainkan di media. Yang menjadi masalah ini berdekatan dengan tanggal pendaftaran capres-cawapres, dan Prabowo menjadi pendaftar terakhir seperti dia menunggu sesuatu untuk melakukan tindakan, dan beberapa waktu keputusan telah di buat beberapa hari setelahnya mengambil keputusan, seakan-akan ini seperti terstruktur dalam rencana.Justru saya melihat hal ini berjalan tidak sesuai dengan apa yang direncanakan karena pada beberapa kesempatan Prabowo begitu ngotot ingin berdampingan dengan Khofifah sebagai Capres dan Cawapres. dan pada kesempatan sebelumnya juga ketika pertemuan relawan Jokowi di GBK pada beberapa bulan lalu beliau (Jokowidodo) menunjukan dukungannya kepada ganjar Pranowo begitupun dengan anaknya Gibran dengan lantang menyerukan untuk berbondong-bondong memilih ganjar pranowo di Pilpres nanti, namun sepertinya karena ganjar ini adalah orang yang tidak bisa dipercaya untuk melanjutkan estapet kepemimpinan beliau sehingga pada akhirnya beliau lebih memilih untuk berpaling dan bekerjasama dengan Probowo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "October 30, 2023, 04:53:13 AM",
      "body": "Quote from: mu_enrico on October 29, 2023, 12:46:31 PMQuote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Buming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?2.Apakah keputusan Mahkamah Konstitusi yang memboehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahanan saat ini?3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Kalau dari kacamata ane yang sudah tidak antusias dengan politik di Indo, sudah cape nyoblos tapi Indo ga jadi negara maju, mulai dari nyoblos cuma beringin sampe nyoblos capres:1. Yes.Bukan berarti yang lain ga ada yang kek gini: Puan, AHY, dll., jadi apa mereka kalo emak/bapaknya bukan orang penting? Ada yang koar-koar politik dinasti ketika misalnya Pilkada DKI kemaren?2. Tepat.Ini biar meratakan lapangan permainan, semuanya boleh nyalon! Jangan ada aturan yang menekel pihak manapun sebelum peluit dibunyikan. Ntar kalo ini dipakai bisa jadi ada kongkalikong usia harus tepat x tahun agar hanya meloloskan capres tertentu.3. Ada.Nepotisme ada di mana-mana bung, itu cuma yang disorot aja di MK, masih banyak istri/anak pejabat x trus jadi pejabat juga.Dinasti politik sudah berlangsung puluhan tahun di Indonesia cuman saat ini saja momen yang lagi bagus untuk dijadikan bahan berita dan juga bahan lawan politik. Padahal hampir semua era presiden sebelumnya sudah memiliki dinasti politik masing-masing mulai dari mantan presiden Megawati dengan Puan Maharani sebagai penerus dinasti politiknya saat menjadi menteri hingga ketua DPR RI perioder 2019 sampai 2024 hingga dinasti politik dari presiden SBY yang diwakilkan oleh AHY. Sebenarnya dinasti politik dari SBY bukan AHY saja karena sebelumnya ada Edhie Baskoro Yudhoyono yang sudah mendukuki posisi sebagai salah satu anggota DPR dari fraksi partai Demokrat. Untuk dinasti politik, jangankan di pusat di daerah bahkan di desa sudah ada terlebih dahulu saat kepala desa terpilih dan sudah pasti dia memberikan posisi dan jabatan pertama sekali untuk keluarga dan kerabat mereka sebelum tersisa satu atau dua jabatan dari kalangan atau kelompok lain tanpa ada ikatan persaudaraan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "October 30, 2023, 10:22:23 AM",
      "body": "Quote from: SaepulMT on October 28, 2023, 01:09:10 PMSilahkan berkomentar , apa pendapat kalian?Sedikit ikut berkomentar gan1. Tidak bisa dibilang seperti itu secara tegas tetapi ada kemungkinan seperti itu. Gibran sebagai warga negara indonesia memiliki peluang yang sama untuk mencalonkan diri sebagai presiden atau wakil presiden indonesia. Gibaran sebagai anak presiden tentu memiliki popilularitas yang dipertimbangkan dari pada orang pada umumnya2. Karena keputusan sudah ditetapkan maka sepakat atau tidak kita harus mengamininya karena kita negara hukum. Jika masih memgganjal dan tetap tidak sepakat bisa membuat gugatan, peninjauan ulang, atau banding dengan mekanisme hukum3. Karena manusia memiliki sisi subjektifitas maka ada kemungkinan keberpihakan tetapi hasil sudah dipiutuskan. Tidak mungkin bisa adil untuk semua orang karena setiap orang memiliki pandangan yang berbeda-beda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "baenschi78",
      "created_time": "October 30, 2023, 11:15:09 AM",
      "body": "Quote from: SaepulMT on October 28, 2023, 01:09:10 PMSilahkan berkomentar , apa pendapat kalian?Isu Nepotisme dan Dinasti akan selalu dituduhkan kepada seorang pemimpin yang anaknya ikut berkontestasi maju sebagai pemimpin yang selalu dipandang dari kacamata etika dan norma. Bagi saya kalau memang anak seorang pemimpin tidak boleh maju berkontestasi menjadi pemimpin, mestinya dibuatkan saja undang-undangnya, misalnya contoh satu, dua bahkan tiga generasi dari keturunan pejabat publik tidak boleh ikut berkontestasi mencalonkan diri sebagai pejabat publik. Selama UU belum ada ya sah-sah saja setiap anak pejabat ikut berkontestasi sekarang keputusannya tinggal pada rakyat mau dipilih apa tidak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "October 30, 2023, 03:20:01 PM",
      "body": "Saya akan mencoba menjawab beberapa pertanyaan berdasarkan sudut pandang saya terhadap arah politik yang sedang dipertontonkan menjelang pemilu 2024. Quote from: SaepulMT on October 28, 2023, 01:09:10 PM1.Apakah dengan dicalonkannya Gibran Rakabuming Raka (anak Presiden Joko Widodo) oleh Prabowo Subianto sebagai calon Wakil Presiden itu adalah bentuk politik dinasti?Isu politik dinasti mencuat kepermukaan setelah putusan Mahkamah Konstitusi (MK) mengubah syarat pencalonan presiden dan wakil presiden melalui sidang pembacaan putusan uji materi terkait batas usia capres/cawapres perkara nomor 90/PUU-XXI/2023. MK menyatakan bahwa seseorang yang belum memasuki usia 40 tahun bisa mencalonkan diri menjadi Capres atau Cawapres selama berpengalaman menjadi kepala daerah atau jabatan lain yang dipilih melalui pemilu.Tidak lama setelah putusan MK tersebut, Gibran langsung diumumkan menjadi Cawapres Prabowo. Apakah ini sebuah kebetulan.? Tentu tidak, semuanya sudah diatur secara sistematis dan mungkin peran bapaknya Gibran tidak lepas dari putusan MK yang mengubah batas usia pencalonan Capres dan Cawapres. Saya menangkap dua kejanggalan disini yang bisa mengarahkan ke politik dinasti. 1. Putusan MK yang mengubah syarat usia Capres dan Cawapres.(Tidak ada sebuah kebetulan apalagi putusan MK dilakukan menjelang pemilu).2. MK memasukkan kata \"Berpengalaman\" pada putusan tersebut meski usianya belum mencapai 40 tahun boleh mencalonkan diri sebagai Capres dan Cawapres.(Putusan MK seperti dipaksakan atau mungkin ada benarnya politik dinasti sedang dibangun, dimasukkan kata berpengalaman untuk dijadikan kartu As Gibran agar lolos verifikasi yang sudah menjabat sebagai walkot solo selama lebih kurang dua tahun).Quote from: SaepulMT on October 28, 2023, 01:09:10 PM2.Apakah keputusan Mahkamah Konstitusi yang membolehkan batas usia capres dan cawapres dibawah 40 tahun dan berpengalaman sudah menjadi kepala daerah,sudah tepat dengan keadaan pemerintahan saat ini?Banyak yang kontra atas putusan ini termasuk Majelis Kehormatan Mahkamah Konstitusi (MKMK) akan menggelar sidang dugaan pelanggaran kode etik hakim Mahkamah Konstitusi (MK). MKMK merasa harus turun tangan atas apa yang baru saja dipertontonkan MK yang terkesan membuka jalan bisa mencalonkan diri sebagai presiden dan wakil presiden meski belum berusia 40 tahun.Sidang yang akan digelar MKMK berdasarkan laporan masyarakat atas kejanggalan putusan MK menjelang pemilu. Putusan MK semakin memperkeruh suasana, MK yang seharusnya Independen dan Mengedepankan Kepentingan masyarakat malah bertindak seperti lembaga pesanan dari suatu kelompok. Quote from: SaepulMT on October 28, 2023, 01:09:10 PM3.Apakah menurut kalian tidak ada unsur Nepotisme karena ketua Mahkamah Konstitusi sekarang adalah Anwar Usman paman Gibran Rakabuming Raka ?Jika dicermati lebih detail, terdapat persoalan mendasar dalam putusan MK tersebut. Persoalan yang saya maksud disini antara paman dengan keponakan. Tidak bisa dikatakan berpengalaman hanya dua tahun menjabat sebagai walkot, apalagi konteks walkot sangat terbatas, hanya sebuah kota lho, tidak lebih.Saya lebih setuju jika MK menyebut pejabat sekelas Wakil gubernur dan Gubernur karena mereka memimpin Propinsi bukan sebuah kota saja. Mungkin karena ada aroma Nepotisme makanya MKMK akan menggelar sidang untuk memeriksa Anwar Usman dan kawan-kawannya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bots1",
      "created_time": "October 30, 2023, 03:39:32 PM",
      "body": "Menurut saya dengan dicalonkannya Gibran jelas merupakan politik dinasti Jokowi untuk melanggengkan kekuasaan. Apalagi modal Gibran dipilih oleh Prabowo karena dia anak presiden yang sedang menjabat. Kalau dia bukan anak presiden yang ayahnya sedang mempimpin saya yakin Prabowo pasti tidak akan memilihnya sebagai cawapres. Keputusan Mahkamah Konstitusi jelas terlihat mengandung unsur Nepotisme. itu jelas terlihat bahwa tiga permohonan sebelumnya, Mahkamah Konstitusi menolak permohonannya dan Anwar Usman tidak ikut bersidang dengan alasan ada konflik kepentingan tetapi ketika masuk permohonan terakhir yang diajukan oleh mahasiswa yang didalam permohonannya jelas menyebutkan nama Gibran disana anmwar usman malah ikut bersidang dan dia mengabulkan permohonannya dan diputuskan. Saya melihat keadaan demokrasi negara kita sekarang mengalami kemunduran dan dengan kejadian seperti itu mengingatkan kita pada orde baru dimana KKN begitu merajalela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "October 30, 2023, 11:52:31 PM",
      "body": "Ane kaget dengan model koalisi hari ini gan, Pertama ane kaget anis bisa berpasangan sama cak imin, padahal anis sebelumnya reprentasi dari PKS yang cukup bersitegang dengan PKB. Kemudian prabowo tiba-tiba berpasangan dengan gibran, dan adanya konflik antara PDIP dengan Jokowi. Wah bakal rame ini keknya pemilu depan dan masih sulit di prediksi karena tidak ada paslon yang memiliki elektabilitas paling menonjol. Viks si pasti 2 putaran pilpressUntuk kasus gibran, jujur saya kaget juga gan bisa tiba-tiba ada peninjauan ulang undang-undang, kemudian di setujui dan langsung berpasangan dengan prabowo, sebelum itu juga kaesang mendadak jadi ketum partai. Seperti jokowi sudah memetakan ini jauh jauh hari. Ane gak nyangka aja kalo jokowi bakal sejauh ini dalam merencanakan, karena dari awal tidak terbaca sama sekali. Dan ane pikir mungkin itu kehebatan politik jokowi yang diam diam das des langsung jadi tanpa perlu dibuat heboh di awal.Terkait politik dinasti, ane pikir pasti ada lah pengaruh jokowi didalamnya, meskipun ane ga punya bukti apapun hanya pandangan ane pribadi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaepulMT",
      "created_time": "October 31, 2023, 08:25:43 AM",
      "body": "Quote from: PytagoraZ on October 30, 2023, 11:52:31 PMAne kaget dengan model koalisi hari ini gan, Pertama ane kaget anis bisa berpasangan sama cak imin, padahal anis sebelumnya reprentasi dari PKS yang cukup bersitegang dengan PKB. Kemudian prabowo tiba-tiba berpasangan dengan gibran, dan adanya konflik antara PDIP dengan Jokowi. Wah bakal rame ini keknya pemilu depan dan masih sulit di prediksi karena tidak ada paslon yang memiliki elektabilitas paling menonjol. Viks si pasti 2 putaran pilpressUntuk kasus gibran, jujur saya kaget juga gan bisa tiba-tiba ada peninjauan ulang undang-undang, kemudian di setujui dan langsung berpasangan dengan prabowo, sebelum itu juga kaesang mendadak jadi ketum partai. Seperti jokowi sudah memetakan ini jauh jauh hari. Ane gak nyangka aja kalo jokowi bakal sejauh ini dalam merencanakan, karena dari awal tidak terbaca sama sekali. Dan ane pikir mungkin itu kehebatan politik jokowi yang diam diam das des langsung jadi tanpa perlu dibuat heboh di awal.Terkait politik dinasti, ane pikir pasti ada lah pengaruh jokowi didalamnya, meskipun ane ga punya bukti apapun hanya pandangan ane pribadiAwalnya ane juga kaget gan ,benar seperti yang agan bilang itu diatas. Saya rasa rakyak di bawah juga merasakan hal yang sama ada keanehan di politik kita ini sedangkan para politisi-politisi itu pikirnya \"ah cuman sebentar nanti juga dingin lagi\" . Memang benar menurut saya juga ini akan rame sebentar saja kalau tidak ada yang menggugat. Cuman ini akan menjadi catatan sejarah yang tidak akan pernah hilang .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "October 31, 2023, 11:33:13 AM",
      "body": "Quote from: SaepulMT on October 29, 2023, 03:00:24 AMQuote from: blue Snow on October 29, 2023, 12:04:40 AMQuote from: SaepulMT on October 28, 2023, 01:09:10 PM2.Apakah keputusan Mahkamah Konstitus yang memboehkan batas usia capres dan cawapres dibawah 40 tahun,sudah tepat dengan keadaan pemerintahanan saat ini?MK tidak membolehkan capres dan cawapres dibawah 40 tahun ya. perlu diingat, dan ente musti baca lagi tuh putusan. jadi mengapa Gibran di bawah 40 tahun, kok bisa jadi cawapres?, karena Dalam keputusan MK tersebut, ada keputusan setelah itu yaitu: berpengalaman sebagai kepala daerah, dalam hal ini Gibran sebagai walikota solo bisa mencalonkan diri jadi cawapres. Nah ini yang jadi persoalan, padahal di awal-awal MK tampak seperti menolak, namun karena seperti ada tekanan, maka terjadilah kuputusan kontroversi tersebut di akhir sidang yang membuat Sadli Isra sedih setelahnya.Tentu saja ane sudah membaca berita atau keputusan tersebut gan  , yang isinya \" Mahkamah Konstitusi (MK) mengabulkan syarat calon presiden dan wakil presiden atau capres-cawapres berusia paling rendah 40 tahun atau berpengalaman sebagai kepala daerah \".  Sumber Berita yang ane bacaGibran itu berusia 36 tahun, artinya di bawah 40 tahun, artinya dalam segi umur Gibran itu tidak masuk dalam kriteria jadi cawapres (kalau berdasarkan keputusan MK di atas). Itu ane ngebenerin quote ente di atas (yang ane garis tebal, miring dan garis bawah),  yg bunyinya : Apakah keputusan Mahkamah Konstitus yang memboehkan batas usia capres dan cawapres dibawah 40 tahun, artinya tulisan ente itu salah, jangan pakai dibawah, itu bedanya krusial banget dalam bahasa indonesia. Kok malah ngegas, dan ngeyakin ane kalau ente sudah baca, hahah, payah.Dan, Hei Xcode7 (yang ngasih merit) post dari SaepulMT, ente paham gak maksudnya?. eh?, udah senior kok main tembak merit aja, alt-nya ya? ah?, sok hebat gitu kalau SaepulMT ngebenerin/ngejawab, padahal jelas itu salah?.sama 1 lagi untuk SaepulMT tau gak kalau ngepost in the row itu dilarang?, hapus tuh dan dijadikan 1 di post no#5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "October 31, 2023, 12:28:55 PM",
      "body": "Quote from: PytagoraZ on October 30, 2023, 11:52:31 PMUntuk kasus gibran, jujur saya kaget juga gan bisa tiba-tiba ada peninjauan ulang undang-undang, kemudian di setujui dan langsung berpasangan dengan prabowo,Sepertinya bakalan rame terkait fenomena Gibran maju di Pilpres 2024 sebagai Cawapres Prabowo. Semuanya dibuat kaget setelah MK mengetok palu setelah menggelar  sidang pembacaan putusan uji materi terkait batas usia capres/cawapres.Banyak kalangan yang menilai putusan MK sebagai membuka gerbang tol bagi Gibran untuk mencalonkan diri sebagai cawapres. Majelis Kehormatan Mahkamah Konstitusi (MKMK) akan segera menanggapi sejumlah laporan terkait dugaan pelanggaran kode etik hakim MK, orang pertama yang diperiksa MKMK ketua MK Anwar Usman yang merupakan paman Gibran atau adik ipar Jokowi. Jika sidang yang digelar MKMK berakhir dengan pembatalan putusan MK, Gibran akan gugus secara otomatis karena tidak memenuhi syarat batas usia minimal pencalonan capres-cawapres.https://m.tribunnews.com/mata-lokal-memilih/2023/10/31/mkmk-putuskan-laporan-hakim-pada-7-november-jika-ketua-mk-bersalah-gibran-gagal-jadi-cawapres",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}