{
  "id": "topic_5464609",
  "title": "tg88",
  "author": "tg88",
  "created_time": "August 26, 2023, 12:31:51 AM",
  "content": "Nessa semana foi divulgado o balanço do 2° trimestre da Nvidia e os números superaram até as previsões mais otimistas. A Nvidia Teve um salto de 101% na receita se compararmos com o mesmo período do ano passado. E para o próximo trimestre a Nvidia já está projetando um crescimento de 170% em relação ao terceiro trimestre de 2022.As empresas estão investindo realmente muito dinheiro em IA, qual vocês acham que está sendo o principal foco de desenvolvimento das empresas para o uso de IA?Acho que estamos vivendo um momento de muita transformação e não está sendo possível visualizar muito efeito no curto prazo, mas estou curioso para saber as mudanças que esse movimento pode causar no mundo que conhecemos hoje.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464609",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "August 26, 2023, 11:27:02 AM",
      "body": "Nvidia é a bola da vez há um tempo...E independente de que lado a AI se desenvolva, com ou sem regulação,  mais pro lado de images ou chapgt ,etc... as placas da Nvidia serão vendidas em qq cenário.Mas, o preço das ações já está alta demais. A melhor hora de investir na Nvidia já passouNão quer dizer q não suba mais 100%, mas agora o risco X retorno está pior...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 26, 2023, 12:16:46 PM",
      "body": "Quote from: tg88 on August 26, 2023, 12:31:51 AMAs empresas estão investindo realmente muito dinheiro em IA, qual vocês acham que está sendo o principal foco de desenvolvimento das empresas para o uso de IA?Acho que estamos naquela fase em que vale tudo. Ou seja, todo o tipo de focos são validos, com dezenas ou centenas de empresas a desenvolver soluções diferentes de IA. E talvez só daqui a um ou dois anos é que começaremos a ver uma real definição no mercado. A maioria dessas empresas irão falir, outras irão se juntar a outras. No final, os grandes players irão continuar a ser os mesmos Microsoft, Google e Apple.A Nvidia é a que menos se importa com o rumo que o desenvolvimento IA vai tomar, no final ela vai sair sempre a ganhar. Principalmente continua a não ter um verdadeiro rival no mercado. E eles nem precisam fazer nada, só continuarem o seu trabalho, porque parece que ninguém quer realmente investir em processadores de alto desempenho e qualidade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "August 26, 2023, 02:28:14 PM",
      "body": "Quote from: joker_josue on August 26, 2023, 12:16:46 PMA Nvidia é a que menos se importa com o rumo que o desenvolvimento IA vai tomar, no final ela vai sair sempre a ganhar. Principalmente continua a não ter um verdadeiro rival no mercado. E eles nem precisam fazer nada, só continuarem o seu trabalho, porque parece que ninguém quer realmente investir em processadores de alto desempenho e qualidade.Um dos pontos que pode interferir no crescimento da Nvidia é caso o governo dos EUA apertar ainda mais as regras e não deixar o mercado chines ter acesso as placas da nvidia. Recentemente a Nvidia se manifestou solicitando que os EUA não aumentem ainda mais as restrições para os chineses. Hoje a China corresponde por 20% a 25% da receita da Nvidia no setor de IA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 26, 2023, 10:32:23 PM",
      "body": "Estava olhando as ações da Nvidia ontem.. subiram mais uns 13% desde que chegaram ao US$ 1 trilhão.. realmente impressionante uma empresa desse tamanho estar valorizando tanto.Será que passa Amazon e Google?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "August 27, 2023, 01:24:59 PM",
      "body": "Quote from: sabotag3x on August 26, 2023, 10:32:23 PMEstava olhando as ações da Nvidia ontem.. subiram mais uns 13% desde que chegaram ao US$ 1 trilhão.. realmente impressionante uma empresa desse tamanho estar valorizando tanto.Será que passa Amazon e Google?Daqui pra frente são como degraus de uma escada, 0,25 bi a cada novo degrau (respectivamente Amazon e Google). É bem desafiador, mas parece que tem potencial pelo menos no curto prazo para ultrapassar a Amazon. A Refinitiv está projetando 12 bi de receita para o próximo trimestre da Nvidia enquanto a própria Nvidia acabou de revelar que está com uma expectativa de 16 bi de receita para o mesmo período.  Mas como o bitmover comentou investir agora pode ser bastante arriscado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "August 27, 2023, 05:42:02 PM",
      "body": "Quote from: tg88 on August 26, 2023, 12:31:51 AMAs empresas estão investindo realmente muito dinheiro em IA, qual vocês acham que está sendo o principal foco de desenvolvimento das empresas para o uso de IA?Tomando como caso de uso a própria Nvidia, o foco está sendo a IA generativa, pois a receita mencionada nesse tópico se deve principalmente ao uso dos chips da Nvidia que foram desenvolvidos especificamente para uso em aplicações que constroem e executam aplicativos semelhantes ao do ChatGPT da OpenAI para proporcionar ao usuário respostas mais rápidas para consultas de linguagem natural e também de geração de imagens.Até onde eu li, nenhuma outra empresa até então conseguiu encontrar hardware que traga resultados tão bons nesse nicho de mercado, e aí... se é algo bom e que só existe em um lugar, a Nvidia cobra o quanto quer por isso pois sabe que terá compradores.Jogos, Cripto Mining agora IA... a Nvidia ganhou muuito dinheiro em todos essas fases e pelo visto sempre esteva um passo à frente prevendo qual seria o próximo movimento do mercado e antecipando a evolução de seus produtos para atender esse mercado.Qual será o próximo? Chips para atender o nicho de robótica em dispositivos autônomos?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 28, 2023, 06:35:44 AM",
      "body": "Quote from: alegotardo on August 27, 2023, 05:42:02 PMQual será o próximo? Chips para atender o nicho de robótica em dispositivos autônomos? Robótica duvido. Porque isso já é um nicho que existe alguns anos e a Nvidia não entrou nele.Não quer dizer que alguns casos, não sejam usados chips Nvidia, mas para a robótica não é algo comum.A robótica usa ASIC - não para minerar, mas chips previamente programadas para determinada função. Depois a evolução passa mais pelo software do que pelo hardware. Ou seja, o robô só precisa de ter um chip que faça ele mexer o braço, e que tenha a informação de todos os movimentos possíveis de fazer. Depois será o software a comandar que movimentos e a que velocidade os faz.Claro que os robôs com IA, já teremos então chips Nvidia para processar a informação. Mas, aqui não é robótica em si, é IA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}