{
  "id": "topic_5407213",
  "title": "Apatu Ek Am",
  "author": "Apatu Ek Am",
  "created_time": "July 22, 2022, 04:20:42 AM",
  "content": "5 days ago I read that one of the posts on twiiter USDT is temporarily down https://twitter.com/paoloardoino/status/1538155542643888128 and are there other factors that make usdt stronger?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407213",
  "comments": [
    {
      "author": "ilovealtcoins",
      "created_time": "July 22, 2022, 04:31:39 AM",
      "body": "The USDT is priced in USD due to the fact that inflation is hitting the world economy and the Fed has taken action to raise interest rates to curb inflation, resulting in a rise in the USD index in recent weeks in response to this. USDT appreciation in USD is obvious as they are valued at 1USDT = 1USD, As long as USD decreases, USDT will decrease accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 22, 2022, 05:40:03 AM",
      "body": "There are internal factors besides the built-in deflation of backed fiat. In the case of USDT, for example bitfinex managed to bring back the public's trust when they succeeded in a series of assurance and transparency audits the all of their asset reserves by the authorities.However, this does not mean that USDT will be able to significantly exceed the price of the original reserve currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "July 22, 2022, 06:04:59 AM",
      "body": "The tweet reference does not have any correlation at all with your topic.https://nitter.net/paoloardoino/status/1538155542643888128Quote1/This morning @Tether_to received a ransom request to avoid mass DDOSes.They tried already once.On a normal day we have around 2k reqs/5minThe attack brought us to 8M reqs/5min.3/Attack is now mitigated.AS-CHOOPA is the main ASN identified by cloudflareIt references an ongoing/planned DDoSes attack on their website. As good as it gets, they must feel lucky to got Cloudflare on their backs. Anyway, there is a similar thread, that has a thorough explanation few recent issues that Tetherhas  acknowledged: Possible tether attack . It seems there is possibly a coordinated attack within the ecosystem. In another way, I have been sensing that they brag too much about their credibility as of late. Surely I would be staying away from Tether if any I got some fund on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "July 22, 2022, 07:06:08 AM",
      "body": "I think the issue has been solved by Tether and the USDT itself are still being peg 1:1.We can only speculate that it could be due to the DDoS attack or simply the effect of the dollar inflation. So for now we can say that it's back to normal as the attack has been thwarted and again peg 1:1. So that is goes news and I would say there's nothing to worry about for now as they have the reserves as back up to continue to have it peg to US dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "July 22, 2022, 01:49:44 PM",
      "body": "That's DDOS, there are so many attackers who are aiming for the legit sites that owned by a very well company. So many times those hackers are ddosing the various sites. i don't even see the price of USDT was getting higher and where did you see that? it's still remain the same for now. https://coinmarketcap.com/currencies/tether/It's still remain 1 dollar. There's no need to feel worry about that. Tether was using cloudflare that can prevent it. USDT stronger caused by fiat money that has become its reserves to backed the token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "July 22, 2022, 03:30:03 PM",
      "body": "The good thing in here is if that you're hoarding USDT for quiet a while then it's literally that juicy to have these prices. As other have said, the USDT price is just getting price in USD so it's safe to assume that they'll get the same valuation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 22, 2022, 09:53:40 PM",
      "body": "Quote from: Apatu Ek Am on July 22, 2022, 04:20:42 AMare there other factors that make usdt stronger?Well, it's pegged on the US dollars and that's why its price is getting high too. It's a global thing that the USD is getting stronger and it's even par with the Euro.All of those things that are happening globally, oil shortage, food shortage, pandemic and everything. The price of USD that's becoming stronger means that they're becoming stronger on the global trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 22, 2022, 09:54:14 PM",
      "body": "I have an assumption that the era of USDT leadership is coming to an end. USDC is steadily reclaiming the market and the gap between the capitalization of these two assets has recently narrowed a lot, now about 11 billion. Most likely, investors saw some concerns about losing peg to the USD and started pouring liquidity into USDC in droves. USDT has not always been smooth with collateral, because judging by their audits, the collateral there was not fiat, but more in securities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "July 22, 2022, 10:04:52 PM",
      "body": "Quote from: noorman0 on July 22, 2022, 05:40:03 AMThere are internal factors besides the built-in deflation of backed fiat. In the case of USDT, for example bitfinex managed to bring back the public's trust when they succeeded in a series of assurance and transparency audits the all of their asset reserves by the authorities.However, this does not mean that USDT will be able to significantly exceed the price of the original reserve currency.I have seen recently how the price of usdt is almost hitting one cent but the worth is still pegged to a dollar especially on exchange so that it will not alter the price. People are now gaining more trust in the project and the fact that they had really shown to us that the project is worth risking for. With the event that happened to Luna this had many many similar stable coins to step up their game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 22, 2022, 10:37:38 PM",
      "body": "USDT is pegged to dollar 1:1 so it only means that USDT will always try to equal its value to 1 dollar and not exceeds it.  A stronger dollar reserve means, a stronger foundation for USDT, and does not mean that USDT will exceed the intended price value which 1 USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "July 22, 2022, 10:59:19 PM",
      "body": "Quote from: Xal0lex on July 22, 2022, 09:54:14 PMI have an assumption that the era of USDT leadership is coming to an end. USDC is steadily reclaiming the market and the gap between the capitalization of these two assets has recently narrowed a lot, now about 11 billion. Most likely, investors saw some concerns about losing peg to the USD and started pouring liquidity into USDC in droves. USDT has not always been smooth with collateral, because judging by their audits, the collateral there was not fiat, but more in securities.Thanks for this info, I haven't followed USDC though, as I put some of my assets in USDT right now so obviously, I'm more concern about this news. But as others have pointed out, this is DDOS attack and not on their reserves dwindling down or something.And last time I check the price is still pegged as 1:1 so I'm will not be concern anymore. Yes, Bitifinex is shady as claim by some and says that they are running on fractional reserves only. But they have been in the market since 2017 or longer if I'm not mistaken, and so far no Luna like problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 23, 2022, 12:51:44 AM",
      "body": "There can be such ups and downs for usdt. It's not terribly scary for me. He usually takes sales as 1:1. We do not experience any loss of value. These are also financially supported assets. There may be insecurities in between and it is necessary not to ignore them. But in general, I don't think it will be a dangerous situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "July 23, 2022, 01:21:44 AM",
      "body": "Quote from: Apatu Ek Am on July 22, 2022, 04:20:42 AM5 days ago I read that one of the posts on twiiter USDT is temporarily down https://twitter.com/paoloardoino/status/1538155542643888128 and are there other factors that make usdt stronger?In the title, you say USDT is getting higher but from the statement it says it is down temporarily. Do you know how USDT works and why it's at 1:1 with dollars? but not completely 100%. Instead of saving in USDT, I see an advantage on the much more stable USDC side. You can see him surviving after the LUNA case and showing who was behind this attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "July 23, 2022, 07:06:06 AM",
      "body": "Quote from: Apatu Ek Am on July 22, 2022, 04:20:42 AM5 days ago I read that one of the posts on twiiter USDT is temporarily down https://twitter.com/paoloardoino/status/1538155542643888128 and are there other factors that make usdt stronger?Personally, I don't have many complaints about the stability it brings. At least for now, it still provides safety for holders. But with the title that OP mentioned here, I really feel there is no connection here. We can see the market in the past few months has suffered a lot of liquidations and collapses of big projects. It also partly affects the cause of stables losing their necessary stability. But don't take it too seriously as it still gives the means to trade in this market. USDT to me, they also have their own problems but have also proven over time that they're legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "July 23, 2022, 07:50:57 AM",
      "body": "Yes, you are right usdt prices getting higher because of the inflation we are dealing right now and it's not a good news at all hence all prices rising up, commodities, gas and all necessities gone up. Lower class will have a big impact to these inflation because they will surely have a big adjustment of their budget to buy their needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 23, 2022, 09:33:58 AM",
      "body": "Quote from: cryptomaniac_xxx on July 22, 2022, 10:59:19 PMQuote from: Xal0lex on July 22, 2022, 09:54:14 PMI have an assumption that the era of USDT leadership is coming to an end. USDC is steadily reclaiming the market and the gap between the capitalization of these two assets has recently narrowed a lot, now about 11 billion. Most likely, investors saw some concerns about losing peg to the USD and started pouring liquidity into USDC in droves. USDT has not always been smooth with collateral, because judging by their audits, the collateral there was not fiat, but more in securities.Thanks for this info, I haven't followed USDC though, as I put some of my assets in USDT right now so obviously, I'm more concern about this news. But as others have pointed out, this is DDOS attack and not on their reserves dwindling down or something.And last time I check the price is still pegged as 1:1 so I'm will not be concern anymore. Yes, Bitifinex is shady as claim by some and says that they are running on fractional reserves only. But they have been in the market since 2017 or longer if I'm not mistaken, and so far no Luna like problem.A DOS attack on a company website will not prevent you from moving your tokens.If you want to understand stablecoins, then read this information.https://bitcointalk.org/index.php?topic=5247581.0USDC reserves are audited by renowned global auditors and reports are published every month.Why don't USDT do the same?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antsam",
      "created_time": "July 23, 2022, 09:37:20 AM",
      "body": "It's up and down isn't it normal? I think USDT's fundamentals are very good with the guarantee that the real money it currently has will be able to support it which will not be like UST which collapsed because from the start it did not have strong fundamentals. I think that my belief has been proven because to this day USDT is still standing strong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 25, 2022, 01:33:44 PM",
      "body": "Quote from: Apatu Ek Am on July 22, 2022, 04:20:42 AM5 days ago I read that one of the posts on twiiter USDT is temporarily down https://twitter.com/paoloardoino/status/1538155542643888128 and are there other factors that make usdt stronger?Your post does not make sense, You said that the USDT is temporarly down, but you then ask \"are there other factors that make usdt stronger?\" seems like you means that the USDT down make it stronger, which is not. And also USDT is stable coin, the price should not get higher than approximately 1 USD that's the main purpose of this coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "July 26, 2022, 08:05:29 AM",
      "body": "There's a meeting that's happening right now and there will be for tomorrow too. Everyone is expecting that there's another effect on it the price of USDT and that's why those that have been holding stablecoins are still holding it because whatever the outcome of that meeting, surely will affect the price of it. Well, there's the effect on USDT because we are all aware of where it is relying and that's why when FED results in a positive meeting, the price of USD will be increasing again and so does the USDT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}