{
  "id": "topic_5465094",
  "title": "Cullinantime",
  "author": "Cullinantime",
  "created_time": "August 30, 2023, 02:31:36 PM",
  "content": "I usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465094",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 30, 2023, 02:41:21 PM",
      "body": "You created my treading strategy  just yesterday, and you created this thread today. Why not use a single thread for your signals. You can make the OP looks in a way people can put your thread on a notification by explaining how you will keep posting signals.Do not continue to create topic because it will become spam and your posts would be see like you are spamming the forum.I can understand what you talk about that it is good to go for long, you followed my advice in your previous thread or likely because you have seen an oversold market. That is nice.But using more than 1 hours chart for your analyses, you will understand that the market might still go down, while 15 and 1 hour chat is suggesting that the market may go up. If you are not holding but trading, know that it would be good to exit the market with little gain before the market reverses back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 30, 2023, 03:28:23 PM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately You cannot be predictable with the altcoins in these present market conditions because their future remains unpredictable and we cannot give a proper position on what they may resulted at any time despite we are moving fast ahead the bullrun, there's no doubt that the altcoins may have positive indications with the market price to rise but there's no certainty in whatever we engage doing in them, bitcoin is what we can accurately describe as a market that will be considered having an investment profidential and we are expecting more of bitcoin to rally round through the weekend from what the speculation gives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 30, 2023, 03:52:59 PM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately So OP is a future trader and after reading the thread it seems like OP is pretty active with the market because you are posting time to time topics for the newbies, but one thing I can understand, you are creating this topic to update us or want to ask something from or any other motto as well, because I think many of the forum users are traders and very experienced traders believe me, pro learners as well but they don't post te updates like what they are doing, seems like they know what it means obviously as Oshosondy said spam.Anyway, I think you should create a thread on my telegram with the signals  , because most of the newbies here ask about the signal telegrams and news & updates as everyone can't master it. Be their master and support them (Taunt). The market is not moving in a good zone last day's appreciation was caused by the grayscale news and now the market is following the sentiments Wait till Friday there can be something interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 30, 2023, 04:43:58 PM",
      "body": "Are you talking about the pump which took place at August 29, 2023. I mean yesterday if not then on what basis are you saying that market could pump more. And one more thing, in crypto industry never say or make any statement that directly encourage others to take entries in the market as most of the members might be new to crypto and after reading this post they might react and take some entries. But what if market have other plans, so always use 4 good words at the end which are (DYOR).And in my suggestion I also think market might go above even in this short time span. I mentioned short time span because in the long run market will obviously go up due to hell lot of reasons but in this short time I think market might hit again $30k but what good it might bring for holders. Hahah. So, I am just buckling up and waiting for the next ATH whenever it comes. I wanted to see my $10 to become 3x 4x 10x I do not know what X hahaha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "August 30, 2023, 05:51:33 PM",
      "body": "Op, You should not excite newbies to do something that could loss them money because a lot of fuds just started due to statements like these you just made above. So it will be better for whole community if you will come up with some rigid plan like on what analysis you are making these predictions then it will be helpful will be providing valuable data and insights but just sharing these is not helpful and will be encouraged too. Quote from: Oshosondy on August 30, 2023, 02:41:21 PMYou created my treading strategy  just yesterday, and you created this thread today. Why not use a single thread for your signals. You can make the OP looks in a way people can put your thread on a notification by explaining how you will keep posting signals.Thanks a lot for the clarification as I thought OP must have a lot of experience but after reading the post I can say he/she is just to excited and confident after learning two or more new things about market and now h/she thing he can time the market like no one have did and become pro in night and started to advice other too. I doubt if the OP might open a VIP Signal channel too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 30, 2023, 06:14:54 PM",
      "body": "Well — based on the thread you posted previously, I thought your strategy was to short coins/tokens that have gone up? Why are you suddenly bullish when they're already up? Next thing you know you're bearish again if it's the case that we get a full retracement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "August 30, 2023, 06:20:29 PM",
      "body": "Quote from: mk4 on August 30, 2023, 06:14:54 PMWell — based on the thread you posted previously, I thought your strategy was to short coins/tokens that have gone up? Why are you suddenly bullish when they're already up? Next thing you know you're bearish again if it's the case that we get a full retracement.The OP's \"strategy\" sounds pretty thin to me in general and probably has more to do with gambling than a well thought out and well executed trading strategy. For me personally, the markets are currently much too difficult to assess, it had hardly any traders the sudden BTC breakout yesterday on the chart. I am currently waiting on the sidelines and watch the market development over the coming weekend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "August 30, 2023, 06:39:27 PM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately Don't be too confident with one analysis when dealing with highly volatile crypto markets. Because we have seen how the recent crypto scenario is even quite stressful for people when referring to price movements. Nothing is certain if you make a decision without considering other options that could be detrimental. For a while it may be quite convincing, but because we are talking about crypto, especially SOL, the case has damaged investor confidence.Quote from: Hamza2424 on August 30, 2023, 03:52:59 PMAnyway, I think you should create a thread on my telegram with the signals  , because most of the newbies here ask about the signal telegrams and news & updates as everyone can't master it. Be their master and support them (Taunt). Agreed, but if Op can show his calculations in statistical form we will reconsider his predictions. Everyone needs valid support because they know the money that will be dropped. So don't let beginners swallow the suggestions above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "August 30, 2023, 07:12:47 PM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately I think next time you are trying to analyze the market, it will be more interesting if you show us your chart because that is what we convince us that you actually know what you are writing differentiating you from people that like speculating the market direction without having a concrete view about what everything is all about. At least you need to show us what is happening in the market right away and your info indicators pointing at what the market is capable of doing in the next market movement. We don't analyze the market without showing why we think the price will move in a certain direction. This is important so other traders that are coming up will have comprehensive view about the market also not just following signals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aeroplanino",
      "created_time": "August 31, 2023, 12:26:12 AM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately In bear market, altcoins are most risky.I only buy bitcoin in a bear market and only buy altcoins in bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 31, 2023, 03:57:54 AM",
      "body": "Op,  I want to remind you that traders have different views of the market, your perspective, and my perspective may not be the same and that is the reason why we make profits or losses trading in the market. However, we are very much closer to rallying up than we have to dip down, All we need to do is apply a strategy that you know will profit you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 31, 2023, 05:12:24 AM",
      "body": "If I was a trader, I did quit trading at the moment because I believe we are in the season where buying and holding is the best option, at least, to avoid losing out on big bumps, look at what bitcoin did the other day, it jumped from $25,000 to a little above $27,000 dollars in just a twinkle of an eye, Now' I can only imagine how many short positions were liquidated by this singular move.Trading is good, at least, it is one of the ways to make quick profit if you know exactly what you are doing and the market moves in your favour, but it is also an avenue to lose out or miss out on big pumps, since pumps sometimes happen when we least expect it .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "August 31, 2023, 06:31:44 AM",
      "body": "If you know the type of coins you are holding in this season, you don't need to be panic about the market price than to continue maintaining your strategies to ensure you achieve what you want in your trading when the right time come. All those altcoins you mentioned here are good for short term trading, but if you want to make huge amount of money from potential coin try to use this period to invest in Bitcoin and apply long term holding which it will help you to increase your profits in the future. I think, Solana, Ethereum and ADA are going to pump higher before the end of this year to allow short term traders to smile again with a huge amount of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "August 31, 2023, 08:03:41 AM",
      "body": "The market is positive right now and it is expected that the market will get better soon. Some other coins, including Bitcoin Ethereum BNB, have great potential to increase in value. When the market suddenly fell down a few days ago, we have been noticing something positive in the market since then. Those who have investments in the market do not get excited, be patient and wait for the market to move to a better position. According to the current market if any coin can be invested at this time then it will not be bad so those who have investment hold on and those who want to invest can invest right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G_Besar",
      "created_time": "August 31, 2023, 08:07:30 AM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately The altcoin that you have chosen doesn't look bad if it's only intended for the short term, because if you are very sure about the pumping conditions in the market and the green zone will decorate the market this year, it's better if you want to choose Bitcoin as an additional asset for you. which has been very good until now apart from the altcoin you mentioned. Because when the green zone approaches the market again, Bitcoin will also experience more increases and can also have an increasing influence on several altcoins and one of them is the one you mentioned.Now the crypto market conditions still look the same after a slight increase in the past two days and the green zone is still not very visible in the market now because a slow decline is still happening, although not so fast, but it still tends to move sideways without increasing so some traders short-term traders still continue to take advantage of this to buy their preferred cryptocurrency before the green zone and rapid increase is approaching some of the existing cryptocurrencies in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "August 31, 2023, 08:38:57 AM",
      "body": "And now we see prices in the market turning red again with Bitcoin prices dropping slightly but already making altcoins decline quite a bit. Another correction is coming to the market as many are on the decline even though there are coins trying to hold on, including ADA.You have to be patient longer because this situation can take longer than we think. But the bitcoin bull run and altcoin season will come back in the market, which is what we are waiting for.You can prepare some money to buy some potential altcoins but you still have to analyze to find out when to enter the market. But if you want to invest, you are collecting Bitcoin and altcoins for the long term. We may see market conditions change next year. Meanwhile, let's enjoy the market journey from now until the end of this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "August 31, 2023, 09:31:50 AM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately Just don't expect any big rally there's no big events happened so most likely the movement will still the same like a short pump and then follow up by the dump. This is normal cycle so better just trade with it according to the current trend.Maybe we can say its best to hold them wait for a rally if we can see something positive things happened since maybe this one can cause a good rally to the coins mentioned in this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "August 31, 2023, 10:11:28 AM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately Remember, even if we are all free to form our own forecasts, none of them are guaranteed to come true. Additionally, if you want to make predictions, there are tools you can utilize that will enable you to do so without solely relying on the history of the coin you wish to employ for your trading activity.Since your level of understanding in cryptocurrency trading will determine how successful you are, if you are a skilled trader with a broad understanding of the industry, man, that will be a huge advantage for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 31, 2023, 11:21:40 AM",
      "body": "Quote from: Cullinantime on August 30, 2023, 02:31:36 PMI usuallyy short but i see that market looks like how it looked like before bigger pump and short liqutation.Be careful to short we will see green market soon now Im long with SOL,ETH,ADA Im ready for pumpMarket is support zone now definately it's like some altcoins rally definately If you see market is in short zone, why not continue riding the short or stay out to wait for due time for long rather than speculating for bull and you already jumped in on bull. That is not the trading pattern, you are speculating and you can lose alot even before the market start to meet your entry price if it will eventually before you blow out your capital. You don't analyse the crypto market with altcoins because bitcoin has the dominance and every movement flows from it except in rare cases if an altcoin does something that is in the news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}