{
  "id": "topic_5433447",
  "title": "FTCash",
  "author": "FTCash",
  "created_time": "January 08, 2023, 08:14:19 AM",
  "content": "Доброго времени суток, уважаемые форумчане!!! Предлагаем Вашему вниманию наш обменный сервис FTCash. FTCash - это платформа, которая использует сложные механизмы для обмена криптовалют по наиболее выгодному курсу, но остается простой и удобной в использовании. Без необходимости регистрации. Через наш обменный пункт каждая транзакция проводится по наиболее выгодному курсу, мгновенно и с низкой комиссией. Простой и удобный интерфейс:FTCash не требует от вас регистрации на сайте. При этом вы совершаете транзакцию, не покидая вкладки вашего браузера, а время ожидания завершения транзакции становится делом пары секунд.Выгодный курс обмена:FTCash подключается к биржам по их API и мгновенно находит наиболее выгодное для вас предложение. Сервис работает с такими биржами как Bittrex, Binance и др.Фиксируете ли вы обменный курс?Да, курс, по которому проводится транзакция, фиксируется на 15 минут. Пользователь может быть уверен, что курс не изменится, прежде чем он закончит оформлять транзакцию. Обращаем Ваше внимание — обмены производится только по заявке на сайте FTCash!Сторонние мессенджеры предназначены для получения консультативной информации, при необходимости Вы можете запросить проверочный код в чате на сайте, и убедиться что общаетесь именно с нами.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433447",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "January 08, 2023, 09:27:39 AM",
      "body": "А ссылка где?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FTCash",
      "created_time": "January 09, 2023, 06:45:14 PM",
      "body": "Добавлена новая валюта: Tether ERC20Также увеличены резервыСсылка на обменник: https://ftcash.cc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FTCash",
      "created_time": "January 10, 2023, 06:39:36 PM",
      "body": "Добавлены новые валюты: Bitcoin BTCLitecoin LTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FTCash",
      "created_time": "January 20, 2023, 11:22:37 AM",
      "body": "Временно отключили направления связанные с: UAH",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FTCash",
      "created_time": "January 25, 2023, 04:31:46 PM",
      "body": "Доброго времени суток, работаем в штатном режиме.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}