{
  "id": "topic_5424807",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "November 30, 2022, 05:43:16 PM",
  "content": "Back to international business with Russia. Here it comes... a method to easily bypass the sanctions.Russia to establish a national cryptocurrency exchangeQuote from: https://www.naturalnews.com/2022-11-29-russia-to-establish-a-national-cryptocurrency-exchange.html#Russian legislators have been collaborating on creating a national cryptocurrency exchange, a move that was reportedly supported by the Ministry of Finance and the Central Bank of Russia. These government entities have a long history of conflict over crypto legislation in the nation, but have now come together to support the initiative.According to local media reports, the Duma, or the lower house of the Russian government, has been in talks with market participants about changes to the country’s current cryptocurrency legislation “on digital financial assets.”The central bank is the first to get a presentation of the revisions, which would establish the legal foundation for a national exchange.Member of the Duma’s Committee of Economic Policy Sergey Altuhov pointed out that no one can deny the existence of cryptocurrencies in today’s global financial system.“The problem is they circulate in a vast stream outside of governmental regulation. The federal budget has lost billions of dollars in tax income as a result,” Altuhov said.Meanwhile, Anatoly Aksakov, the chair of the Duma’s Committee on Financial Market, said back in June that Russia may establish a national cryptocurrency exchange as a member of the Moscow Exchange, “a credible organization with an extensive history.”The said financial organization made a law in September to permit trading in digital financial assets on behalf of the central bank.Historically, the nation’s lawmakers have disagreed with the idea of using cryptocurrencies as a payment method. In 2020, the Russian government enacted a law prohibiting its use for payment purposes. The central bank has also been skeptical because it wants to protect the status of the ruble as the only legal tender in Russia. (Related: Russia legalizes cryptocurrencies for cross-border transactions.)Brighteon.TVDeputy Minister of Finance Alexei Moiseev emphasized the importance of legalizing and supporting local cryptocurrency platforms now, adding that many Russians rely on foreign platforms to open cryptocurrency wallets which could be a dangerous situation given Western sanctions.“It is necessary to do this in Russia, involving entities supervised by the central bank, which are obliged to comply with Anti-Money Laundering [regulations] and Know Your Customer requirements,” Moiseev said....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424807",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "December 01, 2022, 04:14:45 AM",
      "body": "I assume if Russia indeed start their own exchange, owned by the government itself and they start to commerce with Bitcoin and other altcoins, then I expect all western powers and allies of the USA to treat any satoshi that had contact with those exchanges as \"tainted\" and prosecute (or at least interrogate) any citizen in their soil who received funds to their custodial wallets on Coinbase, Binance, etc. I doubt Russian straw men will be tolerated.It is just some of my speculation, though. I can be completely wrong on this one...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "December 04, 2022, 11:11:00 AM",
      "body": "Quote“It is necessary to do this in Russia, involving entities supervised by the central bank, which are obliged to comply with Anti-Money Laundering [regulations] and Know Your Customer requirements,” Moiseev said.Does anyone believe russia will comply with anti money laundering regulation?Wouldn't that be like north korea complying with AML.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "December 04, 2022, 08:56:20 PM",
      "body": "Russia isn't part of the US/Europe banking system that is trying to take over the world. Rather, Russia is involved in free trade. One way or another, Russia gets its free trade. The things that the West banking system is doing is destroying it faster than if it had simply competed with Russia for free trade. Using Ukraine to fight Russia is a simple example of how the West is using the tactics they attribute to Russia. Russia is simply continuing with their free trade everybody thinks the West does, while watching the West destroy itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}