{
  "id": "topic_5411540",
  "title": "JeromeTash",
  "author": "JeromeTash",
  "created_time": "August 28, 2022, 08:43:47 PM",
  "content": "Does anyone know a good trading terminal software for Window or Linux?Something link Binance's trading software for computer, but can be used to connected to different exchanges via API keys. Someone might be knowing some good software here. Give me some pointers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411540",
  "comments": [
    {
      "author": "electronicash",
      "created_time": "August 29, 2022, 05:04:22 AM",
      "body": "no real answer for this yet. i think there was a similar thread about this and there are some few good responses to it. one that i can remember was MetaTrader5. i think you can link it to servers of Forex brokers.try checking this link https://www.binance.com/en/support/announcement/3012b9438595437cac9a7bcbf1b381f7sadly its not for retail traders. you can however use the Forex brokers MT5 version to trade crypto, not binance such as Oanda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 29, 2022, 06:55:26 AM",
      "body": "I still use Aurox Terminal. Actually I've only been monitoring prices so far, have never linked my exchange account due to skepticism. But they have the functionality you need, also support to some of the top exchanges including DEX.As far as I know it's paid app, but I don't know about the exact cost. I have been a full membership for free since I joined their signature campaign 2 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 29, 2022, 12:11:37 PM",
      "body": "What kind of software you used right now? I heard Bitsgap and Crypthopper is good, but they're mainly a trading bot service, so not sure what kind of service you can expect from them. If you're not trading on many exchanges, I'd rather use multiple browser to trade tbh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "August 29, 2022, 01:11:38 PM",
      "body": "Quote from: joniboini on August 29, 2022, 12:11:37 PMWhat kind of software you used right now? I heard Bitsgap and Crypthopper is good, but they're mainly a trading bot service, so not sure what kind of service you can expect from them. If you're not trading on many exchanges, I'd rather use multiple browser to trade tbh.Those two trading bot app you mentioned, i believe that they have their charge's. Because it's quite understanding that anything that deals with bot involve subscription via trading. For you to recommend this trading bots what's the disadvantage behind using recommended bots, because it's the advantages functions and disadvantages function will trigger someone else to enroll with them. Because sometimes all this bot trading apps always consume your Profit with the subscription monthly or weekly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "loveselenagomez",
      "created_time": "August 30, 2022, 02:31:16 PM",
      "body": "Binance Desktop. Download now for refined performance and increased speed; a complement to your crypto trading needs. Available for Windows, MacOS, and Linux. https://www.binance.com/en/desktop-downloadI have been using last 2 years, it's totally unique experience in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "September 08, 2022, 09:42:14 PM",
      "body": "Quote from: electronicash on August 29, 2022, 05:04:22 AMno real answer for this yet. i think there was a similar thread about this and there are some few good responses to it. one that i can remember was MetaTrader5. i think you can link it to servers of Forex brokers.The binance trading terminal is more than OK, but it just for Binance. I needed something where I would connect some more exchanges like FTX, Bybit, Bitmex, etc. so MetaTrader5 won't be ideal. Thanks for the suggestion, though.Quote from: joniboini on August 29, 2022, 12:11:37 PMWhat kind of software you used right now? I heard Bitsgap and Crypthopper is good, but they're mainly a trading bot service, so not sure what kind of service you can expect from them. If you're not trading on many exchanges, I'd rather use multiple browser to trade tbh.Quote from: noorman0 on August 29, 2022, 06:55:26 AMI still use Aurox Terminal. Actually I've only been monitoring prices so far, have never linked my exchange account due to skepticism. But they have the functionality you need, also support to some of the top exchanges including DEX.As far as I know it's paid app, but I don't know about the exact cost. I have been a full membership for free since I joined their signature campaign 2 years ago.Thanks guys, I am going to check them out. I used the Binance trading terminal and some app called aicoin, but problem is it's not well translated. It's mostly in Chinese but seems to be a good trading terminal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 08, 2022, 11:33:26 PM",
      "body": "Have you tried to check TradingView the desktop version? Check them here https://www.tradingview.com/desktop/The only problem they only support a few exchanges. Another old trading software that I know is Cryptowat.ch the desktop one they do support Binance and a few exchanges you can download the software here- https://cryptowat.ch/apps/desktopThen the guide on how to add exchange here https://guides.cryptowat.ch/connect-exchange-accountsHow about zenbot? It doesn't have a graphical interface like other software above it's a pure command-line interface but it's free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "September 09, 2022, 04:13:23 AM",
      "body": "If you're going to explore the internet regarding about this matter, many favors on Linux because of its less flawed lines of coding on its system. Linux is much better than windows especially when it comes to security, however, you need to be more advanced user when you're going to choose linux to maximize its potential as a software. Compared to windows, that has too many users around the globe, it makes it vulnerable to cyber attacks, malwares, and viruses. Since you're trading, you might want to consider the fact that you need to secure the funds of yours that's going to be your key to make profits in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "September 09, 2022, 09:41:29 PM",
      "body": "Quote from: BitMaxz on September 08, 2022, 11:33:26 PMHave you tried to check TradingView the desktop version? Check them here https://www.tradingview.com/desktop/The only problem they only support a few exchanges. I did try tradingview sometime back and the exact problem is what you mentioned. They do support only FTX and OKX on the side of crypto exchanges as of now on their trading panelQuote from: BitMaxz on September 08, 2022, 11:33:26 PMAnother old trading software that I know is Cryptowat.ch the desktop one they do support Binance and a few exchanges you can download the software here- https://cryptowat.ch/apps/desktopThen the guide on how to add exchange here https://guides.cryptowat.ch/connect-exchange-accountsHow about zenbot? It doesn't have a graphical interface like other software above it's a pure command-line interface but it's free.Thanks mate, I will check this out",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "September 11, 2022, 11:45:30 AM",
      "body": "Have you seen Coinigy or TrailingCrypto? Both trading terminals support most popular crypto exchanges as well as a wide variety of order types.https://www.coinigy.com/features/https://www.trailingcrypto.com/They are not free, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}