{
  "id": "topic_5458206",
  "title": "fred21",
  "author": "fred21",
  "created_time": "July 01, 2023, 09:33:42 AM",
  "content": "Hello,I would like to know if Ian Coleman mnemonic is still updated and safe to generate BTC address and key.Also, are there alternative to this browser based solution?My main goal is to generate BTC address on my own with javascript on a browser only without being connected tto the internet?Thanks for your help",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458206",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "July 01, 2023, 09:41:22 AMLast edit: July 01, 2023, 09:55:19 AM by OmegaStarScream",
      "body": "Yes, it should be safe. As for the alternative then you can use Bitaddress (you can generate multiple addresses/PKs but not a seedphrase). Both sites are open source[1][2] so you can easily download and run them locally offline.[1] https://github.com/pointbiz/bitaddress.org[2] https://iancoleman.io/bip39/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 01, 2023, 09:48:19 AM",
      "body": "Quote from: fred21 on July 01, 2023, 09:33:42 AMMy main goal is to generate BTC address on my own with javascript on a browser only without being connected tto the internet?I recommend you to avoid any tool that generates the keys through javascript. click here and read gmaxwell's explanation on why it's not a good idea to use javascript for generating keys. And it may worth mentioning that if by \"without being connected to the internet\", you mean just disconnecting internet when generating the keys, that's not enough. You should use an airgapped device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 01, 2023, 09:50:17 AM",
      "body": "It would be safe to generate mnemonic seed from iancoleman tool if you run it offline.Make sure you never connect this device to the internet to make sure the seed you generated from the tool is safe.I don't heard any alternative yet on iancoleman why not generate your seed into Electrum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fred21",
      "created_time": "July 01, 2023, 10:16:00 AM",
      "body": "I would rather download Ian Coleman mnemonic on github https://github.com/iancoleman/bip39I use tail OS with no internet connection to generate my address. Ian Coleman mnemonic is applying the same protocol to generate 24 words phrases and the resulting addresses as any other code. So what is the issue?Also what would you recommend to generate BTC private Keys for cold storage? I don't trust hardware wallet.About Electrum : Do you know if I can use it in tail OS and if it can be used like Ian Coleman to generate keys and mnemonic phrase only.thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 01, 2023, 10:50:52 AM",
      "body": "Quote from: fred21 on July 01, 2023, 09:33:42 AMMy main goal is to generate BTC address on my own with javascript on a browser only without being connected tto the internet?Do not use a browser to generate the seed phrase. Use text editor on an airgapped device. Quote from: fred21 on July 01, 2023, 10:16:00 AMAbout Electrum : Do you know if I can use it in tail OS and if it can be used like Ian Coleman to generate keys and mnemonic phrase only.These are the OS that you can use with Electrum: https://electrum.org/#downloadYou can run Electrum on airgapped device too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2023, 11:13:28 AM",
      "body": "Quote from: fred21 on July 01, 2023, 10:16:00 AMSo what is the issue?The issue is it uses Javascript.Did you read the post hosseinimr93 linked to above? The bottom line is using Javascript is insecure and does not guarantee your safety. If you are going to all the hassle of using a live OS to set up genuine cold storage, then why would you want to use insecure code to generate your seed phrase?Quote from: fred21 on July 01, 2023, 10:16:00 AMAlso what would you recommend to generate BTC private Keys for cold storage? I don't trust hardware wallet.Use good quality, reputable, open source wallet software such as Core, Electrum, or Sparrow. Review the code yourself if you have the ability to do so. Verify all downloads (this includes your downloads of Tails).Quote from: fred21 on July 01, 2023, 10:16:00 AMAbout Electrum : Do you know if I can use it in tail OS and if it can be used like Ian Coleman to generate keys and mnemonic phrase only.Yes. Tails comes with Electrum already installed, so this is very easy to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fred21",
      "created_time": "July 01, 2023, 02:12:52 PM",
      "body": "Let's dive into JS generating seed phrase.First, I could myself generate a seed phrase without anything. I just pick 24 words from the list given in the BIP 39 protocol.So if Ian colman give me a list of 24 words randomly in the same list what can be wrong? It is just picking word at random.The risk maybe is the code being change to give me a list of 24 word already known by somebody. But this is hacking not JS related.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2023, 03:05:39 PM",
      "body": "Quote from: fred21 on July 01, 2023, 02:12:52 PMFirst, I could myself generate a seed phrase without anything. I just pick 24 words from the list given in the BIP 39 protocol.So if Ian colman give me a list of 24 words randomly in the same list what can be wrong? It is just picking word at random.Picking random words yourself from the word list is widely recognized as highly insecure and one of the worst possible ways to generate a seed phrase. This is also absolutely not what Ian Coleman's software is doing. What Ian Coleman is actually doing is generating a pseudo-random number via crypto.getRandomValues and then encoding that in to a seed phrase. Your browser is simply not a very good source of entropy for this process. Compare this to Bitcoin Core, for example:Quote from: o_e_l_e_o on January 14, 2023, 01:41:25 PMMost good wallets will be based on entropy directly from the OS and the computer's hardware. Bitcoin Core, as an example, draws entropy from /dev/urandom (which is from the OS, or the equivalent on non-Linux systems), RDSEED/RDRAND (which is from the processor), and a whole host of data from the computer itself, such as current resource usage, timestamps, kernel parameters, network data, version data, etc. All of this is then combined through a variety of techniques such as XORs and hashes, so if one source of entropy is weak or compromised then your final result should still be secure.It is fine to not fully understand the process behind seed phrase generation or the risks which need to be considered and mitigated against. Most people don't. But you should at least try to realize this and stick to the tried, tested, and recommended methods instead.If you are dead set on using a webpage to generate your seed phrase then ultimately, we can't stop you. But you are taking on unnecessary risk by doing so, especially when there are much safer alternatives available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fred21",
      "created_time": "July 01, 2023, 03:37:51 PM",
      "body": "It encodes this number generated into a seed phrase. whether it is done via JS or bitcoin Core, the resulting seed phrase has an equal chance to be guessed by someone trying every combination of words.The entropy doesn't change the chance of guessing one seed phrase compare to another.Are there 24 words combination from words listed in BIP 39 protocol easier to guess than other? If you pick at random those 24 words, you have the same probability to get each of those combination.   As there are 2048 words, total number of combination is 2048x2047x2046x...x2025x2024. So when you pick one combination, you have one chance out of 2048x2047x2046x...x2025x2024 to get one specific combination independently from how it was generated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 01, 2023, 03:52:49 PM",
      "body": "Quote from: fred21 on July 01, 2023, 03:37:51 PMAre there 24 words combination from words listed in BIP 39 protocol easier to guess than other?A 24 word BIP39 seed phrase provides 256 bits of entropy while a 12 word BIP39 seed phrase provides 128 bits of entropy. Therefore, the probability of brute-forcing a 24 word seed phrase is smaller. Of course, a 12 word seed phrase is enough and again, take note that human is not a good source of entropy. Quote from: fred21 on July 01, 2023, 03:37:51 PMAs there are 2048 words, total number of combination is 2048x2047x2046x...x2025x2024. There are 204823 * 8 or 2256 combinations. Take note that words can be repeated and the last 8 bits are checksum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2023, 04:02:38 PM",
      "body": "Quote from: fred21 on July 01, 2023, 03:37:51 PMThe entropy doesn't change the chance of guessing one seed phrase compare to another.Yes, it absolutely does. If I have 256 bits of random entropy sourced from /dev/urandom, and you have 256 bits of entropy sourced from your browser fingerprint, then your seed phrase is exponentially weaker than mine and exponentially more likely to be broken.Quote from: fred21 on July 01, 2023, 03:37:51 PMAre there 24 words combination from words listed in BIP 39 protocol easier to guess than other?Yes. It all depends on the entropy used to generate those words in the first place.Quote from: fred21 on July 01, 2023, 03:37:51 PMAs there are 2048 words, total number of combination is 2048x2047x2046x...x2025x2024.There is nothing preventing repeat words, and the last words contains a checksum, so as above there are 2256 combinations, not what you have written.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fred21",
      "created_time": "July 01, 2023, 04:14:09 PM",
      "body": "If there are a total of 2256 combinations. one combination of 24 words has the same chance of being picked than another combination of 24 words. This probability is 1 out of 2256 whether how it was generated if each word was picked randomly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 01, 2023, 06:00:03 PM",
      "body": "Quote from: fred21 on July 01, 2023, 04:14:09 PMThis probability is 1 out of 2256 whether how it was generated if each word was picked randomly. If the words have been picked truly randomly, right. The point here is that if the words are chosen by human brain, then they are not random. The correct way to generate a seed phrase is to generate a random entropy using a trustworthy software and then convert that to a seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "July 01, 2023, 06:17:24 PM",
      "body": "Quote from: fred21 on July 01, 2023, 04:14:09 PMIf there are a total of 2256 combinations. one combination of 24 words has the same chance of being picked than another combination of 24 words. This probability is 1 out of 2256 whether how it was generated if each word was picked randomly. Assuming that we are 10 billion people on this planet, we all decided to use Bitcoin and each of us had on average about 2000 wallets (which is a very large number), the sum of what we will get is 2.0e13 which is very far even if the wallet contains 12 words.The problem lies if these words were not randomly chosen, and then the human brain gets used to choosing similar things and with the possibility of repeating more than one word, we will find that this possibility has become very weak, especially if social engineering is used to determine the words that you may use a lot, and therefore you will choose them to be seeds.it is better to assume that any wallet that you did not generate or generated using your brain, or that is not randomly generated well is a hacked wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2023, 06:45:11 PM",
      "body": "Quote from: fred21 on July 01, 2023, 04:14:09 PMif each word was picked randomly.Again, the words aren't picked. Entropy is used to generate a random number, and that random number is encoded as a seed phrase.If the random number is generated in a cryptographically secure way, then yes, the probability is the same. The point I am making is that I don't believe the Javascript function crypto.getRandomValues within a browser environment (as is the case with Ian Coleman) will generate truly cryptographically secure numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fred21",
      "created_time": "July 01, 2023, 08:39:42 PM",
      "body": "I don't see why the number generated would be more likely to be cracked when the seed phrase has the same chance of being guessed.Also when you use your seed phrase in the ian Coleman JS interface, the interface generate always the same addresses with the related private keys in the same order because this is deterministic. This is doing the same job as any other interface using the same protocol with the same seed phrase.If I put the seed phrase in any other wallet, it will generate the exact same addresses in the same order with the same private keys. So on this side there is no difference between JS and the other software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2023, 08:56:49 PM",
      "body": "Quote from: fred21 on July 01, 2023, 08:39:42 PMI don't see why the number generated would be more likely to be cracked when the seed phrase has the same chance of being guessed.Because the number is being generated by different processes using different entropy sources. If your entropy source is poor, then your number won't be completely random.Quote from: fred21 on July 01, 2023, 08:39:42 PMIf I put the seed phrase in any other wallet, it will generate the exact same addresses in the same order with the same private keys.This is a completely separate (and completely trivial) function to generating the seed phrase in the first place.I don't understand why you are arguing about this, especially when it is clear you do not understand the basics. Javascript key generators are insecure. There are plenty of easy to use alternatives already suggested. Electrum, for example, is already bundled with Tails, so is trivial to use since you are planning to use Tails anyway. As I said above, you seem very keen to use an insecure javascript generator and there is nothing we can do to stop you, other than warn you of the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "July 01, 2023, 09:56:11 PMLast edit: July 01, 2023, 10:10:50 PM by apogio",
      "body": "Quote from: fred21 on July 01, 2023, 02:12:52 PMLet's dive into JS generating seed phrase.First, I could myself generate a seed phrase without anything. I just pick 24 words from the list given in the BIP 39 protocol.So if Ian colman give me a list of 24 words randomly in the same list what can be wrong? It is just picking word at random.The risk maybe is the code being change to give me a list of 24 word already known by somebody. But this is hacking not JS related.To be exact, you would need to guess 23 words and then calculate the 24th, as it is the checksum of the 23 previous words.Nevertheless, please don't.On this planet, NOTHING is totally random.In fact, scientists claim that the only thing that could be random is the age at which the center of atoms explode. (that's pure physics and it is not yet fully proven).Our minds are absolutely not capable of defining randomness. And of course we are unable to choose 23 words from a list of 2048 in a secure random way.If you don't want to accept that you can use a wallet such as electrum to generate the words, then you could flip a coin 256 times to generate your entropy. You can refer to this manual https://youtu.be/LxTkLwpV1PoHowever, if you flip a coin 256 times, there will definitely be similarities in the manner that you flip it. So again, not totally random. I can assure you that if we had the appropriate tools to calculate all the forces that apply to the coin, we could predict the outcome. The same applies to roulette and all those \"random\" systems. We just don't have the tools to predict the outcome. I may sound boring and annoying, but the summary is:  Randomness (entropy source) is the most important thing when generating a wallet. Be absolutely careful. Do it correctly once and don't worry ever again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "July 01, 2023, 10:02:26 PM",
      "body": "If you're concerned about the difference between Electrum seed phrases and Bip39 seed phrases, you can use another wallet to generate your seed.  Sparrow, for example can be used to create a secure Bip39 seed phrase, and unlike Ian's tool, it uses the cpu's processing power to create entropy.If you insist on using the Ian Coleman tool, use the advanced feature to enter your own entropy.  Here's a code that can be used to create a 256 bit HEX string that can be used to enter your own entropy.Code:cat /dev/urandom | tr -dc 'A-F0-9'  | fold -w 256 | head -n 1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}