{
  "id": "topic_5448812",
  "title": "Spaceman1000$",
  "author": "Spaceman1000$",
  "created_time": "April 14, 2023, 10:51:14 AM",
  "content": "It has been widely reported that the wife of the Moroccan player filed for divorce from her husband and requested that the assets of her husband be divided equally(50/50). The PSG player Achraf Hakimi, is one of the highest earners in European football and as such, it is believed that, his is a multi millionaire.so having her husband properties being splitted into half will make her earn so much money for herself. So unknown to Hakimi's wife Hiba Abouk, the Spanish actress, her husband Achraf hakimi has all his properties all in his mother's name Sadia Mouth as revealed by the court.At this point, it dawned on Hiba About that she made the wrong move, as things didn't go the way she expected, but the divorce appeal still went on. So my question is, will these be a new normal for footballers, Because even Cristiano Ronaldo is said not to have yet gotten married to his girlfriend that has given birth to 4 children.https://www.correctng.com/psg-star-achraf-hakimis-wife-fails-to-get-divorce-payout-because-he-put-assets-in-mothers-name/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448812",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "April 14, 2023, 10:10:48 PM",
      "body": "I saw what he did & it’s quite disloyal & a bit sneaky but I understand his motives. This isn’t the first & won’t be the last time a rich dude does something like this to protect his wealth. What happens if his Mother is disloyal though & gets a taste of the big money which leads to her screwing him over? Once it’s in writing it’s her momey even though clearly, it’s not.There is a reason prenuptial agreements exist, I find it all really sad though. The world would he a better place if everybody was more honest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "April 14, 2023, 10:59:52 PM",
      "body": "Achraf Hakimi's move was really wise, and he is being praised for it all around the world. People feel that some ladies do not marry just to find a live companion, but it is now considered as a business to make money in European countries due to the regulation set aside when they are divorced. The only thing I don't agree with is Hakimi not being completely honest with his wife, even though it served him well. I'm not a supporter of the law that requires divorced married couples to share property. The man is always the one who suffers the most and bears the brunt of the loss. Unlike the Arab countries and African continent, this rule is not applicable there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "April 15, 2023, 07:59:22 AM",
      "body": "Hakim's wife Hiba is not too worried about the wealth since it happens like this. She's not a poor woman that depends on her husband's wealth. She's one of the richest actress in Spain. But divorce demands wealth be shared. So it's normal in the court of law. But true be told, Hakim decision to register All he's wealth in his mum's name is the best decision in this modern world where women has lost value and respect for men.  In all we do let's add little wisdom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "April 15, 2023, 11:41:58 AM",
      "body": "Quote from: Lordhermes on April 15, 2023, 07:59:22 AMHakim's wife Hiba is not too worried about the wealth since it happens like this. She's not a poor woman that depends on her husband's wealth. She's one of the richest actress in Spain. But divorce demands wealth be shared. So it's normal in the court of law. But true be told, Hakim decision to register All he's wealth in his mum's name is the best decision in this modern world where women has lost value and respect for men.  In all we do let's add little wisdom.Judging from what you said about Hiba not being a poor woman, is it then possible for her own part of the wealth to be shared? Or the law doesn't permit women's wealth to be shared after divorce?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 15, 2023, 06:24:13 PM",
      "body": "Quote from: Spaceman1000$ on April 14, 2023, 10:51:14 AMSo unknown to Hakimi's wife Hiba Abouk, the Spanish actress, her husband Achraf hakimi has all his properties all in his mother's name Sadia Mouth as revealed by the court.At this point, it dawned on Hiba About that she made the wrong move, as things didn't go the way she expected, but the divorce appeal still went on.If she really can no longer be in the marriage, she should be able to leave with what she has since her husband has nothing. Hakimi must have known that this was possible in the future and decided to seek the best way to protect his wealth. At this point, even if she decides to stay, if I was Hakimi, I will offer to pay her some settlement and then end the union. Many people and not just soccer players have learnt from Emmanuel Eboué case where his wife took all he had without pity or some sort of consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "April 16, 2023, 06:17:04 AM",
      "body": "Quote from: Spaceman1000$ on April 15, 2023, 11:41:58 AMQuote from: Lordhermes on April 15, 2023, 07:59:22 AMHakim's wife Hiba is not too worried about the wealth since it happens like this. She's not a poor woman that depends on her husband's wealth. She's one of the richest actress in Spain. But divorce demands wealth be shared. So it's normal in the court of law. But true be told, Hakim decision to register All he's wealth in his mum's name is the best decision in this modern world where women has lost value and respect for men.  In all we do let's add little wisdom.Judging from what you said about Hiba not being a poor woman, is it then possible for her own part of the wealth to be shared? Or the law doesn't permit women's wealth to be shared after divorce?It might not be true that Hakim's wife intends to take part in her husband's wealth. Many things might have led to this misunderstanding it could be due to some irreconcilable difference. Even the richest men of our time still want more money. Hiba might be rich but she wants more. So she didn't expect her husband to buy all his belongings through his mother. If she had known she might have reconsidered her actions and prepared more for the divorce. Hakim has observed that he could trust his mother more than his wife which was why he acted that way. There are mothers that you can trust but there are also wives you can trust. The summary of why he did this was that he trusted his mother more than his wife.I can never do what he did. My wife and I own everything we have and I can entrust everything to her because I know she will never abandon the children. The children are the reason why we work so hard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "April 18, 2023, 05:02:16 AM",
      "body": "Quote from: DeathAngel on April 14, 2023, 10:10:48 PMI saw what he did & it’s quite disloyal & a bit sneaky but I understand his motives. This isn’t the first & won’t be the last time a rich dude does something like this to protect his wealth. What happens if his Mother is disloyal though & gets a taste of the big money which leads to her screwing him over? Once it’s in writing it’s her momey even though clearly, it’s not.There is a reason prenuptial agreements exist, I find it all really sad though. The world would he a better place if everybody was more honest   disloyal but I think it paid off for him, imagine if he hasn't made that move, he'll have lost half of his property to a woman who doesn't want to fix her home...I find those who have a problem with Hakimi's decision funny, I think if his mum wasn't trustworthy enough, he wouldn't purchase everything in her name.Only him had seen and knows the moves the wife had made at home that made him doubt her.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "April 18, 2023, 07:45:47 AM",
      "body": "This is the irony of super-rich people. It seems that money is valued more than relationships and family. This issue occurs in many occupations as well and not only for footballers, celebrities are one of them.Ideally, marriage is built on trust so prenup shouldn't be an option. However, at a young age, when I'm thinking of marriage after I've become successful, a prenup is something I learn/research a lot about. But in reality, I married my wife when we were both poor, lul.The lesson learned is, marriage is often a political union when both parties have the same power/wealth. Therefore in the case of separation, no one will fight over money since they are both equal. Ronaldo and other super-rich individuals are basically present-day kings, so the exclusive relationship rule basically doesn't apply to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 18, 2023, 11:28:17 AM",
      "body": "Quote from: DeathAngel on April 14, 2023, 10:10:48 PMThere is a reason prenuptial agreements exist, I find it all really sad though. The world would he a better place if everybody was more honest  This is true, these prenuptial agreements have been more popular with hardworking people and mostly with the celebrities that we know of before they tie the knot with their partners. IMHO, it looks like Hakimi's move is being praised but if we're going to think on the brighter side, he should have thought of his kids rather than this. It's understandable that he's trying to protect his wealth and don't want to give it to her ex-wife and benefit from it but then, it's sad that he had moved it all before Hiba knew it. Well, if it's all about wealth and money, distrust and disloyalty comes out in so many forms even if both of your soul have lived together. Still, Hiba has her fortune that she worked hard from her own career.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 18, 2023, 09:12:48 PM",
      "body": "Well... it's something one can actually learn from, not just footballer or sportsmen but anyone that's super rich and is in a relationship where he doesn't trust his spouse. Imagine if not for his smartness he would have lost half of his wealth to a woman and a marriage of 3 years old. Emmanuel Ebue, after his football career his life became a sad one. The wife tricked him to be signing documents which he didn't care to ask and some of the big paychecks he earned while playing for Galatasaray were paid into the wife's account and at some point the marriage didn't work out, he lost his wealth, and he has gone bankruptcy. So, I don't see anything wrong with what Hakimi did and if super rich guys wants to follow his footsteps, it's a good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 18, 2023, 10:03:08 PM",
      "body": "Quote from: Alisha-k on April 18, 2023, 05:02:16 AMI think if his mum wasn't trustworthy enough, he wouldn't purchase everything in her name.Not all mothers are the same, Hakimi's mother is trustworthy like you have said and that is why he could do such. Some mother's are not as trustworthy as others, that is why everybody cannot follow this the same way Hakimi has gone. For some people they cannot put things in their mother's name or any other person's name but theirs. Know and understand the character of anyone before you decide to want to give spending the rest of your life together with them a chance. Marriage should not be for exploitation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "April 19, 2023, 12:30:44 AM",
      "body": "Their story's been broadcast internationally & it's talked about in the Arab world persistently. He 19 she 31 when they dated. He 24 she 36 when they're divorced. I've pity for their two kids.Quote from: Spaceman1000$ on April 14, 2023, 10:51:14 AMIt has been widely reported that the wife of the Moroccan player filed for divorce from her husband and requested that the assets of her husband be divided equally(50/50). The PSG player Achraf Hakimi, is one of the highest earners in European football and as such, it is believed that, his is a multi millionaire.so having her husband properties being splitted into half will make her earn so much money for herself. So unknown to Hakimi's wife Hiba Abouk, the Spanish actress, her husband Achraf hakimi has all his properties all in his mother's name Sadia Mouth as revealed by the court.At this point, it dawned on Hiba About that she made the wrong move, as things didn't go the way she expected, but the divorce appeal still went on. So my question is, will these be a new normal for footballers, Because even Cristiano Ronaldo is said not to have yet gotten married to his girlfriend that has given birth to 4 children.https://www.correctng.com/psg-star-achraf-hakimis-wife-fails-to-get-divorce-payout-because-he-put-assets-in-mothers-name/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "April 22, 2023, 08:24:04 AM",
      "body": "Frankly speaking this whole saga about Hakimi and his wife or should I say ex-wife is just funny, very laughable. Sometimes all these women they're not really getting married because they love the guy but because of their money, some women ain't satisfied with what they have.In this case and some other related cases I think women such as Hiba Abouk, they get married to rich men especially footballers and pretend to be happy, acting as if they came to stay but their major aim is the money. How I wish other footballers would learn from this funny story. Money is not everything in life.Thumbs up to Hakimi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "April 30, 2023, 10:57:39 AM",
      "body": "How's it thumbs up to Hakimi if he's facing rape allegations? If his wife married him for money it's a separation from his way of acting in private life.Quote from: Sexylizzy2813 on April 22, 2023, 08:24:04 AMFrankly speaking this whole saga about Hakimi and his wife or should I say ex-wife is just funny, very laughable. Sometimes all these women they're not really getting married because they love the guy but because of their money, some women ain't satisfied with what they have.In this case and some other related cases I think women such as Hiba Abouk, they get married to rich men especially footballers and pretend to be happy, acting as if they came to stay but their major aim is the money. How I wish other footballers would learn from this funny story. Money is not everything in life.Thumbs up to Hakimi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "April 30, 2023, 04:25:11 PM",
      "body": "I really doubt it, because I believe that the secret or tactics is now out in the open. Therefore people have learnt it and won't fall for that kind of trick, if I may call it that. I believe that henceforth people who are about to marry footballers or other celebrities will somehow want to know about their spouse to be financial records. To know it it will be suitable for them, in the event divorce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "April 30, 2023, 04:41:46 PM",
      "body": "Since his parents were the main factor in his success, Hakim made a wise choice in putting all of his assets in his mother's name, as he explained. Given that so many women have turned to divorce as a source of financial security, Hakimi made a smart decision, and people now respect him for it.Because women today are more interested in the wealth of the men than in their own and their children's futures, many people will learn about and adopt this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "May 01, 2023, 10:27:05 AM",
      "body": "To an extent,but it's totally wrong to put all your wealth in your parents name when you have a family. Excerpt you don't trust the partner. If anything happens to you and you die, then your parents and your wife are not in good terms. Your wife will be denied everything and she will suffer with your children. We have to be rational about a thread, we must also look the both side of the story before adopting it as a norms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 04, 2023, 09:16:11 PM",
      "body": "Quote from: Alisha-k on April 18, 2023, 05:02:16 AMQuote from: DeathAngel on April 14, 2023, 10:10:48 PMI saw what he did & it’s quite disloyal & a bit sneaky but I understand his motives. This isn’t the first & won’t be the last time a rich dude does something like this to protect his wealth. What happens if his Mother is disloyal though & gets a taste of the big money which leads to her screwing him over? Once it’s in writing it’s her momey even though clearly, it’s not.There is a reason prenuptial agreements exist, I find it all really sad though. The world would he a better place if everybody was more honest   disloyal but I think it paid off for him, imagine if he hasn't made that move, he'll have lost half of his property to a woman who doesn't want to fix her home...I find those who have a problem with Hakimi's decision funny, I think if his mum wasn't trustworthy enough, he wouldn't purchase everything in her name.Only him had seen and knows the moves the wife had made at home that made him doubt her.What was the reason for the divorce though. Did he cheat, did he just have enough of her & want to trade her in for somebody else?When you take your marriage vows you promise ‘what’s mine is yours’.I think he could left her with something at least. He stripped her bare & left her nothing. You do not treat a woman you once loved like that if you are a good man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mm2543363580",
      "created_time": "May 06, 2023, 10:30:44 AM",
      "body": "His move is totally sensible and he's far sighted as he has seen that before that many girls will come in his life for money ad football players are good earners too. May be his love for his mother is the reason as she is the one who made him this famous (family comes first) and he owes his success to his mother .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}