{
  "id": "topic_5511219",
  "title": "stadus",
  "author": "stadus",
  "created_time": "September 30, 2024, 04:08:26 AM",
  "content": "It’s been a while since we’ve seen a significant pump in the Bitcoin market, unlike in the past when pump-and-dump trends were common. If I recall correctly, any news involving government approval would cause a pump in price, while negative news, like China’s Bitcoin ban in the past, would trigger a dump, but these effects were usually temporary.Recently, I’ve noticed something different, like with the ETF example. Before it was approved, traders and investors were highly optimistic that once it got the green light, Bitcoin would \"go to the moon.\" The application process for a Bitcoin ETF started back in 2013, /with many applications eventually approved , but this recent one is the biggest.When BlackRock announced their application for a spot Bitcoin ETF on June 15, 2023, it pumped Bitcoin’s price, and then there was another surge from the false report of approval.So, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5511219",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "September 30, 2024, 04:34:51 AM",
      "body": "Algos/traders are getting smarter. They position themselves way before the event takes place and that’s why their trades look out of order. AI is a big help too. I’m wonder sometimes though, if every trader uses AI powered algos, everyone will be making the same trades. Since nobody will get trapped on the wrong side of the trade, what will happen in this scenario? The price of that asset will either go to infinity or to zero. Interesting times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 30, 2024, 04:46:35 AM",
      "body": "Quote from: mindrust on September 30, 2024, 04:34:51 AMAlgos/traders are getting smarter. They position themselves way before the event takes place and that’s why their trades look out of order.Most of traders can not change themselves and continue to be loses with time. Very few traders can learn from the market, own losses and change themselves to become successful and profitable traders.In this market, with each new bull market, there are a lot of noise on media and massive new participants will join this market, they will need time to learn the lesson \"Buy the rumors, sell the news\".\"Buy the rumor, sell the news\". Meme or actual strategy?See the chart of \"How Buy the Rumor, Sell the News looks like\", that is insightful on how this strategy works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "September 30, 2024, 05:12:37 AM",
      "body": "Quote from: stadus on September 30, 2024, 04:08:26 AMSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....That has been happening, bitcoin is gradually becoming more stable over time and we can easily see that through its yearly growth chart. Bitcoin's returns have been decreasing over time and it wouldn't be surprising if Bitcoin one day becomes as stable and less volatile as gold. But in return, that would make bitcoin safer like gold is today.The more mature Bitcoin becomes, the less volatile it becomes, and that makes it less attractive to speculators looking to get rich quickly. But it will become the preferred choice of those looking for a store of value, a safe haven, or it could be legalized and recognized as a global means of payment like the original purpose for which Satoshi created it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "September 30, 2024, 05:13:02 AM",
      "body": "Quote from: stadus on September 30, 2024, 04:08:26 AMSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....The technical candle has been confirmed to remain the same and has been agreed by many people, but it may not necessarily make you profit in that time. But Fundamental news is not always accurate and historical history is not always repeated. This can be proof that fundamental and technical news is not always profitable. We will depend on the whale on certain conditions, the pump and dump scheme is also greatly affected by these conditions. When a large institution enters, Whale's job will be even harder. They find it increasingly difficult to withstand the upward or downward movement of the market. So maybe it has a little bit of an effect, but I think the market will continue to have that scheme, only time will probably tell.  IMO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 30, 2024, 05:39:27 AM",
      "body": "Quote from: stadus on September 30, 2024, 04:08:26 AMbut this recent one is the biggest.Why that one is the biggest? it just an options trading, it's an another \"ETFs\" thing that being approved by SEC. Not all positive news and bad news affect Bitcoin price because most people only pay attention with the \"new\" and \"popular\" thing. Like El Salvador accept Bitcoin as legal tender, it make Bitcoin price rise, but when Central African Republic accept Bitcoin as legal tender, it doesn't make Bitcoin price rise.FOMC meeting do affect Bitcoin price, so pay attention with every FOMC meeting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "September 30, 2024, 05:46:44 AM",
      "body": "Quote from: Solosanz on September 30, 2024, 05:39:27 AMQuote from: stadus on September 30, 2024, 04:08:26 AMbut this recent one is the biggest.Why that one is the biggest? it just an options trading, it's an another \"ETFs\" thing that being approved by SEC. It's hard to say which one is the biggest, and if we want to compare, we have to do many things for a reasonable comparison.Price impacts of news in comparison.Other factors, events that happened during a same period of the main news.The first part is easy to do, collect prices and compare them, but the second part is more complicated, with many things we can include and also many things that can be important, but we can miss.I recall that in a previous market cycle, news like \"Bitcoin legal tender\" and \"Bitcoin beach/ city\" in El Salvador, Elon Musk invested in Bitcoin, Tesla accept Bitcoin as a payment method, made more price impacts than Bitcoin Spot ETFs in late 2023 (rumor) and actual approvals in January 2024.Additionally we have to consider that with bigger market cap of Bitcoin, price impacts from any big news will become smaller than in earlier market cycles with smaller market cap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "September 30, 2024, 06:19:17 AM",
      "body": "QuoteSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....If the Bitcoin/crypto market becomes \"boring\", most investors would run away. Price volatility is what makes the market interesting to the investors. The pump-and-dump nature of the crypto market will never go away. Market liquidity is constantly going in and getting out, which pumps the prices up or crashes them down. The army of BTC \"HODLers\" won't let the price collapse to extreme levels and the new money, that would enter the BTC market would trigger another FOMO phase.The \"buy the rumor, sell the news\" method would never go away from any financial market(it doesn't matter if it's stocks, FOREX or crypto).There was massive hype around the Blackrock Bitcoin ETF and the 2024 Bitcoin halving, which caused the BTC price to hit 73K USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "September 30, 2024, 06:53:14 AM",
      "body": "With the current momentum in the price of bitcoin, I think that the other holders are already feeling the gradual rise in its price in the market. Although it's okay for it to drop as long as it doesn't go below 61k$, because if it goes down there again, we still see bitcoin as weak there.It's different because we ourselves do technical analysis; we know if the momentum will be positive in the movement that bitcoin is doing, and not every time we hear news that that's what will actually happen to the price value. nor bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 30, 2024, 08:08:00 AM",
      "body": "I agree that those events that you have mentioned actually made the price of Bitcoin to spike or plunge depending if it was a positive or negative news. Since those previous event, is there any recent positive events that has occurred and didn't make the price of Bitcoin to surge high? The price of Bitcoin was just around $58k for more than 3 weeks but just after the announcement of more acquisition of Bitcoin by micro strategy was made and the other event where Trump paid for burger with Bitcoin, the price of Bitcoin reached $65k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 30, 2024, 08:44:18 AM",
      "body": "The market seems to be maturing now, particularly with the involvement of institutional investors like BlackRock. Their interest signifies a growing acceptance of Bitcoin as a legitimate asset class, and I think this is part of why we’re seeing less extreme volatility than before. Institutional investors tend to bring a more measured, long-term approach compared to retail traders, who often react emotionally to news.As adoption grows and the market matures further, I do believe we’ll see less of the wild pump-and-dump behavior that was common in Bitcoin’s earlier days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "September 30, 2024, 10:54:57 AM",
      "body": "It’s true that the market seems less chaotic compared to the wild pump-and-dump days, but saying Bitcoin is now “stable” might be pushing it. Recent Bitcoin ETF inflows, especially BlackRock’s spot ETF, saw $184 million pumped into the market just last month, so there’s still volatility, but more institutional players are now driving it. While that brings some maturity, Bitcoin’s price swings are still significant, though less extreme than before. So, “boring”? Maybe not, but more controlled compared to past years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 30, 2024, 11:11:12 AM",
      "body": "Quote from: davis196 on September 30, 2024, 06:19:17 AMIf the Bitcoin/crypto market becomes \"boring\", most investors would run away. Price volatility is what makes the market interesting to the investors.They will stay as there are many investors, traders in stock market or gold market with lower volatility. Lower volatility will make Bitcoin less attractive than previous years but it is natural because times for x100, x1000 or higher with Bitcoin investment is long gone but if investors can hold their bitcoin a long time, they will get very good profit, better than gold or stocks.It's because Bitcoin total supply is 21 millions, not more, and many bitcoins were considered to be lost. We don't know exact number of lost bitcoins but many bitcoins were lost by many people, it reduces circulating supply to less than 21 millions.Bitcoin inflation rate now is 1.7%.https://charts.woobull.com/bitcoin-inflation/QuoteThe pump-and-dump nature of the crypto market will never go away.Cryptocurrencies (altcoins) are pump and dump coins, Bitcoin is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "September 30, 2024, 11:44:57 AM",
      "body": "Quote from: stadus on September 30, 2024, 04:08:26 AMSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....I think the approval application of the Etf was submitted and same time there's been numerous of investors buying huge amounts of bitcoin including the institutional investors which has begot the enticement of the current market rate unlike some sentimental experiences we've had recently. The blackrock is a promising increase for mini investors as a case of the higher demands of investors stoning the market leading to had lead to the faded dump but if the approval is trashed, then we may experience stagnant values but less dump u like recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 30, 2024, 12:15:00 PM",
      "body": "Why \"Buy the Rumor, Sell the News\" is Fading in Bitcoin Trading? Maybe bitcoin now is too big the big bank the big companies heck even now a country involving in Bitcoin and the way like it used to not gonna work anymore but I saw bitcoin now had more relation with economy news just like the forex did. the bitcoin correlation same as gold sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 30, 2024, 12:28:30 PM",
      "body": "Perhaps it wasn't the best day to create this thread, when we look at the current price and what it was just one day ago. We were close to $66k last night and from there the price dropped down to $63k. I haven't been paying too close of attention to the reasons, but I have seen speculations that it's related to the speech of US Fed Chairman Jerome Powell on the economy and monetary policy and and FUD related to payout distribution of FTX funds. Bad news still knows how to catch Bitcoin off-guard unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "September 30, 2024, 12:34:17 PM",
      "body": "Quote from: Smack That Ace on September 30, 2024, 05:12:37 AMQuote from: stadus on September 30, 2024, 04:08:26 AMSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....That has been happening, bitcoin is gradually becoming more stable over time and we can easily see that through its yearly growth chart. Bitcoin's returns have been decreasing over time and it wouldn't be surprising if Bitcoin one day becomes as stable and less volatile as gold. But in return, that would make bitcoin safer like gold is today.The more mature Bitcoin becomes, the less volatile it becomes, and that makes it less attractive to speculators looking to get rich quickly. But it will become the preferred choice of those looking for a store of value, a safe haven, or it could be legalized and recognized as a global means of payment like the original purpose for which Satoshi created it.Less volatility means less thrill and excitement for us, because we all know that the only way to get rich faster is by means of high volatility. However, on the other hand, that will also lessen the worries and speculations most particularly for newbies as they’re most likely who are making noise in the market, while those early traders and investors are silently studying the market. But nevertheless, if adoption grows for bitcoin from big countries and institutions, surely the lessening of volatility will become unstoppable, which is actually where bitcoin is heading to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 30, 2024, 12:46:04 PM",
      "body": "Quote from: mirakal on September 30, 2024, 12:34:17 PMBut nevertheless, if adoption grows for bitcoin from big countries and institutions, surely the lessening of volatility will become unstoppable, which is actually where bitcoin is heading to. Volatility also depends on the hands owning the coins. Too much centralization within a few huge investment companies isn't good either. And that is also where we are heading to. ETFs buy more bitcoin in a given timeframe than was mined during that same period. If they and their investors started selling or changed their minds on bitcoin (for whatever reason), the bear market would be in full swing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "September 30, 2024, 01:21:27 PM",
      "body": "Quote from: davis196 on September 30, 2024, 06:19:17 AMQuoteSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....If the Bitcoin/crypto market becomes \"boring\", most investors would run away. Price volatility is what makes the market interesting to the investors. The pump-and-dump nature of the crypto market will never go away. Market liquidity is constantly going in and getting out, which pumps the prices up or crashes them down. The army of BTC \"HODLers\" won't let the price collapse to extreme levels and the new money, that would enter the BTC market would trigger another FOMO phase.The \"buy the rumor, sell the news\" method would never go away from any financial market(it doesn't matter if it's stocks, FOREX or crypto).There was massive hype around the Blackrock Bitcoin ETF and the 2024 Bitcoin halving, which caused the BTC price to hit 73K USD. I don't think the crypto market will be less volatile because we are still a free market and there is not too much regulation yet. But with bitcoin it could be different because bitcoin ETFs have been approved, large investment funds have joined and they are under the control of law enforcement agencies. But for bitcoin to become as stable as gold, that certainly hasn't happened yet and won't happen anytime soon, but we probably won't see bitcoin drop 70-80% in value like previous bear seasons. Volatility will definitely decrease significantly.“Buy the rumor, sell the news” still exists in the markets but things don’t always work that way, they are becoming more unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 30, 2024, 01:39:19 PM",
      "body": "Quote from: stadus on September 30, 2024, 04:08:26 AMSo, to cut the story short, are we heading towards a more stable Bitcoin price now that institutional investors are entering the market? And if that’s the case, will the market become \"boring,\" with less volatility as the pump-and-dump behavior fades? What are your thoughts on this?.....First of all, I don't quite see how the title relates to what you are asking, but in this respect, this was already said four years ago and look at the volatility we had. The logical thing is that as the market cap becomes bigger and big players enter the market that are going to hold basically as Michael Saylor does, the price will not fluctuate as much, but that will be at the cost of losing profitability as well.In any case I think it will be a slow process, I don't think we will see it stabilise at the S&P level in this same cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}