{
  "id": "topic_5431048",
  "title": "Sexylizzy2813",
  "author": "Sexylizzy2813",
  "created_time": "December 22, 2022, 09:28:41 PM",
  "content": "Pardon my lofty beliefs and assumptions but is it too much to think Brazil could be like El Salvador in terms of adopting Bitcoin as means of exchange? This thoughts were birthed out from this link  here  though. It's no news that Bitcoin is still bearish and still not out of the woods yet with prices fluctuating from $16k- 17k in the past two weeks; there's at least some positives in the clouds for the  digital coin. Brazil President, Jair Bolsonaro, has signed a bill which will be effective 180 days from today, the 22nd of December, recognizing the use of BTC as means of payment for trading purposes. This law would certainly encourage massive use and probably affect the price of BTC, hopefully. But with the Central Bank of Brazil (BCB) working to release it'd own digital coin, is Bitcoin being used as a sub to await the preparation of their CBDC or it would be given some important notice like El Salvador did?? https://bitcoinmagazine.com/legal/brazil-enacts-bitcoin-payments-bill",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431048",
  "comments": [
    {
      "author": "jackg",
      "created_time": "December 22, 2022, 11:40:02 PM",
      "body": "I think countries that have CBDCs will only see them well used if they incorporate them into international payment methods (and considering banks charge so much for converting between currencies, bitcoin and a few alts might be a good alternative for incorporating - particularly to allow large companies to hold other assets and transfer them eg internationally).CBDCs won't do well on their own against systems like contactless payments and they might just end up being sold to banks too (or - hopefully - payment processors who do charge less fees if they have to be sold off to someone).Bitcoin could already be used as a payment method in most places so the new law being passed in Brazil might be a gentle shove from a government member to put it in the news and get citizens to invest - especially at a time of a bear market. Bear markets are normally the times things can be built and tested without the strains of dealing with bull markets (such as higher fees and a greater chance they'll be attacked).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 23, 2022, 03:21:55 AM",
      "body": "Quote from: Sexylizzy2813 on December 22, 2022, 09:28:41 PM But with the Central Bank of Brazil (BCB) working to release it'd own digital coin, is Bitcoin being used as a sub to await the preparation of their CBDC or it would be given some important notice like El Salvador did?? https://bitcoinmagazine.com/legal/brazil-enacts-bitcoin-payments-billI don't see much difference between a country's CBDC and its local currency. Using CBDC is just like using the electronic version of the local currency. These CBDCs cannot compete favorably with Bitcoin because most people know that the advantages of using Bitcoin greatly outweigh the benefit of using these CBDCs. An example is the case of Nigeria where the government came up with the eNaira just to discourage its citizens from using Bitcoin. Instead of limiting the influence of Bitcoin, its awareness and adoption increased greatly and the government began to blame its mass adoption for the fall of the nation's currency. Decentralization, privacy, hedge against inflation, global acceptance, and international influence are some of the qualities that Bitcoin possesses that dwarfs other digital currencies. Brazil can introduce its CBDC but the fact is Bitcoin would still be number one in that country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 23, 2022, 03:50:37 AM",
      "body": "There's no relation between Bitcoin and Brazilian's CBDC, I think they want to see if Bitcoin is give benefit for them or not with the current bills passed. There's not high Bitcoin usage and volume in Brazil, so I doubt if it will affect Bitcoin price since it's just a tiny part.Don't forget Bitcoin isn't tax free on Brazil, so they need to pay tax to the government of every profit they made. It's a win-win situation for the Brazil government to get more tax payment and they can free to continue or stop make Bitcoin to be used as payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 23, 2022, 05:18:25 AM",
      "body": "I don't think Bitcoin will ever be a \"sub\" to any CBDC to be made out there imo. Bitcoin is and will always stay as it was, regardless of what laws are made or what other so-called \"competitors\" are made by centralized organizations. If there was, you'd have seen it already with just their fiat, cause let's be real, CBDC is really just the digital form of their fiat, nothing much has changed from that. Heck, I reckon most people would be more inclined to use Bitcoin instead of any CBDC (if only the two were compared) just because of the market and possible profits of hodling it in the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "December 23, 2022, 08:41:35 AM",
      "body": "It's natural for government bodies to always want control over  Bitcoin and I'm not in the least surprised that they want to set a sort of watchdog if the coin is considered as an investment purpose. Some naysayers have been quick to point out the disadvantages of the digital coin which is it's tendency to volatility but I think the main reason and fear is that usage of BTC will block any means of monitoring from them and they aren't okay with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 23, 2022, 03:37:37 PM",
      "body": "Quote from: Sexylizzy2813 on December 22, 2022, 09:28:41 PM Brazil President, Jair Bolsonaro, has signed a bill which will be effective 180 days from today, the 22nd of December, recognizing the use of BTC as means of payment for trading purposes. This law would certainly encourage massive use and probably affect the price of BTC, hopefully. But with the Central Bank of Brazil (BCB) working to release it'd own digital coin, is Bitcoin being used as a sub to await the preparation of their CBDC or it would be given some important notice like El Salvador did?? https://bitcoinmagazine.com/legal/brazil-enacts-bitcoin-payments-billI am from Brazil and I try to get all information possible about crypto I can confirm: there isn't much going on and this regulation is mostly about exchanges.Brazil is not going to do something like El Salvador, and this law is not about it.What is this law about?Kyc in exchangeMoney laundering Ponzi schemes New barriers for new exchanges to get license to operate.Nothing will change here in short term for bitcoin users and as payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 23, 2022, 04:39:02 PM",
      "body": "@bitmover, from everything we could read in maybe the last 2-3 weeks, we could conclude that a lot of people are completely confused with what is happening in Brazil. Even if Brazil did the same thing as El Salvador, I don't understand why people think that it would cause some kind of massive movement in the price of Bitcoin - because, like in ES, Bitcoin would only be an alternative to the existing currency.I guess that in a sea of bad news, everyone is desperately looking for some good news, so even though everyone would like something like that to happen, we still have to be realistic and accept reality - in the end, someone like you who lives in Brazil knows best what it's all about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 23, 2022, 05:09:29 PM",
      "body": "Quote from: Lucius on December 23, 2022, 04:39:02 PM@bitmover, from everything we could read in maybe the last 2-3 weeks, we could conclude that a lot of people are completely confused with what is happening in Brazil. Even if Brazil did the same thing as El Salvador, I don't understand why people think that it would cause some kind of massive movement in the price of Bitcoin - because, like in ES, Bitcoin would only be an alternative to the existing currency.I guess that in a sea of bad news, everyone is desperately looking for some good news, so even though everyone would like something like that to happen, we still have to be realistic and accept reality - in the end, someone like you who lives in Brazil knows best what it's all about.This law has nothing to do with El Salvador case.El Salvador is a very small country, with a restricted economy and a USD was their official fiat currency.We have a national fiat currency, our economy is a giant and Brazil is almost a continent. Brazil will not adopt bitcoin as a legal tender now.You can read the full law here using Google translate https://www.planalto.gov.br/ccivil_03/_ato2019-2022/2022/lei/L14478.htmThe target of this law were exchanges and altcoins  ponzi schemes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 23, 2022, 05:40:08 PM",
      "body": "Quote from: Lucius on December 23, 2022, 04:39:02 PMI guess that in a sea of bad news, everyone is desperately looking for some good news, so even though everyone would like something like that to happen, we still have to be realistic and accept reality - in the end, someone like you who lives in Brazil knows best what it's all about.In a very simple way:1. Defines that exchanges and other third-party providers will need authorization from the gov to work in Brazil. (art 2)2. Defines that these exchanges/providers will need to have transparency, consumer protection and data protection measures, etc... as established by the gov. (art 4)3. Defines which type of companies fit as crypto exchanges/providers (i.e enable the trade between crypto<>crypto<>fiat, custody of crypto assets, etc...). (art 5)4. Defines that one or more governmental entities will have the authority over these exchanges/providers. (art 6 and 7)5. Creates a law to punish fraud with crypto assets for up to 8 years. (art 10)6. Considers legal entities related to crypto as financial institutions according to the law. (art 11)7. Increases the penalty of money laundering by up to 2/3 times if done through crypto. (art 12)8. Defines that crypto exchanges/providers will keep a registry of all transactions over a certain value limit. (art 12)TLDR: if you want to open an exchange or crypto company, you will need to follow the laws + if you're going to commit fraud with crypto, you're going to be arrested.Nothing about Brazil buying crypto or making it widely acceptable everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "December 23, 2022, 09:28:06 PM",
      "body": "Whatever the intention of the Brazilian government on the implementation of Bitcoin as a mode of payment may have a connection to the CBDC, whatever it is, I think only those who proposed the law know (we can't read minds, do we?).  It is possible that the acceptance of Bitcoin as a mode of payment is one of the ways the government of Brazil wanted to test out digital payment methods.  They can also implement that to learn how the system works more closely and implement the good traits they found in their CBDC.  Hopefully, there is no corruption intended in creating such a project else, everything will be a waste. Because the suppose to be masses that will benefit from that plan will be diverted to corrupt officials getting the best of the approved law implementation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 24, 2022, 02:47:21 PM",
      "body": "Quote from: bitmover on December 23, 2022, 05:09:29 PMThis law has nothing to do with El Salvador case.---The target of this law were exchanges and altcoins  ponzi schemes It's been completely clear to me since the first thread appeared in the Bitcoin discussion, and after that at least 2 or 3 more in the same board and now here. I just wanted to say that people misinterpret things because they don't understand what's really going on.Quote from: TryNinja on December 23, 2022, 05:40:08 PM~snip~I support regulation that will prevent people who are incompetent from opening exchanges, as well as severely punishing all those who engage in fraud in the crypto world. Everything that happened this year alone clearly shows that non-regulation has caused damages of more than $100 billion (Kwon&Bankman alone) and that there is simply no other choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 24, 2022, 03:02:53 PM",
      "body": "Quote from: Lucius link=topic=5431048.msg61491575#msg61491575Quote from: TryNinja on December 23, 2022, 05:40:08 PMTLDR: if you want to open an exchange or crypto company, you will need to follow the laws I support regulation that will prevent people who are incompetent from opening exchanges, as well as severely punishing all those who engage in fraud in the crypto world. Everything that happened this year alone clearly shows that non-regulation has caused damages of more than $100 billion (Kwon&Bankman alone) and that there is simply no other choice.The most important here, is that this law heavily supported by a group called ABCripto, whichis a group of the oldest (and bad) exchanges in Brazil. This group lost about 70% of their volume to binance , because binance is way cheaper and better.Now, this regulation will most likely become a barrier for new exchanges and players to come in. Maybe big companies such as Crypto.com may be able to enter the market, but small players will most likely be blocked by this Law and the government. There is huge freedom in the act of deciding whether or not a brokerage can or cannot get the license operate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "December 24, 2022, 04:19:16 PM",
      "body": "Quote from: Sexylizzy2813 on December 22, 2022, 09:28:41 PM But with the Central Bank of Brazil (BCB) working to release it'd own digital coin, is Bitcoin being used as a sub to await the preparation of their CBDC or it would be given some important notice like El Salvador did??Even if their CBDC's launch and they intend to now make a U-turn on making BTC legal for trading in Brazil, it would have already given bitcoins enough time to become popular amongst the people of Brazil. It is still a win situation. When people begin to use CBDC's and see how almost similar and yet very different they are from bitcoins, they will not dump all the bitcoins they have for the governments' centralized CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "December 24, 2022, 04:29:13 PM",
      "body": "Trust me (well, don't, haha) but I'd be willing to bet anyone that Brazil (or Brazilians, really) are probably a lot farther ahead with Bitcoin adoption than El Salvador.Sure, the latter's made the news with headlines from its dictator president (nothing personal) but I've seen a lot more evidence of Bitcoin utility in Brazil than in El Salvador.So don't worry about whether your president or government will get between the covers. You don't need them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "December 24, 2022, 07:21:07 PM",
      "body": "Well that’s not the real crypto currency so it does not matter if Brazil succeed in it or not. Just creating digital coin does not mean it can replace the bitcoin or other crypto coins. That’s really rough idea to think about. Bitcoin is bitcoin. The complexity and simplicity, both can be seen in the single cocoon of cryptographic methods. Bitcoin won’t go away from peeps mind unless and until there comes better version of the bitcoin. Well, it seems impossible to me in the long run so bitcoin will surely stay there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "December 24, 2022, 07:22:35 PM",
      "body": "From the looks of it, I think bitcoin will stay operational in the country for a substantial amount of time. The government of that country is pretty firm in making a statement about bitcoin and/or crypto becoming more prevalent in their country. Which in itself is cool I guess cause it helps with hastening bitcoin's global adoption one country at a time, but at the same time this could mean regulation and strict user guidelines are to be imposed for bitcoin to be operational within the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 24, 2022, 07:26:38 PM",
      "body": "Countries can have different policies, and I don't think Brazil will be exactly like El Salvador. I guess the case of El Salvador is special because they don't have their own fiat (their fiat is the USD), which might be why they didn't think seriously of making their own CBDC. Brazil is a bigger country with more things to account for, and they have their own strong fiat currency. Maybe they'll make a CBDC, but it seems the plan is quite distant (for 2024), and who know if they decide to go through with it. But generally, I think a CBDC can coexist with Bitcoin. In my own country (Ukraine), there's a governmental plan to both accept Bitcoin as payment and explore a local fiat-based CBDC in the future, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 24, 2022, 07:34:05 PM",
      "body": "People are already warned about CBDC I guess they all believe it's used for surveillance which people don't trust governments. Even if they allow CBDC to be used in buying BTC, the people will be more cautious because they get records of who owns BTC.Brazil embracing BTC will make the country open for all because the impression is that people are free. BTC is here to stay, it doesn't choose whoever and whatever the owner may do to his BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 24, 2022, 09:06:46 PM",
      "body": "Quote from: bitmover on December 23, 2022, 03:37:37 PMI am from Brazil and I try to get all information possible about crypto I can confirm: there isn't much going on and this regulation is mostly about exchanges.Brazil is not going to do something like El Salvador, and this law is not about it.What is this law about?Kyc in exchangeMoney laundering Ponzi schemes New barriers for new exchanges to get license to operate.Nothing will change here in short term for bitcoin users and as payment method.That's good to hear the latter part.Although some confirmation and help from the government will really be seen as something for pushing bitcoin to its fullest in a country. Most countries should just do this.They have to enforce laws to combat those illegal activities that might be associated with bitcoin based on the use of those criminals while looking at how it's being used correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}