{
  "id": "topic_5407348",
  "title": "geniota",
  "author": "geniota",
  "created_time": "July 23, 2022, 11:37:12 AMLast edit: August 10, 2022, 04:02:08 AM by geniota",
  "content": "The End of the Pump Phase and Communication HandlingHi guys, it's Alex from TokFlow again! In the previous section, I analyzed the RACA's steps to pump the prices and how market makers manipulated the community with media tricks. In part 2, I'm going to shed light on the end of the whole pump phase with a lot of striking evidence and most importantly how Radio CACA handled the media in the post-pump phase from the beginning of this year till now. After going sideways for about 2 weeks at the price of 0.003-0.004, the development team rapidly set RACA price at an unexpected ATH level.1. To the moonOn November 8, RACA proclaimed it would develop the Cyber Security Training Centre inside USM, an office located near SpaceX's headquarters. Besides, RACA also organized the airdrop program of 300 eggs and 10,000 DAU Milestone – an extremely valuable gift on the occasion of the project announcing a series of fascinating information. The community became so thrilled that the number of people joining the project had shot up. The developers continued to pamper the \"contentment\" of the community by announcing the burning of 300 million RACA and another 200 million RACA airdrops to all MPB owners on the same day (November 12, 2021). Two days later (November 14, 2021), RACA price successfully reached ATH at 0.0119888 in the tremendous excitement beyond suspicion of the community. Do you still remember the lowest price of RACA just about 7 months ago? Within more than half a year, developers had successfully pumped the price of a low cap coin 630 times higher.2. A mass of evidence that MM pumped and dumped tokenSome may wonder that RACA has developed comprehensively in terms of both marketing and project, so the sharp increase in RACA prices is entirely driven by the power of the community without deliberate manipulation? Our TokFlow team has developed an AI that tracks hundreds of MM wallet labels with total transactions worth tens of billions of RACA, and here is the proof:https://www.linkpicture.com/q/Image1-p2.png(Click here for more information: TokFlow Channel)This is a small portion of MM wallet labels that we collected, as you can see, the above wallets all hold a substantial token volume that can completely manipulate the market. Throughout the entire pump phase, MM wallets are constantly buying in large quantities of RACA and selling very small quantities, with a view to pushing up the prices and simultaneously taking advantage of these MM wallets to fake market volume by buying and selling at the same time a very large number of tokens.I really take my hat off to the marketing and project development strategies of Radio CACA's team. A perfect plan without a bit of a loophole or suspicion from the community, and the ATH price (0.0119888) that the developers chose to fake is also a pretty nice number to make them satisfied and move on to the next phase - Dump.The question is how they pumped the token without shocking the market, or making the community criticize and boycott the project when using a lot of big names to PR for it. In fact, those wise whales and market makers never wait for a spike in price to start pumping. Instead, they gradually dumped while pumping the price without making the community notice.I'll take the example of a wallet address with suspicious performance which is called wallet A: 0x9e8451158086ba066d93c11d8d4b6e1969bcbc8d: https://www.linkpicture.com/q/Image2-p2.png(Synthetic data by TokFlow AI)According to TokFlow analytics, wallet A received money from Dev on September 7, 2021. Therefore, I suspect this is a wallet label controlled by the Dev team.To clarify this, I also checked the source of the wallet label 0xc99e4e934f1ddd2e3e03ffe38fe862ab5d6139be transferred to wallet A on August 24, 2021. Not surprisingly, it turned out that the amount of RACA also came from Dev, then it was broken down and transferred to a lot of other wallets:https://www.linkpicture.com/q/Image3-P2_3.png(Synthetic data by TokFlow AI)So after receiving token from 2 sources of Dev, wallet A held the token until mid-October and began to make a lot of orders transferring the token:https://postimg.cc/t7hZScvs(Synthetic data by TokFlow AI)I will randomly view a transaction of wallet A transferred 200K RACA to the wallet 0x241ab55768da608196f4cd2d63f5dbc07415b1a2 on October 7, 2021 to see the real purpose of this transaction. Here's what I found: https://www.linkpicture.com/q/Image5-p2.png(Synthetic data by TokFlow AI)From this I came to the conclusion: wallet A received a large number of tokens from Dev's sources then made a lot of orders transferring money to other sub-wallets to place the sell-off orders, which shows a fairly obvious dump behavior of the developers.During the tracing process, the TokFlow team tracked down how the developers erased the trace of the token’s origin by pushing the token to the exchange, then transferring the token to another wallet address that \"only God knows\" whether it was a real user wallet or Dev wallet. But nothing can cover the eyes of the community or TokFlow AI, I will give you an example of another wallet label:(0xe4850258b8699bbd7b1cb337b6023c6b979e5808)https://www.linkpicture.com/q/Image6-p2.png(Synthetic data by TokFlow AI)The aforementioned is a regular wallet label, but could it receive tokens simultaneously from both exchange and Dev? This is the proof that the Dev team could transfer money to the exchange, and then wipe out the trace by transferring to another wallet and transferring a few rounds to many other wallet labels to dump. My team - TokFlow has counted hundreds of wallets with similar transactions which indicate that the number of tokens dumped to the community was not negligible at all (in particular, these wallets showed signs of dump when the project had good news). In addition, it is also easy to notice the behavior of Dev breaking down the tokens into wallets and staking for rewards. Here's a similar example of how much money Dev spent on farming:https://www.linkpicture.com/q/Image7-p2.png(Synthetic data by TokFlow AI)I just showed you how Dev dumped the tokens. However, the number of tokens in Dev wallets is only a small portion. When I learned that Devs could erase traces by pushing tokens to the exchange and then withdrawing from other wallets, I had my TokFlow team review all the wallets receiving money from the exchange and dumping continuously from the moment the price started to be pumped sharply from the end of October to the end of December. Here's part of what TokFlow found: https://www.linkpicture.com/q/Image8-p2.png(Click here for more information: TokFlow Channel)All of the above wallets show suspicious signs of receiving billions of RACA from the exchange and then selling in equal amounts. I will check for you wallets that have dumped more than 7.5 billion RACA: https://www.linkpicture.com/q/Image9-p2.png(Synthetic data by TokFlow AI)Take a look at some of the highlights from this wallet address 0x431731d312dffa688a37d81af8874a58776eacfd as follows: - The wallet had a total of 32865 transactions since 24/09/2021 (when the project had boosted pricing for more than 1 month) until now. The wallet had the most transactions at the end of October until mid-November 2021 (when the project consecutively reached new peaks)- The wallet received the total number of 8,934,803,024 RACA from the exchanges, sold 7,509,388,951 RACA, the remaining number of 1,425,414,073 RACA was transferred to other wallets, the current number of tokens in the wallet was zero. - The total transaction of the wallet includes: +Source of tokens in: 2 exchanges (PancakeSwap and Gate.io) or some other wallet addresses such as: 0x98e8f871d814bfc5506b6cd4abeb3d05f809f8c5 (the source of money from this wallet address also came from the above 2 exchanges)+ Source of tokens out: in 2 ways: either sold right on PancakeSwap, or transferred to some wallet address, e.g. => 0xb023d7f5aabd97b41b367a74c8e09cfa34a97702=> 0x972c69d9d0af1bc888fee3efa15753f531046710=> 0x39bd1ae0c8f3387905684913dc84f34e18a1654aSo where will the tokens received from the above wallet addresses go?https://i.postimg.cc/qM03gJNn/Image10-p2.pnghttps://i.postimg.cc/6qHt9f7M/Image11-p2.pnghttps://i.postimg.cc/jqvsQt8y/Image12-p2.png(Synthetic data by TokFlow AI)=> As such, they continued to be pushed onto Gate.io or Mexc.com exchanges. And as analyzed above, this is a form of token erasure used by developers or market makers to make MM wallets up as regular user wallets that blinds the community. And with just one wallet label, the market makers have successfully dumped nearly tens of billions of tokens, so with the list of hundreds of wallets we found, the number is truly mind-boggling. 3. Handling of community crisis in post-dump phaseI know that, up to now, RACA has been quite successful as the rest of the community of the project is still having a lot of faith in the development team, with the belief that this is just a stage of technology adjustment and upgradation, and one day they will reclaim.But just wait and see ‘cause who knows. The keyword that TokFlow and I want to show you here is \"faith.\" The simplest way for a pump project to handle a community crisis when the tokens are divided too many times is to give the community conviction. By various methods, the developers won't let the project die suddenly. On the one hand, market makers will gut the project slowly, making the project more and more dumped. On the other hand, the marketing department continues to appease the community, creates things for the community to see the relentless efforts of the Dev team, and the project is still constantly developing. Well, that's exactly what Radio CACA has been doing and continues to do.In the previous section, I used TokFlow AI to analyze how MM and Dev dumped the tokens, and in terms of communication, immediately after reaching the ATH level, the inevitable consequence of a series of pump orders is that the RACA price is constantly falling and has divided 10 in just over 1 month to only 0.00185 (December 12, 2021). The community panicked, and lost their faith. At this time, the developers tried to appease the community by holding a round 2 MPB sale on RacaNFT on November 19 and ended in less than 2 minutes. This indicates that the community is so optimistic that they see it as an opportunity to buy the dip. RACA manipulates the community trust with a series of news that offers hope: Burn 10 billion RACA in December+ GiveAway more than 100k RACA for holders+ Continue to release USM Land Mystery Boxes (sold out in 3 minutes and 45 seconds).+ The token price was pushed back to 0.0047 on December 23, 2021, and dropped continuously for the next month to 0.0018 until January 22, 2022. I suppose, at this time, the dump phase of the developers is almost complete. However, the game of cat and mouse is not over. RACA continued to perform Pump and Dump on the tokens for the next 2 months to maintain trust in the community and \"suck the blood\" as much as possible. In late January and early February 2022, RACA's media buzzed with news: + 30/1/2022: The Blockchain Association of the University of Cambridge partnered with Radio Caca (RACA) to build education in the Metaverse world \"Metaverse + Education\", Empowering Education Reform, Promoting Educational Equality.+ 3/2/2022: The transaction fee on the NFT market was reduced to 3%.+ 6/2/2022: 📢 Turkey 🇹🇷 Government 🏛 announced it is actively looking into the Metaverse. At the same time, the MOST widely-distributed and famous local press & newspapers 📰 in Turkey are highlighting all great things about #RACA @USMverseThe RACA price at this time increased continuously to 0.0025. Then, it was slowly dumped to 0.001. On March 28, 2022, the developers announced an airdrop of 680 million RACA market fees for all MPBs. This served as the last gift that market makers gave to the loyal communities at 0.0027 before the price continued to divide 9 more times until now.https://postimg.cc/3kGkPbn4Currently, the price is trading in the range of 0.0003-0.0004. Market makers continue to show their efforts to fix and improve the project's mechanism, while communities whose assets have been divided several times are still holding on to hope that one day the project will thrive again. I've noticed that there are still signs of Dev, MM or sharks collecting tokens in recent times:https://postimg.cc/DJwjjsnZ(Click here for more information: TokFlow Channel)This is part of the list of new wallets continuing to collect tokens, which is compiled by TokFlow. You can double-check the transactions on the BSC Chain. I don't know if this is good news for those who are still hoping for a rebound or it’s the doubt that RACA developers just quietly manipulate the market and will once again steer the RACA boat out to sea for some more fish?I'm going to give this answer to the traders, but for me Alex and the TokFlow team - every trick can be exposed! Want to analyze hot tokens? Let’s join our TokFlow Community to make your suggestions! We’re glad to be able to help you!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407348",
  "comments": []
}