{
  "id": "topic_5474197",
  "title": "cabron",
  "author": "cabron",
  "created_time": "November 15, 2023, 03:42:09 PM",
  "content": "I am trying to sell old stuff that I have from power tools and the Crossbows that I have created myself. This will require me to sign and submit KYC but I have no experience in BTC payment methods, the options I have are:CoinPaymentsCoinGatePayOPNOWPaymentsCoinbase Commerce Anything else you can suggest? For anyone who tried any of these, which one do you like the most and why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474197",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "November 15, 2023, 03:44:45 PM",
      "body": "But since you're selling some old tools you have, is it really worth it to build a website and use a payment processor for this? also, I'm not sure I understand the KYC part, do you need to pass KYC, or the buyer must do it?Here's a list of payment processors anyway, with their KYC policy: https://bitcointalk.org/index.php?topic=5444578.0I would use something like eBay to sell those (assuming that you're allowed to sell them), and then use the fiat to buy Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 15, 2023, 03:44:58 PM",
      "body": "I tried only blockonomics.co before coz it has free nth transaction fee also no KYac requirements. I also knew there is an existing thread for the list of these payment processors Edit: Found it https://bitcointalk.org/index.php?topic=5444578.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 15, 2023, 04:45:48 PM",
      "body": "Quote from: OmegaStarScream on November 15, 2023, 03:44:45 PMBut since you're selling some old tools you have, is it really worth it to build a website and use a payment processor for this? also, I'm not sure I understand the KYC part, do you need to pass KYC, or the buyer must do it?Here's a list of payment processors anyway, with their KYC policy: https://bitcointalk.org/index.php?topic=5444578.0I would use something like eBay to sell those (assuming that you're allowed to sell them), and then use the fiat to buy Bitcoin. Are my buyers also going to be signing up for the payment methods using those on my list?  If they are then I can see this is not what they want as well.I'm already distracted by what you said. It must be hard to sell using my own wordpress site and I have to continue paying for the server which would take time before I get sales. I thought eBay was dead. blockonomics.co is interesting since no KYC needed. It suggests Shopify which also has a list of crypto payment methods https://help.shopify.com/en/manual/payments/additional-payment-methods/cryptocurrency I will still end up having to maintain a Shopify store which is $2000/month jeez",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "November 15, 2023, 04:51:03 PM",
      "body": "Quote from: cabron on November 15, 2023, 04:45:48 PMAre my buyers also going to be signing up for the payment methods using those on my list?  If they are then I can see this is not what they want as well.I'm already distracted by what you said. It must be hard to sell using my own wordpress site and I have to continue paying for the server which would take time before I get sales. I thought eBay was dead. blockonomics.co is interesting since no KYC needed. It suggests Shopify which also has a list of crypto payment methods https://help.shopify.com/en/manual/payments/additional-payment-methods/cryptocurrency I will still end up having to maintain a Shopify store which is $2000/month jeez Making a site is not necessary if you have where to advertise the product. Let's say you made an account with a payment processor, and you created the invoice for X amount. Is it just for the sole purpose of giving it to people who are interested in buying? why not simply give an address in that case? As for KYC, then I'm not sure I understand your question. If you don't want users to create an account, or go through KYC, then most services don't ask for that either, unless the amount is too big I would imagine but you will have to pass KYC as a merchant. If you also want to avoid that, you can go with Coinbase Commerce or BTCPayServer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "November 15, 2023, 07:00:58 PM",
      "body": "Quote from: cabron on November 15, 2023, 04:45:48 PMblockonomics.co is interesting since no KYC needed. It suggests Shopify which also has a list of crypto payment methods https://help.shopify.com/en/manual/payments/additional-payment-methods/cryptocurrency I will still end up having to maintain a Shopify store which is $2000/month jeez If you already say that you have a WordPress site, then it is better to look for a solution based on that. It is certainly a cheaper solution than Shopify.coinremitter.com seems to me to be suitable for what you are looking for. If I understood correctly, this would only be for the short term until you sell off what you have, so the monthly free plan can be fine for you. It's also KYC-free for both sides.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}