{
  "id": "topic_5409864",
  "title": "Xal0lex",
  "author": "Xal0lex",
  "created_time": "August 14, 2022, 07:31:37 PMLast edit: August 14, 2022, 09:51:59 PM by Xal0lex",
  "content": "Buy AssetMantle coin (MNTL) for bitcoin. Or can anyone suggest the easiest way to buy this coin for bitcoin. Ideally, if anyone knows how to buy this coin for bitcoin directly. Although I doubt there are options to exchange directly, this coin is based on Cosmos blockchain if I'm not mistaken. Suggest your options.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409864",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 15, 2022, 10:59:10 PM",
      "body": "As of now I don't know any direct way you can buy the coin using Bitcoin, but you can buy it from osmosis (https://app.osmosis.zone) using USDC.You could just swap the BTC to USDC using one of the trusted instant exchanges like fixedfloat... More can be got here (https://kycnot.me) and then you use the USDC to buy MNTL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "August 19, 2022, 05:46:23 PM",
      "body": "Quote from: Bitcoin_Arena on August 15, 2022, 10:59:10 PMAs of now I don't know any direct way you can buy the coin using Bitcoin, but you can buy it from osmosis (https://app.osmosis.zone) using USDC.You could just swap the BTC to USDC using one of the trusted instant exchanges like fixedfloat... More can be got here (https://kycnot.me) and then you use the USDC to buy MNTL.Thank you for your help. But it needs USDC on Axelar blockchain. There is no such thing in the exchanger you mentioned. To transfer USDC to Axelar blockchain you need to use a bridge. And there is quite a big commission. A lot of extra work, as they say  I found a simpler way. I exchanged bitcoin for Atom coin at the exchanger you mentioned. And for this coin I bought MNTL at https://app.osmosis.zone. It seems to me, that it is much easier, and the commissions are small.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}