{
  "id": "topic_5441985",
  "title": "King GK",
  "author": "King GK",
  "created_time": "March 03, 2023, 01:06:35 PM",
  "content": "There are many women out there in the world today! I think the level of difficulty to learn cryptocurrency is the reference for all women to enter the crypto currency   It is also very difficult for those who have to save the private keys 🔑 because usually the women often forget to save her personal data I also always try to keep valuable to at home but sometimes if I often forget and in the crytocurrency market if I forget to save the private key it will be a disaster for us.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441985",
  "comments": [
    {
      "author": "DanWalker",
      "created_time": "March 03, 2023, 02:37:05 PM",
      "body": "I don't think women are more forgetful or negligent than men, I myself have asked my wife to hold my private key, and I feel much safer in her hands than I am. Today's world has become egalitarian, and sometimes women are better than men at jobs that were previously only available to men. We should not look down on women today. I don't know about other countries, but my country has a large number of girls participating in the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "March 03, 2023, 03:46:59 PM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMThere are many women out there in the world today! So, but what's the specific need?I did not go so far as to think that the gender imbalance of traders would really have an important effect on trading. In fact, none of the trading tips or advice I've found mentions specific gender requirements on the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 03, 2023, 04:32:21 PM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMThere are many women out there in the world today! I think the level of difficulty to learn cryptocurrency is the reference for all women to enter the crypto currency   It is also very difficult for those who have to save the private keys 🔑 because usually the women often forget to save her personal data I also always try to keep valuable to at home but sometimes if I often forget and in the crytocurrency market if I forget to save the private key it will be a disaster for us. I find women more organized than men, so there shouldn't be any fear of them losing their keys or personal data. In my location women suffer from discrimination which affects their interest in some sectors of the economy. The cryptocurrency sector is currently dominated by male because only few women have shown interest in the sector. The society sees the sector as a male thing and women are encouraged to focus on some professions that is perceived as feminine such as teaching, nursing, house keeping, etc. But this discrimination is gradually phasing out because more parents have started knowing the importance of allowing their girl child to freely choose their profession. However, it will be wonderful to have more females in the cryptocurrency industry because women also needs financial freedom and privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "March 03, 2023, 05:29:00 PM",
      "body": "IMO we don't need any more people in crypto trading. I'd argue that trading doesn't benefit bitcoin in any way. It's just a way for people to make a few more dollars from people who are forced to sell at low prices due to fear, or personal reasons. I don't see why would you need more traders instead of more investors. I also fail to understand why you need women to do it. I'd rather see women launch startups and offer goods and services for bitcoin. This actually increases awareness and has positive impact on bitcoin ecosystem, while trading doesn't. Aren't traders the people who are now crying that crypto is a scam because they were keeping their savings on Scam Bankster's platform?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 03, 2023, 06:47:52 PM",
      "body": "Quote from: coolcoinz on March 03, 2023, 05:29:00 PMIMO we don't need any more people in crypto trading. I'd argue that trading doesn't benefit bitcoin in any way. It's just a way for people to make a few more dollars from people who are forced to sell at low prices due to fear, or personal reasons. I don't see why would you need more traders instead of more investors. I also fail to understand why you need women to do it. I'd rather see women launch startups and offer goods and services for bitcoin. This actually increases awareness and has positive impact on bitcoin ecosystem, while trading doesn't. Aren't traders the people who are now crying that crypto is a scam because they were keeping their savings on Scam Bankster's platform?I agree.  Traders are for the most part delusional folks who think they're going to beat the market and end up with riches for making some trades sitting at their computer.  They're toxic, increase volatility, and every trader I've ever met in real life has gone broke.  Sure, we need more girls in crypto, but not as worthless traders who do nothing but bankrupt themselves to enrich exchanges.  We need more women that have actual skills (trading isn't a skill, it's gambling) and are willing to put their time and energy into creating crypto projects that exist on chain that increase use cases and solve problems for users.  We don't need any traders at all, male or female.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 03, 2023, 07:13:19 PM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMSnippedTo correct you first on the title you're using, why not change the word girls to \"women\" to make it more professional, secondly incase you don't know, then try to get this noted that women were very good at keeping secrets than men, you can conduct a research on that, so I believe in keeping private keys in a secured manner, women will be a very good consideration at that, we also have women active in the cryptocurrency world but just few and from those few, little number of them were recognized, just take a look at the forum here as a reference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jvanname",
      "created_time": "March 03, 2023, 10:27:53 PM",
      "body": "Asking girls to trade cryptocurrency is abuse against women because the cryptocurrency sector is filled with deplorable deplorables who do not even realize that Bitcoin does not even have a mining algorithm that is designed to advance science.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FireDAOJackie_Z",
      "created_time": "March 08, 2023, 06:20:41 AM",
      "body": "Quote from: coolcoinz on March 03, 2023, 05:29:00 PMIMO we don't need any more people in crypto trading. I'd argue that trading doesn't benefit bitcoin in any way. It's just a way for people to make a few more dollars from people who are forced to sell at low prices due to fear, or personal reasons. I don't see why would you need more traders instead of more investors. I also fail to understand why you need women to do it. I'd rather see women launch startups and offer goods and services for bitcoin. This actually increases awareness and has positive impact on bitcoin ecosystem, while trading doesn't. Aren't traders the people who are now crying that crypto is a scam because they were keeping their savings on Scam Bankster's platform?You are truly making the point. I can share an interesting story/scam happened to me. A few days ago, I logged in my Facebook and tried to reach some of my friends overseas, suddenly a very young and attractive lady sent me a friend request. Out of curiosity, I accepted. Then she was beginning to \"make friends\". To be honest, I am not young and naive and I know there must be reasons these attractive girls are chasing you. One hours later, she asked for my What's App number and I gave her. Then she started chatting there on and on. Basically she was saying she got divorced and was interested in me, which is all false of course. And in the next few days, she kept sending me all crypto transaction records saying that how much she earned every day. Then I knew she was trying to seduce me to buy all altcoin for her personal gain. Well, I am not stupid and said no. And she was not upset at first because she said she would be my girlfriend but we had to make money first, bla bla bla... in the end, I laughed out and she knew I was not a fool and would not fall in her trap. Finally she said I was not suitable for her and stopped talking to me. Do you think this is an exception ? Hell no, I have met these women dozens in the past years. I guess this is another reason why so many altcoins are badmouthed in the market. Scams only depend on scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "March 10, 2023, 06:08:43 AM",
      "body": "Quote from: FireDAOJackie_Z on March 08, 2023, 06:20:41 AMYou are truly making the point. I can share an interesting story/scam happened to me. A few days ago, I logged in my Facebook and tried to reach some of my friends overseas, suddenly a very young and attractive lady sent me a friend request. Out of curiosity, I accepted. Then she was beginning to \"make friends\". To be honest, I am not young and naive and I know there must be reasons these attractive girls are chasing you. One hours later, she asked for my What's App number and I gave her. Then she started chatting there on and on. Basically she was saying she got divorced and was interested in me, which is all false of course. And in the next few days, she kept sending me all crypto transaction records saying that how much she earned every day. Then I knew she was trying to seduce me to buy all altcoin for her personal gain. Well, I am not stupid and said no. And she was not upset at first because she said she would be my girlfriend but we had to make money first, bla bla bla... in the end, I laughed out and she knew I was not a fool and would not fall in her trap. Finally she said I was not suitable for her and stopped talking to me. Do you think this is an exception ? Hell no, I have met these women dozens in the past years. I guess this is another reason why so many altcoins are badmouthed in the market. Scams only depend on scammers.Gold diggers, gold diggers everywhere [meme inserted].If you were horny enough, she'd be with your child, if you were horny and smart enough, she'd be digesting the mini you's by now, lol. But it seems you were just smart not to fall for it.To all the young and beautiful girls out there, I can make you rich, you just need to visit my office which has a nice couch and there is also a camera for educational purposes, you can earn 1000$ in less than 2 hours.Here is the process, you just show your ID to prove you are at legal age, I will take care of the rest. Guaranteed 500k Onlyfans subscribers.This is what I can think of when you guys talk about more girls in crypto, girls can easily be manipulated, there is no room for pussies in crypto.🤣",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "voos",
      "created_time": "March 10, 2023, 11:19:46 AM",
      "body": "Crypto Trading?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "March 15, 2023, 11:06:49 PM",
      "body": "It would be incorrect to assume that women are less interested in cryptocurrency since they tend to forget things.Because you are forgetful as a woman doesn't mean other women will do the same because of their nature of taking care of homes. Several women are interested in cryptocurrency, and they are successful in it with no problems with money loss or losing their private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 15, 2023, 11:52:57 PM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMThere are many women out there in the world today! I think the level of difficulty to learn cryptocurrency is the reference for all women to enter the crypto currency   Every thing needs a starter before getting to know more about it and that level is no different from the level of learning cryptocurrencies. It's just the same from those that we need to start somewhere, get to learn about it and pursue if we want to stay on its industry.Quote from: King GK on March 03, 2023, 01:06:35 PMIt is also very difficult for those who have to save the private keys 🔑 because usually the women often forget to save her personal data It's not difficult to keep things, in fact, AFAIK, girls are even the best when it comes to hiding things so saving their private keys won't be that difficult to make and I'm speaking based on my observation about them. Keeping the private keys is a no-brainer. Just needed to give some detailed instruction on how to keep them.Quote from: King GK on March 03, 2023, 01:06:35 PMI also always try to keep valuable to at home but sometimes if I often forget and in the crytocurrency market if I forget to save the private key it will be a disaster for us. Not for us but only for people like you that tend to forget important things like your private keys. Do something about it and place it on a place where you put things at most times but is kind of hidden from your visitors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 16, 2023, 11:04:12 AM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMThere are many women out there in the world today! I think the level of difficulty to learn cryptocurrency is the reference for all women to enter the crypto currency   It is also very difficult for those who have to save the private keys 🔑 because usually the women often forget to save her personal data I also always try to keep valuable to at home but sometimes if I often forget and in the crytocurrency market if I forget to save the private key it will be a disaster for us. You need to pull yourself together. Not only your opinions are blatant misogyny, they doesn't make any sense either. You lie that women forget their privatekeys because of reasons you won't give. And by doing so are implying that men are somehow don't do that. And yet you want more women in cryptocurrency, and even trading, which when you do it in cexes doesn't have anything to do with privatekeys. So what's the point with your post? Just to diss women?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "March 16, 2023, 08:38:42 PM",
      "body": "Not all women are same though, some women are smart and even smarter than men, don't use the little disadvantages of one woman to judge others, crypto is not centralized to one gender alone,I think if you see any woman who is interested and wishes to join and invest, please don't hesitate to introduce them to it because some women are so smart and hard-working...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 17, 2023, 12:30:55 AM",
      "body": "Perhaps we also need more girls and women to get interested in Bitcoin mining, Bitcoin development and Bitcoin merchant acceptance, not only trading.Do not get me wrong, trading is important as part of the Bitcoin ecosystem, besides the bad stuff others have already mentioned; trading also helps to keep the huge liquidity of this market. And while there must be some girl already into trading, I feel there must be less in those other activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "March 17, 2023, 01:01:02 AM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMThere are many women out there in the world today! I think the level of difficulty to learn cryptocurrency is the reference for all women to enter the crypto currency   It is also very difficult for those who have to save the private keys 🔑 because usually the women often forget to save her personal data I also always try to keep valuable to at home but sometimes if I often forget and in the crytocurrency market if I forget to save the private key it will be a disaster for us. Women are not forgetful as you said in this topic. When it comes to forgetfulness and carelessness, it is more of an attribute of men than women. Whenever I have an important documents, it is always the female gender that will keep it safe. The man is always bothered with so many things in his head which includes job's responsibilities and many other things and this make man to be more forgetful. The reason women are not very much in cryptocurrency trading is because they lack the ability to take risk. The men are the risk-takers and they are mostly the breadwinners. That is why you see them being more populated than women. I am not surprised that it happens in cryptocurrency because that is how it happens even in other sectors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "March 18, 2023, 07:17:43 AM",
      "body": "Quote from: King GK on March 03, 2023, 01:06:35 PMThere are many women out there in the world today! I think the level of difficulty to learn cryptocurrency is the reference for all women to enter the crypto currency.Trading have nothing to do with gender, if women are not much into trading it does not affect the crypto industry in any way. But I think crypto trading is getting to an era whereby many women will get involve to it, the crypto industry is still growing and with time there will be lot of changes that we gonna experience. You should know women are different from men in the way they go for things,  men are quick to accept new innovations first before other people will later come in for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 18, 2023, 02:33:43 PM",
      "body": "I don’t think it matters which sex somebody is regarding crypto investing. What we need is more adoption, male, female or whatever else people like to call themselves these days. We just need more adoption, lots more of it.If you were interested in cool girls in the industry, check these -1. Tavonia Evans (@cryptodeeva)2. Meltem Demirors (@Melt_Dem)3. Maliha Abidi (@maliha_z_art)4. Cleve Mesidor (@cmesi, @cmesidor)5. Elizabeth Stark (@starkness)6. Lavinia Osbourne (@LaviniaOsbourne) 7. Kinjal Shah (@_kinjalbshah) 8. Caitlyn Long (@CaitlinLong_) 9. Preethi Kasireddy (@preethikasireddy, @iam_preethi)10. Yi He (@heyibinance) 11. Laura Shin (@laurashin)12. Natalie Brunell (@natbrunell, @nataliebrunell)13. Layah Heilpern (@LayahHeilpern, @_layah_heilpern)  14. Rachel Siegel (@CryptoFinally)15. Lea Thompson (@girlgone_crypto, @girl_gone_crypto)16. Randi Hipper (@missteencrypto) 17. Aleksandra Huk (@HukAleksandra, @aleksandrahuk)https://influencermarketinghub.com/female-crypto-influencers/Some of them are rather easy on the eye also so the perfect women.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chibaba",
      "created_time": "May 26, 2024, 11:23:03 PM",
      "body": "Quote from: DeathAngel on March 18, 2023, 02:33:43 PMI don’t think it matters which sex somebody is regarding crypto investing. What we need is more adoption, male, female or whatever else people like to call themselves these days. We just need more adoption, lots more of it.If you were interested in cool girls in the industry, check these -1. Tavonia Evans (@cryptodeeva)2. Meltem Demirors (@Melt_Dem)3. Maliha Abidi (@maliha_z_art)4. Cleve Mesidor (@cmesi, @cmesidor)5. Elizabeth Stark (@starkness)6. Lavinia Osbourne (@LaviniaOsbourne) 7. Kinjal Shah (@_kinjalbshah) 8. Caitlyn Long (@CaitlinLong_) 9. Preethi Kasireddy (@preethikasireddy, @iam_preethi)10. Yi He (@heyibinance) 11. Laura Shin (@laurashin)12. Natalie Brunell (@natbrunell, @nataliebrunell)13. Layah Heilpern (@LayahHeilpern, @_layah_heilpern)  14. Rachel Siegel (@CryptoFinally)15. Lea Thompson (@girlgone_crypto, @girl_gone_crypto)16. Randi Hipper (@missteencrypto) 17. Aleksandra Huk (@HukAleksandra, @aleksandrahuk)https://influencermarketinghub.com/female-crypto-influencers/Some of them are rather easy on the eye also so the perfect women.You obviously have a good list of influential women in this industry cos i can recognize Yi He on your list but quite surprised you omitted or missed out on Gracy Chen; formerly Bitget's MD and recently announced their CEO. Imho i feel Yi He and Gracy Chen are the most notable women top players in this industry. Tho, I stand to be corrected",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}