{
  "id": "topic_5425828",
  "title": "sgeldercoin",
  "author": "sgeldercoin",
  "created_time": "December 05, 2022, 10:35:22 AM",
  "content": "Hi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425828",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "December 05, 2022, 11:08:17 AM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 10:35:22 AMHi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)Can you post the link of the shitcoin that you are shilling so we can mock it   I have seen a lot of projects claiming that the coin they created will rule the market and it only took a couple of months before the coin is dead so be sure that it is really good and not the next shitcoin to die.I tried to find it but it does not even exist, is it in the panning stage, or is the coin already existing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 05, 2022, 12:14:46 PM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 10:35:22 AMHi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)You sure even bigger than bitcoin and ethereum? Are you sure its marketcap maybe you are mistaken with the information. Price could be higher than btc or eth but marketcap is something you cant easily confirm bigger than those. Also if they are bigger than them then why they having trouble to get listed on coinmarketcap and coingecko.Quote from: coin-investor on December 05, 2022, 11:08:17 AMI tried to find it but it does not even exist, is it in the panning stage, or is the coin already existing.Maybe in different chain but surely this is a shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sgeldercoin",
      "created_time": "December 05, 2022, 12:37:15 PM",
      "body": "I put a url in my profile to the telegram group of GELDC.It is the biggest coin in terms of marketcap and not in terms of price and coinmarketcap and coingeckolist coins which have a lower marketcap than Bitcoin and Ethereum and all the other top 100 coins, because they are heavily invested in Bitcoin and Ethereum and would loose all their investments if GELDC would appearat top 1 at these 2 pages (now you know the reason they don´t list the biggest marketcap coin!).Although i have information that an other marketcap page will list it within this month andthen GELDC dethrones Bitcoin from top 1.The chain is ETH chain and it is an erc20 token.GELDC does not much to rule the markeetcap, because it simply rules it already as top1 coinwith its marketcap.I hope you guys know what measures the marketcap. If not I write the formula here:Marketcap= supply mutiply current price.The price at uniswap is 0.00000000032 USD in trade with ETH.Take that 0.00000000032 and multiply it with the supply of the GELDC token (you find the supply in their whitepaper also to find at their telegram group) and you get an atounding amount of $$$ high marketcap, to be exact: hti bigest marketcap of all coins and top 100 companies combined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "December 05, 2022, 01:31:22 PM",
      "body": "So this is supposed to be the next big thing in Cryptocurrency and will soon top all the other coins in the market, you cannot even create a decent website, this is one of the reasons why investors should learn and educate themselves about shitcoins and shill coins this is one example of it.I'm not even interested in your FREE 50 trillion because it's worthless   https://boerse.website/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sgeldercoin",
      "created_time": "December 05, 2022, 01:48:05 PM",
      "body": "You miss the point, because you judge the book (GELDC) by it´s cover (website of GELDC).You are like the guys who rather point out mistakes in a sentence that writes \"1 millions USD are yourss\" than to understand the real value of the sentence. Guy, you rather evaluate than to value and to understand what is written. Such guys GELDC does not need and surely the admin would not give you any GELDC at your birthday.Go play with other shitcoins which constantly lose value since 1 year and more.The real marketcap number 1 token is GELDC and this is purely a rational thing I write here, because the proof is in the math.And 619 holders (Mark Cuban billionaire and Vladimir Putin co-founder of Ethereum are hodlers )knowing GELDC is something outstanding big (bigger than all coin, yes even bigger than Bitcoin): https://etherscan.io/token/0x9a2e92f57eb9aedf260d091c314a7f52ef0461a1 \"So this is supposed to be the next big thing in Cryptocurrency and will soon top all the other coins in the market, you cannot even create a decent website, this is one of the reasons why investors should learn and educate themselves about shitcoins and shill coins this is one exampleof it.I'm not even interested in your FREE 50 trillion because it's worthless  Cheesy Cheesyhttps://boerse.website/\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dwminer1",
      "created_time": "December 05, 2022, 04:40:23 PMLast edit: December 06, 2022, 09:47:29 AM by dwminer1",
      "body": "Congratulations! It's only Monday, but I think you've got the week's prize for the most pathetic shilling in your pocket  Do you really think you're going to get anyone interested in this \"project\" this way?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sgeldercoin",
      "created_time": "December 05, 2022, 05:53:35 PM",
      "body": "Only the money hungry (who want to become billionaire and not only millionaire) will join and these brave enough ones who see GELDC also at top 1 in terms of market cap very coming soon in December 2022, far ahead of Bitcoin and ETH and all the other low marketcap coins.We are already 619 hodler, hey, better than below 100 hodlers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 05, 2022, 06:38:20 PM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 10:35:22 AMHi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)Market cap is a flawed parameter to measure a coin's performance! Let's assume you create a coin with 1 billion supply and you have sold one coin for $100. Then your market cap will become 100 billion US dollar. Regardless of the fact that you have only sold one coin. So never judge a coin based on its market cap. Rather look for the daily transaction volume and the the volume traded in exchanges. That will give you a better understanding of a coin's performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sgeldercoin",
      "created_time": "December 05, 2022, 06:47:21 PM",
      "body": "I wouldn´t judge a coin on it´s trading volume because it can easily manipulated by a bot, likeit is mostly happens even at big exchanges like binance and other centralised exchanges.Hence the reason coinmarketcap dot com is measuring coins by its marketcap,because this is the most significant.Anyway, GELDC will be listed this month at a coinmarketcap page, although notat coingecko or cmc, because they fear GELDC at top 1 at their pages, becausethey are heavily invested in BTC, ETH and other big coins and if people seeGELDC at the top 1 position, millions would dump Bitcoin and ETH and other coins.So, they strongly avoid to list GELDC, although GELDC doesnt depend on them,because it found, like already mentioned, an other markectcap page whereit gets listed this month December at top 1 position, yes ahead of BTC and ETH,DuuhhhQuote from: avikz on December 05, 2022, 06:38:20 PMQuote from: sgeldercoin on December 05, 2022, 10:35:22 AMHi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)Market cap is a flawed parameter to measure a coin's performance! Let's assume you create a coin with 1 billion supply and you have sold one coin for $100. Then your market cap will become 100 billion US dollar. Regardless of the fact that you have only sold one coin. So never judge a coin based on its market cap. Rather look for the daily transaction volume and the the volume traded in exchanges. That will give you a better understanding of a coin's performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "December 05, 2022, 07:02:51 PM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 10:35:22 AMHi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)Unfortunately your wish will never come through.  Not natter how good the project is, it can't be ahead of btc. Lol, I doubt you understand what you are say. If the coin is a shitcoin (wish I suspect it is) the mc you are so excited about won't last long because such coins only have hype and nowadays a project needs more than just hype stay alive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sgeldercoin",
      "created_time": "December 05, 2022, 07:57:44 PM",
      "body": "I see you don´t understand much about mc.I will post soon a link where you´ll see GELDC top1 ahead of btc, eth and so on.You can check a photo, where it is top 1 already: https://twitter.com/gelderAnd GELDC doesnt need hype, because a top 1 marketcap can´t be taken from a coinwith such high supply like GELDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 05, 2022, 08:09:55 PM",
      "body": "The usual scam, which no one needs. Look at the development of the project over the past 4 years.This graph clearly shows that this is a regular shitcoin, which appeared in 2017 and only once it was pumped so that the owners of this project could make money. This shitcoin has no prospects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "December 05, 2022, 10:49:28 PM",
      "body": "How hard you were promoting your shit scam token. I can even make a new token with name of GELDC SCAM with unlimited token caused by it can be minted anytime and it will have even more marketcap then your shitty crap token. It seems like it doesn't matter how hard people try to told your scam token was nothing. When will you wake up from your dream? Your token was just a scam token and that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 05, 2022, 11:53:26 PM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 10:35:22 AMHi guys, there is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.FYI (a gem in my eyes)Not a single reason why anything about this would be a gem. I can make overpriced token myself, i just give all of the insane circulating supply to my own addresses and make 1 transaction that's overpriced and it's 10x more marketcap then bitcoin. It doesn't mean it would be valuable in reality or that coinmarketcap would fall on the easiest trick ever and list it as legit token.That's what you are trying to sell here. Sorry to say but it's worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RealMalatesta",
      "created_time": "December 06, 2022, 05:49:03 AM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 10:35:22 AMthere is token called GELDC and it has the biggest marketcap of all coinsand if it gets listed at coinmarketcap dot com itwill be top 1 even in front of BTC and ETH and all the other low mc cap coins.That is if it will ever be listed in CMC but doubt it because even the CMC itself will think this coin is too shady. They don't really welcome coins like that because it gives them a bad name. I only wonder if how can this coin have the biggest market cap when this was the first time we hear such coin?What I know is that in order for the coin to achieve a big market cap it will be popular first because that is a sign that many people have pour their money on that coin. Idk why but after looking this coins name it reminds me of elgd or elron gold but this coin do only had a letter c on their name. Well it's not possible to copy the exact name of any existing coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "December 06, 2022, 08:14:58 AM",
      "body": "as you said being number 1 top over bitcoin and eth. Lol You say it will be a big coin with high volume number and the best among other coins but there is no valid proof of all but just some bullshit to scam others out of shitcoin.i really appreciate everything you said for your own coin promotion but you are going the wrong way. all of us who are here already know all about the shitcoin fraud that has occurred several times. so there is no other way but to ignore shitcoin going forward.You also missed this one. if indeed the coin you are promoting can be the best coin on the market later, why don't your coin create its own blockchain? why is it still on the ethereum chain? while you say you will be number 1 coin over eth",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sgeldercoin",
      "created_time": "December 06, 2022, 08:41:05 AMLast edit: December 06, 2022, 09:15:45 AM by sgeldercoin",
      "body": "Tell me the source of this chart.To the other guys: we talk later. And of course everybody can make such coin, although the difference between you guys and the dev of this coin is: HE DID IT AND it has already 619 hodler, hehe.Quote from: Xal0lex on December 05, 2022, 08:09:55 PMThe usual scam, which no one needs. Look at the development of the project over the past 4 years.https://i.imgur.com/cKHawIV.pngThis graph clearly shows that this is a regular shitcoin, which appeared in 2017 and only once it was pumped so that the owners of this project could make money. This shitcoin has no prospects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "December 06, 2022, 09:43:15 AM",
      "body": "Quote from: sgeldercoin on December 05, 2022, 06:47:21 PMI wouldn´t judge a coin on it´s trading volume because it can easily manipulated by a bot, likeit is mostly happens even at big exchanges like binance and other centralised exchanges.Hence the reason coinmarketcap dot com is measuring coins by its marketcap,because this is the most significant.Anyway, GELDC will be listed this month at a coinmarketcap page, although notat coingecko or cmc, because they fear GELDC at top 1 at their pages, becausethey are heavily invested in BTC, ETH and other big coins and if people seeGELDC at the top 1 position, millions would dump Bitcoin and ETH and other coins.So, they strongly avoid to list GELDC, although GELDC doesnt depend on them,because it found, like already mentioned, an other markectcap page whereit gets listed this month December at top 1 position, yes ahead of BTC and ETH,DuuhhhAnd you still couldn't share the other market cap site where your shitToken is listed. So because to create some humungous number of shitTokens that are trading for 0.00000000032 USD, you can easily do multiplication and conclude as you have done here; QuoteTake that 0.00000000032 and multiply it with the supply of the GELDC token (you find the supply in their whitepaper also to find at their telegram group) and you get an atounding amount of $$$ high marketcap, to be exact: hti bigest marketcap of all coins and top 100 companies combined. that makes it better or bigger than BTCitcoin or even Ethereum   Pls if I might ask, is this your website with all your huge market cap?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "December 06, 2022, 09:57:34 AM",
      "body": "OP, so you are the owner of the project? or just a representative? even I don't see your announcement thread is active.you are trying to make marketing on forums, but I don't think it's a good way. if you have a good market I think you and your shitcoin know very well how to make forum marketing.good luck with your shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}