{
  "id": "topic_5410886",
  "title": "A.L.F.",
  "author": "A.L.F.",
  "created_time": "August 23, 2022, 05:37:47 AMLast edit: January 26, 2023, 12:48:16 AM by A.L.F.",
  "content": "Вся приведенная ниже, от моего имени, информация о биткоине основана только на анализах диаграмм его цены в разные годы-месяцы-дни, сделанных лично мной.  Я не опираюсь на материалы СМИ, \"инсайдерскую информацию\", высказывания толстосумов криптомира, как широко известных так и малоизвестных и неизвестных вовсе, и в моих выкладках они не используются (как, впрочем, и ТА с ФА ...в догонку). Я не рекламирую стартапы, монеты, финансовые организации, способы быстрого заработка и \"энерго-заряженные талисманы\", я не рекламирую Н-И-Ч-Е-Г-О. Если ОДНАЖДЫ вы увидите подобное в моих публикациях, значит под моим ником пишет кто-то другой (однажды мой аккаунт уже угоняли, вернул без труда, но репутацию успели подпортить основательно).  Для торгующих \"с плечом\" не рекомендую ориентироваться на мои конечные цифры, т.к. перед непосредственным заходом на цель рынок склонен делать небольшие петли в противоположную сторону, выбивая стоп-лоссы.  Я рекомендовал бы в этой ветке публиковать не картинки целиком, а только ссылки на них (и лишь когда такое действительно необходимо). Поясню: многим зачастую, анонимным пользователям, просматривающим мою ветку через бесплатные vpn с очень узкой полосой пропускания, где интернет еле шевелится, приходится очень долго ждать полной загрузки страницы, \"картинки в полный рост\" могут в разы сильнее тормозить этот и без того медленный процесс либо вовсе его прервать. Поэтому \"картинки в полный рост\", по крайней мере ЗДЕСЬ, я не приветствую.  Просматривая ветки этого форума \"о сакральных гаданиях и предсказаниях\" за последнее десятилетие, заметил , что все они начинались на пике цен коинов и ажиотажа, поднимаемого адептами этой религии, а когда монеты, одна за другой, начинали падать в гавно на дно, гул стихал и ветки сами-собой умирали. Сейчас практически весь крипторынок уже на дне, ...н-ну хоть в этом моя ветка  отличается от остальных.  Данный топик поможет новичкам поскорее потерять свои монеты, что еще больше обогатит и без того разжиревших толстосумов.  (Поскольку модератор волевым решением \"склеил\" два моих поста в один, я восстановлю ЗДЕСЬ время его публикации)       August 23, 2022,  06:58:12 PM (GMT)  Две НЕновости. Одна, как водится, плохая.  1. В последние 4 суток ценник биткоина прилип к линии поддержки/сопротивления(в дальнейшем просто \"ПС\"), проходящей в диапазоне $20800...$21000 (в данную минуту уже в пятый раз пытается ее продавить) и готовится откатится на $19930. Значение уровня получено на основе отрезка графика с 21.08.2022 00:00 по сей момент, вероятность >90%.  2. После достижения исторического минимума этого года $17600, биткоин с 18.06 по 30.07 нарисовал на графике несколько \"холмов\", позволяющих судить о настроениях немногочисленной. но очень гордой группы покупателей. Они готовятся к \"походу\" на $58000 и начнется эта веселуха этот разворот 2-го сентября, так что можно не торопиться, не рвать прям с ветки, а \"на пока\" подставить ведра снизу. Как и в первом случае, вероятность очень высокая.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410886",
  "comments": [
    {
      "author": "xandry",
      "created_time": "August 23, 2022, 10:03:47 AM",
      "body": "Quote from: A.L.F. on August 23, 2022, 05:37:47 AM  Просматривая ветки этого форума \"о сакральных гаданиях и предсказаниях\" за последнее десятилетие, заметил , что все они начинались на пике цен коинов и ажиотажа, поднимаемого адептами этой религии, а когда монеты, одна за другой, начинали падать в гавно на дно, гул стихал и ветки сами-собой умирали. Сейчас практически весь крипторынок уже в гавне на дне, ...н-ну хоть в этом моя ветка  отличается от остальных.  Данный топик поможет новичкам поскорее потерять свои монеты, что еще больше обогатит и без того разжиревших толстосумов.Чем собственно ваша тема отличается от других с обсуждениями курсов?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 23, 2022, 10:33:34 AMLast edit: September 01, 2022, 05:59:25 PM by A.L.F.",
      "body": "Quote from: xandry on August 23, 2022, 10:03:47 AMQuote from: A.L.F. on August 23, 2022, 05:37:47 AM  Просматривая ветки этого форума \"о сакральных гаданиях и предсказаниях\" за последнее десятилетие, заметил , что все они начинались на пике цен коинов и ажиотажа, поднимаемого адептами этой религии, а когда монеты, одна за другой, начинали падать в гавно на дно, гул стихал и ветки сами-собой умирали. Сейчас практически весь крипторынок уже в гавне на дне, ...н-ну хоть в этом моя ветка  отличается от остальных.  Данный топик поможет новичкам поскорее потерять свои монеты, что еще больше обогатит и без того разжиревших толстосумов.Чем собственно ваша тема отличается от других с обсуждениями курсов?От обсуждения уже рассчитанные уровни не изменятся (на Небе это знают, потому и вопросов не задают). Я не обсуждаю \"курсы\", а выкладываю найденные цели (или диапазон, после пристального разглядывания диаграмм и наслоений \"тонкого мира будущего\" на них) и/или примерную дату, и по возможности, могу уточнить \"неочевидное\" или ответить на вопрос. Эти цифры предназначены для новичков (\"не вляпайтесь!! еще успеете.\"). Передаю им право самим решать вестИ ли обсуждение/ния, если да, они могут это сделать между собой, причем не обязательно в ЭТОЙ ветке.  (Поскольку модератор волевым решением \"склеил\" два моих поста в один, я восстановлю ЗДЕСЬ время его публикации.)       August 23, 2022, 6:55:51 PM (GMT)Quote from: Excimer on August 23, 2022, 03:24:58 PMТема - огоньQuote from: xandry on August 23, 2022, 10:03:47 AMЧем собственно ваша тема отличается от других с обсуждениями курсов?Пожалуй отправить бы в trashcan тему. Засоряет локаль  н-Да. Представляю себе ваше с ним общение.  Во первых, я должен сказать вам спасибо за накрутку счетчика постов в моей ветке, но должен не означает сказал (?!).  Во вторых, пожалуй, настал момент сказать сакраментальную фразу: \"девочки не ссорьтесь\", ...плз!  Ну и в третьих, поскольку вижу вы большой специалист в этом вопросе, а сколько звезд то на погонах-нах-нах уувввааауууу, ну просто чума(!!!), девки наверно в койку так и лезут то потрудитесь подтвердить свою состоятельность в данном закоулке \"человеческого знания\" или хоть как-то ее обозначить, прежде чем давать такие смелые наставления модератору, ...он взрослый мальчик, думаю разберется и без сопливых, год регистрации у него на форуме тот же, что и у меня, только вот \"они потом пошли в графья, а мы в артисты\".  Для начала, например, могу \"обозначить\" свою.  После этого поста ...ну разумеется моего... едва ли не вся ветка форума НА НОЧЬ \"закупилась попкорном\", чтобы наблюдать так сказать в ПРЯМОМ ЭФИРЕ глобальный разворот того Эфира (смешно получилось) ...и те кто поставил ордер на озвученное мной значение – 0,00834 – уже к утру насыпали ведра полностью и по приемлемой цене, а к обеду – еще и в неплохом плюсе были, благодаря резкому росту монеты. А те кто ставил на 0,008 (как предлагал  Yaremi) – практически ничего не купили, хоть цена и коснулась этого значения.  К слову, а вы чем занимались в те годы (?!), ах да-а, припоминаю, вас же тогда еще и \"в проекте\" не было. Вы ведь на форуме только в 2019 появились (не могу сказать что сожалею). Может раньше вы были кем-то другим(?) и у вас угнали АКК(?) ...н-н-не(?)  ...захотелось потроллить (?) ...возвернетесь через недельку – вместе позлорадствуем!! С такого расстояния не могу разглядеть ХТО ВЫ? ...симпатичный мальчик или страшненькая девочка? ...а?...немногословный вы наш. Можете не отвечать, ну т.е. можно не прям щщщас, подготовьтесь... и хрестоматия русской литературы вам в помощь..., ну или википедия,  на худой конец надеюсь за \"худой конец\" меня не забанят.P.S.  Хочу предостеречь горячие головы с воспаленным воображением, что любые совпадения имен персонажей с именами реальных людей случайны, а все описанные выше события – вымышлены.  А для особо одаренных остальных повторяю, ВЕТКА ОРИЕНТИРОВАНА НА НОВИЧКОВ, а не на полных членов, т.е. я конечно же хотел сказать ДЕЙСТВИТЕЛЬНЫХ.... н-ну то есть не так чтобы уж(!!)... ну, в общем, вы поняли?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 24, 2022, 06:55:02 AMLast edit: August 28, 2022, 06:52:03 PM by A.L.F.",
      "body": "Судя по движению котировок, в последние 40 часов появился новый покупатель, желающий \"спекульнуть по тихому\". Резво принявшись вытягивать биток к цели $23000 (видимо надеясь на солидарность некоторых \"чумных голов\") к сегодняшнему утру подустал и взял передышку, возможно просто закончились заемные средства.К настоящему моменту, в последние 3 часа, эти попытки продолжились, но с гораздо меньшим напором, видимо выгребает оставшиеся крохи. Вероятность продолжения штурма указанной цели крайне низка (<20%).  Хотя... существуют и более \"приземленные\" обьяснения подобных ситуаций. Для тех кто отслеживает суточные объемы торгов на КРУПНЫХ биржах, не секрет, что как только он падает до \"определенного\" уровня, биржа начинает двигать рынок в сторону максимальной ликвидности (менять цену), Задачей таких манипуляций является максимальное наращивание объема торгов, но при минимально возможном изменении цены. А внешне это выглядит как приход нового БОГАТОГО Буратино игрока.  Для нашего случая, обе эти причины не могли вызвать не только прыжок цены выше $23000, но и хоть сколько-нибудь к нему приблизиться.Линия ПС, а точнее их там сразу две(почти параллельные наклонные), сегодня еще немного приподнялась, одна до $20964, другая до $21067 (вчера было $20908 и $20999 в это же время). И, конечно же, не смотря на то, что за последние 5 суток сила покупателей не изменилась, а сила продавцов продолжает заметно слабеть, по прежнему сохраняется крайне высокой угроза обвала ниже $20000. Т.е. видимо стоит продолжать держать ликвидность в баксах.  (Поскольку модератор волевым решением \"склеил\" два моих поста в один, я восстановлю ЗДЕСЬ время его публикации)       August 24, 2022,  05:16:08 PM (GMT)  Картина \"на сейчас\" примерно такова (новые значения).  1. Рынок почему-то зажат заперт в узком диапазоне пол...потолок/$20400...$21950(либо $22150 ...до сих пор уточняю). И это состояние продлится до конца месяца, плюс минус лапоть. Любителям подзаработать на коротких дистанциях похоже будет где порезвиться, не опасаясь \"выпасть\" из диапазона.  2. 2-е сентября, о котором я ранее упоминал – это не дата праздника под названием \"разворот рынка\" как я считал ранее, а окончание текущего цикла с данным узким  диапазоном.  Выводы: Упомянутые ранее цели $19930 и 23000$ – есть, но до окончания цикла(т.е. 02.09.2022) они не достижимы из-за \"низкого потолка и высокого пола\".  Вопрос: Может ли что-то нарушить эту идиллию?  Ответ:   Не знаю.. вероятно да, например, громкая новость, фейк, ...  Вопрос: Почему рынок не достает до пола, а упирается в линии ПС?  Ответ:   Когда линии ПС(они восходящие) поднимутся к потолку, рынок их продавит и сможет дотянуться до пола.Похоже на то, что до конца месяца писать мне не о чем...P.S.  Предыдущий пост содержал ошибку по поводу линии ПС: $221067; должно быть $21067 (сейчас уже исправил, разумеется, шестизначного значения быть не могло).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 27, 2022, 05:04:51 AMLast edit: August 28, 2022, 06:49:02 PM by A.L.F.",
      "body": "Вот так, вылетая на встречную полосу, подумаешь, что хуже уже некуда  ...и тут же получаешь удар \"взад\".  Три дня назад я полагал, что мог ошибиться с \"потолком\" на 200 пунктов, а сегодня выясняется, что на все 300 пунктов я мог ошибаться с нижней границей диапазона.     Настает момент истины, оптимисты теперь ждут движения к $23000, а пессимисты ставят вёдра на $19930, а возможно и ниже. Я полагаю - рынок вернется к линиям ПС в район $ 21100.  Вероятно, в СМИ проскочила НЕКАЯ новость и поэтому крупные биржи, а точнее их \"чудаки на букву М\" MoneyMaker's решили \"подстраховаться\", опустив пардон  рынок ниже плинтуса. Когда фейк растает, торги вернуться к прежнему уровню.  (Поскольку модератор волевым решением \"склеил\" два моих поста в один, я восстановлю ЗДЕСЬ время его публикации)       August 27, 2022,  04:49:27 PM (GMT)  Все озвученные ранее угрозы, которые могли произойти – теперь произошли, угроз больше не осталось, осталось только фиаско, простите за черный юмор.  Тот небольшой графический материал торгов, что \"нарисовался\" сразу после обвала, никаких целей ниже текущих ($19800) не показал, он показал, что покупатели нацелились на прежние \"дообвальные уровни\" (около $21,5 k), а продавцы (т.е. те кто упорно двигал его вниз)... дальше говорить не буду, потому что сам пока не понимаю, как такое может быть, впервые с таким встречаюсь, но выглядит неплохо. Позднее, возможно, дополню этот пост. Я не пытаюсь никого успокоить.  \"Позднее\" уже наступило (прошло три часа).  Стали проявляться границы текущего коридора (пока ориентировочно): $19750...$20150. Говорю \"ориентировочно\", потому что возможно верхнее значение $20300. Позднее, возможно, дополню этот пост.  И снова здрасьсьсьсте (прошло ещё 11 часов).  Ни плохих, ни хороших новостей нет, по поляне от $14k до $18k разбросано несколько едва заметных целей с вероятностью 5%...10%, это видимо ожидания некоторых мелких групп трейдеров, просматриваются две цели с вероятностью 20%...30%, выше нынешних уровней, одна на $21000, другая на $21700, причем переходящих одна в другую, эдакая \"двухэтапная\", если в последующие часы график \"дорисует\" подтверждение этих целей, появится надежда...  На всём интервале от момента локального минимума просматриваются вялые систематические попытки разворота рынка вверх, ждём-с...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 28, 2022, 03:53:51 PM",
      "body": "Ещё одна цель, чуть выше границы коридора, на $20430, вероятность 50%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 29, 2022, 01:57:33 AMLast edit: September 01, 2022, 10:10:56 PM by A.L.F.",
      "body": "Вот, кажется, и \"фиаско\" подоспело. У нас только математика, а у НИХ все деньги мира: расклад просто уху... ух какой расклад!!!  единовременно,менее чем за 1 минуту, \"ради прикола\" !! ..вброшено 350 монет ($70 000 000) лишь на одной из крупных бирж.  Видимо, \"Спецоперация прошла успешно\" и перед нами опять ...\"новая реальность\", и 2% потерянного депозита.  Цифры.Рынок \"слегка не додавили\", расчитывали на $19370, а смогли сломать лишь две линии ПС и границу коридора, значит могут попытаться ещё разИК.Скоро рынок (во второй уже раз) поднимется до $19720, а далее, видимо, они опять начнут атаку.  Ещё одна цель в диапазоне $22350...$22400 с вероятностью >80%. Случай в своём роде уникальный, её влияние на рынок просматривалось всю последнюю неделю, во многом благодаря ей (т.е. людям, которые за ЭТИМ стоят) рынок был \"вытянут за уши\" из последней недавней \"мёртвой петли\" и поднят к цели, о которой я упомянул 22 августа, сори,  28 августа.  Показательная...такая...не знаю как назвать. Цель, которую даже может не достигнут, уже повлияла на многое.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 30, 2022, 04:01:41 PMLast edit: August 30, 2022, 07:36:58 PM by A.L.F.",
      "body": "\"Нельзя войти в одну реку дважды\", но крипторынок это сумел сделать, по масштабу обвал равноценен обвалу 26 августа и сейчас около $19700. Никаких предпосылок к этому не было (кроме, возможно политико-экономических, новостных, либо майнеры опять забыли заплатить вОвремя за электричество, также возможно, что рынок ну конечно же воротилы, которые им управляют пытается избавиться освободиться от тех кто торгует на заёмные средства, а возможно и друг от друга). На крупных биржах дневной оборот приличный, у них не видно причин двигать цену.  По оценке его(обвала) поведения динамики за последние 2 часа, он \"не собирается\" идти ниже $19500 (прошлый минимум).-----------------------------После 16:30 GMT динамика стала меняться, рынок способен упасть до $19300.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "August 31, 2022, 09:02:32 AMLast edit: September 01, 2022, 10:22:21 PM by A.L.F.",
      "body": "В свете событий последних дней, рынок всё больше становится как чёрное полотно, ниЧО не разглядеть. Ни продавцы, ни покупатели \"уже никуда не хотят\", рынок намерен водить хороводы вокруг $20200 и ждать \"взмаха крыла\" очередного ММ.  Можно сказать, что есть слабые признаки скатывания рынка к $19900 в течение следующих 4 часов, вероятность 20% или чуть более. Все ранее озвученные цели остаются \"в силе\". Общий тренд рынка последних дней – восходящий,  $120 в сутки.  Сейчас уже произошёл отскок от $19900, но пик его ($20200) пройден и цена снижается.  Появились основания полагать, что возможен и третий обвал, на этот раз цена может долететь до $18900, о степени вероятности: >20%. Не хотелось бы наводить панику, но если кто не успел закупить монеты на $19930 и ниже в течение предыдущих снижений цены, то в период ЭТОГО снижения не рекомендую покупки на уровнях $19800...$19300, т.к. там разворота может и не состояться (не смотря на 6 линий ПС). Да и цена, вполне возможно, надолго застрянет в области $19000. По времени: завтра ближе к вечеру (по МСК), но оглядываясь на предыдущие обвалы, не уверен, что ОНИ... а здесь должна зазвучать тревожная музыка из \"бондиады\" ...будут кого-то или чего-то дожидаться.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 01, 2022, 02:36:44 PM",
      "body": "Прежде чем озвучить изменения на данную минуту, сделаю одну важную оговорку.  Если бы я не был уверен, что где-то сидит сумасшедший с мешком монет, готовый в любой момент вбросить их на рынок и обвалить его как минимум до $118900, угроза не \"СТРАШНО\" вероятная, но всё ещё остается угрозой, то я бы наверняка поверил в те яркие перспективы, которые рисует рынок в последние дни.  Продолжается разворот рынка вверх (это по \"объективным\" расчётам). \"Объективно\", рынок готов к взлёту за границу $22000. Никаких  сколько-нибудь заметных целей \"внизу\" нет, если забыть об этой \"маленькой неприятности\" в виде возможной катастрофы с вероятностью 20%, но...  нельзя. Когда она исчезнет я не знаю, вероятно, когда исчезнут её явные и неявные признаки. Это, как минимум... ч-ч-чччЁрт его знает скОКА времени.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imhoneer",
      "created_time": "September 01, 2022, 07:37:25 PM",
      "body": "Quote from: A.L.F. on September 01, 2022, 02:36:44 PM  Прежде чем озвучить изменения на данную минуту, сделаю одну важную оговорку.  Если бы я не был уверен, что где-то сидит сумасшедший с мешком монет, готовый в любой момент вбросить их на рынок и обвалить его как минимум до $118900Я ведь Вас правильно понимаю, что свои прогнозы Вы пишите из будущего, прикидываясь здесь неопытным прогнозистом, но иногда проговариваетесь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 01, 2022, 08:12:22 PMLast edit: September 01, 2022, 11:04:51 PM by A.L.F.",
      "body": "Quote from: imhoneer on September 01, 2022, 07:37:25 PMQuote from: A.L.F. on September 01, 2022, 02:36:44 PM  Прежде чем озвучить изменения на данную минуту, сделаю одну важную оговорку.  Если бы я не был уверен, что где-то сидит сумасшедший с мешком монет, готовый в любой момент вбросить их на рынок и обвалить его как минимум до $118900Я ведь Вас правильно понимаю, что свои прогнозы Вы пишите из будущего, прикидываясь здесь неопытным прогнозистом, но иногда проговариваетесь.                   В точку..!...когда планируете сделать первые десять иксов в своём \"imhoneer investment fund\" (?), мол, я-то знаю ... я так понимаю, у нас неторопливая \"светская беседа\" за клюшкой.. \"в гольф\". И да, спасибо за обнаруженную опечатку. Говорят, что такие вещи выдают тайные страхи человека.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 02, 2022, 01:29:24 PMLast edit: September 02, 2022, 05:10:28 PM by A.L.F.",
      "body": "В данный момент цена несколькими рывками вверх приблизилась к $20400, многие наверняка  думают во-попёрло-вО-попЁРЛО (!), о некоем переломе. Нет повода так думать.  Пока последние 2-е суток рынок шёл вниз паутинка тонких сопредельных миров находилась в равновесии не просматривалось никаких дополнительных признаков, увеличивавших риск обвала. Но как только он пошёл вверх, опять стали проявлять себя цели в области $19000, все они лежат на условной восходящей линии. полагаю, когда она сравняется с нынешними уровнями, или чуть раньше, короче, когда риск обвала станет минимальным тогда и начнётся \"настоящий подъём\". P.S.  Сейчас ЭТА линия проходит через уровень $19220, а через сутки (в это же время) будет на $19500. Простите, ошибся, будет $19390.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imhoneer",
      "created_time": "September 02, 2022, 03:56:15 PM",
      "body": "Quote from: A.L.F. on September 01, 2022, 08:12:22 PM...когда планируете сделать первые десять иксов в своём \"imhoneer investment fund\" (?)В течении ближайших пяти лет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 03, 2022, 09:50:35 AMLast edit: September 03, 2022, 04:59:40 PM by A.L.F.",
      "body": "Quote from: imhoneer on September 02, 2022, 03:56:15 PMQuote from: A.L.F. on September 01, 2022, 08:12:22 PM...когда планируете сделать первые десять иксов в своём \"imhoneer investment fund\" (?)В течении ближайших пяти лет.  ..значит откапываем шампанское через 5 лет, только вот, сначала его нужно туда закопать.  А теперь надо вернуться к нашим бара... (у-упс!) , делам нашим скорбным.  Рынок скользит вниз вдоль одной из линий ПС, которая \"примерно\" через 13 часов упрётся в узел (для самых-самых новичков поясню, это такая точка, где сходятся много-много линий ПС) \"приблизительно\" на уровне $19450, а дальше всё просто \"...либо я веду её в ЗАГС, либо она меня ведёт к прокурору..\", либо нисходящая свеча бьёт точно в узел и рынок взлетает вверх (возможно не выше нынешних \"потолков\", а возможно и... всякое бывает), либо, если чуть раньше или чуть позже минут десять-двадцать...и т.д. – падение медленно тормозится и не факт что вынырнет вверх.  Есть третий вариант, рынок вообще не \"опустится\" до такого позора.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 04, 2022, 09:54:20 AMLast edit: September 04, 2022, 10:44:48 AM by A.L.F.",
      "body": "Ожидания на \"жёсткий\" сценарий, когда противостояние можно было завершить одним \"железным блоком\", не оправдались. Рынок пошёл по более мягкому, теперь об уверенном развороте можно будет говорить не ранее \"неделю спустя\". А пока – рынок \"опасливо косИтся\" на $20k (\"нарисовал\" её в последние сутки) и при этом сейчас \"весь в раздумьях\".  P.S.  Только спустя почти час после написания этого поста посмотрел статистику суточных объёмов крупных бирж, \"...н-ну о-оочень маленькие, но сегодня...\" как бы не случилось беды!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 05, 2022, 10:52:23 PMLast edit: September 06, 2022, 12:12:16 AM by A.L.F.",
      "body": "Сегодня (почти) никаких цифр приводить не буду из-за отсутствия должного исходного материала (графиков), на котором обычно делаю свои выкладки.  С момента моей последней публикации, рынок рисует нечто похожее на лоскутное одеяло вместо графика. Короткие спокойные участки чаще обычного разделяют внезапные взлёты и падения на примерно равные ценовые дистанции. Склонен считать, что так теперь \"работают\"(по новой \"метОде\") некоторые централизованные биржи для принудительной накрутки своего суточного оборота. Не уверен, что выкладки на основе таких \"исходников\" дадут верный результат.  Надеюсь эта чехарда ненадолго, и скоро снова всё станет \"РОВНО\".  Единственный вывод который я могу сделать, складывая взаимоуничтожая \"подёргивания\" с противоположной направленностью и затем \"сшивая\" эти лоскуты воедино: последние 40 часов цена медленно, но поступательно росла в темпе $170/сут. Как только вышеозвученная причина исчезнет можно будет сделать более вразумительную оценку о реальном положении на рынке.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 06, 2022, 03:23:34 PMLast edit: September 06, 2022, 04:30:54 PM by Xal0lex",
      "body": "Всё очень плохо (темпы разворота – на нуле, темп роста ушёл в минус, критический уровень, после которого может начаться обвал: $19600). Возможный текущий уровень, вокруг которого будет ещё несколько часов ходить рынок: $19770.  \"...Не умоляя всего вышесказанного...\", короче, если случайно заметите, что в следущие пару дней цена уже \"взошла\" до $20800 – безжалостно фиксируйте прибыль, это может оказаться последней радостью в этом году.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 07, 2022, 12:39:52 PMLast edit: September 07, 2022, 01:02:29 PM by A.L.F.",
      "body": "Последние 17 часов цена катится вниз со скоростью $270/сут. по одной из линий ПС. Остановок не планируется.  Биржи \"наелись\", их боты отдыхают. А когда проснуться, то возможно начнут \"демонстрировать\" рывки к $19300.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A.L.F.",
      "created_time": "September 08, 2022, 02:05:43 PMLast edit: September 08, 2022, 03:32:24 PM by A.L.F.",
      "body": "\"Верх\" абсолютно чистый, т.е. совсем ничего, \"низ\" – неопределённый, т.е. последние оптимисты беспорядочно сбрасывают остатки монет, торги в основном идут между биржами и с \"нулевым профитом\", их боты явно не в состоянии либо не стремятся \"вытянуть\" рынок выше $19500. По некоторым признакам объём фейковых ордеров давно перевалил за 80%. Выделить слабый, хоть сколько-нибудь \"полезный сигнал\" из графика о \"настроениях реальных трейдеров\" можно будет спустя ..не знаю даже какое.. время. \"...и тоже бросилась в бурное море ...и сия пучина поглотила ия в один момент ...короче все умерли...\".  Динамика торгов позволяет предположить скатывание цены в ближайшие часы ниже $19000 (много ниже).  P.S.  Хоть я и \"весьма далёк\" от интриг мира БОЛЬШИХ финансов, но картинка явно проступает \"какая-то кривая\". Либо ММ-щики сознательно пытаются \"выгреБСти\" остатки с крипторынка, чтобы позднее продать свой актив (не монеты, а биржи ЦЕЛИКОМ), ведь на нынешних уровнях цен больших оборотов не сделать, а при дальнейшем падении... ясно-понятно. Либо им придется в ближайшее время начать вливать огромные средства, предварительно конечно же освободившись от тех, кто замутил такую х.. \"хорошую\" ситуацию. ...ну эт-т станет понятно лишь к концу сентября.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}