{
  "id": "topic_5463711",
  "title": "gligoresti",
  "author": "gligoresti",
  "created_time": "August 18, 2023, 03:24:06 PM",
  "content": "Dears,Please help me to understand what happened with a bct transaction I made from one cold wallet address to another. In short: I transferred the correct amount in the receiving address and when I check the status, it appears another transaction with a similar but smaller amount to a total unknown btc address. This unknown transaction appears on top of my correct transaction. The transaction(s) is pending since one hour and in the explorer it shows that the transaction will be completed in 12 hours.Can someone please explain what happened?Best regards, g",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463711",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "August 18, 2023, 03:25:31 PM",
      "body": "If you see two addresses, the second address is your change address. Assuming someone sent you 1 BTC. You send 0.6 BTC to Mr A, the remaining 0.4 BTC would be sent back to an address on your wallet that you used to make the transaction. To check high priority fee, use mempool fee rate like https://mempool.space/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 18, 2023, 03:30:39 PM",
      "body": "As mentioned above, this is most likely your change address. A malware wouldn't act that way probably. Not sure which wallet you're using but, you can read this article from Trezor [1] for a better understanding.You should be able to see the transaction you've received in your transactions history though, whether it got confirmed or not.[1] https://trezor.io/learn/a/what-is-a-change-address",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 18, 2023, 03:41:04 PM",
      "body": "There is nothing that appears suspicious based on what I understand from your statement.You have send out a transaction using the giving estimated fee which your cold wallet provided to you, which as of the time of sending that might appear to be the best and you proceed with the transaction with the agreed fee, but checking from the explorer you are seeing a 12hours time frame remaining in other for the transaction to undeer go 1 block confirmation. It's obvious that fee has changed, and the estimated time most time don't usually take that long in other for it to get confirm. So you just have to be patient, as I don't see anything suspicious their, unless their are other suspicious activities not listed above that you have observe while using the cold wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 18, 2023, 03:47:21 PM",
      "body": "Quote from: gligoresti on August 18, 2023, 03:24:06 PMDears,Please help me to understand what happened with a bct transaction I made from one cold wallet address to another. In short: I transferred the correct amount in the receiving address and when I check the status, it appears another transaction with a similar but smaller amount to a total unknown btc address. This unknown transaction appears on top of my correct transaction. The transaction(s) is pending since one hour and in the explorer it shows that the transaction will be completed in 12 hours.Can someone please explain what happened?Best regards, gLooks like you made some transaction of BTC and it is getting delayed and that's a normal thing because the delay is due to the priority level of your transaction. For example, if you could see at mempool explorer you would find their levels of priority with respect to Fee. Low priority level has fewer fees and fee increases with level. This means, if you have manually selected the fee which is not an option that could be seen in every wallet (feature known as RBF), or if your fee is selected automatically then the reason behind the delay is.Other transactions have high priority as there makers paid more fee then your one that's why your transaction is getting delayed and do not worry to see the 12 hours deadline because that could decrease to 1 hour or 1 minute when the congestion will decrease (traffic or load on blockchain or there will be less transactions).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 18, 2023, 03:49:51 PM",
      "body": "Quote from: gligoresti on August 18, 2023, 03:24:06 PM<...>Just to exemplify, if you transacted under the balance of the address you sent the funds from, you should be seeing something like what is displayed for this (random) transaction:https://blockchair.com/bitcoin/transaction/d24c75eb10fa7e77cd6e839025afe2c793f6328c80335ef682fb9d4caacb2f1eThe Senders address in the above example had 0.00017932 BTC. He then sent 0.00007667 BTC to another address, spent 0.0000686 BTC on the TX fee, and got 0.00003405 BTC in change. The change is sent to a different (new) address on the Sender’s wallet. Note that this all happens within a single TX. You mention a second TX, but I figure you mean a second address within the same (single) TX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "August 18, 2023, 04:45:07 PM",
      "body": "Quote from: gligoresti on August 18, 2023, 03:24:06 PMDears,Please help me to understand what happened with a bct transaction I made from one cold wallet address to another. In short: I transferred the correct amount in the receiving address and when I check the status, it appears another transaction with a similar but smaller amount to a total unknown btc address. This unknown transaction appears on top of my correct transaction. The transaction(s) is pending since one hour and in the explorer it shows that the transaction will be completed in 12 hours.Can someone please explain what happened?Best regards, gLet us make it clear.You made a transaction from 'X' address to 'Y' address.And you see another transaction in your history that you didn't authorize.Sending funds from 'X' address to an unknown address.If this is what you are saying then your wallet is compromised and someone double spent your unconfirmed funds to their wallet.Can you please check if the second transaction is confirmed yet or not?If yes there is no way to retrive your funds back, if not replace the transaction ASAP with the highest possible fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "August 19, 2023, 02:47:56 PM",
      "body": "Bitcoin uses an UTXO[1] transaction model and not an account transaction model. An easy to follow explanation can be found here:https://learnmeabitcoin.com/beginners/transactionsI suggest you hang out a while on that site as it explains a lot of the inner mechanics of Bitcoin in a nicely descriptive way. Mostly easy to understand and quite detailed if you want it. I regularly visit learnmeabitcoin.com when details of Bitcoin faded from my memory.As others have already indicated, you can spend an UTXO only as a whole and if it's bigger than you want to transfer to your target address, you want to have the surplus change back into your own wallet as an additional so called change output in your transaction.[1]: Unspent transaction output",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}