{
  "id": "topic_5452614",
  "title": "pooya87",
  "author": "pooya87",
  "created_time": "May 13, 2023, 02:22:15 PM",
  "content": "Quote\"Die folgende Energiekrise traf die Wirtschaft praktisch unvorbereitet und mit voller Wucht.\"\"The energy crisis that followed hit the economy almost unprepared and with full force.\" says Patrik-Ludwig Hantzsch, Head of Creditreform Economic Research in Neuss, summarizing the development of 2022.In a study published on May 11, 2023 by the German credit agency creditreform it is revealed that last year (2022) because of the energy crisis that Europe experienced the number of insolvencies grew by 24.2% in Western Europe (EU-14, Britain, Switzerland and Norway) which is 139,973 companies and by 53.5% in Eastern Europe which is a total of 60,010 companies.The largest increase of insolvencies were among these countries:1. Austria 59.7%2. Britain 55.9%3. France 50.0%4. Belgium 41.7%QuoteInflation, Energiemangel und weitere gesamtwirtschaftliche Probleme haben die Zahl der Unternehmensinsolvenzen in Europa deutlich ansteigen lassen.Dazu zählte der massive Preisanstieg beispielsweise bei Energie und Rohstoffen sowie auch die deutlich höheren Finanzierungskosten aufgrund der Zinswende. Im Jahresverlauf 2022 schwächte sich auch die Konjunktur spürbar ab.The reasons stated for the huge increase in number of bankruptcies in the study are:1. \"Lack\" of energy (or energy deficiency as I pointed out nearly a year ago)2. High inflation3. \"Massive\" rise in price of raw materials4. \"Massive\" rise in price of energy5. Significantly higher financing costs due to the turnaround in interest rates6. Weakened economyWhat makes it worse is that the energy crisis in Europe is not yet over. In fact expects predict this year it will be worse considering that Russian gas exports to Europe has significantly decreased compared to last year and nowhere near enough replacement has been found. Add to that the ongoing deindustrialization of Europe and as Hantzsch stresses:Quote\"Der Druck bleibt auf dem Kessel, so dass auch in den kommenden Monaten mit steigenden Zahlen zu rechnen sein wird“\"The end of the road has probably not yet been reached. The pressure remains on the boiler, so that increasing numbers can also be expected in the coming months\"Reference: https://www.creditreform.de/aktuelles-wissen/pressemeldungen-fachbeitraege/news-details/show/unternehmensinsolvenzen-in-europa-jahr-2022",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452614",
  "comments": [
    {
      "author": "stompix",
      "created_time": "May 13, 2023, 03:20:43 PMLast edit: May 13, 2023, 03:41:26 PM by stompix",
      "body": "You forgot to add that those 199,983 companies are- 0.86 of the total number of companies in Europe- the increase is from 0.63 the year before, so a huge number 0.2% increase, lolIt contradicts your previous lies about the German bankrupcies:Quote from: pooya87 on September 28, 2022, 07:24:16 AMIn a recent interview in German TV the head of the Federation of German Industries BDI, Siegfried Russwurm pointed out the increasing number of insolvencies in the country. 30% have already declared bankruptcy while about 60% have claimed to go insolvent this season. Only about 11% of the German businesses has claimed to have no issues! Majority of them claimed that they are going to take their capital outside Germany.But as usual, the distorting of truth is your specialty!Also, you deliberately forgot to add the conclusion of that article:Quote\"The balance sheet figures show a slight economic recovery of companies in Western Europe after the deterioration in the first year of Corona,\" explains Hantzsch. Significantly fewer companies would have a negative profit margin. 21.3 percent of the companies still recorded negative EBIT in 2021 (previous year: 26.7 percent). A fifth of the companies (19.6 percent) achieved a very high profit margin of more than 25 percent. Equity ratios have also recovered somewhat. The proportion of companies with a high equity ratio of more than 50 percent rose by one percentage point to 47.2 percent. By contrast, the proportion of companies with a very low equity ratio fell to 22.0 percenHow about you stick to the troubles of the shitshow that is Iran now and the falling rial rather than bitching about Europe and the united states all day?LE:What a non-suprise, what this little propagandist has forgotten to add from the report is the graph of bankruptcies around Europe in normal times:Easy to understand why :https://www.creditreform.de/fileadmin/user_upload/central_files/News/News_Wirtschaftsforschung/2023/Insolvenzen_in_Europa/2023-05-11_AY_OE_Analyse_EU-2022.pdfThere were actually FEWER bankrupcies in Europe in 2022 than in 2019 and 2018!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "May 13, 2023, 11:03:39 PM",
      "body": "The effect of the war in Ukraine didn't only affect business in Europe and America negatively, it affected the entire world. In Africa, many businesses crumbled and there was a high rate of unemployment. Even the news outlet that OP references agreed that the major reason for this business bankruptcy is not only the energy crisis but the effect of the Covid-19 pandemic. Businesses were just gradually recovering from the pandemic before the war broke out. In my country, the price of oil and gas has stabilized and I also heard that Europe has discovered other sources of importing oil and gas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 14, 2023, 02:57:42 AM",
      "body": "I wonder how do those figures translate to euros or dollars. Those are shocking numbers but it's possible those are comprised of small to medium companies, ones which are easily shaken even by slight macroeconomic movements. With the pandemic and the global economy and the invasion all happening almost at one, these relatively small companies will easily cave in.Anyway, a quick glance of the GDP figures at least in the EU, every single country, save for Estonia in 2022, is actually registering positive numbers. Although 2020 was apparently a very bad year for almost all of them, 2021 and 2022 were much better ones.[1] I also wonder how accurate this study is. [1] https://ec.europa.eu/eurostat/databrowser/view/tec00115/default/table?lang=en",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 14, 2023, 03:33:25 AM",
      "body": "Quote from: stompix on May 13, 2023, 03:20:43 PMIt contradicts your previous lies about the German bankrupcies:Quote from: pooya87 on September 28, 2022, 07:24:16 AMIn a recent interview in German TV the head of the Federation of German Industries BDI, Siegfried Russwurm pointed out the increasing number of insolvencies in the country. 30% have already declared bankruptcy while about 60% have claimed to go insolvent this season. Only about 11% of the German businesses has claimed to have no issues! Majority of them claimed that they are going to take their capital outside Germany.While he is generally a quality poster, you made me remember that he said that half a million families had gone homeless in the UK, which I quickly dismantled, and I've been looking for the post to quote it but I don't know if he deleted it because I can't find it. It seems he only wants to see the speck in his neighbours eye. This thread is also quite illustrative:The Economist: 335000 people could \"freeze to death\" in EuropeHow many will have died directly from not being able to heat themselves at the end? Not even 1%. Unless we consider \"freezing to death\" that people over 90 years of age with various risk factors have died after contracting influenza, COVID and other diseases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 14, 2023, 09:26:55 AM",
      "body": "I'm grateful to stompix for clarifying the situation and providing the context. If it's just a 0.2% increase and actually fewer bankruptcies than in some of the previous years, all seems good to me. Of course, 2022 wasn't easy, but I really don't think that sponsoring a terrorist state to get more electricity (which is also not environmentally friendly) is a reasonable solution. I'm glad that the situation isn't as bad as it may have initially seemed, and I don't see why 2023 wouldn't be an improvement over 2022 either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "May 14, 2023, 09:31:20 AM",
      "body": "This Energy crisis will affect Bitcoin Network too as it will be hard to provide energy to mine and process the transactions. I am not sure if it's already affecting it despite having such a huge hash rate working 24/7 * 365 days. I am sure big mining companies are already working on alternative energy options like solar and wind. Let's see how this goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "May 14, 2023, 09:52:22 AM",
      "body": "Another attempt, of course not successful, of manipulating information, and trying to tie the described to the \"needed event.In order to make sure that this is a manipulation, we read two blocks of information:from the author: \"199,983 companies went bankrupt in Europe due to the ENERGY CRISIS in 2022\"and from the article: \"After years of CORONA CRISIS, when companies across Europe were massively subsidized, the reality of a market economy is gradually returning: many companies are unable to cope with permanent crises in the long term. 139,973 company bankruptcies were registered in Western Europe, as well as in Norway, Switzerland and the UK This is an increase of 24.2 percent (2021: 112,686 cases) In Eastern Europe, the situation is even more dramatic.Inflation, energy shortages and other macroeconomic problems  have led to a significant increase in the number of corporate bankruptcies in Europe. In 2022, there were 139,973 business insolvencies in Western Europe (EU-14, UK, Switzerland and Norway). This is an increase of 24.2 percent (2021: 112,686 cases). In Eastern Europe, the number of corporate bankruptcies increased by 53.5 percent. This is the result of a study by Creditreform Wirtschaftsforschung, Neuss.Accordingly, in the past year, European companies had to take on numerous obligations. These include, for example, massive increases in energy and raw material prices, as well as significantly higher financing costs due to changes in interest rates. The economy also noticeably weakened during 2022.\"The question is where in the article it is indicated that \"199,983 companies went bankrupt in Europe due to the ENERGY CRISIS in 2022\" ?  Dear pooya87, maybe in your society, everyone believes in every word and any nonsense, but here are people who know how to use the brain and information",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 14, 2023, 11:02:11 AM",
      "body": "This is capitalism. Some companies went bankrupt while new companies are being created. It's a never ending cycle. There's no tragedy here.The vast majority of those companies are small businesses. Those business owners will be fine and they will soon create new companies(or some of them might get a job).The Russian propaganda keeps screaming about the huge crisis and deindustrialization of Europe, that Europe can't survive without Russian oil ad gas. Obviously, Europe CAN and WILL survive without Russian oil and gas and the situation isn't that bad, but the propaganda never stops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 14, 2023, 01:25:42 PM",
      "body": "Starting with yes it's BS not many more companies went bankrupt then in years previous I have to ask this question being an American and can't find the answer about the EU. Are your bankruptcies there same as our bankruptcies here? Here, a company can go bankrupt but just for debt re-organizational purposes. It still continues to exist, and operate, but all the money it owes people has been reorganized and or wiped out. Or the debtors take over the business and operate it, or instead of shutting down of the banks that were owed money to take it over and try to sell it. Here, you could do the above or just go bankrupt and go out of business. Is it the same there?Does not really matter, but what I thought would be a quick search took me down a rabbit hole with no bottom and no answers.Grumble about accountants and lawyers.....-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 14, 2023, 04:20:37 PMLast edit: May 14, 2023, 04:47:00 PM by pooya87",
      "body": "I wonder if Handelsblatt newspaper received similar weird reactions from trolls when they published the same exact thing I posted here. Or is the reactions like this because I posted it... hmm...Quote from: Poker Player on May 14, 2023, 03:33:25 AM~I always publish the source of the data I post. If you have a hard time believing them, you should either dispute the numbers or take it up with the source. For example the part about 30% bankruptcies the troll doesn't like to mention is the source which was Siegfried Russwurm, head of the Federation of German Industries BDI in an interview on German TV.Quote from: DaveF on May 14, 2023, 01:25:42 PMStarting with yes it's BS not many more companies went bankrupt then in years previousIt depends on which country you look at. For example the number of bankruptcies in UK is between 25 to 30% higher than previous years specifically years before pandemic. Or in countries in Central or Eastern Europe, like Hungary where the numbers grew significantly more compared to 2018-2019 (a 11x increase from 3700 to 41500).Or in Turkey [which is included as parts of stats in Europe (!)] the number of bankruptcies grew by 80% compared to 2018.On the other hand there are of course some other countries that set a better stats, like Greece with 50% decrease compared to 2018. Or Italy with 30% decrease.However, the overall as the study says shows an increase in the number of insolvencies across Europe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "May 15, 2023, 08:00:57 AM",
      "body": "Quote from: pooya87 on May 14, 2023, 04:20:37 PMI wonder if Handelsblatt newspaper received similar weird reactions from trolls when they published the same exact thing I posted here. Or is the reactions like this because I posted it... hmm...Quote from: Poker Player on May 14, 2023, 03:33:25 AM~I always publish the source of the data I post. If you have a hard time believing them, you should either dispute the numbers or take it up with the source. For example the part about 30% bankruptcies the troll doesn't like to mention is the source which was Siegfried Russwurm, head of the Federation of German Industries BDI in an interview on German TV.Quote from: DaveF on May 14, 2023, 01:25:42 PMStarting with yes it's BS not many more companies went bankrupt then in years previousIt depends on which country you look at. For example the number of bankruptcies in UK is between 25 to 30% higher than previous years specifically years before pandemic. Or in countries in Central or Eastern Europe, like Hungary where the numbers grew significantly more compared to 2018-2019 (a 11x increase from 3700 to 41500).Or in Turkey [which is included as parts of stats in Europe (!)] the number of bankruptcies grew by 80% compared to 2018.On the other hand there are of course some other countries that set a better stats, like Greece with 50% decrease compared to 2018. Or Italy with 30% decrease.However, the overall as the study says shows an increase in the number of insolvencies across Europe. But for example, North Korea is the center of stability! No bankruptcies. Nothing happens, everything is stable .. Because .. NOTHING IS HAPPENING  The same stability was in the USSR - a consistently low standard of living, a stable low quality of work, a consistently low quality of products and services produced, a consistently low education, which means a consistently low science, medicine, technology...But on television and radio - STABLE regular lies - about achievements, about the joy of life, about the fact that the whole world envy us, .... STABLE!Such stability is like a person in a complete coma - he won't burn his finger when he cooks a barbecue, he won't swallow water when he's diving, he won't get grass on his jeans while running across a green field, he won't hit his toe while playing with his a child in his apartment .. EVERYTHING is stable and good for him ... but he is in a coma",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 15, 2023, 09:10:12 AM",
      "body": "Quote from: DaveF on May 14, 2023, 01:25:42 PMStarting with yes it's BSI just love this topic now, pretty surprised that nobody went just for the title and everyone took their time to read what the actual numbers mean, the propaganda backfired like it was supposed to be. Now fast forward to your question in Europe (I exclude the UK since I'm not familiar with them) we have the things, insolvency, and bankruptcy, much like the US but with the difference that once applied to companies, not LLC or personal enterprises bankruptcy is the final step, a company entering bankruptcy after going through restructuring and unable to pay its debts, insolvent, will get shut down as it has no way out of its debt, it happens usually if in 1-3 years after declaring insolvency it still going through losses.This thing, again, shows why that stupid title is so misleading, as a company facing problems with the 2022 energy crisis (now gone!) would have just sought protection and wouldn't have declared bankruptcy the same year, it simply couldn't have happened.Quote from: DaveF on May 14, 2023, 01:25:42 PMHere, a company can go bankrupt but just for debt re-organizational purposes. It still continues to exist, and operate, but all the money it owes people has been reorganized and or wiped out. Or the debtors take over the business and operate it, or instead of shutting down of the banks that were owed money to take it over and try to sell it.That's what restructuring or insolvency is here, the moment we hit bankruptcy it means the end of it and the court orders the sale of assets.It doesn't apply to entrepreneurs or LLC!Quote from: Poker Player on May 14, 2023, 03:33:25 AMWhile he is generally a quality poster, you made me remember that he said that half a million families had gone homeless in the UK, which I quickly dismantled, and I've been looking for the post to quote it but I don't know if he deleted it because I can't find it. It seems he only wants to see the speck in his neighbours eye. What the refusal of a green card does to people, really sad, isn't it?Quote from: pooya87 on May 14, 2023, 04:20:37 PMJust get over it, your propaganda ended like Soleimani, kotlet!Nobody is buying your alarmist and apocalyptic shit anymore!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "May 16, 2023, 09:03:29 AM",
      "body": "Quote from: stompix on May 15, 2023, 09:10:12 AMI just love this topic now, pretty surprised that nobody went just for the title and everyone took their time to read what the actual numbers mean, the propaganda backfired like it was supposed to be. This is a classic approach, or the concept of the Russian world - lie always, lie everywhere, lie with or without reason! The main thing is to lie! To lie in order to create the appearance of \"a happy life in Russia\", and to create the appearance of \"total problems\" for everyone who does not support Russia. And for different categories - different technologies:- for the local population in Russia, you can give out any nonsense in the media at all, even about flying into the sun and installing the largest flag in the galaxy on the stars on the sun! And they will be worn with this \"fact\" all their lives - for people with brains - a little more difficult. An event is taken, and ... modified with a lie. Purpose: \"bring a real fact, that's even an article, and a headline, and even a Western one.\" Actually, what we observed on this lovers of the ideas of the \"Russian world\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "May 16, 2023, 09:38:22 AM",
      "body": "of the 199,983 companies, I doubt 100% of them you never heard of its name and you doubt they ever produce anything you consume in your life, many of this companies just have the name and have no actual products, their sole purpose of existing is just to seek quick money from IPO, or other private fund raising, to defrauding gullible investors generally, anyway it would bring nothing of values to anyone, may be bank who provide loan to them would be in trouble. I did say we did good by weeding out all of this good for nothing bad actor companies, nobody would be arrested for the fraud but it is still good to finally kick them out of existence. btw there is still 37,194,791,749 that is out of the wild and defrauding people everyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 16, 2023, 10:04:59 AM",
      "body": "Quote from: Broly46 on May 16, 2023, 09:38:22 AMof the 199,983 companies, I doubt 100% of them you never heard of its name and you doubt they ever produce anything you consume in your life, many of this companies just have the name and have no actual products, their sole purpose of existing is just to seek quick money from IPO, or other private fund raising, to defrauding gullible investors generally, anyway it would bring nothing of values to anyone, may be bank who provide loan to them would be in trouble. I did say we did good by weeding out all of this good for nothing bad actor companies, nobody would be arrested for the fraud but it is still good to finally kick them out of existence. btw there is still 37,194,791,749 that is out of the wild and defrauding people everyday.There are a ton of family-owned businesses and also really small-time companies that operate within a very small region, like a local town or county, and thus only serve that place. Most of these companies have balance sheets that are vulnerable to energy spikes so I would not be surprised if it was these companies that constituted a majority percentage of those that have gone bankrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 16, 2023, 10:21:31 AM",
      "body": "Quote from: NotATether on May 16, 2023, 10:04:59 AMQuote from: Broly46 on May 16, 2023, 09:38:22 AMof the 199,983 companies, I doubt 100% of them you never heard of its name and you doubt they ever produce anything you consume in your life, many of this companies just have the name and have no actual products, their sole purpose of existing is just to seek quick money from IPO, or other private fund raising, to defrauding gullible investors generally, anyway it would bring nothing of values to anyone, may be bank who provide loan to them would be in trouble. I did say we did good by weeding out all of this good for nothing bad actor companies, nobody would be arrested for the fraud but it is still good to finally kick them out of existence. btw there is still 37,194,791,749 that is out of the wild and defrauding people everyday.There are a ton of family-owned businesses and also really small-time companies that operate within a very small region, like a local town or county, and thus only serve that place. Most of these companies have balance sheets that are vulnerable to energy spikes so I would not be surprised if it was these companies that constituted a majority percentage of those that have gone bankrupt.For sure these small companies are majorly the ones vulnerable to such situations as their income are very miniut compared to the bigger companies who roll in profit in millions and hundreds of thousands on daily basis.  I do not need any sooth Sayer to confirm that these companies are the ones to suffer from the outcome of energy spikes. They would have their staff to pay, tax to pay and other maintenance and running cost so as to sustain their existence with the little profit they take in and it happens that there is all of a suden a hike in energy price in the country, I do not think they would be able to withstand it as most of them would need energy in running their various businesses and in a situation where they can not meet up with the energy bill to pay for coupled with the low profit they rake in, it will be obvious for them to continue and in that situation they would have no choice than folding up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "May 16, 2023, 10:51:17 AM",
      "body": "A question - and where the author of a topic got to? Why such silence? Not a single answer to the evidence of his deliberate lies? It seems that he is frantically looking for a new article, which he will try to turn inside out and \"prove to everyone that he is right\" I just remember his wonderful post, full of \"pride\" for Iran, and \"cowardice of the American Navy.\" The situation is exactly the same - he took a certain fact, attributed to him something that he really wants but will never be - and voila, \"victorious news is on the air\"! The author is filled with \"pride\" for his \"great country\", \"the enemy is humiliated and insulted\" Let me remind you very briefly:The fact is that one of the tankers transporting oil for some company from the United States, violating the rules of navigation, created an accident where people died on the other ship. As expected, he was detained by Iranian troops.In the presentation of the \"lover of the truth\" pooya87: Iran wanted to spit on the United States, and imposed its sanctions and seized an American tanker full of oil, and the 6th US fleet cowardly stood aside and was afraid to release its tanker, which was calmly captured by cool Rambos from the Iranian army ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "May 16, 2023, 11:01:57 AM",
      "body": "Quote from: NotATether on May 08, 2023, 09:01:50 AMthere are ton of family-owned businesses and also really small-time companies that operate within a very small region...No doubt, they operate in small local town, also defraud strictly gullible investors from the small town they located, if they still have the audacity after they defraud all people and goes broke, they would soon create yet another new business to defraud new gullible investors again from the town, or they may want to move to a new town, or they could still defraud on the same town again by changing to new company name and new face to the executives, to make the company feel different and more trustworthy again. plenty of fraud and tricks they can come up with, they would never stop, they have no fear to the sin they commited, as shameless as most of the crypto companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 16, 2023, 05:39:29 PM",
      "body": "This is a classic example of what disaster can happen when you follow the footprint of US who claims to be the boss of the world. Ask youself a question first -Will any country allow it's biggest enemy to have undisrupted access to their border? The answer is no! In terms of the world GDP, Ukraine contributes only 0.3%. So it's not a very important country in terms of international trade. Why would US want them to be a part of NATO? Ask youself this question. Now when Russia attacked Ukraine to stop them from joining NATO, US imposed a lot of sanctions on Russia. European countries followed the same pattern without thinking that they are highly dependent on Russian gas and oil. The result is in front of you. US successfully managed to bring down entire European economy so that Euro doesn't challenge Dollars dominance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}