{
  "id": "topic_5469099",
  "title": "emre06060",
  "author": "emre06060",
  "created_time": "October 03, 2023, 07:38:32 PM",
  "content": "Para verdiğimiz Exxen çöktü. Maçı tv 8,5da şifresiz veriyorlar. Kaçak yayın izlemeyin diyenler 20 dk sinir etti beni",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469099",
  "comments": [
    {
      "author": "MostarCoin",
      "created_time": "October 03, 2023, 09:03:15 PM",
      "body": "Tivibu ile web'den izledim ben de exxen maalesef tat vermiyor. Neyseki sonuç güzel oldu da bu seferlik mazur görebiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spack17",
      "created_time": "October 03, 2023, 09:57:17 PM",
      "body": "Gerçekten inanılmaz bir olay bu. Daha geçtiğimiz zamanlarda Acun Ilıcalı çıkıp kaçak yayınlar hakkında bir açıklamada bulunmuştu. Bu yayınları yapanlara da izleyenlere de laf etmişti diye hatırlıyorum. Bunun üzerinden çok bir zaman geçmeden böyle bir olay yaşandı. Yani daha siz kendiniz düzgün hizmet veremeyip insanları parasıyla rezil ediyorsunuz. Şimdi nasıl bir açıklama yapacak ya da yapabilecek mi merak ediyorum. Maç başladıktan herhalde bir 30 dk sonra anca Exxen kendine geldi.Tabi insanlar TV8,5'dan maçı izleyip bitirmişlerdir. Galatasaray maçlarında bir yoğunluk olacağı bariz belliyken neden altyapılarını sağlam bir şekilde hazırlamazlar akıl almıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "October 04, 2023, 09:03:28 AM",
      "body": "Quote from: Spack17 on October 03, 2023, 09:57:17 PMGerçekten inanılmaz bir olay bu. Daha geçtiğimiz zamanlarda Acun Ilıcalı çıkıp kaçak yayınlar hakkında bir açıklamada bulunmuştu. Bu yayınları yapanlara da izleyenlere de laf etmişti diye hatırlıyorum. Bunun üzerinden çok bir zaman geçmeden böyle bir olay yaşandı. Yani daha siz kendiniz düzgün hizmet veremeyip insanları parasıyla rezil ediyorsunuz. Şimdi nasıl bir açıklama yapacak ya da yapabilecek mi merak ediyorum. Maç başladıktan herhalde bir 30 dk sonra anca Exxen kendine geldi.Tabi insanlar TV8,5'dan maçı izleyip bitirmişlerdir. Galatasaray maçlarında bir yoğunluk olacağı bariz belliyken neden altyapılarını sağlam bir şekilde hazırlamazlar akıl almıyor.Acun'un paralı kanalı bozuldu diye kaçak yayın yapanlar haklı olamaz. Bana kalırsa Acun açıklamasında haklıydı. Kaçak yayın yapanların suçu kendine. Acun'un sattığı hizmeti karşılayamaması kendine. Herkes kendi bacağından asılır. Acun sattığı hizmeti karşılayamadı diye kaçak yayıncılık yapanlar haklı sayılamaz Spack17.Acun şifresiz kanalı olduğu için şanslı. Durumu oradan kurtardı. TV 8,5 olmasaydı ne yapacaktı? Daha bi kötü durumda olurdu. Kimseye açıklama dahi yapamazdı. Bana göre böyle bişi 1 kereye veyahut 2 kereye mahsus affedilebilir. Canlı yayında küçük bi kablo kopsa yayın durur. Telafisi yok. Çünkü anlık, canlı. Ama bi yandan da iyi oldu diyorum. Şampiyonlar Ligi maçları eskiden şifresiz yayındaydı. Yine şifresiz yayında olması kötü bişi diiil. Kablo nerde koptuysa bundan sonra hep kopabilir aynı yerinden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spack17",
      "created_time": "October 04, 2023, 11:00:43 AM",
      "body": "Quote from: Ondekinecakabilirim on October 04, 2023, 09:03:28 AMQuote from: Spack17 on October 03, 2023, 09:57:17 PMGerçekten inanılmaz bir olay bu. Daha geçtiğimiz zamanlarda Acun Ilıcalı çıkıp kaçak yayınlar hakkında bir açıklamada bulunmuştu. Bu yayınları yapanlara da izleyenlere de laf etmişti diye hatırlıyorum. Bunun üzerinden çok bir zaman geçmeden böyle bir olay yaşandı. Yani daha siz kendiniz düzgün hizmet veremeyip insanları parasıyla rezil ediyorsunuz. Şimdi nasıl bir açıklama yapacak ya da yapabilecek mi merak ediyorum. Maç başladıktan herhalde bir 30 dk sonra anca Exxen kendine geldi.Tabi insanlar TV8,5'dan maçı izleyip bitirmişlerdir. Galatasaray maçlarında bir yoğunluk olacağı bariz belliyken neden altyapılarını sağlam bir şekilde hazırlamazlar akıl almıyor.Acun'un paralı kanalı bozuldu diye kaçak yayın yapanlar haklı olamaz. Bana kalırsa Acun açıklamasında haklıydı. Kaçak yayın yapanların suçu kendine. Acun'un sattığı hizmeti karşılayamaması kendine. Herkes kendi bacağından asılır. Acun sattığı hizmeti karşılayamadı diye kaçak yayıncılık yapanlar haklı sayılamaz Spack17.Acun şifresiz kanalı olduğu için şanslı. Durumu oradan kurtardı. TV 8,5 olmasaydı ne yapacaktı? Daha bi kötü durumda olurdu. Kimseye açıklama dahi yapamazdı. Bana göre böyle bişi 1 kereye veyahut 2 kereye mahsus affedilebilir. Canlı yayında küçük bi kablo kopsa yayın durur. Telafisi yok. Çünkü anlık, canlı. Ama bi yandan da iyi oldu diyorum. Şampiyonlar Ligi maçları eskiden şifresiz yayındaydı. Yine şifresiz yayında olması kötü bişi diiil. Kablo nerde koptuysa bundan sonra hep kopabilir aynı yerinden. Tabi ki kaçak yayın yapanlar haklı sayılamazlar siz beni çok yanlış anlamışsınız.    Ben kendim korsana karşı bir insanım oyun, dizi, film, maç vs ne olursa olsun orijinal olarak tüketilmesi gerektiğini ve insanların hakkına girilmemesi gerektiğini savunurum. Benim burada demek istediğim şuydu. Exxen platformu insanları parasıyla rezil etmiş oldu. İnsanlar bu gibi durumlarda maalesef korsana yöneliyorlar. TV8,5 vermeseydi bu maç için de öyle olabilirdi yani.Bu yüzden Acun Ilıcalı söylediğini lafta bırakmamalı. İnsanların kaçak yayına yönelmesini engellemek için en başta kendisinin problemsiz hizmet vermesi gerekiyor.Ülkemizde korsana yönelim her zaman var oluyor belki ama en azından bu insanların sayısı gün geçtikçe daha da azaltılabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "October 04, 2023, 01:35:36 PM",
      "body": "Quote from: Spack17 on October 04, 2023, 11:00:43 AMQuote from: Ondekinecakabilirim on October 04, 2023, 09:03:28 AMQuote from: Spack17 on October 03, 2023, 09:57:17 PMGerçekten inanılmaz bir olay bu. Daha geçtiğimiz zamanlarda Acun Ilıcalı çıkıp kaçak yayınlar hakkında bir açıklamada bulunmuştu. Bu yayınları yapanlara da izleyenlere de laf etmişti diye hatırlıyorum. Bunun üzerinden çok bir zaman geçmeden böyle bir olay yaşandı. Yani daha siz kendiniz düzgün hizmet veremeyip insanları parasıyla rezil ediyorsunuz. Şimdi nasıl bir açıklama yapacak ya da yapabilecek mi merak ediyorum. Maç başladıktan herhalde bir 30 dk sonra anca Exxen kendine geldi.Tabi insanlar TV8,5'dan maçı izleyip bitirmişlerdir. Galatasaray maçlarında bir yoğunluk olacağı bariz belliyken neden altyapılarını sağlam bir şekilde hazırlamazlar akıl almıyor.Acun'un paralı kanalı bozuldu diye kaçak yayın yapanlar haklı olamaz. Bana kalırsa Acun açıklamasında haklıydı. Kaçak yayın yapanların suçu kendine. Acun'un sattığı hizmeti karşılayamaması kendine. Herkes kendi bacağından asılır. Acun sattığı hizmeti karşılayamadı diye kaçak yayıncılık yapanlar haklı sayılamaz Spack17.Acun şifresiz kanalı olduğu için şanslı. Durumu oradan kurtardı. TV 8,5 olmasaydı ne yapacaktı? Daha bi kötü durumda olurdu. Kimseye açıklama dahi yapamazdı. Bana göre böyle bişi 1 kereye veyahut 2 kereye mahsus affedilebilir. Canlı yayında küçük bi kablo kopsa yayın durur. Telafisi yok. Çünkü anlık, canlı. Ama bi yandan da iyi oldu diyorum. Şampiyonlar Ligi maçları eskiden şifresiz yayındaydı. Yine şifresiz yayında olması kötü bişi diiil. Kablo nerde koptuysa bundan sonra hep kopabilir aynı yerinden. Tabi ki kaçak yayın yapanlar haklı sayılamazlar siz beni çok yanlış anlamışsınız.    Ben kendim korsana karşı bir insanım oyun, dizi, film, maç vs ne olursa olsun orijinal olarak tüketilmesi gerektiğini ve insanların hakkına girilmemesi gerektiğini savunurum. Benim burada demek istediğim şuydu. Exxen platformu insanları parasıyla rezil etmiş oldu. İnsanlar bu gibi durumlarda maalesef korsana yöneliyorlar. TV8,5 vermeseydi bu maç için de öyle olabilirdi yani.Bu yüzden Acun Ilıcalı söylediğini lafta bırakmamalı. İnsanların kaçak yayına yönelmesini engellemek için en başta kendisinin problemsiz hizmet vermesi gerekiyor.Ülkemizde korsana yönelim her zaman var oluyor belki ama en azından bu insanların sayısı gün geçtikçe daha da azaltılabilir.Hepimiz doğruları yanlışları biliyoruz ama farkında olduğumuz bir şey de hizmet kalitesi iyi olmadan insanlara bir şeyler satmaya çalışmaları. Bu yaptıkları yanlışta çok haklılarmış gibi de korsan yayınları eleştirmeleri. Korsan yayın doğru bir tercih değil bunda hemfikiriz ama parasını verdiğimiz bir yayını izleyemiyorsak ve o anlar tarihte sadece 1 defa yaşanıyorsa izleyicileri bu duygudan mahrum bırakamazlar. Mahkum bırakırlarsa da ahkam kesmeleri doğru değil. Bence bizde sorun korsan yayın falan değil. Bizdeki birçok şeyde asıl sorun hizmet kalitesinin düşük olup fazla para istenmesi. 4564576 tane yayın içeriği var hangi birini alalım. Hadi alıyoruz ama bir de izleyemiyorsun. Tam bir saçmalık.Hepsini bir uygulamadan izleme şansımız olmalı ve makul fiyatlarda sunulmalı. Bu olmadıkça korsan yayının önüne geçebileceklerini sanmıyorum. İnsanlar da meraklı değil bir ton reklamla birlikte maç izlemeye. Uygun fiyatta ve tek uygulamada sunulsa kimse korsan yayınla uğraşmaz diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "October 04, 2023, 02:16:35 PM",
      "body": "Valla büyük rezalet olmuş üyelere yapılan çok büyük ayıp millet para veriyor ama adamlar bir işi düzgün yapamıyor sonra açık kanaldan yayın veriyor.Ben Bayern maçını izleyecektim bir açtım GS maçı var komik oldu. Acun da boşa korsan yayınla mücadele falan diye anlatmasın önce kendi işini düzgün yapsın. Milleti parasıyla rezil edip böyle üste çıkmaya çalışıyorlar. Galibiyet için Galatasaray'ı kutlarım. Manchester United'ı en kötü zamanında yakaladıklarında kesin kazanmaları lazımdı ülke puanı için iyi oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "October 12, 2023, 05:54:28 PM",
      "body": "Acun Ilıcalı geçen daha yeni bu rezillik hakkında açıklama yapmış. Sadece maçtan 5 dakika öncesinde girmeye çalışanların erişim sağlayamadığını aslında büyük bir sıkıntı olmadığını falan dile getirmiş. Bu açıklama gerçekten çok talihsiz yani sizin normalde özür dilemeniz gerekir. Bunca insan ayda kaç lira para verip düzgün hizmet almayı bekliyor.Zaten ülkemizde böyle platformlar ne yazık ki tutarlı bir performans sergileyemiyor. Düzgün bir canlı yayın vermek nasıl bu kadar zor olabilir? Kurarsınız sunucularınızı ona göre sorun ortadan kalkar. Yoğunluğu tahmin edemeyecekseniz niye bu iştesiniz ki o zaman?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}