{
  "id": "topic_5433269",
  "title": "SME211",
  "author": "SME211",
  "created_time": "January 06, 2023, 03:43:55 PM",
  "content": "I am on the receiving end of a bitcoin transfer.  I have been asked to pay a fee called \"Hash Power fee to a Reflection ID\"  before the funds will be deposited in my wallet.  Is this a legitimate fee that I need to pay as a receiver of bitcoin or is it a scam?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433269",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "January 06, 2023, 04:10:49 PM",
      "body": "You want to receive bitcoin for free from someone? That is a scam. Bitcoin receiver do not have to be pay any fee but some people can ask for fee or any other payment before you can receive payment for no job done, than to scam you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "January 06, 2023, 06:53:09 PM",
      "body": "what even is a \"Hash Power fee to a Reflection ID\"? anyway, just like what Charles-Tim have said, it is a scam. you are better off ignoring it. this is a pretty common scam strategy being used by scammers. also. it is weird that when you search their website on Google it doesn't show their website, instead, it shows a list of scam alert reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 07, 2023, 08:33:23 AM",
      "body": "That's scam lolThe only fee one pays when carrying out the Bitcoin mining fee or transaction fee, and it's usually less than a dollar these days when the network is not clogged with unconfirmed transactions. The fee is automatically deducted by a service or wallet from where the Bitcoin is being sent from. Anyone asking you to pay them another fee before they send your Bitcoins is a scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}