{
  "id": "topic_5457095",
  "title": "Lafu",
  "author": "Lafu",
  "created_time": "June 21, 2023, 01:42:05 PMLast edit: June 22, 2023, 05:49:00 PM by Lafu",
  "content": "Vorsicht bei neuen Coin Projekten und Ankündigungs Topics im Englischen Bereich im Altcoinbereich !Eigentlich wollte ich schon seit längerem das hier schreiben , aber ich hatte irgendwie nie richtig Zeit dazu.Auch hatte ich oft das gefühl den ein oder anderen damit eventuell zu nerven ständig warnungen zu schreiben,sei es bezüglich Miner Software oder eben wie so oft im \" Announcements Altcoin Bereich \"Ich weiß auch das viele hier nicht wirklich oder oft im Englischen Bereich unterwegs sind oder etwas schreiben dort.Aber in letzter Zeit kommt es immer mehr vor das \" Komische Accounts \" und die für den normalen User nicht gleich verdächtig erscheinen verdächtige Topics starten.Die offensichtlichen Fake Anns mit deren Malware download Links sind sehr stark zurückgegangen und werden nur noch vereinzelt gemacht.Ich weiß auch das viele eventuell diese Announcements lesen und sich nichts dabei denken (Aber genau dies ist die masche der Hacker) unauffällig zu wirken.Deswegen meine bitte ( und das geht in erster Linie an die neuen User aber auch an die alten Hasen hier im Forum) hinterfragt erstmal alles bevor ihr es glaubt und eventuell downloaded.Scheut euch nicht mir eine pm oder in form eines beitrages wo ihr mich erwähnt zu fragen ob das Projekt oder der download sicher ist.Nur zum Beispiel , ein Topic erstellt heute von einem Account der seit 2018 registriert ist und das passwort geändert hat und als ersten Beitrag gleich ein Coin Projekt mit download schreibt.Das hier ist der Topic : [ANN][CPU SOLO MINING] LUCKYCOIN，PRIVATE POW CHAINWie in diesem Fall hinterfrage ich alles und versuche dem Topicstarter aus der deckung zu locken da einiges sehr verdächtig erscheint.In solchen Fällen schaut bitte als erster drauf wann war der letzte Beitrag des Accounts , wann wurde der Account registriert und wurde das passwort geändert.Checkt die download quelle mit Virustotal und fragt auch Google mit Stichwörtern die im Ankündigungs Topic Titel oder innerhalb vorkommen.Eventuell mag ich einige mit dem ganzen hier nerven aber Vorsicht ist halt immernoch besser als Nachsicht.Ihr könnt jederzeit mir ein PM schreiben wenn ihr was verdächtiges findet oder ließt.Oder ihr schreibt es einfach auch hier in meinem Thread : Report Malware and Suspicious Links here so Mods can take Action !Alternativ könnt ihr aber auch diese gleich direkt reporten wenn ihr wollt.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457095",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "June 21, 2023, 04:44:46 PM",
      "body": "Quote from: Lafu on June 21, 2023, 01:42:05 PMIn solchen Fällen schaut bitte als erster drauf wann war der letzte Beitrag des Accounts , wann wurde der Account registriert und wurde das passwort geändert.Danke für den wichtigen Thread @Lafu! Bin leider OOM. Aber ich versuche es nachzureichen, wenn ich wieder flüssig bin.Eine Ergänzung vielleicht: Viele Neulinge dürften nicht wissen, woran man sieht, dass ein bei einem Account kürzlich das Passwort geändert wurde. Als Hilfe bietet sich hier https://bpip.org/ an. Wenn man hier nach dem jeweiligen Nutzernamen sucht, kann man oben rechts am Rand im Mod/Security Log sehen wann zum letzten Mal das Passwort geändert wurde. Oder ob der Nutzer nach langer Inaktivität wieder aufgewacht ist.Hier ein Screenshot, des von dir verlinkten Betrüger-Accounts:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "June 21, 2023, 08:03:30 PM",
      "body": "Also bevor ich geschaut hätte seit wann der Account aktiv ist und ob das Passwort geändert wurde hätte ich doch viel eher auf die offensichtlichen Werte Activity und Merit geschaut. Getreu dem Motto: wer sich die Mühe macht Activity und Merit zu sammeln wird schon kein Betrüger sein?!Wo ist der Denkfehler bei dieser Herangehensweise?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "June 21, 2023, 08:24:10 PM",
      "body": "Quote from: Turbartuluk on June 21, 2023, 08:03:30 PMAlso bevor ich geschaut hätte seit wann der Account aktiv ist und ob das Passwort geändert wurde hätte ich doch viel eher auf die offensichtlichen Werte Activity und Merit geschaut. Getreu dem Motto: wer sich die Mühe macht Activity und Merit zu sammeln wird schon kein Betrüger sein?!Wo ist der Denkfehler bei dieser Herangehensweise?Grundsätzlich sind Activity und Merits schon ein gutes Indiz dafür, ob ein Account grundsätzlich ein bisschen vertrauenswürdiger ist (natürlich auch der Trust).Es kann aber auch sein, dass ein Account gehackt wurde und eigentlich total vertrauenswürdig aussieht. Gerade hier ist das Datum der letzten Passwortänderung dann ein sehr gutes Indiz dafür, dass es sich um einen potentiellen Scam/Malware handelt.Lieber einmal zu oft nachfragen oder einen Thread erstellen als einmal zu wenig",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "June 21, 2023, 08:31:06 PM",
      "body": "Quote from: Turbartuluk on June 21, 2023, 08:03:30 PMAlso bevor ich geschaut hätte seit wann der Account aktiv ist und ob das Passwort geändert wurde hätte ich doch viel eher auf die offensichtlichen Werte Activity und Merit geschaut. Alte Accounts können einen hohen Activity Wert und einen hohen geairdropten Merit Score haben. Das sagt nicht unbedingt etwas über die Qualität des Accounts aus.Wie oft haben wir es schon erlebt, dass alte Accounts verkauft oder gehackt wurden um diese dann für dubiose Zwecke zu nutzen. Dementsprechend sind die Werte eher ein Indiz. Ich schaue lieber einmal zu oft bei BPIP bevor ich einen fremden Link anklicke. Bisher bin ich damit immer gut gefahren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 21, 2023, 08:56:07 PM",
      "body": "Quote from: Turbartuluk on June 21, 2023, 08:03:30 PMGetreu dem Motto: wer sich die Mühe macht Activity und Merit zu sammeln wird schon kein Betrüger sein?!Wo ist der Denkfehler bei dieser Herangehensweise?Die Betrüger schauen ja auch, wie sie ihren Betrug so realistisch aussehen lassen können, wie es geht. Und da Accounts, die vor 01/2018 den Rang Legendary hatten, 200 sMerit (versendbare Merits) bekommen haben, könnten sie die 200 Merits für schlechte Absichten verwenden, wie das Senden zu einem neueren Account, der zum Ziel hat, andere Leute zu betrügen. Oder der Account, mit dem betrogen werden soll, ist ein Legendary Account und um die Problematik zu übertünchen, dass dieser erst wieder seit kurzer Zeit aktiv ist, würde der Betrüger ca. 50 Beiträge (z.B. mit ChatGPT) über vielleicht 1 Monat in einem der Spambereich im Forum (Bitcoin Diskussion, Altcoins, Glücksspiel) schreiben, um nicht direkt aufzufallen. Erst dann würde er den Betrug durchführen. Dann würde der Schriftzug \"seit kurzem erst wieder aktiv\" im Profil wieder verschwinden und der Betrüger hätte höhere Chancen, dass er als seriös angesehen wird. In diesem Fall lohnt es sich, beim jeweiligen Account einmal nachzuschauen, ob es eine längere Lücke gibt in der Beitrags-Historie oder ob der Account früher Beiträge in einem lokalen Forumsbereich geschrieben hat und nun, nach längerer Pause vom Forum, in einem anderen lokalen Forumsbereich kommentiert. Erst unlängst in Reputation passiert, dass solch ein verkaufter Account aufgeflogen ist. Oder ob es früher eher ein Entwickler war und jetzt nur noch seichte Einzeiler kommen. Es gibt da viele Dinge, die ein Indiz sein können, dass der Account gehackt oder verkauft wurde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "June 21, 2023, 10:02:18 PM",
      "body": "OK, ok... Ich merk schon, ich hab noch einiges zu lernen....Im Nachhinein hätte man da ja durchaus auch selber drauf kommen können. Danke jedenfalls für den schnellen Input. BPIP kommt dann wohl auch noch auf die Liste der Themen mit denen ich mich demnächst irgendwann mal beschäftigen sollte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 21, 2023, 11:40:39 PM",
      "body": "Quote from: Turbartuluk on June 21, 2023, 10:02:18 PMBPIP kommt dann wohl auch noch auf die Liste der Themen mit denen ich mich demnächst irgendwann mal beschäftigen sollte. Ja, BPIP ist wirklich eine sehr gute und nützliche Seite. Dazu hatte ich vor längerer Zeit mal etwas geschrieben, vielleicht ist es nützlich für dich: BPIP - Bitcointalk Public Information Project - Ranglisten und hilfreiche InfosDarin sind auch die originalen Fäden aus dem internationalen Forumsteil verlinkt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "June 22, 2023, 05:46:05 PM",
      "body": "Quote from: Turbartuluk on June 21, 2023, 08:03:30 PMGetreu dem Motto: wer sich die Mühe macht Activity und Merit zu sammeln wird schon kein Betrüger sein?!Wo ist der Denkfehler bei dieser Herangehensweise?Grundsätzlich hat der Rang , Activity und Merit nichts damit zu tun das der jeweilige Account ein Betrüger sein kann oder nicht.Wie von bullrun2020bro , sam00 und auch 1miau bereits geschrieben , BPIP ist da aufjedenfall ein nützliches Tool da man dort alles auf einen Blick hat.Wenn du auf den User Account seinen Trust klickst sieht man in den meisten Fällen ob der Account wieder aktiv seit langen ist usw.Das beste was man aber tun kann ist wie auch schon erwähnt die Beitrags history des Accounts anzuschauen wann die letzten posts gemacht wurden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "June 22, 2023, 06:21:38 PMLast edit: June 22, 2023, 06:42:15 PM by willi9974",
      "body": "Viele gute Infos hier, da lasse ich gerne ein Merit da.Gerade die Infos für die Accounts wegen wieder erwacht und Passwortwechsel, sind gute Tipps. Auch die letzten 20-50 Beiträge anschauen sind auch immer wieder gut, wenn sich das Postingverhalten oder der Stiel wie jemand schreibt ändert. https://ninjastic.space/ Ist auch immer eine gute Anlaufstelle für einen Check.Viele Grüße Willi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "July 21, 2023, 02:19:28 PM",
      "body": "Ich möcht nochmals darauf Hinweisen das es jetzt in der letzten Woche wieder vermehrt und fast täglich Fake Announcements gegeben hat.Ihr könnt dies aufjedenfall in meinem Topic : Report Malware and Suspicious Links here so Mods can take Action ! nachlesen.Momentan ist es so das meistens ein User 2 verschiedene Threads eröffnet , aber auch im mining bereich werden wieder vermehrt Fake Miner Software sachen geschreiben.Als passt auf und bitte meldet verdächtige sachen oder schreibt mir dann sehe ich es mir an.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}