{
  "id": "topic_5476007",
  "title": "velhoti",
  "author": "velhoti",
  "created_time": "November 30, 2023, 02:24:07 AM",
  "content": "I searched some p2p markets and found https://bisq.network/, https://hodlhodl.com and https://robosats.com, but all of them are bitcoin centric, in the sense it is possible exchange a set of coins to bitcoins or the oposite, bitcoin to some altcoin or fiat.I totally agree bitcoin deserve its top position, but is there some p2p market not centered around bitcoin? I'd like to exchange eth for fiat (directly), for instance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476007",
  "comments": [
    {
      "author": "GreatArkansas",
      "created_time": "November 30, 2023, 02:37:00 AM",
      "body": "You can try to use KYCnot.meBut right now I checked, you can try to filter some exchange services by XMR/BTC/LN/CASH/FIATXMR is the only altcoin in the filter. Another way you can check is to check each of the exchanges and then check if they have some altcoins available in their p2p market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 30, 2023, 04:19:54 AM",
      "body": "Don't CEX platforms help you solve that?Basically I see user behavior is switching from crypto to stablecoin and then fiat, usually as far as I know, this is the common way p2p works.But of course there will still be some direct support tools without going through many other intermediaries, but the scale and safety will make many people worried.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velhoti",
      "created_time": "November 30, 2023, 06:01:13 PM",
      "body": "Quote from: GreatArkansas on November 30, 2023, 02:37:00 AMYou can try to use KYCnot.meThank you, it is a comprehensive list, very useful. Unfortunately there are few with high enough rating to be trustworthy.Quote from: bluebit25 on November 30, 2023, 04:19:54 AMDon't CEX platforms help you solve that?Yes, they solve, but for a different niche of users, p2p and CEX have diferent properties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "November 30, 2023, 06:45:23 PM",
      "body": "Quote from: velhoti on November 30, 2023, 02:24:07 AMI searched some p2p markets and found https://bisq.network/, https://hodlhodl.com and https://robosats.com, but all of them are bitcoin centric, in the sense it is possible exchange a set of coins to bitcoins or the oposite, bitcoin to some altcoin or fiat.I totally agree bitcoin deserve its top position, but is there some p2p market not centered around bitcoin? I'd like to exchange eth for fiat (directly), for instance.Centralized exchanges mostly allow crypto-to-fiat P2P transactions. Crypto-to-crypto transactions aren't necessary in there because there is already lots of altcoin pairs with one another and stablecoins. So it doesn't need to crypto-to-crypto P2P trade. I am not sure if there is any service like that but i have seen some crypto project that allow token conversion between bitcoin and some major altcoin like ETH, matic, SOL, XRP etc. Not sure how safe they are to use but this type of service exists.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velhoti",
      "created_time": "November 30, 2023, 07:07:59 PM",
      "body": "Some CEX have p2p, but they demand KYC. There are a rich environment of CEXs with multiple payment methods and the most liquid markets, but it is all about decentralization. P2p is decentralized, analougue to DEX. Thats is the way in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "November 30, 2023, 07:59:09 PM",
      "body": "Quote from: velhoti on November 30, 2023, 07:07:59 PMSome CEX have p2p, but they demand KYC. There are a rich environment of CEXs with multiple payment methods and the most liquid markets, but it is all about decentralization. P2p is decentralized, analougue to DEX. Thats is the way in my opinion.Liquidity and trading pairs are the major drawbacks of a decentralized P2P crypto exchange platform. However, you never provide information about the particular crypto you want to exchange so we can know maybe it on fixedfloat, LocalMonero, and Crypton Exchange which are platforms I have used and like their service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "November 30, 2023, 10:45:09 PM",
      "body": "Quote from: velhoti on November 30, 2023, 06:01:13 PMp2p and CEX have diferent properties.Binance is a CEX but it has a P2P market and just as the other exchanges, they have their spot market and at the same time a separate market for P2P.Quote from: velhoti on November 30, 2023, 07:07:59 PMSome CEX have p2p, but they demand KYC. Well, you got it. This is the only difference between those that have been mentioned and the ones that we're saying to you about being on CEX and P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velhoti",
      "created_time": "November 30, 2023, 11:06:59 PM",
      "body": "QuoteThis is the only difference between those that have been mentioned and the ones that we're saying to you about being on CEX and P2P.It is a huge difference full of technical, legal, economic and ideological implications (and not the only one, bisq accept amazon gift card, as example).I meant decentralized p2p in my question, not those fake p2p from CEX, sorry if i expressed myself wrongly. Anyway i am open to discussion and i considered for a moment fake p2ps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "November 30, 2023, 11:18:19 PM",
      "body": "Quote from: velhoti on November 30, 2023, 11:06:59 PMQuoteThis is the only difference between those that have been mentioned and the ones that we're saying to you about being on CEX and P2P.It is a huge difference full of technical, legal, economic and ideological implications (and not the only one, bisq accept amazon gift card, as example).I meant decentralized p2p in my question, not those fake p2p from CEX, sorry if i expressed myself wrongly. Anyway i am open to discussion and i considered for a moment fake p2ps.That's fine, as much as we are seeing different markets. The good thing here is that there's a competition but it's not as strong as what the consumers/users need.The majority of the volume goes to these P2P CEXes because people are there and with these suggested P2p markets, they are good no doubt. But the volume aren't the same as the cexes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "November 30, 2023, 11:21:33 PM",
      "body": "Quote from: bluebit25 on November 30, 2023, 04:19:54 AMDon't CEX platforms help you solve that?Basically I see user behavior is switching from crypto to stablecoin and then fiat, usually as far as I know, this is the common way p2p works.But of course there will still be some direct support tools without going through many other intermediaries, but the scale and safety will make many people worried.From the links the OP provided in the post, it shows that he is in need of a DEX that meets his requirements. Of course we know that CEX solves this issue and in fact have a lot other features, but remember that privacy is important. Maybe not to you but that’s some persons top priority. For me, I’m equally looking to transition from centralized exchanges to did centralized to decentralized exchanges even if centralized exchange like Binance is addictive, I still think decentralized exchanges are better and should be advocated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}