{
  "id": "topic_5398817",
  "title": "cheezcarls",
  "author": "cheezcarls",
  "created_time": "May 16, 2022, 05:23:24 AM",
  "content": "Source: https://bitpinas.com/business/coins-ph-pba-partnership/Hala grabe talaga toh guys! Nangin official crypto partner na si Coins PH sa PBA (Philippine Basketball Association). Ano ang masasabi nyo dito sa latest move in Coins PH guys? Gusto ko marinig ang iba't ibang opinion nyo tungkol dito. Maraming salamat po sa lahat.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398817",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 16, 2022, 06:10:11 AM",
      "body": "Hopefully this will cause a significant increase in Coins.ph adoption payments-wise sa mga physical stores. Shockingly sa laki na ng size ng Coins.ph, mabibilang ko lang sa daliri kung ung number of stores na tumatanggap ng Coins.ph payments sa vicinity ko. Wag nilang hintaying unahan sila ng GCash sa crypto payments adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "May 16, 2022, 07:36:26 AM",
      "body": "Last time was Philippine's Miss U tapos PBA naman ngayon. Agresibo sila sa kanilang marketing campaign simula nung nagpalit na ng may-ari. Isabay pa dyan yung mga sunod-sunod na listings. Pagdating sa partnership, wala masyado detalye kaya limited lang din opinyon. Siguro isa dyan ay pwede na bumili ng ticket through the app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 17, 2022, 09:55:17 AM",
      "body": "Ayos, mukhang planado pala nila Wei yung mga ganitong partnership. Mas maganda 'to kasi mas lalawak ang exposure ni Coins.ph sa pamamagitan ng mga partners nila. Tapos may nabasa pa akong balita na pinirmahan ni Digong yung tungkol sa digital payments.Kaya parang pabor na pabor sa atin yung mga ganitong adoptions, mas makikilala din lalo ang crypto sa bansa natin sa mga ganitong partnerships. Sana mas dumami pa partnership ni Coins.ph at mas pag igihan pa nila yung serbisyo nila para sa pagiging convenient nilang app wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 17, 2022, 12:01:15 PM",
      "body": "have they hinted about their plans? I would love to hear what are their plans. partnering with PBA would increase their exposure to the Filipinos. In the same article, it seems that PDAX also made a move to partner up with UAAP. I hope in doing so it would increase PDAX's exposure to the young Filipinos that are still unaware of cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "May 18, 2022, 10:41:01 AM",
      "body": "Quote from: cheezcarls on May 16, 2022, 05:23:24 AMAno ang masasabi nyo dito sa latest move in Coins PH guys? Kahit hindi pa natin alam ang buong detalye ng partnership na ito, malaking balita parin ito, especially since may ilang \"known crypto exchanges\" na gusto din ipenetrate ang market natin!Quote from: acroman08 on May 17, 2022, 12:01:15 PMhave they hinted about their plans? I would love to hear what are their plans.Here you go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "May 18, 2022, 12:05:01 PM",
      "body": "Maganda ito in the long run dahil macoconvert yung mga bet lords na gumagamit ng gcash into coins.ph. Hahaha. Pero seriously, May negative na kasi ang crypto sa mga pangkaraniwang tao dahil madalas ito gamitin dati ng mga scammer sa mga ponzi scheme nila at coins.ph ang gamit nilang mode of payment. Sana maging maganda ang acceptance ng mga noypi sa paggamit ng coins.ph lalo na sa Bitcoin at mawala na ang stigma na scam ang crypto.Anyway madami pa dn bng regular viewers ang pba except sa laban ng ginebra kapag regular games lang?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "May 18, 2022, 01:12:32 PM",
      "body": "Another great news, mukhang maganda ang pagpapatakbo ng bagong owner ng coins.ph, naging mas aggressive pa sila sa marketing nila. Mahilig tayo sa PBA, kaya magandang news ito para sa akin, I'm just curious, anong klaseng partnership ang meron sa PBA at coins.ph, hindi naman kasi specific yung nasa news (link).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "May 23, 2022, 01:22:20 PM",
      "body": "Quote from: Beparanf on May 18, 2022, 12:05:01 PMAnyway madami pa dn bng regular viewers ang pba except sa laban ng ginebra kapag regular games lang? Konte lang, kailangan present talaga lagi ang Ginebra kasi sila lang nag aatract ng crowd. Magandang news ito para sa ating crypto enthusiast dahil pinapakita dito na sikat na talaga ang bitcoin through coins.ph. Sana makatulong ito para ma educate ang mga tao to determine ponzi scheme using bitcoin to attract people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "June 04, 2022, 02:07:59 PM",
      "body": "Quote from: Japinat on May 18, 2022, 01:12:32 PMI'm just curious, anong klaseng partnership ang meron sa PBA at coins.ph, hindi naman kasi specific yung nasa news (link).Nag post sila kahapon ng kaunting details sa \"blog\" nila, pero mas detailed yung nabasa kong article sa \"Yahoo\".- Personally, I really like how they'll be using PBA's platform to educate others [sa tingin ko mas malaki ang impact nito, compared sa mga ads].Quote from: https://www.yahoo.com/now/coins-ph-becomes-exclusive-crypto-060000603.htmlCoins.ph will have brand presence featured throughout the Philippine Cup, the PBA's premier tournament, where it will offer interactive experiences to engage fans and promote awareness of all things crypto.~Snipped~Coins.ph will make use of the interactive games on selected matches to allow fans to win free crypto. At the same time, Coins.ph will also be featured on television ads throughout the season.~Snipped~Coins.ph will use its brand presence to increase public awareness of crypto and explain concepts such as blockchain, NFTs, and Web3 to basketball fans across the nation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}