{
  "id": "topic_5433026",
  "title": "BossTrack",
  "author": "BossTrack",
  "created_time": "January 04, 2023, 06:18:50 PMLast edit: January 12, 2023, 01:53:43 PM by BossTrack",
  "content": "Hello, everyone! We’re announcing the beta version of our project is open and free for public use.What is Boss Track? Boss Track simply shows you the performance of your DeFi portfolio in a simple and clean dashboard!WEBSITE | TELEGRAM | MEDIUM | TWITTER | INSTAGRAM | TOKEN Multiple Chains, One DashboardBoss Track is designed to take the 'clunkiness' out of DeFi which has users switching between chains on their web3 wallet and pairing their on-chain assets to stable coins just to see their portfolio's value. Boss Track takes your wallet address and counts the value of your on-chain assets for you! It is compatible with multiple chains, meaning if you have assets of Ethereum and BSC, you will see both chain's assets you own on one single dashboard. Giving you real time profits & loss statistics of each individual asset and the overall portfolio's performance.Boss Track is currently compatible with the following chains with more to be added soon:Ethereum ERC20Binance Smart ChainPolygonAvalancheCronosStart Tracking Your Wallet In SecondsBoss Track doesn't require any download, signup or even site permissions from your web3 wallet. To start tracking your wallet is incredibly simple and fast, all you need to do is go to the Boss Track Webiste and click the \"Connect Wallet\" button. Then paste your wallet address into the field.Click 'Go' and that's it! Boss Track will show you a dashboard and begin tracking the p&l and price movements of assets in your wallet. Your wallet address is saved into your browser's cookies and you can check the performance of your portfolio at any time.Boss Track Beta",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433026",
  "comments": [
    {
      "author": "BossTrack",
      "created_time": "January 04, 2023, 06:19:32 PM",
      "body": "This post is reserved for an important future update on the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 07, 2023, 04:31:06 PM",
      "body": "As you're not offering a token and more toward announcing your portfolio tracker platform, I think this board would suite you better: service announcement. You can move your thread by clicking the \"move topic\" button at the very end of this page, left side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BossTrack",
      "created_time": "January 12, 2023, 01:52:49 PM",
      "body": "Quote from: holydarkness on January 07, 2023, 04:31:06 PMAs you're not offering a token and more toward announcing your portfolio tracker platform, I think this board would suite you better: service announcement. You can move your thread by clicking the \"move topic\" button at the very end of this page, left side.We have a token called Boss Token: https://bosstoken.com/ which is currently on BSC and will be used unlock premium features on Boss Track aside from having rewards distributed to holders and deflationary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 12, 2023, 04:28:38 PM",
      "body": "Can't help but being curios, does your platform also offers a tracking service for multiple address? For example, I have an metamask-based ERC wallet and then when trustwallet became a trend, I also have a wallet on TW, with some of my assets on MM still sitting there these days. Can I put both addresses on your plarform and simultaneously knows my entire assets on both wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BossTrack",
      "created_time": "January 12, 2023, 08:25:55 PM",
      "body": "Quote from: holydarkness on January 12, 2023, 04:28:38 PMCan't help but being curios, does your platform also offers a tracking service for multiple address? For example, I have an metamask-based ERC wallet and then when trustwallet became a trend, I also have a wallet on TW, with some of my assets on MM still sitting there these days. Can I put both addresses on your plarform and simultaneously knows my entire assets on both wallet?Sure thing, you can track multiple wallet addresses and switch between them easily. Once you add a wallet address it gets saved in your browser cookies so you don't have to go through the hassle of signing into your different web3 wallets just to see your portfolio's value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "January 12, 2023, 08:31:51 PM",
      "body": "well, the concept is good. but if in case, there's at least one of the members of the team who has ill intentions in his mind, this service may give him idea which wallets have valuable assets. we don't know to what extent of record they will have upon using their site. i am just playing a devil's advocate here. you can always prove wrong and make your platform a useful one to crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 13, 2023, 12:09:43 AM",
      "body": "Quote from: BossTrack on January 12, 2023, 08:25:55 PMQuote from: holydarkness on January 12, 2023, 04:28:38 PMCan't help but being curios, does your platform also offers a tracking service for multiple address? For example, I have an metamask-based ERC wallet and then when trustwallet became a trend, I also have a wallet on TW, with some of my assets on MM still sitting there these days. Can I put both addresses on your plarform and simultaneously knows my entire assets on both wallet?Sure thing, you can track multiple wallet addresses and switch between them easily. Once you add a wallet address it gets saved in your browser cookies so you don't have to go through the hassle of signing into your different web3 wallets just to see your portfolio's value.Ahh, maybe I was a little bit unclear. Allow me to clarify using your attached picture. Is there a page that shows all of those assets on \"Personal 1\", \"Shib #2\" and \"double up\" into one?So, suppose I have 3 eth and 20 BNB on \"Personal 1\", 50 eth, 3 BNB and 1,000 usdt on \"Shivb #2\", and 3 xrp on \"double up\", the \"overview\" --or whatever they're named-- page will shows:- 53 eth- 23 BNB- 3 xrp- 1,000 USDTinsread of having to select each wallet and look at the amount on the said wallet individually?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BossTrack",
      "created_time": "January 14, 2023, 10:09:08 PM",
      "body": "Quote from: AmoreJaz on January 12, 2023, 08:31:51 PMwell, the concept is good. but if in case, there's at least one of the members of the team who has ill intentions in his mind, this service may give him idea which wallets have valuable assets. we don't know to what extent of record they will have upon using their site. i am just playing a devil's advocate here. you can always prove wrong and make your platform a useful one to crypto users.You don't have to worry about anything malicious occurring for the following reasons.1. The only information input to BossTrack is a wallet address, we don't collect information such as e-mail, phone, name or any usual profile information that could help a bad actor to social engineer a CEX account or government to track you. We know as much about wallet holders as the blockchain does.2. We don't connect or require permission from a web3 wallet, there is no contract being signed by users - it simply displays info on the blockchain in an easier to digest format.3. I designed the project to have as few vulnerabilities for users as possible, even in a worst case scenario and the project is compromised by a hacker - they simply have a page that takes API data from BSCscan, Etherscan, etc with zero control of your web3 wallet or any of your personal info.Quote from: holydarkness on January 12, 2023, 04:28:38 PMAhh, maybe I was a little bit unclear. Allow me to clarify using your attached picture. Is there a page that shows all of those assets on \"Personal 1\", \"Shib #2\" and \"double up\" into one?So, suppose I have 3 eth and 20 BNB on \"Personal 1\", 50 eth, 3 BNB and 1,000 usdt on \"Shivb #2\", and 3 xrp on \"double up\", the \"overview\" --or whatever they're named-- page will shows:- 53 eth- 23 BNB- 3 xrp- 1,000 USDTinsread of having to select each wallet and look at the amount on the said wallet individually?Yeah, we actually have the code for a multiwallet view that combines all portfolios together, although it's not live right now we are considering implementing this as part of a premium feature for holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}