{
  "id": "topic_5454831",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "June 02, 2023, 07:46:16 AMLast edit: June 02, 2023, 10:12:27 PM by letteredhub",
  "content": "Having a proper knowledge of cryptocurrency helps you avoid unnecessary losses by being victim of scams, notwithstanding if the scammers are passing through a close friend or relative of yours in introducing it (investment project) to you, by your common enlightenment of cryptocurrency you will be able to quickly discern they are fraud despite whatever buzzwords they may use in their bid to deceive you. In that scenario you don't only help yourself escape from falling victim but also exhume such a friend or relative too. In extension, your knowledge of cryptocurrency equips you to avoid platforms that promises offers that are too good to be true as return on your investments.How fraudulent persons easily take advantage of you is in your urgency to invest. Get knowledge first before you invest or trade in cryptocurrency rather than putting your money into what you have no understanding on.Every experienced crypto enthusiasts always talks about the avoidance of greed and that's because it does matters and can't be overemphasized. Keep off from greed avoid being part of those that are interested in making money for doing nothing. In the initial footing of your crypto quest learning should be a focal point.Cryptocurrency is no doubt a revolutionary adoption that is successively moving across the board into different facet of the society and if you don't learn to have a proper knowledge about it now you're going to be left behind when the global acceptance multiplies more than it is today. At the end of the day learning can not be overemphasized in life.EDITHere some materials source I uncover from the forum that could be of assistance to any newbie interested to learn, they may not touch purely on investment but it's a good starting point for learning and  you can go further by DYOR on more informations through other sources.Beginners guide to btchttps://learnmeabitcoin.com/beginnershttps://bitcointalk.org/index.php?topic=1631151.msg16405643#msg16405643https://bitcointalk.org/index.php?topic=3469416.0https://bitcointalk.org/index.php?topic=2968050.0https://learnmeabitcoin.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454831",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "June 02, 2023, 08:54:48 AM",
      "body": "Quote from: letteredhub on June 02, 2023, 07:46:16 AMHow fraudulent persons easily take advantage of you is in your urgency to invest. Get knowledge first before you invest or trade in cryptocurrency rather than putting your money into what you have no understanding on.One needs to seek for knowledge and adequate information before engaging in taking any step of investment in cryptocurrency, also you shouldn't assume you know it all when you're just yet to get started, a half baked cake is not a cake at all, lack of information will get one deformed because there will be loss of asset involved and any scam or fraudulent activities to experience along the way.Quote from: letteredhub on June 02, 2023, 07:46:16 AMEvery experienced crypto enthusiasts always talks about the avoidance of greed and that's because it does matters and can't be overemphasized. A greedy man is an impatient being that always like to forcefully achieve a landmark success in life without being patient enough for their own time and turn to come, such individuals are are not contempted and cannot appreciate the value of what they have, not until they loose everything together on the course to gain everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 02, 2023, 09:39:21 AM",
      "body": "Knowledge is the cornerstone of every success, including Bitcoin investment. If you have a good understanding of Bitcoin and cryptocurrencies and how they work, it will be difficult for you to fall for the most popular types of scams in the crypto sector, but some individuals prefer to start without studying, which is why the majority of them wind up falling prey to various scams.Quote from: letteredhub on June 02, 2023, 07:46:16 AMHow fraudulent persons easily take advantage of you is in your urgency to invest. Get knowledge first before you invest or trade in cryptocurrency rather than putting your money into what you have no understanding on.The urgency to invest is primarily induced by FOMO; everyone will be eager to invest so that they do not miss out, and as a result, they will make silly errors that may lead to them being scammed.QuoteEvery experienced crypto enthusiasts always talks about the avoidance of greed and that's because it does matters and can't be overemphasized. Keep off from greed avoid being part of those that are interested in making money for doing nothing. In the initial footing of your crypto quest learning should be a focal point.Most people who see cryptocurrency as a get-rich-quick scheme are greedy, and they will likely accept any offer of high returns that the scammers make them in order to gain quick money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "June 02, 2023, 11:57:58 AM",
      "body": "Quote from: letteredhub on June 02, 2023, 07:46:16 AMHaving a proper knowledge of cryptocurrency helps you avoid unnecessary losses by being victim of scams, notwithstanding if the scammers are passing through a close friend or relative of yours in introducing it (investment project) to you, by your common enlightenment of cryptocurrency you will be able to quickly discern they are fraud despite whatever buzzwords they may use in their bid to deceive you. In that scenario you don't only help yourself escape from falling victim but also exhume such a friend or relative too. In extension, your knowledge of cryptocurrency equips you to avoid platforms that promises offers that are too good to be true as return on your investments.They should never go on somethings they don't know even if this is introduce by their friend or family since they don't know if this will result to any positive approach to them. So best before going on something risky much better if they should research first the information you receive so that we can define that this is good and not a shady platform to invest. There's so many ways to ask for feedback and this is the importance of this community since we can ask various people who's more experience to us and get helpful information by the advice given.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 02, 2023, 01:47:39 PM",
      "body": "Any undertaking of something new, by itself, implies learning. How will you deal with what you don't understand? But I agree that if a person comes to crypto, the rush to invest in different types of coins, of which there are a lot today, can lead to the loss of their money.I always thought that money is hard for people; if you do not want losses, you will learn about the project ten times from all sides, and only then will you risk becoming an investor.Although, of course, beginners need to follow strictly one leading Bitcoin, learn all the ways to handle and store it, and then go and buy.As a logical conclusion, for everything that you are interested in, knowledge is needed, and the more of it, the more successful the business will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "June 02, 2023, 01:58:08 PM",
      "body": "Your OP might be able to add some information regarding what knowledge a beginner might have. because indeed every beginner will not seriously put their money into the market without knowledge. they will study first. but sometimes the knowledge they get is not accurate enough to help them choose investment or trading assets.you may not need to rewrite it if additional information is already on this board. you just have to make it a reference for beginners. I hope you are willing to add it and of course, it will really help beginners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "June 02, 2023, 02:19:29 PM",
      "body": "Quote from: Pandu Geddon on June 02, 2023, 01:58:08 PMYour OP might be able to add some information regarding what knowledge a beginner might have. because indeed every beginner will not seriously put their money into the market without knowledge. they will study first. but sometimes the knowledge they get is not accurate enough to help them choose investment or trading assets.you may not need to rewrite it if additional information is already on this board. you just have to make it a reference for beginners. I hope you are willing to add it and of course, it will really help beginners. I am second the motion for this, Op must add a little bit good information because as we all know that once a beginners try to enter the Crypto world then they must have enough knowledge becausee sometimes they will see or learn not accurate knowledge then that's the reason why some investors will failed. And if they have enough and accurate details then one thing for sure they will be a successful one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "June 02, 2023, 04:02:35 PM",
      "body": "Quote from: lovesmayfamilis on June 02, 2023, 01:47:39 PMAny undertaking of something new, by itself, implies learning. How will you deal with what you don't understand? But I agree that if a person comes to crypto, the rush to invest in different types of coins, of which there are a lot today, can lead to the loss of their money.Actually the thing is most of the people becoming interested in crypto investment are those who get influenced by paid shillers who somehow attract them to invest in different projects from whom they are paid.This is why they rush to invest without even learning about the team background what project is offering and why they will get returns for it but simply blindly follow their advice and regret later on.You also know how many coins come on daily basis but what utility they are serving as compared to bitcoin like currencies against they are competing? Nothing but the newbie investors surrounded by greed jump into them and loose funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 02, 2023, 04:09:07 PM",
      "body": "Quote from: letteredhub on June 02, 2023, 07:46:16 AMCryptocurrency is no doubt a revolutionary adoption that is successively moving across the board into different facet of the society and if you don't learn to have a proper knowledge about it now you're going to be left behind when the global acceptance multiplies more than it is today.It has adoption like no other else. But come to think of it, many users only view as crypto as money multiplier and government see this unfit. Why? Cause its easy and very convenient to investors. But hence some losses money due to greediness and lack of knowledge like what you have said. Its alway better to be agressive at a right time and be secured when its needed so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 02, 2023, 04:30:42 PM",
      "body": "Investment in Crypto takes a lot of time in you knowing what you are investing in. Being a newbie to Crypto, it is advisable that one needs to properly know about Crypto to gain more knowledge about it as scammers take advantage of newbies since they know newbies are desperate to invest in new projects. They will take advantage of that opportunity to persuade you to invest in their project and once you do that,  the rest is history, your funds are all gone and it will be story upon story which does make any meaning.These are the reasons newbies are advised to properly take out time to study about Crypto so as to know when a scammer comes to you in the name of investing in their projects.I believe this thread would give insight to newbies and the reasons they must learn about bitcoin and Crypto in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 02, 2023, 04:33:08 PM",
      "body": "No one can learn from others' experiences, go experience it yourself and write your own journey. Do not copy. Do not emphasis someone's learning in your life.Not everyone's life is the same, and so does the experiences. Go try out everything you need in Cryptoverse and once you start making mistakes, you will understand that you are growing.Because the one who does not do mistakes, never learns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 02, 2023, 04:49:53 PM",
      "body": "Quote from: ImThour on June 02, 2023, 04:33:08 PMNo one can learn from others' experiences, go experience it yourself and write your own journey. Do not copy. Do not emphasis someone's learning in your life.Not everyone's life is the same, and so does the experiences. Go try out everything you need in Cryptoverse and once you start making mistakes, you will understand that you are growing.Because the one who does not do mistakes, never learns.Mate, I believe mistakes sometimes are as a result of carelessness of the individual in particular.There is a saying that says \" what an elder sees while seating, a child cannot see it while standing\"  whey I say this,  learning from people's experience is not a bad thing but it aids you to apply the principles of that person who had the experience coupled to your own knowledge to best handle that situation or challenges to achieving success. The time wasted while trying to learn is not bad but it is bad when you fail to apply some principles of the knowledge you have from others who have been there before you to enable you scale through the process. In this case, when ever a situation arises that seems difficult, one can easily apply a method he or she has already heard about to that situation which would make them come through.With the above as explained, I think learning from experience is not bad but a good one to expand your knowledge and horizon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "June 02, 2023, 04:58:49 PM",
      "body": "QuoteHow fraudulent persons easily take advantage of you is in your urgency to invest. Get knowledge first before you invest or trade in cryptocurrency rather than putting your money into what you have no understanding on.Not only the urgency to invest but also the ignorance over the subject.  Even with the urgency to invest if a person knows what he is doing, he will never fall into the trap of scammers.  I think people who are easily scammed are those that are too greedy and lack knowledge of the area where they are engaging.  I fully agree that we must never put our money on something we have little to no knowledge.  Or let other drive us and make a decision for us since if they are the people who are convincing us, they might lead us to their trap because seldom of these people will decide for our good, they will always the path towards their advantage.QuoteEvery experienced crypto enthusiasts always talks about the avoidance of greed and that's because it does matters and can't be overemphasized. Keep off from greed avoid being part of those that are interested in making money for doing nothing. In the initial footing of your crypto quest learning should be a focal point.True that, I have seen lots of people blinded by greed lose their lifelong savings.  They hastily invest without verifying the legitimacy of the offer of the scammers. QuoteCryptocurrency is no doubt a revolutionary adoption that is successively moving across the board into different facet of the society and if you don't learn to have a proper knowledge about it now you're going to be left behind when the global acceptance multiplies more than it is today. At the end of the day learning can not be overemphasized in life.One shouldn't underestimate the power of education, in every venture we must educate ourselves about the investments.  We must also learn to know the current uptrend, and hot topics of the economy so that we can go with the flow and won't be left behind.  Many people missed opportunities because of the lack of knowledge of what is trending and hot in the market, while many companies aren't able to cope up with changes because they ignore the power of knowlege about the recent event of the area they are involved with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "June 02, 2023, 05:55:21 PM",
      "body": "Tye cryptocurrency world is a place where we ought to know what we are doing or else we might just end up keep losing money without knowing what could be our problems. The community is fair enough and for those that don't want to acquire the necessary and adequate information about crypto and it market, they will keep complaining about not earning from the market. Most time this is due to our rush to  quickly want to invest without having someone to guide us through the journey. It is very important to keep doing our own research as either a crypto investor or trader. We need to ask questions about what we don't have proper comprehensive knowledge about so we can keep learning non stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 02, 2023, 06:12:10 PM",
      "body": "Quote from: ImThour on June 02, 2023, 04:33:08 PMNo one can learn from others' experiences, go experience it yourself and write your own journey. Do not copy. Do not emphasis someone's learning in your life.Not everyone's life is the same, and so does the experiences. Go try out everything you need in Cryptoverse and once you start making mistakes, you will understand that you are growing.Because the one who does not do mistakes, never learns.We certainly can learn from others experience if we are smart enough, I don't really want to risk everything on my own so I will look for the review, feedbacks from the others who already experienced it. And that is why we have forum like platforms where everyone share their information which might be helpful for someone else.But we can't understand everything without trying it on our own so we need to be smart as well as cautious when it comes to money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "June 02, 2023, 06:26:17 PM",
      "body": "It's prolly the same thing that's been said over and over again in here...As much as I know, in a proper circulation pump, funds must leave one exit address into another receiving address - willingly or not,.. either ways, it must happen,.. just don't be the victim in these case.Therefore any newbie that doesn't wanna pay with 'em hard earned bucks for not doing the right thing shouldn't hesitate to learn and follow the rules of the game. Pseudonymity is the core-rule in the game and whatsoever isn't acknowledged under the rule falls a victim.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 02, 2023, 08:47:22 PM",
      "body": "Quote from: letteredhub on June 02, 2023, 07:46:16 AMHow fraudulent persons easily take advantage of you is in your urgency to invest. Get knowledge first before you invest or trade in cryptocurrency rather than putting your money into what you have no understanding on.Is probably on of the most popular advice giving to newbies coming into cryptocurrency. Firstly I would say it is the narrative most people get coming into cryptocurrency, which is to get rich quick.  some of them just come in and they subscribe for signals or they act on FOMO, this makes them not to focus on having the fundamentally knowledge about it. In as much as I would advise someone to wait till he acquires enough knowledge aside the security knowledge before going to trading, I would also suggest he takes some funds he can lose and hodl for long. This will give him more experience and coupled with the knowledge he is acquiring the road to been a successful trader will be easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "June 02, 2023, 09:44:12 PM",
      "body": "Quote from: Pandu Geddon on June 02, 2023, 01:58:08 PMYour OP might be able to add some information regarding what knowledge a beginner might have. because indeed every beginner will not seriously put their money into the market without knowledge. they will study first. but sometimes the knowledge they get is not accurate enough to help them choose investment or trading assets.you may not need to rewrite it if additional information is already on this board. you just have to make it a reference for beginners. I hope you are willing to add it and of course, it will really help beginners.Thank you for the recommendation as initially I never thought of that in mind but as you have said I'll do well put up some sources of information that they be of help  and I'll do appreciate if any body can also drop in some materials with the needed informations as it concerns the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "June 02, 2023, 11:25:49 PM",
      "body": "Quote from: letteredhub on June 02, 2023, 07:46:16 AMHow fraudulent persons easily take advantage of you is in your urgency to invest. Get knowledge first before you invest or trade in cryptocurrency rather than putting your money into what you have no understanding on.Knowledge is crucial in all aspects of life, but it's especially crucial when it comes to business or investing. Before undertaking any action, one must be well-informed; otherwise, it will be very difficult to achieve success.Therefore, having a thorough understanding of Bitcoin and cryptocurrencies in general is essential for success in the cryptocurrency sector.QuoteEvery experienced crypto enthusiasts always talks about the avoidance of greed and that's because it does matters and can't be overemphasized. Keep off from greed avoid being part of those that are interested in making money for doing nothing. In the initial footing of your crypto quest learning should be a focal point.Because of this greed, a lot of people lose money in the cryptocurrency industry very easily. When someone is eager to make quick money in the cryptocurrency industry, they will never know the right direction because their aim will just be in a place where they can make it easily and that can easily lead them to make wrong decisions.However, you can only be successful in the crypto sector if you have a solid understanding of cryptocurrencies in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 02, 2023, 11:26:02 PM",
      "body": "Apart from having a good knowledge of cryptocurrency in order to avoid scam, another thing that leads people, especially newbies to scam is greed.Pay one and recieve two;Some people actually believes there is free money somewhere out there waiting to be grabbed and that is why they fall victim of scams promising them unrealistic returns and in the end, most of them end up concluding that cryptocurrency is scam, not knowing that they are the ones that chose scammy projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}