{
  "id": "topic_5444490",
  "title": "Myrzapb",
  "author": "Myrzapb",
  "created_time": "March 11, 2023, 03:09:18 PM",
  "content": "Understandably this network has a competitor (Arbitrum) however arbitrum doesn't have a coin, Both networks (Arbitrum and Optimism) are built to scale ethereum (solve high fees problems etc).Optimism currently trading at $1.84 by the time of writing (feels a bit oversold).Looking at https://coinmarketcap.com/rankings/exchanges/dex/ (Dex 24 hours trading volume) Arbitrum has second largest trading volume while Optimism is fifth.So i was wondering if OP is nothing but a hyped up coin or is it good enough for the long term (3-4 years) ?Haven't made much research either, please correct me if im wrong.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444490",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "March 11, 2023, 04:13:19 PM",
      "body": "If you look at the charts of DEXs, you will find that there have been insane increases during the last two years, and perhaps the reason for this is the fee problem, but will fees be a big problem, or at least a hot topic during the next 4 years? I doubt a lot about that because the continuity of the problem will negatively affect the currency, especially since it moved to POS",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "March 13, 2023, 01:56:12 PM",
      "body": "Quote from: Myrzapb on March 11, 2023, 03:09:18 PMUnderstandably this network has a competitor (Arbitrum) however arbitrum doesn't have a coin, Both networks (Arbitrum and Optimism) are built to scale ethereum (solve high fees problems etc).Optimism currently trading at $1.84 by the time of writing (feels a bit oversold).Looking at https://coinmarketcap.com/rankings/exchanges/dex/ (Dex 24 hours trading volume) Arbitrum has second largest trading volume while Optimism is fifth.So i was wondering if OP is nothing but a hyped up coin or is it good enough for the long term (3-4 years) ?Haven't made much research either, please correct me if im wrong.This optimism hype is due to multiple airdrops given by the optimism ecosystem. So most users are trying to participate in Optimism ecosystems projects. Then OP  market value will increase. In the case of Arbitrum, they do not have their own token or airdrops yet. I am not recommended holding OP for 2-3 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "March 13, 2023, 02:56:11 PM",
      "body": "This issue has been discussed for a long time. Just recently read about it. The article discussed more advantages of Arbitrum in comparison with Optimism. In fact, these are basically similar protocols and only time will tell which of them is better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "March 13, 2023, 05:27:01 PM",
      "body": "@Myrzapb, I personally haven't had more research related to Optimism (OP), but AFAIK, they get public attention after they have an airdrop program. So the conclusion that I can say from my current POV is... yes, Optimism is a hyped token. FYI, currently the price of Optimism (OP) is at $ 2.57 with a percentage increase of 38.82%. These tokens are not good to hold for a long time, because the hype will be temporary, just like what happened with AI tokens recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FirmWars",
      "created_time": "March 16, 2023, 06:57:28 PM",
      "body": "Quote from: @sriyan on March 13, 2023, 01:56:12 PMQuote from: Myrzapb on March 11, 2023, 03:09:18 PMUnderstandably this network has a competitor (Arbitrum) however arbitrum doesn't have a coin, Both networks (Arbitrum and Optimism) are built to scale ethereum (solve high fees problems etc).Optimism currently trading at $1.84 by the time of writing (feels a bit oversold).Looking at https://coinmarketcap.com/rankings/exchanges/dex/ (Dex 24 hours trading volume) Arbitrum has second largest trading volume while Optimism is fifth.So i was wondering if OP is nothing but a hyped up coin or is it good enough for the long term (3-4 years) ?Haven't made much research either, please correct me if im wrong.This optimism hype is due to multiple airdrops given by the optimism ecosystem. So most users are trying to participate in Optimism ecosystems projects. Then OP  market value will increase. In the case of Arbitrum, they do not have their own token or airdrops yet. I am not recommended holding OP for 2-3 years. Do you know that airdrop is a good marketing strategy in the crypto space? So you saying that it was because of OP airdrop that's why it has so much hype is wrong, shiba inu, for example, did no airdrop, instead, they took advantage of Dogecoin's success, if you are a developer you need to make use of any possible hype or strategy that can make your project more noticeable, yet, optimism works as intended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "March 16, 2023, 11:39:05 PM",
      "body": "with presence of arbitrum token it surely gonna change the tide I guess as you said optimism already oversold, many will switch over to arbitrum once the token is public for the sake of profit.but then again both still have relevancy as long as they are still solving what ethereum couldn't solve so I guess investing in one of them still a good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}