{
  "id": "topic_5410164",
  "title": "taufik123",
  "author": "taufik123",
  "created_time": "August 17, 2022, 02:25:18 AMLast edit: August 18, 2022, 03:43:43 AM by taufik123",
  "content": "Hari ini merupakan hari bersejarah bagi bangsa Indonesia, Tanggal 17 Agustus 2022 merupakan hari kemerdekaan bangsa indonesia. Indonesia saat ini memiliki Slogan baru yaitu \"Pulih Lebih Cepat Bangkit Lebih Kuat\" dengan harapan bangsa indonesia mampu bertahan dalam kondisi apapun dan bertahan lebih kuat dalam menghadapi segala macam rintangan. Kemerdekaan indonesia bukan hanya kemerdekaan melawan para penjajah, namun kemerdekaan memiliki banyak makna salah satunya Kemerdekaan secara ekonomi.Berbicara tentang ekonomi, disini saya akan membahas tentang perjalanan Sejarah & Regulasi Cryptocurrency di Indonesia:2013 - Mata Uang crypto memasuki pasar perdagangan dengan 3 Exchange yang tersedia untuk melakukan transaksi bitcoin seperti sistem di marketplace. Exchanger bekerja sebagai pihak ketiga dengan menyediakan sistem OTC ( Over the Counter ) yang nantinya akan dikenakan PPN 10 persen dan juga split harga dari jumlah transaksi yang dilakukan.2017 - Ketik harga bitcoin terus naik dan mencapai ATH sekitar $19.000 menjelang akhir tahun 2017, bitcoin mulai booming dan diberitakan di berbagai media sehingga banyak investor baru yang masuk ke bitcoin. Seiring berjalannya waktu harga bitcoin dan beberapa crypto lainnya terus naik.2018 - Bank Indonesia menegaskan pelarangan penggunaan Virtual Currencysebagai alat pembayaran yang sah karena tidak sesuai dengan UU 7/2011 Tentang Mata Uang. Merujuk pada aturan Bank Indonesia tersebut pemerintah melalui siaran pers 12 januari 2018 disebutkan salat satu resiko memiliki dan memperjualbelikan mata uang virtual yang tidak memiliki kejelasan underlying asset yang mendasari nilainya, transaksi asset virtual yang spekulatif akan menimbulkan resiko penggelembungan atau bubble sehingga bisa merugikan masyarakat dan juga berpotensi mengganggu stabilitas sistem keuangan.2019 -  Pertama kalinya Regulasi Mata uang cryptocurrency dinyatakan legal sebagai asset komoditas di indonesia berdasarkan peraturan Badan Pengawasan Perdagangan Berjangka Komoditi ( BAPPEBTI ) Nomor 5 Tahun 2019, yang mengatur tentang ketentuan teknis penyelanggaraan Pasar Fisik Aset Kripto ( Crypto Asset ) pada Bursa Berjangka. 2020 - BAPPEBTI mengeluarkan peraturan lain tentang transaksi mata uang kripto Nomor 7 Tahun 2020Tentang bagaimana penetapan aset kripto yang dapat di perdagangkan di pasar fisik aset kripto dengan mencantumkan 229 jenis mata uang kripto yang legal untuk di perdagangkan di pasar komoditi indonesia.2021 - Berdasarkan data yang dimiliki BAPPEBTI jumlah investor cryptocurrency di indonesia mencapai sekitar 9.5 juta investor. sementara jumlah transaksi aset crypto investor indonesia mencapai Rp478.5 Triliun rupiah per juli 2021 dan transaksi pasar crypto indonesia rata-rata mencapai Rp1.7 triliun rupiah perhari.2022 - BAPPEBTI menerbitkan aturan baru terkait dengan cryptocurrency Nomor 11 tahun 2022, tentang regulasi baru yang menambahkan jumlah aset crypto yang di perdagangkan, yang awalnya 229 aset crypto tahun 2020 kini bertambah menjadi 383 aset crypto ditahun 2022. Regulasi ini dapat mendorong peningkatan keamanan investor aset crypto. Inti dari regulasi terbaru tersebut adalah:1. Pedoman teknis baru pada penilaian aset crypto yang layak dan legal untuk diperdagangkan di pasar indonesia.2. Melarang bursa untuk melakukan perdagangan crypto yang berada diluar aset crypto legal yang sudah terdaftar.3. Memberikan sanksi bagi bursa yang melakukan pelanggaran peraturan baru ini dan pihak mana saja yang menjadi bagian dari tim penilaian status legalitas aset crypto indonesia.4. Melakukan pelaksanaan peninjauan kembali pada status legalitas minimal setiap satu tahun sekali dan melakukan pencabutan aset crypto yang berada dibursa indonesia saat ini.Sumber:https://zipmex.com/id/learn/sejarah-cryptocurrency-lika-liku-aset-kripto/https://kompaspedia.kompas.id/baca/paparan-topik/mata-uang-kripto-dari-sejarah-awal-hingga-regulasi-di-indonesiahttps://katadata.co.id/desysetyowati/digital/62f5f1c538b5a/ada-aturan-baru-kripto-transaksi-bitcoin-cs-diramal-melonjak-di-ri",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410164",
  "comments": [
    {
      "author": "Husna QA",
      "created_time": "August 17, 2022, 03:43:19 AMLast edit: May 16, 2023, 03:17:31 PM by Husna QA",
      "body": "Sedikit saran/ralat atau mungkin penambahan sumber untuk melengkapi pada beberapa poin berikut:Quote from: taufik123 on August 17, 2022, 02:25:18 AM2013 - Mata Uang crypto memasuki pasar perdagangan dengan 3 Exchange yang tersedia untuk melakukan transaksi bitcoin seperti sistem di marketplace. Exchanger bekerja sebagai pihak ketiga dengan menyediakan sistem OTC ( Over the Counter ) yang nantinya akan dikenakan PPN 10 persen dan juga split harga dari jumlah transaksi yang dilakukan.Mungkin bisa disebutkan 3 exchange yang dimaksud yang mana saja.Quote from: taufik123 on August 17, 2022, 02:25:18 AM2017 - Ketik harga bitcoin terus naik dan mencapai ATH sekitar $19.000 menjelang akhir tahun 2017, bitcoin mulai booming dan diberitakan di berbagai media sehingga banyak investor baru yang masuk ke bitcoin. Seiring berjalannya waktu harga bitcoin dan beberapa crypto lainnya terus naik.Berikut ini data yang diperoleh dari https://coinmarketcap.com/currencies/bitcoin/:Quote from: taufik123 on August 17, 2022, 02:25:18 AM2018 - Bank Indonesia menegaskan pelarangan penggunaan Virtual Currencysebagai alat pembayaran yang sah karena tidak sesuai dengan UU 7/2011 Tentang Mata Uang. Merujuk pada aturan Bank Indonesia tersebut pemerintah melalui siaran pers 22 januari 2018 disebutkan salat satu resiko memiliki dan memperjualbelikan mata uang virtual yang tidak memiliki kejelasan underlying asset yang mendasari nilainya, transaksi asset virtual yang spekulatif akan menimbulkan resiko penggelembungan atau bubble sehingga bisa merugikan masyarakat dan juga berpotensi mengganggu stabilitas sistem keuangan.Dari informasi yang saya telusuri, siaran pers BI tersebut bukan terbit 22 Januari 2018 tapi 12 Januari 2018.https://www.bi.go.id/id/publikasi/ruang-media/news-release/Pages/sp_200418.aspx:Berikut ini link dari UU ataupun beberapa peraturan yang disebutkan di OP:- UU RI No. 7 Tahun 2011 Tentang Mata Uang:  https://jdih.bumn.go.id/baca/UU Nomor 7 Tahun 2011.pdf- Peraturan BAPPEBTI Nomor 5 Tahun 2019:  http://bappebti.go.id/resources/docs/peraturan/sk_kep_kepala_bappebti/sk_kep_kepala_bappebti_2019_02_01_w9i365pf_id.pdf- Peraturan BAPPEBTI Nomor 7 Tahun 2020:  https://bappebti.go.id/resources/docs/peraturan/sk_kep_kepala_bappebti/sk_kep_kepala_bappebti_2020_12_01_i6tg8tfb_id.pdf- Peraturan BAPPEBTI Nomor 11 Tahun 2022:  https://bappebti.go.id/resources/docs/peraturan/sk_kep_kepala_bappebti/sk_kep_kepala_bappebti_2022_08_01_fx03j2mm_id.pdfBeberapa ralat kecil lain:- indonesia -> Indonesia- BAPPETI -> BAPPEBTI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "August 18, 2022, 12:06:50 AM",
      "body": "Quote from: taufik123 on August 17, 2022, 02:25:18 AMBerbicara tentang ekonomi, disini saya akan membahas tentang perjalanan Sejarah & Regulasi Cryptocurrency di Indonesia:Walaupun tidak ada hubungan secara langsung dengan tanggal, hari, momen dan sejarah kemerdekaan bangsa Indonesia, setidaknya spirit kemerdekaan ini bisa memacu semangat bagi Rakyat Indonesia pada umumnya dan Member bitcointalk pada khususnya untuk mulai belajar investasi dan menabung bitcoin/crypto sejak dini. karena kalau merunut ke slogan pulih lebih cepat dan bangkit lebih kuat, sulit untuk dilakukan jika tanpa modal semangat bitcoin (dicemooh dan ditekan), apalagi untuk pulih lebih cepat, kalau tanpa modal penunjang seperti investasi, tentu tidak bisa pulih karena perekonomian dunia saat ini sangat tidak stabil akibat perang dan covid, tentu aset mempertahankan nilai seperti bitcoin inilah yang bisa menjaga dan memulihkan anda lebih cepat dan bangkit lebih kuat untuk beberapa tahun kedepan.Happy Independence Day - 77, Indonesia!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 18, 2022, 03:29:55 AMLast edit: August 18, 2022, 03:42:42 AM by taufik123",
      "body": "Quote from: Husna QA on August 17, 2022, 03:43:19 AM-snip-Thanks banget untuk reviewnya om @HusnaQA, memang dan beberapa kata yang belum tepat dan tanggal yang tidak sesuai dan sudah saya edit. Untuk 3 Exchange tersebut saya belum menemukan informasi yang valid, karena bitcoin.co.id AKA indodax berdiri dan beroperasi tanggal 15 Februari 2014.Namun beberapa artikel mengatakan di tahun 2013 ada 3 exchanger yang digunakan namun tanpa informasi yang jelas.Quote from: DroomieChikito on August 18, 2022, 12:06:50 AMQuote from: taufik123 on August 17, 2022, 02:25:18 AMBerbicara tentang ekonomi, disini saya akan membahas tentang perjalanan Sejarah & Regulasi Cryptocurrency di Indonesia:Walaupun tidak ada hubungan secara langsung dengan tanggal, hari, momen dan sejarah kemerdekaan bangsa Indonesia, setidaknya spirit kemerdekaan ini bisa memacu semangat bagi Rakyat Indonesia pada umumnya dan Member bitcointalk pada khususnya untuk mulai belajar investasi dan menabung bitcoin/crypto sejak dini. karena kalau merunut ke slogan pulih lebih cepat dan bangkit lebih kuat, sulit untuk dilakukan jika tanpa modal semangat bitcoin (dicemooh dan ditekan), apalagi untuk pulih lebih cepat, kalau tanpa modal penunjang seperti investasi, tentu tidak bisa pulih karena perekonomian dunia saat ini sangat tidak stabil akibat perang dan covid, tentu aset mempertahankan nilai seperti bitcoin inilah yang bisa menjaga dan memulihkan anda lebih cepat dan bangkit lebih kuat untuk beberapa tahun kedepan.Happy Independence Day - 77, Indonesia!Beberapa sejarah panjang tentang penggunaan dan regulasi cryptocurrency di indonesia ini diharapkan bisa memberikan pandangan bahwa crypto di indonesia terus berkembang seiring waktu, sehingga memberikan minat bagi generasi mudah dan orang awam lainnya untuk mulai masuk ke crypto dan berinevstasi.Semangat bitcoin memang harus dimiliki dan ini menjadi modal bagi pemula agar bisa bertahan dari segala cemoohan dan tekanan dari berbagai kalangan yang tidak suka dengan bitcoin. yang paling penting regulasi tentang cryptocurrency dan bitcoin sudah jelas sebagai asset komoditi.  MERDEKA MERDEKA  MERDEKA  MERDEKA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "August 18, 2022, 05:38:02 AMLast edit: August 18, 2022, 06:11:01 AM by mamesso",
      "body": "Pada alinea pertama pembukaan UUD 45, terdapat alasan Bangsa Indonesia memperjuangkan kemerdekaan, karena kemerdekaan merupakan hak segala bangsa. Kata-kata ini dapat dijadikan motivasi bagi siapa saja untuk memilih jalan hidupnya kearah yang lebih baik untuk masa depannya terutama bagi yang belum kenal dan sedang ingin mendalami investasi dan trading Cryptocurrency.Sejarah dan Regulasi Cryptocurrency di Indonesia telah mengubah pandangan investor khususnya pada bitcoin dan umumnya pada Aset Alternatif lain, Indonesia menjadi salah satu negara yang menyambut kehadiran Cryptocurrency dan teknologi blockchain dengan wajah ramah, dengan adanya beberapa aturan yang mengakomodasi aset crypto menjadi bukti yang tak terbantahkan bahwa Indonesia sangat ramah terhadap aset Crypto.Entah bagaimana jadinya jika Indonesia tidak melegalisasi perdagangan aset kripto, setidaknya tidak ada jaminan legalitas Trading atau investasi di Indonesia. Tentu kita yang sudah mengenal Crypto akan mengalami kesulitan untuk mengkonversi Crypto ke FIAT IDR karena Bappebti tidak memberi izin pada bursa kripto lokal.Terimakasih Indonesia-Ku yang telah memberi kemudahan dan melegalisasi perdagangan aset kripto, kemudahan demi kemudahan yang difasilitasi dapat membawa Aset Crypto semakin berkembang di Indonesia.Dirgahayu Republik Indonesia yang ke 77, tetap semangat dalam memperjuangkan banyak hal demi kemakmuran seluruh anak negeri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 18, 2022, 11:59:12 PM",
      "body": "Agan @taufik123, saya lihat thread serupa yang agan buat namun dalam versi bahasa Inggris (https://bitcointalk.org/index.php?topic=5410166.0) saat ini berada di lokal board Indonesia (asumsi saya di pindah oleh moderator). Mungkin agan bisa mempertimbangkan untuk di lock karena jadinya terkesan double thread di board yang sama.Quote from: taufik123 on August 18, 2022, 03:29:55 AMUntuk 3 Exchange tersebut saya belum menemukan informasi yang valid, karena bitcoin.co.id AKA indodax berdiri dan beroperasi tanggal 15 Februari 2014.Namun beberapa artikel mengatakan di tahun 2013 ada 3 exchanger yang digunakan namun tanpa informasi yang jelas.Nah 3 exchange tersebut juga yang membuat saya penasaran karena dari yang saya tahu, Indodax ini yang merupakan exchange cyptocurrency pertama di Indonesia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "August 19, 2022, 08:05:07 PM",
      "body": "Quote from: mamesso on August 18, 2022, 05:38:02 AMPada alinea pertama pembukaan UUD 45, terdapat alasan Bangsa Indonesia memperjuangkan kemerdekaan, karena kemerdekaan merupakan hak segala bangsa. Kata-kata ini dapat dijadikan motivasi bagi siapa saja untuk memilih jalan hidupnya kearah yang lebih baik untuk masa depannya terutama bagi yang belum kenal dan sedang ingin mendalami investasi dan trading Cryptocurrency.Apa hubungannya, Om?BTW, tidak semua yang berinvestasi atau trading di crypto berujung dengan happy ending. Kalau agan perhatikan, banyak juga yang mengalami bad ending. Terlepas itu dari kesalahan individual atau faktor bad luck, dengan fakta ini kita tidak bisa mengatakan kenal dan mendalami crypto bisa mendapatkan masa depan yang lebih baik. Tetap saja ada dua kemungkinan; (1) sukses = masa depan lebih bagus, atau (2) gagal = masa depan tidak lebih baik.  Quote from: mamesso on August 18, 2022, 05:38:02 AMSejarah dan Regulasi Cryptocurrency di Indonesia telah mengubah pandangan investor khususnya pada bitcoin dan umumnya pada Aset Alternatif lain, Indonesia menjadi salah satu negara yang menyambut kehadiran Cryptocurrency dan teknologi blockchain dengan wajah ramah, dengan adanya beberapa aturan yang mengakomodasi aset crypto menjadi bukti yang tak terbantahkan bahwa Indonesia sangat ramah terhadap aset Crypto.Tidak juga, Om. Dari dulu bahkan sampai saat ini, tetap saja ada institutsi/lembaga atau kelompok tertentu yang masih memandang crypto itu tidak layak untuk menjadi pilihan aset. Salah satu contohnya adalah OJK, mereka tetap bersikukuh melarang lembaga jasa keungan untuk memfasilitasi crypto. Selain itu, ada juga MUI yang mengeluarkan fatwa haram atas investasi crypto.Beberapa artikel di bawah ini mungkin bisa mewakili alsan mengapa saya katakan bahwa Indonesia belum bisa dikatakan ramah:- https://www.liputan6.com/bisnis/read/3921456/5-alasan-pemerintah-keluarkan-larangan-bitcoin- https://bisnis.tempo.co/read/1551960/5-fakta-mengenai-fatwa-haram-kripto-yang-dikeluarkan-muhammadiyah-mui-dan-nu- https://tekno.kompas.com/read/2022/01/26/07210097/ojk-larang-jasa-keuangan-indonesia-fasilitasi-perdagangan-kripto?page=all#:~:text=%22Penggunaan%20cryptocurrency%20sebagai%20mata%20uang,%2C%22%20tulis%20MUI%20dalam%20fatwanya.CMIIW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 19, 2022, 10:54:39 PM",
      "body": "Quote from: kawetsriyanto on August 19, 2022, 08:05:07 PMQuote from: mamesso on August 18, 2022, 05:38:02 AMSejarah dan Regulasi Cryptocurrency di Indonesia telah mengubah pandangan investor khususnya pada bitcoin dan umumnya pada Aset Alternatif lain, Indonesia menjadi salah satu negara yang menyambut kehadiran Cryptocurrency dan teknologi blockchain dengan wajah ramah, dengan adanya beberapa aturan yang mengakomodasi aset crypto menjadi bukti yang tak terbantahkan bahwa Indonesia sangat ramah terhadap aset Crypto.Tidak juga, Om. Dari dulu bahkan sampai saat ini, tetap saja ada institutsi/lembaga atau kelompok tertentu yang masih memandang crypto itu tidak layak untuk menjadi pilihan aset. Salah satu contohnya adalah OJK, mereka tetap bersikukuh melarang lembaga jasa keungan untuk memfasilitasi crypto. Selain itu, ada juga MUI yang mengeluarkan fatwa haram atas investasi crypto.Kalau sampai OJK ataupun BI mengizinkan lembaga jasa keuangan menggunakan fasilitas cryptocurrency bisa-bisa nantinya 'menyerempet' menjadi alat pembayaran yang legal juga selain Rupiah. Saya sih melihatnya pemerintah dalam hal ini lebih mengambil jalan tengah (tidak dikatakan menyambut juga), tidak sepenuhnya melarang karena ada efek ekonomi yang dihasilkan dari trade cryptocurrency (akhirnya ada pemberlakuan pajak yang bisa diambil dari sana) plus tidak sepenuhnya menerima apalagi sebagai alat pembayaran karena jelas akan bertentangan dengan UU mata uang di Indonesia, maka dari itu hanya menjadikannya sebagai aset komoditas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 20, 2022, 04:43:12 AM",
      "body": "Quote from: Husna QA on August 18, 2022, 11:59:12 PMAgan @taufik123, saya lihat thread serupa yang agan buat namun dalam versi bahasa Inggris (https://bitcointalk.org/index.php?topic=5410166.0) saat ini berada di lokal board Indonesia (asumsi saya di pindah oleh moderator). Mungkin agan bisa mempertimbangkan untuk di lock karena jadinya terkesan double thread di board yang sama.Tampaknya udah di lock moderator, saya juga baru sadar kalo thread langsung di move ke SFI.dan saya beberapa hari ini jarang buka forum.Quote from: Husna QA on August 19, 2022, 10:54:39 PMQuote from: kawetsriyanto on August 19, 2022, 08:05:07 PMQuote from: mamesso on August 18, 2022, 05:38:02 AMSejarah dan Regulasi Cryptocurrency di Indonesia telah mengubah pandangan investor khususnya pada bitcoin dan umumnya pada Aset Alternatif lain, Indonesia menjadi salah satu negara yang menyambut kehadiran Cryptocurrency dan teknologi blockchain dengan wajah ramah, dengan adanya beberapa aturan yang mengakomodasi aset crypto menjadi bukti yang tak terbantahkan bahwa Indonesia sangat ramah terhadap aset Crypto.Tidak juga, Om. Dari dulu bahkan sampai saat ini, tetap saja ada institutsi/lembaga atau kelompok tertentu yang masih memandang crypto itu tidak layak untuk menjadi pilihan aset. Salah satu contohnya adalah OJK, mereka tetap bersikukuh melarang lembaga jasa keungan untuk memfasilitasi crypto. Selain itu, ada juga MUI yang mengeluarkan fatwa haram atas investasi crypto.-snip- Saya sih melihatnya pemerintah dalam hal ini lebih mengambil jalan tengah (tidak dikatakan menyambut juga), tidak sepenuhnya melarang karena ada efek ekonomi yang dihasilkan dari trade cryptocurrency (akhirnya ada pemberlakuan pajak yang bisa diambil dari sana) plus tidak sepenuhnya menerima apalagi sebagai alat pembayaran karena jelas akan bertentangan dengan UU mata uang di Indonesia, maka dari itu hanya menjadikannya sebagai aset komoditas.Tidak sepenunya melarang crypto memang bukan tanpa alasan, ini menjadi nilai plus yang akan menguntungkan negara untuk mendapatkan beberapa tambahan penghasilan dari pengenaan pajak cryptocurrency. Pengenaan pajak yang dilakukan biasanya sudah terpotong dari transaksi yang kita lakukan di beberapa exchange official yang sudah terdaftar di BAPPEBTI. di antaranya: Per tanggal 9 Maret 2022, dilansir dari situs resmi BAPPEBTI, maka berikut daftar perusahaan pedagang aset Kripto yang terdaftar di Bappebti :1. PT Indodax Nasional Indonesia (Indodax) 2. PT Crypto Indonesia Berkat (Tokocrypto)3. PT Zipmex Exchange Indonesia (Zipmex) 4. PT Indonesia Digital Exchange (Idex) 5. PT Pintu Kemana Saja (Pintu) 6. PT Luno Indonesia LTD (Luno) 7. PT Cipta Koin Digital (Koinku) 8. PT Tiga Inti Utama  (Triv)9. PT Upbit Exchange Indonesia 10. PT Rekeningku Dotcom Indonesia 11. PT Triniti Investama Berkat (Bitocto)Tapi jika exchanger yang belum terdaftar di BAPPEBTI seperti Binance, Kucoin, Coinbase dll tentu tidak akan ada pajak yang dikenakan dan situs diblokir oleh ISP indonesia. dan pada kenyataannya saat ini pengguna lebih tertarik menggunakan Binance di bandingkan Exchange lokal dengan alasan potongan yang terlalu mahal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "August 21, 2022, 02:44:42 AM",
      "body": "Quote from: Husna QA on August 18, 2022, 11:59:12 PMQuote from: taufik123 on August 18, 2022, 03:29:55 AMUntuk 3 Exchange tersebut saya belum menemukan informasi yang valid, karena bitcoin.co.id AKA indodax berdiri dan beroperasi tanggal 15 Februari 2014.Namun beberapa artikel mengatakan di tahun 2013 ada 3 exchanger yang digunakan namun tanpa informasi yang jelas.Nah 3 exchange tersebut juga yang membuat saya penasaran karena dari yang saya tahu, Indodax ini yang merupakan exchange cyptocurrency pertama di Indonesia.Kemungkinan bukan exchange lokal Indonesia, karena memang sejak dulu sebelum Indodax terkenal, beberapa Orang Indonesia setahu saya banyak main di LocalBitcoins, blockchain.org ama bitpay. tapi memang banyak di LocalBitcoin karena ada orang Indonesia-nya jadi bisa p2p nukar via rekening bank local, atau kalau gak nemu, nyari bule yang bisa nuker bitcoin pakai paypal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "August 21, 2022, 08:42:25 AM",
      "body": "Quote from: kawetsriyanto on August 19, 2022, 08:05:07 PMApa hubungannya, Om?Setidaknya ada sedikit hubungan pada kata yang digaris bawahi diatas, langkah pemerintah Indonesia menjadikan crypto sebagai aset komoditas, dapat membuka ruang bagi investor Indonesia dengan memberikan kepastian dan perlindungan hukum. Aset crypto sedang menjadi hype bagi kaum melenial, sejauh ini aset crypto masih menjadi daya tarik dijadikan media untuk mendapat cuan. Meskipun tidak dari semua investor berujung dengan happy ending, tapi kalau dikalkulasi investor yang happy ending lebih besar angkanya dari yang mengalami bad ending. Jika dilihat dari besarnya pajak yang dibayar Tokocrypto yang mencapai angka Rp16,2 miliar per bulan Juli lalu, saya mengasumsikan investor lebih banyak berujung dengan happy ending. Quote from: kawetsriyanto on August 19, 2022, 08:05:07 PMTidak juga, Om. Dari dulu bahkan sampai saat ini, tetap saja ada institutsi/lembaga atau kelompok tertentu yang masih memandang crypto itu tidak layak untuk menjadi pilihan aset. Salah satu contohnya adalah OJK, mereka tetap bersikukuh melarang lembaga jasa keungan untuk memfasilitasi crypto. Selain itu, ada juga MUI yang mengeluarkan fatwa haram atas investasi crypto.Untuk yang ini sudah di tanggapi Om Husna QA diatas.Terimakasih Om Husna QA sudah menjeskan dengan sangat detil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 22, 2022, 01:30:49 AMLast edit: August 22, 2022, 05:50:50 AM by taufik123",
      "body": "Quote from: DroomieChikito on August 21, 2022, 02:44:42 AMQuote from: Husna QA on August 18, 2022, 11:59:12 PMQuote from: taufik123 on August 18, 2022, 03:29:55 AMUntuk 3 Exchange tersebut saya belum menemukan informasi yang valid, karena bitcoin.co.id AKA indodax berdiri dan beroperasi tanggal 15 Februari 2014.Namun beberapa artikel mengatakan di tahun 2013 ada 3 exchanger yang digunakan namun tanpa informasi yang jelas.Nah 3 exchange tersebut juga yang membuat saya penasaran karena dari yang saya tahu, Indodax ini yang merupakan exchange cyptocurrency pertama di Indonesia.Kemungkinan bukan exchange lokal Indonesia, karena memang sejak dulu sebelum Indodax terkenal, beberapa Orang Indonesia setahu saya banyak main di LocalBitcoins, blockchain.org ama bitpay. tapi memang banyak di LocalBitcoin karena ada orang Indonesia-nya jadi bisa p2p nukar via rekening bank local, atau kalau gak nemu, nyari bule yang bisa nuker bitcoin pakai paypal.yaps, sedikit menemukan jawaban tentang 3 exchange tersebut, karena indodax memang masih jadi yang pertama di indo dan pada tahun 2013 belum ada exchange indo yang lainnya.Karena dulu bitcoin juga masuk ke indonesia melalui Bule yang berkunjung ke bali dan mereka membawa bitcoin untuk ditukarkan dengan rupiah karena beberapa vila atau penginapan menerima bitcoin sebagai pembayaran.seperti kutipan sejarah bitcoin dibawah ini, mungkin akan memperjelas:Quote from: https://zipmex.com/id/learn/sejarah-cryptocurrency-lika-liku-aset-kriptoSejarah Cryptocurrency di Indonesia Kehadiran mata uang kripto di Indonesia diawali oleh Bitcoin. Dalam penuturan Rizal, cryptocurrency masuk ke Indonesia pada awal 2013. Pada masa itu ada tiga exchanger yang memberikan platform bagi para penggunanya untuk jual beli Bitcoin. “Dulu sistemnya kayak marketplace. Jadi misalnya aku mau jual Bitcoin 10 ribu, ada yang mau beli, tidak? Ternyata ada yang mau beli,” kisahnya. Exchanger bekerja sebagai third party menyediakan sistem OTC (Over the Counter). Nantinya pengguna akan dikenakan PPN sebesar 10 persen dan juga split harga. Di luar exchanger, Bitcoin masuk ke Indonesia melalui wisatawan asing yang berkunjung ke Bali. Mereka biasanya membawa Bitcoin untuk ditukarkan menjadi rupiah ke money changer tertentu. Selain itu, ada pula beberapa vila yang memberikan kesempatan bagi tamunya untuk membayar dengan Bitcoin. Penetrasi Bitcoin tak sampai di situ saja. Awal kemunculannya, Bitcoin juga masuk melalui komunitas-komunitas. Ada yang berupa voucher, airdrop, dan ada pula yang berupa reward. Seperti yang pernah dilakukan Rizal, kala itu ia disuruh mengerjakan task-task mudah dalam website dan nantinya akan diberi Bitcoin sebagai reward.“Jadi misalnya kita diminta mengunjungi website, nanti dapat berapa Bitcoin, atau kita menyelesaikan task-task di website lalu dapat Bitcoin juga,” lanjut Rizal. Saat itu, Rizal sebenarnya masih belum tahu apa yang harus ia lakukan dengan Bitcoin yang ia dapatkan. Namun, Rizal memutuskan untuk menyimpannya saja. Perlahan tapi pasti, Bitcoin mulai menunjukkan taring. Tahun 2017, Bitcoin booming di Indonesia dan seiring waktu harganya terus meningkat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 22, 2022, 02:47:48 AM",
      "body": "Quote from: taufik123 on August 22, 2022, 01:30:49 AMQuote from: DroomieChikito on August 21, 2022, 02:44:42 AMKemungkinan bukan exchange lokal Indonesia, karena memang sejak dulu sebelum Indodax terkenal, beberapa Orang Indonesia setahu saya banyak main di LocalBitcoins, blockchain.org ama bitpay. tapi memang banyak di LocalBitcoin karena ada orang Indonesia-nya jadi bisa p2p nukar via rekening bank local, atau kalau gak nemu, nyari bule yang bisa nuker bitcoin pakai paypal.yaps, sedikit menemukan jawaban tentang 3 exchange tersebut, karena indodax memang masih jadi yang pertama di indo dan pada tahun 2013 belum ada exchange indo yang lainnya.Karena dulu bitcoin juga masuk ke indonesia melalui Bule yang berkunjung ke bali dan mereka membawa bitcoin untuk ditukarkan dengan rupiah karena beberapa vila atau penginapan menerima bitcoin sebagai pembayaran.Barusan saya coba telusuri diskusi member-member senior di forum Bitcointalk ini terutama sekitaran tahun 2013 mengenai exchange atau tempat trading/penukaran mana saja yang sempat disebutkan atau disarankan untuk digunakan pada waktu itu di Indonesia, berikut ini beberapa diantaranya:Quote from: mallegold on April 11, 2013, 02:37:47 AMPada dasarnya sih semua trading sama yaitu sama-sama punya resiko untuk rugi. tapi ada baiknya anda bisa mempelajarinya sendiri dengan melihat sistem yang tersedia di webnya. kelebihan dibtc-e.com sama dimtgox. com adalah tersedianya banyak cryptocurrency yang diperdagangkan.Quote from: Bicknellski on April 24, 2013, 01:59:13 PMhttps://localbitcoins.com/ad/11370/Trade page for Local Bitcoins. Are you looking to sell BTC?Halaman Perdagangan Bitcoins lokal. Apakah Anda ingin menjual BTC?Quote from: tan_panama on September 24, 2013, 02:36:32 AMdr btc lgsung ke idr https://artabit.com/Quote from: kfruit on November 13, 2013, 11:56:22 AMBTW, ada yang tau tempat beli bitcoin selain artabit? Beda harga jual-belinya hampir 16% :'(Quote from: djarot on November 24, 2013, 05:20:49 AMAda yg udah nyoba ini http://bitcoin.   co.   id/ ??Quote from: wakwao on November 28, 2013, 07:03:42 AMTadi nyoba beli dikit di bitcoin.co.id, gak ada keterangan kapan kira2 dikirimnya, sudah satu jam belum ada perubahan dan support belum dibales, kayanya yang ngurus cuma satu orang deh -_-Quote from: buffett on December 13, 2013, 04:04:17 PMhalo, salam kenal saya salah satu pemilik bitcoin.co.idmohon maaf waktu itu memang manajemen kita belum ok dan kebetulan dua orang yg urus sedang keluar negeri. kedepannya pasti kita perbaiki. untuk sekarang transaksi jam &amp; hari kerja paling lama 1 jam, sedangkan diluar jam kerja maksimal 12 jam. dalam waktu dekat kita akan menambah jam kerja kita sampai tengah malam. kita juga menyediakan support lewat ym.oh ya bitcoin.co.id juga baru saja diulas di detik.com  ;DQuote from: djarot on November 24, 2013, 07:14:50 AMQuote from: KolorIjo on November 24, 2013, 07:11:46 AMjasa okpay di indo gmn ga,dah ada yang sudah coba?Coba kemari aja bro, perfectonlinechanger . oom - dulunya duyduychanger ..P2P:Quote from: Bicknellski on April 07, 2013, 01:04:22 PMBuying Bitcoin with Rupiah. BCA transfers escrow available.PM me for details.Sorry for the Google Translate.Membeli Bitcoin dengan Rupiah.BCA transfer escrow tersedia.Pesan pribadi saya untuk rincianMerchant:Quote from: cakalele on December 16, 2013, 09:32:45 AMhalo ane baru belajar bitcoin +/- 1 bulan ane coba buat daftar merchant yang terima bitcoin di Indonesia:1. http://kumpulblogger.com/bitcoin_kb.php2. http://www.ads-id.com/forums/content.php/41-We-Accept-Bitcoin!3. http://uangkuno.netyang lain belom ketemu lagiForum Bitcointalk ini juga jadi bagian informasi untuk melihat sejarah Bitcoin masa lalu melalui pengalaman membernya yang dari Indonesia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}