{
  "id": "topic_5466320",
  "title": "Victorybit1",
  "author": "Victorybit1",
  "created_time": "September 10, 2023, 03:05:06 PM",
  "content": "Are they profiting from floods? I don't understand why we face this flood issue every year. Growing up, I knew there was an annual flood, but it wasn't as disastrous as the 2012 one, which claimed many lives and properties. After that, there was the 2022 flood, and now we're hearing about another one to come this 2023. What has changed that we're experiencing floods again this year? I'm aware that a substantial amount of money is allocated to states affected by floods. I believe that influential individuals benefit from it, while only a small portion goes to the actual flood victims.This is a serious issue because everyone now wants to move to areas where they don't experience floods. The landowners are increasing their rent in those flood-free areas. Acquiring land there is now outrageously expensiveFor those of us living in these areas, you should know how troubled we all are during this period because we're all thinking about where to stay if things get worse this year. It's an experience I wouldn't wish on my worst enemy, especially considering the cost of living. Naija which way. It is well.What has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466320",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 10, 2023, 03:33:37 PM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?Poor or no drainage is one of the main cause of flooding.Some heavy rainfall (and with some other natural disasters) can also cause flooding. The flood that submerged one third of Pakistan last year would be beyond drainage. Although some flood would have been avoid if drainages are well constructed and if people are not turning the drainages into a dumping ground.The one that happened in Southern Nigeria last year was as a result of heavy rainfall and displace of water from dams in Nigeria and in Cameroon which caused it.Flood is a natural disaster. Not that some people intentionally caused flooding, but in the process of preventing flooding from occuring, and also saving lives during flooding, some people are provided with jobs and they are making money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "September 10, 2023, 03:50:14 PM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMAre they profiting from floods? I don't understand why we face this flood issue every year. Growing up, I knew there was an annual flood, but it wasn't as disastrous as the 2012 one, which claimed many lives and properties. After that, there was the 2022 flood, and now we're hearing about another one to come this 2023. What has changed that we're experiencing floods again this year? I'm aware that a substantial amount of money is allocated to states affected by floods. I believe that influential individuals benefit from it, while only a small portion goes to the actual flood victims.This is a serious issue because everyone now wants to move to areas where they don't experience floods. The landowners are increasing their rent in those flood-free areas. Acquiring land there is now outrageously expensiveFor those of us living in these areas, you should know how troubled we all are during this period because we're all thinking about where to stay if things get worse this year. It's an experience I wouldn't wish on my worst enemy, especially considering the cost of living. Naija which way. It is well.What has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?This flood issue is one of the things way we as good Nigerians dey suffer well, Most people way they live in riverine areas they suffer well well, for rivers state we don't experience floods because our rivers are saltwater but for Bayelsa state this flood too worry, but the matter be say some people they profit well for the flood and the people way no dey profit plenty pass, but why e be say those people way the flood no even affect self-con dey profit pass people way flood affect?But the way I dey see am e go be like say this year flood no go worry too much if not some places for done overflow.Anyway I never experienced flood before but this year I for like to experience am so that I go no how far,,,, nai make I travel come bayelsa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorybit1",
      "created_time": "September 10, 2023, 04:44:15 PMLast edit: September 10, 2023, 07:52:21 PM by Victorybit1",
      "body": "Quote from: Charles-Tim on September 10, 2023, 03:33:37 PMQuote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?Poor or no drainage is one of the main cause of flooding.Some heavy rainfall (and with some other natural disasters) can also cause flooding. The flood that submerged one third of Pakistan last year would be beyond drainage. Although some flood would have been avoid if drainages are well constructed and if people are not turning the drainages into a dumping ground.The one that happened in Southern Nigeria last year was as a result of heavy rainfall and displace of water from dams in Nigeria and in Cameroon which caused it.Flood is a natural disaster. Not that some people intentionally caused flooding, but in the process of preventing flooding from occuring, and also saving lives during flooding, some people are provided with jobs and they are making money. Yes, flood is a natural disaster; however, my concern is how to manage it in such a way that it won't be disastrous. I know there are ways the government can manage it for example building infrastructures like leves, that will serve as defense, having good drainage system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "September 10, 2023, 05:44:49 PM",
      "body": "The real victims of flood did not receive anything from flood palliative. I was a very serious victim of flood last year's flood and I didn't not see anything from the authorities to aid me out. But those who were not affected take away everything. And I am not bothered because God has done it for me. Now let come to your question. The whole world benefits from Nigeria flood. Let me shock u. The following companies benefits from Nigeria flood disasters. 1. Foam mattress Companies2. Foreign Rice Companies3. Indomie companies in Nigeria4. And other food companies. 2022 flood enter the former president of Nigeria Goodluck Ebele Jonathan house and the money he realized from the flood, Jesus Christ was too much. World donors donated enough gave him but the poor who were seriously affected were not given anything. Flood is not Natural again but it is man made. They are bringing flood to make money if not they can control this flood not to affect anyone in the country. NEMA is part of the team. The politicians are the real flood victims and not the people who live in the rural areas and suffer the most and sleep on the motor roads because there is no place for them to stay.Though the climate change is also one of the caused me f the flooding but that is not the real reason of it. Flood in Nigeria has been politicized. Those who work in NEMA build houses after the flood and keeping the real victims to be perpetual in suffering. The flood really affect the living of the people. US and Europe are in support of the flooding because if there is no flood, the states that produce food go produce plenty foods for di kwantry and things go dey cheap well well. And foreign food items no go come like dat so, dey make sure say flood go come spoiled di food crops so dat there will be no sufficient food in the country so dem go bring their own come sell give us with a high prices. Na di tactics for the flood every year now.All di bad bad thing wey dey happen for we country, Oyibo people hand dey. Herdsmen, Boko Haram, flood na dem dey do am because dem won use Nigeria as a dumping ground for their products. I believed say someone don tok am before wey I see. And na di truth be dat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "September 10, 2023, 05:48:07 PM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMAre they profiting from floods? I don't understand why we face this flood issue every year. Growing up, I knew there was an annual flood, but it wasn't as disastrous as the 2012 one, which claimed many lives and properties. After that, there was the 2022 flood, and now we're hearing about another one to come this 2023. What has changed that we're experiencing floods again this year? I'm aware that a substantial amount of money is allocated to states affected by floods. I believe that influential individuals benefit from it, while only a small portion goes to the actual flood victims.This is a serious issue because everyone now wants to move to areas where they don't experience floods. The landowners are increasing their rent in those flood-free areas. Acquiring land there is now outrageously expensiveFor those of us living in these areas, you should know how troubled we all are during this period because we're all thinking about where to stay if things get worse this year. It's an experience I wouldn't wish on my worst enemy, especially considering the cost of living. Naija which way. It is well.What has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?Sincerely flood has been one big issue affecting my people from the Niger Delta and other  parts of the country. In 2012 the impact of the flood disaster on my people was second to none, their House's, their agricultural produce, the animals in the bushes everything was ravaged by the flood impact.Goodluck Jonathan was the president then, heaven and earth where promised to the affected people and a huge amount of money was released for rehabilitation of those affected local governments and state governments.  Trust me with our abrakatabra set of politicians, those funds released Never got to the grassroots especially those greatly affected till date.Trust me international bodies every now and then always send relief funds for disaster management yet, this funds ends up in the pockets of private individuals. So in answering your question, yes some persons are making money from the flood disaster though flood is a natural disaster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "September 10, 2023, 08:19:00 PM",
      "body": "Quote from: Charles-Tim on September 10, 2023, 03:33:37 PMQuote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue? it.Flood is a natural disaster. Not that some people intentionally caused flooding, but in the process of preventing flooding from occuring, and also saving lives during flooding, some people are provided with jobs and they are making money.We know say flood nah natural disaster wey no be man the control am but e get measures wey the vital to take to stop this impending flood every year or to prevent am to get a very minimal effect on the citizens anytime e happen but people for government no wan do the vital tins like building of dam, network canals, dredging of some river basins but them don take the situation use open office for every one or two years as the floods com, billions will be budgeted to use provide flood materials for flood victims and foodstuffs etc etc. All that money na their pockets them dey put am.Money that could have been used to solve the flood problem them prefer to use am the treat the effect of the flood each time the flood come. So in common sense there are people making money out of this recurring floods and not just say them dey work per say nah job something. Them just use the flood open office for their sef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 10, 2023, 09:23:22 PM",
      "body": "Quote from: letteredhub on September 10, 2023, 08:19:00 PMWe know say flood nah natural disaster wey no be man the control am but e get measures wey the vital to take to stop this impending flood every year or to prevent am to get a very minimal effect on the citizens anytime e happen but people for government no wan do the vital tins like building of dam, network canals, dredging of some river basins but them don take the situation use open office for every one or two years as the floods com, billions will be budgeted to use provide flood materials for flood victims and foodstuffs etc etc. All that money na their pockets them dey put am.I see this like 'because Nigeria is not affected with earth quake, Nigeria government is better because they are preventing it'. How does that sound? Many times, no prevention can stop flooding from happening. It can begin with a heavy rain and storm. In some countries, it can begin with more than storm as it can begin with hurricane.According to a report that was published in 2022, you will know that the government of a nation can only try, also depending on how good some places are. There is no way flooding can be prevented in some places but there could be a warning, it would still occur during raining season in any country. In the image I posted below, even developed countries like USA and Japan are included. In population, 18% of Nigerians were reported to be affected by flooding, you can see other countries with higher percentage, up to over 50%.Fig. 3: Absolute and relative population exposure at country level.You can blame our government for money mismanagement but even if they are not managing money, this will not stop flooding and it depends on how massive heavy rainfall and storm result to flooding. Despite there are good drainages, it is possible that the water can submerge the drainages and result to a significant flood with loss of life and properties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 10, 2023, 10:38:23 PM",
      "body": "Quote from: Charles-Tim on September 10, 2023, 09:23:22 PMYou can blame our government for money mismanagement but even if they are not managing money, this will not stop flooding and it depends on how massive heavy rainfall and storm result to flooding. Despite there are good drainages, it is possible that the water can submerge the drainages and result to a significant flood with loss of life and properties.I think the flooding would be low if Nigerian government didn't default on creating dams and putting the necessities in place a long time ago. If they did, the flooding wouldn't be as devastating as it has been in recent years. This isn't the first time and it's not just the issue of flooding. Nigerian governments overtime has defaulted in a lot of things.As long as it doesn't affect the overall state of the nation, it's of little concern. I know Flooding is a natural disaster but it can be managed so the damage isn't so extensive. Who reimburses the common citizen when his properties are damaged by flood(s)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "September 10, 2023, 11:06:59 PM",
      "body": "Flood is a natural occurrence, but I think the money our government allocates for flood victims is been mismanaged by the commission that is assigned to function to that effect, I believe that there are areas where flood are bound to happen, going by nimet predictions, the government is supposed to put all in place to curtail this situation, if it eventually occurs, you don't tell households that have nowhere to go, to relocate, where would you want them to go, our natural disaster management should account for all the funds that have been released to them from the onset because they have failed to salvage this situation. The government has also failed to construct a good drainage system for the water to have a channel, It is very disheartening to see people's property being destroyed because of the government's reluctant attitude towards their citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "September 10, 2023, 11:45:39 PM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMAre they profiting from floods? I don't understand why we face this flood issue every year. Growing up, I knew there was an annual flood, but it wasn't as disastrous as the 2012 one, which claimed many lives and properties. After that, there was the 2022 flood, and now we're hearing about another one to come this 2023. What has changed that we're experiencing floods again this year? I'm aware that a substantial amount of money is allocated to states affected by floods. I believe that influential individuals benefit from it, while only a small portion goes to the actual flood victims.Sometimes we are the cause of the flooding that’s happening. I know one of the reasons for flooding is a lack of drainage, and I'm sure it’s the government that’s supposed to provide that. We are the cause of some floods because we know that we don’t have enough drainage in the country, and the little we do have, people have already turned it into a dumping ground, which won’t allow free flow of water wherever there is a rainfall, which always results in floods. Some people do build houses in areas where they are not supposed to, houses should not be built in areas close to rivers. Some people know that floods do disturb people in a particular area, but they will still go ahead and buy land and build houses in places like that, which is wrong.Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?Definitely, the government can mitigate it. If proper drainage is provided everywhere, then it’s going to help reduce floods in a particular area. If appropriate means of dumping refuse are provided by the government, and the citizens are also making use of them, because some people prefer to turn the drainage and roadside into dump sites rather than using the appropriate channels, make sure we don’t build houses in a waterway and don’t try to block water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 11, 2023, 01:11:34 AM",
      "body": "There is a high tendency that people are leveraging on the flood incidents to cash out. If you pay attention, you will notice there are a lot of groups/committees being formed here and there with fantastic titles such as 'River Niger Flood Monitoring Team', ' Orashi Flood Response Team' and others.... these are the few I know from Rivers State. These associations were merely created for people who want to make money not because they really want to do anything to stop the flood or help the victims. In 2022, one billion Naira was claimed to have been released by former governor of Rivers State (Bar. Ezenwo Nyesom Wike) for the flood victims of the Orashi region. It will surprise you to know that a large chunk of this money ended in Port Harcourt and never made it to the villages. A lot of intervention funds for flood rarely make it to the real victims and it is very hard accounting for these monies. Basically, this flood of a thing have become a huge business for some people and going forward, even years that flood will not have much divestating effect, they will promote it through fears and rumors so that enough funds will be released to the agencies and committees... that is the hustle my people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 11, 2023, 07:02:06 AM",
      "body": "Quote from: nelson4lov on September 10, 2023, 10:38:23 PMWho reimburses the common citizen when his properties are damaged by flood(s)? There are organizations like NEMA and NIWA that are created by the federal government to help flood victims. Private organization or people can also help. There are charities assisting. It can be a help from the government of another country.Examples:https://thenationonlineng.net/fed-govt-plans-special-fund-for-flood-victims/https://www.thecable.ng/nema-distributes-relief-items-to-victims-of-2022-flood-in-bauchi/amphttps://punchng.com/557-anambra-flood-victims-get-niwas-relief-materials/?amphttps://www.premiumtimesng.com/news/top-news/560651-us-provides-1-million-support-for-flood-victims-in-nigeria.html?tztc=1https://ng.usembassy.gov/united-states-commits-5-million-in-additional-humanitarian-assistance-for-nigeria-flood-response-efforts/https://reliefweb.int/report/nigeria/federal-government-supports-victims-flood-natural-and-human-induced-disasters-zamfara-statehttps://borgenproject.org/flood-victims-in-nigeria/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "September 11, 2023, 08:19:15 AM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMAre they profiting from floods? I don't understand why we face this flood issue every year. Growing up, I knew there was an annual flood, but it wasn't as disastrous as the 2012 one, which claimed many lives and properties. After that, there was the 2022 flood, and now we're hearing about another one to come this 2023. What has changed that we're experiencing floods again this year? I'm aware that a substantial amount of money is allocated to states affected by floods. I believe that influential individuals benefit from it, while only a small portion goes to the actual flood victims.This is a serious issue because everyone now wants to move to areas where they don't experience floods. The landowners are increasing their rent in those flood-free areas. Acquiring land there is now outrageously expensiveFor those of us living in these areas, you should know how troubled we all are during this period because we're all thinking about where to stay if things get worse this year. It's an experience I wouldn't wish on my worst enemy, especially considering the cost of living. Naija which way. It is well.What has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?Flood is a constant problem in this our country, it can be reduce but since there is no permanent solution is why I said constant flood. Flood only happen in Nigeria only the raining season and ne of the reason why the flood they choke us for this country be say some states are not suppose to be where they are situated. Anytime there is high raining times, our Dams reserves are always full to the brims, and the management don't have choice but to release the excess water. However, before they release this body of water, the villages near by are pre-warned to live the riverine areas because they know very well that it is going to cause damages but they don't live the areas and when the water is release, it affects everyone around such areas.Some towns also have bad planning and layout that when this water pass through their surroundings, instead of it to go through the water channels, they become clog instead and fill the houses, this is why drainage always happen every season and as long as the permanent solution are not put in place, they will always happen in every raining season. The government need to help the villagers around the riverine areas seek for new place with housing and basic amenities and the towns that are badly plan need to be evaluate and proffer a permanent solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorybit1",
      "created_time": "September 11, 2023, 08:57:49 AM",
      "body": "Quote from: Agbe on September 10, 2023, 05:44:49 PMThe real victims of flood did not receive anything from flood palliative. I was a very serious victim of flood last year's flood and I didn't not see anything from the authorities to aid me out. But those who were not affected take away everything.  can you imagine this and some person hoard the palliative meant for the victim until they spoiled.Na you get my point; Despite say it's natural disasters , some individuals have realized they can benefit from larger or bigger floods. Over the years, our situation has worsened, and it's puzzling why things have changed. Even though factors like poor drainage systems and climate change contributes, it's frustrating that nothing is being done to address these issues. These problems could be efficiently managed in a more functional country. Some people dey cash out greatly no body fit tell me otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 11, 2023, 09:26:21 AM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?I live in an area where flood was one of the issues several years ago, but today we don’t experience such again after the construction of large under bridge for passage of water within the city. Lack of drainage and poor maintenance of large drainages for water passage can be one of the causes. If you notice in some locations within the country, a town or an area where there is no good drainage system passing the area, the roads are easily damaged and houses get affected by this flood. The government has a vital role to play by constructing those large under bridges for water passage in order to mitigate the effect of flooding in those riverine communities. Also, we the people also need to understand that it is our duty to also provide water passages in our areas to also help curtail the flooding into damaging homes and roads in those vicinities. Quote from: Agbe on September 10, 2023, 05:44:49 PM~I can still remember vividly of you complaining about the flood last year that happened in your city. We don’t pray for such to happen again. But owning and blaming all this on humans is just surprising to me, flood that use to be natural is now something controlled by humans just because of selfish interest. I pray and hope that an everlasting solution and end is found soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 11, 2023, 09:52:07 AM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMThis is a serious issue because everyone now wants to move to areas where they don't experience floods. The landowners are increasing their rent in those flood-free areas. Acquiring land there is now outrageously expensiveYou sure say this statement truly represent wetin dey actually happen because from wetin i dey see for my own state na places wey dey get flood wey even dey get people attention like the GRA or other areas wey estate dem plenty. The thing be say na those areas get the finest houses and since na well plan areas in regards to the building dem, d  houses dey cost and people still dey relocate still as light, security and comfort dey full those areas. Na where flood dey wey no get name na where people dey run from but you see all those big man areas dem people still dey pack go irrespective of the flood. Which dey wey news come out say lekki flood wan finish the place yet na where still dey sell pass for Lagos be dat. And as for people benefiting from it, the truth be say any bad thing wey dey happen for this country, e get people wey dey benefit from am because if dem no dey benefit, dem for dun find way solved that particular problem since. Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?The main cause of flood na lack of proper housing plans, people dey build build block all the waterway dem wey we get and dem no dey even create better channel wey the water go flow enter rivers dem. This is the reason all this swampy areas wey estate dem dey buy or governments dey buy and sandfill to use do their GRA dey always get flood issues because of lack of proper drainage system. Assuming when dem dey do road, dem dey dig better gutter we for no dey get this flooding problems but because people dun build house cover the normal root wey water dey follow before na wetin dey mostly cause this flooding problem. Also the dam wey Nigeria suppose build wey dem never build dey also contribute to why the river line areas dey suffer for this flood matta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "September 11, 2023, 08:09:56 PM",
      "body": "Well for someone like me staying in an flood prone region like bayelsa state it's is not a new occurrence anymore as it's not part of every thing we do including school calendar for both higher institutions and lower to observe an short break due to this drastic flood. Last year flood was  the worst I have ever experienced and the worst thing about this flood is that it comes with alot of dangerous things like wild animals lurking around for place to also stay(snakes). The flood got so worst that we had to make a canoe at the entrance of street before we can access our home and many people were rendered homeless as a result of this issue.As for palliative and what the government are doing to stop this, I really don't know because we are very corrupt that nothing ever reaches the grassroots and the real affected victims of this man made disaster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "September 11, 2023, 10:13:10 PM",
      "body": "Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMAre they profiting from floods?Yes so many government top officials are benefitting from it, like the Minister of Humanitarian Affair and Natural Disaster and the head of NEMA are the major beneficiaries from this natural disaster. The money that would be donated for the flood victims through these offices wouldn't be used for the flood victims. Only 10% would be brought out and that is why you see that the victims are always frustrated and vulnerable during this period.Quote from: Victorybit1 on September 10, 2023, 03:05:06 PM  it wasn't as disastrous as the 2012 one, which claimed many lives and properties. After that, there was the 2022 flood, and now we're hearing about another one to come this 2023. 2022 flood was something else and more disastrous than 2012,if you look at the difference, it shows ten years difference, which makes me to keep wondering if by 2032, it will repeat itself. I was in Bayelsa during these two disastrous period, and I experienced both. At 2012, I had a project in Bayelsa State and suddenly after two weeks the flood came and it was all like a joke. I didn't take to my heels out of the state fast and before I knew it the road was damaged and destroyed by the flood which made it impossible for me to leave the state. Last year, was very bad because the government didn't provide camps for the victims and the water level was higher than that of 2012. Victims had no option than to forcefully open the locked government schools within their reach for shelter and some were render homeless. Palliatives that was donated to these flood victims wasn't given to them but were hoard in a government ware house, leaving the flood victims to fend for themselves and their children, when they know that the whole state is submerged in water and all businesses and schools was closed. During these flood period,there is always hyper inflation in those states,because the price of goods will be very costly, due to lack of access road to bring them in, commodities becomes scarce with a higher demand,and the greedy ones among the traders will take the advantage of the condition of things to triple their prices.Quote from: Victorybit1 on September 10, 2023, 03:05:06 PMWhat has caused the increase in disastrous floods, and can't the government do something to mitigate the issue?Excessive rainfall causes the increase in floods that can be disastrous. The water is stored in the dam,like we have a Kanji dam where most of the rainfall stores and that is what is used to generated electricity for our usage. When this dam fills to the brim,it is likely to spill off water and for this not to be constant,the damn will be opened so that water can move down to the oceans. In Nigeria, the water passes through River Niger to the ocean down in the South South region, especially Bayelsa state that shares boundary with the Atlantic ocean. It is only the communities that the River Niger runs through that do experience the flood because the river will be filled up and flow into the communities. So my advice is that Government should build drainages in such areas and communities that will help the easy flow of water. Then the small rivers and lakes that rain water have washes sand into,to make it not deep as before,should be dredge so that they will be able to contain more water and not overflowing into the communities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 11, 2023, 10:29:51 PM",
      "body": "Quote from: Charles-Tim on September 11, 2023, 07:02:06 AMQuote from: nelson4lov on September 10, 2023, 10:38:23 PMWho reimburses the common citizen when his properties are damaged by flood(s)? There are organizations like NEMA and NIWA that are created by the federal government to help flood victims. Private organization or people can also help. There are charities assisting. It can be a help from the government of another country.Examples:https://thenationonlineng.net/fed-govt-plans-special-fund-for-flood-victims/https://www.thecable.ng/nema-distributes-relief-items-to-victims-of-2022-flood-in-bauchi/amphttps://punchng.com/557-anambra-flood-victims-get-niwas-relief-materials/?amphttps://www.premiumtimesng.com/news/top-news/560651-us-provides-1-million-support-for-flood-victims-in-nigeria.html?tztc=1https://ng.usembassy.gov/united-states-commits-5-million-in-additional-humanitarian-assistance-for-nigeria-flood-response-efforts/https://reliefweb.int/report/nigeria/federal-government-supports-victims-flood-natural-and-human-induced-disasters-zamfara-statehttps://borgenproject.org/flood-victims-in-nigeria/These are mostly palliative to offset some of the effects of the flooding rather than the properties itself that were damaged as a result of the flood. Anyway, we can't expect much from a government like Nigerian government. Instead of approving palliative budget, government should focus on doing the right thing which is to prevent flooding entirely. Until it overruns any of the important government areas, they won't do anything about it.Quote from: DaNNy001 on September 11, 2023, 08:09:56 PM~Snipped As for palliative and what the government are doing to stop this, I really don't know because we are very corrupt that nothing ever reaches the grassroots and the real affected victims of this man made disaster.It's as expected. I would prefer if they don't give palliative but fix it instead. Nigeria is hard enough. Starting from scratch is 100x harder at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}