{
  "id": "topic_5448818",
  "title": "cafter",
  "author": "cafter",
  "created_time": "April 14, 2023, 11:25:39 AM",
  "content": "my question is if anyone has one million dollars and he transfered to cex and want to buy btc, so how much price of bitcoin can be moved with 1 million dollars, and also while selling 1 million dollars worth bitcoin, then how much price can be moved. is it depends on anything? and what possible scenario can occur while moving the price like high volume small candle, you can also try to explain with 10million if you know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448818",
  "comments": [
    {
      "author": "elevates",
      "created_time": "April 14, 2023, 11:39:53 AM",
      "body": "Quote from: cafter on April 14, 2023, 11:25:39 AMmy question is if anyone has one million dollars and he transfered to cex and want to buy btc, so how much price of bitcoin can be moved with 1 million dollars, and also while selling 1 million dollars worth bitcoin, then how much price can be moved. is it depends on anything? and what possible scenario can occur while moving the price like high volume small candle, you can also try to explain with 10million if you know. I do not think a million would affect the price of Bitcoin. I guess a few billion or more would be needed and you would also need to use multiple or several exchanges. As there are many big Bitcoin exchanges in 2023. Back in 2014, Willy bot pumped the Bitcoin price on the Mt. Gox exchange. It is not a job for a single individual. You would need a group and coordinate moves to achieve the result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "April 14, 2023, 11:45:45 AM",
      "body": "Quote from: https://cointelegraph.com/news/bank-of-america-claims-it-costs-just-93-million-to-move-bitcoin-s-price-by-1The now infamous Bank of America research note slamming Bitcoin also contains research suggesting that it takes just $93 million worth of inflows to move Bitcoin’s price by one percent.According to this article, $1 Million is like a nothing to move Bitcoin price, it's need $93 Million to move Bitcoin price by one percent. So it's mean $1 Million only can move Bitcoin price for 0.0107%, so it's really so small.But this was an old article, so it may change since the Bitcoin price now and then are different, but the point is, you need to spend really hugeeeee amount money if you want to pump Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "April 14, 2023, 12:00:14 PM",
      "body": "Quote from: cafter on April 14, 2023, 11:25:39 AMmy question is if anyone has one million dollars and he transfered to cex and want to buy btc, so how much price of bitcoin can be moved with 1 million dollars, and also while selling 1 million dollars worth bitcoin, then how much price can be moved. is it depends on anything? and what possible scenario can occur while moving the price like high volume small candle, you can also try to explain with 10million if you know. Bitctoins' price will hardly change when buying $1.000.000 (that's only about ~33BTC), this amount is insignificant against the background of the general capitalization and at the moment should not have an effect on the current market value.Depends on trading volumes. With large volumes of buying or selling, the price will rise or fall. This is a classic market regulation scheme based on the law of supply and demand.$10.000.000 won't have such a tangible effect on the price of bitcoin either.Quote from: Plaguedeath on April 14, 2023, 11:45:45 AMQuote from: https://cointelegraph.com/news/bank-of-america-claims-it-costs-just-93-million-to-move-bitcoin-s-price-by-1The now infamous Bank of America research note slamming Bitcoin also contains research suggesting that it takes just $93 million worth of inflows to move Bitcoin’s price by one percent.According to this article, $1 Million is like a nothing to move Bitcoin price, it's need $93 Million to move Bitcoin price by one percent. So it's mean $1 Million only can move Bitcoin price for 0.0107%, so it's really so small.But this was an old article, so it may change since the Bitcoin price now and then are different, but the point is, you need to spend really hugeeeee amount money if you want to pump Bitcoin.You've already been told here that it would take $93.000.000 to see a 1% change, which at the current price of ~$30,700 is only ~$307. That is, a one-time investment of bitcoin almost ~$100.000.000 will only raise the price to ~$31,000. Of course, the figures are approximate, but the general trend allows you to understand. Significant changes in bitcoin's price will require more money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 14, 2023, 12:46:38 PM",
      "body": "Quote from: cafter on April 14, 2023, 11:25:39 AMis it depends on anything? and what possible scenario can occur while moving the price like high volume small candle, you can also try to explain with 10million if you know. It depends on the depth of the orders, you can go to the major exchanges and see how much the volumes on placed orders are, 1 million$ is nothing on both sides but $10 million might make a temporary dent right now it would make a $200 drop on Binance and about a $300 jump.Quote from: elevates on April 14, 2023, 11:39:53 AMI do not think a million would affect the price of Bitcoin. I guess a few billion or more would be needed and you would also need to use multiple or several exchanges.Billions? The largest by volume is the Binance/USDT, at nearly 10% of complete BTC volume, a flash $100million drop there would send the coin to $24k levels instantly, and if not all the buy orders would instantly retreat when the bots see the incoming dump.Do you think that when we dropped last time from 29k to 26k there were tens of billions of coins getting sold?  Still much to go till we hit levels where billions are needed to move markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "April 14, 2023, 05:38:11 PM",
      "body": "The volume is much more than $1M. Today it's $22B which means this $1M will hardly move the price up or down. But it must affect the price if you do it in the small exchanges or in a DEX since the price in those exchanges is very much different from the large exchanges. But I'm not sure if you can influence the prices to be dumped and people to start buying when you do something even when you try with $10M.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 15, 2023, 09:50:12 AM",
      "body": "@OP, Do you think a million-dollar trade will affect a multi-billion-dollar market? Even a 100 million-dollar trade can't affect the price of bitcoin. Making a million-dollar trade on some centralized exchanges like Binance, you won't even be noticed, much less have a negative or positive impact on the market. This kind of trade can just affect a particular exchange with low volume, like XT or Finexbox, which have a very low volume. Pumping in 1 million dollars to buy Bitcoin alone from their will definitely clear off all open sales orders, which will eventually make the price kind of high just on that particular exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 15, 2023, 12:02:03 PM",
      "body": "Quote from: bittraffic on April 14, 2023, 05:38:11 PMThe volume is much more than $1M. Today it's $22B which means this $1M will hardly move the price up or down. It doesn't work like that, volume is made out of consecutive trades and you could spend billions on both sides without moving it but with only a slight increase of 10% on one side you could crash it like we've seen it before.Think of two glasses half full, how much water can you pour from one to another without spilling, millions of hectoliters! Now do it with one full and the other 1/4 You can generate volume worth billions with 1 million in-depth if most trades are 1% of the depth, but still a 500k batch would crash everything.Quote from: Nwada001 on April 15, 2023, 09:50:12 AM@OP, Do you think a million-dollar trade will affect a multi-billion-dollar market? Even a 100 million-dollar trade can't affect the price of bitcoin. Making a million-dollar trade on some centralized exchanges like Binance, you won't even be noticed, much less have a negative or positive impact on the market. How about you check that yourself?https://www.binance.com/en/trade/BTC_USDT?theme=light&type=spotDo tell me what happens if somebody drops  $100 million on it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 15, 2023, 12:15:27 PM",
      "body": "Quote from: stompix on April 15, 2023, 12:02:03 PMHow about you check that yourself?https://www.binance.com/en/trade/BTC_USDT?theme=light&type=spotDo tell me what happens if somebody drops  $100 million on it  I'd love to try that, then come back and share my experience.That's if @shasan can lend me $100 million, which I will pay back if I eventually dump the market and take advantage of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 15, 2023, 12:27:27 PMLast edit: May 15, 2023, 10:50:49 AM by stompix",
      "body": "Quote from: Nwada001 on April 15, 2023, 12:15:27 PMI'd love to try that, then come back and share my experience.That's if @shasan can lend me $100 million, which I will pay back if I eventually dump the market and take advantage of it.You know that you don't need the actual sum to open the order book and check how a $100 million would move it, right?Here is the order book:https://www.binance.com/en/orderbook/BTC_USDTAnd here is the simplified depth:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 15, 2023, 08:24:41 PM",
      "body": "Quote from: cafter on April 14, 2023, 11:25:39 AMmy question is if anyone has one million dollars and he transfered to cex and want to buy btc, so how much price of bitcoin can be moved with 1 million dollars, and also while selling 1 million dollars worth bitcoin, then how much price can be moved. is it depends on anything? and what possible scenario can occur while moving the price like high volume small candle, you can also try to explain with 10million if you know. At current price of Bitcoin, 1 million dollars investment won't move it even a 1%, and you must keep the volatility of Bitcoin in your mind because there can be sudden dumps of 2-4% anytime due to bulk selling. If a sudden dump takes place then your own capital will move downward anytime. That 10 millions can impact the price of Bitcoin a little bit but not too much, the previous scenario can still happen even if you put 10 million USD buy orders. In order to move Bitcoin from it's current price mark, the investment of about 10-50 millions is needed. That might move the market upward for short time, but even in that case many of the current holders might start bulk selling to earn profit from their holdings. In that situation market can still move downwards, not by a lot but a little bit for short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "April 15, 2023, 08:39:06 PM",
      "body": "The market cap of bitcoin is $580+B and moving a million of dollars is nothing compared to what you're thinking that it can move the price. There's a huge money that needs to be moved if someone needed to make some price motion. And $1M isn't just enough for doing that. Maybe a billion or two can make some difference but $1M, won't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 15, 2023, 10:21:10 PM",
      "body": "Quote from: cafter on April 14, 2023, 11:25:39 AMmy question is if anyone has one million dollars and he transfered to cex and want to buy btc, so how much price of bitcoin can be moved with 1 million dollars, and also while selling 1 million dollars worth bitcoin, then how much price can be moved. is it depends on anything? and what possible scenario can occur while moving the price like high volume small candle, you can also try to explain with 10million if you know. It won't move a nudge, if you look at the trading volume in coinmarketcap, it's currently around $12 Billion. So it's just like a drop in the ocean. So that's how big the trading volume of Bitcoin as compare to the rest of crypto, it still dominates the market close to 50%. And if I'm going to buy $1 million, I would rather to it, OTC, to summarized:QuoteUnlike trading on an exchange, OTC trades are conducted directly between two counterparties. It’s the easiest way to trade a large block of coins in one go. Each trade is a bilateral agreement between a buyer and a seller - no one else sees the discussion, which allows you to discuss trading large sizes without fear of affecting the markets. The trade can be as simple or as customized as you like. https://www.binance.com/en/blog/all/otc-basics-by-binance-trading-337068226927206400The thing is even if whales will want to move and manipulate the market, it doesn't mean they will always make money, sometimes it could be a bad move for them to invest huge amount and then the market goes into the opposite direction.And if some entity wants to influence the price, he has to be a big holder, like 51% of all Bitcoin in circulation. Not sure if we have that kind of statistics, but it doesn't make sense for a single whale to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}