{
  "id": "topic_5453760",
  "title": "mu_enrico",
  "author": "mu_enrico",
  "created_time": "May 23, 2023, 11:17:18 AMLast edit: October 06, 2024, 07:25:54 AM by mu_enrico",
  "content": "Halo gan, sebagai penggemar komputer (enthusiast) mari saling tukar informasi dan saran kalau mau ngrakit PC dan/atau beli leptop. Ini akan sangat berguna untuk kaum mendang-mending dalam menentukan pilihan.Bahasan ini akan ane awali dengan pembahasan singkat dan link-link yang biasa dipakai enthusiat dalam meracik PC mereka.Disclaimer: konten dalam thread ini hanya berupa informasi sehingga ane tidak bertanggung jawab kalau ada yang tidak puas (buyer remorse) dan kerugian lainnya ketika membaca komentar & OP di thread ini. DYOR & DWYOR1. PSUSumber: PSU Tier List - Cultist NetworkIni sumber cukup valid IMO meskipun dulu sempet ada kasus di mana fanboy merek tertentu tidak terima...Kalau mau aman paling tidak pilih minimal Tier C untuk PC low-end. Ingat kalau low-end mereka bisa jadi mid-end kalok di lokal Indo.2. Memory DDR4 vs DDR5* DDR5 lebih cepat hanya untuk kerja tertentu.* DDR4 lebih murah (bang for buks).* DDR4 lebih value untuk gaming.Sumber: DDR5 vs DDR4: Is It Time To Upgrade Your RAM?IC yang terbaik untuk DDR4 adalah Samsung B-dieCek di sini: B-Die Finder3. Processor AMD vs IntelTergantung budget, AMD lebih budget dari segi harga processor dan harga motherboard.Hindari membeli generasi terbaru karena masih belum mature.Saat ini yang sudah mature dan laris:- Ryzen 5000 Series- Intel 12th & 13th genSumber:The Best & Worst Budget Gaming CPUs Ranked! - Tier ListPassMark - Price Performance (CPU Mark / $Price)4. CPU Fan vs Liquid Cooler/AIOBudget ambil fan, Liquid cooler/AIO hanya lebih senyap dan estetik namun performa tidak lebih baik dibandingkan fan (untuk AIO budget).Sumber:Liquid Cooling vs. Air Cooling Benchmark In-Depth (NH-D15, NZXT X62, & More)5. Motherboard AMD vs IntelTergantung budget, selain itu cek:* Tipe RAM yang dibeli memiliki profil XMP pada mobo atau tidak (cek di support website brand mobo)* Kuat ngangkat RAM high speed atau tidak (cek di support website brand mobo)* VRM kuat ngangkat CPU yang dibeli, terjadi throtle atau tidak (cek di situs-situs review)* Ada fitur bios flashback atau tidak, berguna ketika agan beli mobo lama tapi mau pakai processor yang lebih baru (asal socket sesuai) biasanya bios belum diupdate dan tidak mendeteksi. Fitur ini membuat kita tidak harus pasang cpu lawas untuk memperbaharui bios. Alternativenya suruh penjual mengupdate bios ke versi terbaru.6. GPU AMD vs Intel vs NvidiaTergantung budget, AMD lebih budget dengan performa yang sedikit di bawah Nvidia, namun kompabilitas game kadang bermasalah.Konten kreator disarankan pilih Nvidia. Intel masih belum mature dan banyak masalahnya.Sumber: PassMark - Price Performance (G3D Mark / $Price)7. SimulasiGunakan PCPartPicker untuk melakukan simulasi dalam menentukan spek yang sesuai budget yang agan punya.Untuk lokal bisa gunakan rakitan.com - simulasi.Kalau agan butuh saran mengenai build, silahkan komen di bawah. Jangan lupa untuk mencantumkan.* Range Budget?* Fungsi: gaming, office, video editing, 3d rendering?* Build AMD/Intel?Atau mau pamer build agan untuk dikomentari? Cantumkan (misalnya punya ane):* PSU: Fractal Design Ion+ 660w 80+ Platinum* CPU: Ryzen 5 5700X* Mobo: MSI B550-A PRO (AM4)* RAM: Team T-Force Dark Z Alpha 32Gb (4x8GB) 3600Mhz* Primary storage: Crucial T500 2TB PCIe Gen4 NVMe M.2 SSD* GPU: RTX 3060 Ti",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453760",
  "comments": [
    {
      "author": "Sarah Azhari",
      "created_time": "June 25, 2023, 12:05:57 AM",
      "body": "Quote from: mu_enrico on May 23, 2023, 11:17:18 AMHalo gan, sebagai penggemar komputer (enthusiast) mari saling tukar informasi dan saran kalau mau ngrakit PC dan/atau beli leptop. Ini akan sangat berguna untuk kaum mendang-mending dalam menentukan pilihan.Kalau menurut agan buat running node bitcoin doang apa perlu high spek?, soalnya aku mau running node, tapi masih ragu dengan spek laptopku yang satu ini, inti corenya yang biasa saja (mungkin setara dengan core i5), ramnya 16 GB, Hardisknnya 2 terabyte + 256 GB SSD nvme m2 ku pakai untuk Windows 10 OS yang running saat ini. Denger-denger, kalau mau running node musti memiliki performa laptop yang mumpuni, saat ini baru kupakai hanya untuk download blockchain, masih ragu buat kupakai running full node bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "June 25, 2023, 01:08:30 AM",
      "body": "Quote from: Sarah Azhari on June 25, 2023, 12:05:57 AMDenger-denger, kalau mau running node musti memiliki performa laptop yang mumpuni, saat ini baru kupakai hanya untuk download blockchain, masih ragu buat kupakai running full node bitcoin.Kalau yang ane denger, yang paling dibutuhkan adalah:1. Kestabilan koneksi internet (unlimited), karena nanti bakal download bergiga-giga data di awal sinkronisasi, dan bakal konek 24/7 setelah nodenya running.2. Device sanggup nyala 24/73. Watt kecil agar tidak tekor (karena nyala 24/7)Kalau untuk masalah spek seharusnya tidak begitu berat karena Bitcoin bisa running di Raspberry Pi 4 dan Odroid M1. Kedua device ini memenuhi ketiga persyaratan di atas. Kalau agan pakai leptop/PC takutnya biaya listrik bulanan membengkak...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fathafraink",
      "created_time": "June 25, 2023, 07:42:46 AM",
      "body": "Quote from: mu_enrico on May 23, 2023, 11:17:18 AMAtau mau pamer build agan untuk dikomentari? Cantumkan (misalnya punya ane):* PSU: Fractal Design Ion+ 660w 80+ Platinum* CPU: Ryzen 5 5600* Mobo: MSI B550-A PRO (AM4)* RAM: Team T-Force Dark Z Alpha 32Gb (4x8GB) 3600Mhz* Primary storage: Samsung SSD 980 M.2 PCIe Gen3x4 1TB* GPU: RTX 3060 TiGan, apa gak sayangkah memiliki RAM dgn kecepatan 3600Mhz, sedangkan CPU agan hanya mampu menggunakannya hingga 3200Mhz saja : https://www.amd.com/en/products/cpu/amd-ryzen-5-5600Spesifikasi agan sudah termasuk high-end sih menurut saya, bolehtaukah untuk keperluan apa saja yang biasa agan gunakan? apakah itu seperti menjalankan node, mining, editing video, atau gaming kah ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "June 25, 2023, 10:39:49 AM",
      "body": "Quote from: fathafraink on June 25, 2023, 07:42:46 AMGan, apa gak sayangkah memiliki RAM dgn kecepatan 3600Mhz, sedangkan CPU agan hanya mampu menggunakannya hingga 3200Mhz saja : https://www.amd.com/en/products/cpu/amd-ryzen-5-56003200Mhz itu mode JEDEC gan, nanti diganti di mode XMP bisa sampai 4000Mhz+, tergantung support motherboardnya (https://www.msi.com/Motherboard/B550-A-PRO/Specification)Lebih lanjut XMP: https://www.crucial.com/support/articles-faq-memory/what-is-xmpSebenernya yg ane incer adalah b-die 4000Mhz kalau mau optimal, cuma harganya agak berasa naiknya.Kalau ga ada mode XMP (kek preset OC gitu) bisa di OC manual, pastikan aja mobonya support.Punya ane 3600 Mhz sangat stabil, mungkin bisa di OC lagi tapi karena bukan b-die ya ribet. Kalau ane baca di forum sih 3800 Mhz masih sangat stabil. Untuk 4000 Mhz udah banyak yang ga menyarankan meskipun banyak orang yang pakai 4000 Mhz untuk AM4. https://www.youtube.com/watch?v=mXhqKf0-3HAOiya max speed juga tergantung berapa banyak RAM yg agan pakai, kalo 4 keping kek ane mentok di 3600 Mhz (berdasarkan spesifikasi).Quote from: fathafraink on June 25, 2023, 07:42:46 AMSpesifikasi agan sudah termasuk high-end sih menurut saya, bolehtaukah untuk keperluan apa saja yang biasa agan gunakan? apakah itu seperti menjalankan node, mining, editing video, atau gaming kah ?Kalau untuk lokal udah mid-end mungkin, tapi kalo untuk global ya jelas low-end...Keperluan semuanya lah gaming, multimedia, video/image editing, office, yang ane udah jarang cuma coding doang.Quote from: ETFbitcoin on June 25, 2023, 09:49:03 AMApakah website tersebut lebih baik dibandingkan website/aplikasi lokal lainnya seperti daftar dibawah ini?https://www.enterkomputer.com/simulasi/https://play.google.com/store/apps/details?id=com.rakitpc.rakitpcItu website referensi ane sejak 15+ tahun yang lalu, tadi ane buka yg enterkomputer ya sama aja sih, cuma beda tampilan doang. Kalau untuk harga mendingan beli terpisah saja tidak perlu beli di enterkomputer atau rakitan, tergantung mana yg lebih murah.Quote from: ETFbitcoin on June 25, 2023, 09:49:03 AM80+ Platinum? Apakah komputer tersebut digunakan 24/7 atau sering digunakan untuk hal yang berat dari segi komputasi?Sebetulnya waktu rakit ane hanya butuh yang gold (asalkan beneran gold, ga cuma branding doang) tapi udah pada kosong yang di PSU tier list. Beruntungnya ada itu produk baru dateng dan selisih harganya tipis sekali dengan gold yg ready stock. Mungkin pada waktu itu yg gold masih jadi rebutan para penambang koin jadi mahal banget.Kalau penggunaan paling hanya off ketika ane tidur aja (untuk apa saja udah dijawab di atas).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 27, 2023, 01:55:08 AM",
      "body": "Quote from: mu_enrico on May 23, 2023, 11:17:18 AM* CPU: Ryzen 5 5600Baru dirakit ini om? Ane ada niat upgrade CPU ke 5600 dari 3600X, tapi mengingat 5800XD udah rilis jadi ganti target ke sana. PC buat kebutuhan content creation dan gaming sih, sekilas selisih 1 jutaan di marketplace online antara 5600 dan 5800XD. Mendingan ambil 5800XD atau sekalian nunggu AM5 stabil ya? Agak out-of-date ane dengan kabar di dunia PC, terakhir dengar masalah CPU Ryzen terbaru yang pada meleduk. Salah satu sebabnya karena motherboard nyetel voltase VRM/EXPO terlalu tinggi (paling banyak Asus kalau ga salah). CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "June 27, 2023, 10:01:20 AM",
      "body": "Quote from: joniboini on June 27, 2023, 01:55:08 AMBaru dirakit ini om?Build akhir Q3 2022 gan.Quote from: joniboini on June 27, 2023, 01:55:08 AMAne ada niat upgrade CPU ke 5600 dari 3600X, tapi mengingat 5800XD udah rilis jadi ganti target ke sana. PC buat kebutuhan content creation dan gaming sih, sekilas selisih 1 jutaan di marketplace online antara 5600 dan 5800XD. Mendingan ambil 5800XD atau sekalian nunggu AM5 stabil ya?Ga salah gan harga 5600 ama 5800X3D selisih di 1 jutaan???5600 itu 1,87 jt https://tokopedia.link/015aooq8XAb5800X3D itu 5,38 jt https://tokopedia.link/015aooq8XAbKalau ada budget lebih buat proc, kalau ane mending 5700x yang tray kalau agan sudah punya cooler yg mumpuni & PSU masih kuat +35W. Di bawah 3 jt udah dapet, dan kalau mau yg tray garansi inter (rada gacha) sudah di angka 2,7 jt.Quote from: joniboini on June 27, 2023, 01:55:08 AMMendingan ambil 5800XD atau sekalian nunggu AM5 stabil ya? Agak out-of-date ane dengan kabar di dunia PC, terakhir dengar masalah CPU Ryzen terbaru yang pada meleduk. Salah satu sebabnya karena motherboard nyetel voltase VRM/EXPO terlalu tinggi (paling banyak Asus kalau ga salah). CMIIW.Kalau AM5 agan harus beli proc + mobo + DDR5, yang bikin biaya upgrade ga worth it kalau buat ane. Itu budget udah kayak build baru.Kalau yang masalah itu yg AM5 gan https://www.youtube.com/watch?v=cbGfc-JBxlYAM4 udah terjamin dan teruji, jadi ga perlu khawatir Kalau agan cuma ganti proc, paling update bios doang di motherboard lama (make sure aja supported) sebelum update, sama kalau ga mendukung BIOS flashback berarti yg 3600X jangan dicopot dulu, update BIOS dulu baru copot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 28, 2023, 12:53:15 AM",
      "body": "Quote from: mu_enrico on June 27, 2023, 10:01:20 AMGa salah gan harga 5600 ama 5800X3D selisih di 1 jutaan???5600 itu 1,87 jt https://tokopedia.link/015aooq8XAb5800X3D itu 5,38 jt https://tokopedia.link/015aooq8XAbWoiya salah lihat. Yang ane lihat 5800X biasa ternyata. Selisihnya jauh banget ternyata haha. Quote from: mu_enrico on June 27, 2023, 10:01:20 AMKalau ada budget lebih buat proc, kalau ane mending 5700x yang tray kalau agan sudah punya cooler yg mumpuni & PSU masih kuat +35W. Di bawah 3 jt udah dapet, dan kalau mau yg tray garansi inter (rada gacha) sudah di angka 2,7 jt.Ok om makasih sarannya. PSU dan cooler lumayan OK sih, cuma motherboard ane yang sepertinya ga bagus karena temperature VRM tinggi banget. Salah beli mobo sepertinya, tapi ok\" aja sih selama ga dipakai untuk OC dll. Untuk flash BIOS dkk ane udah terbiasa sebenarnya, plus udah ada UPS jadi kalau mati listrik tiba\" sih kemungkinan besar tetap aman. Quote from: mu_enrico on June 27, 2023, 10:01:20 AMKalau yang masalah itu yg AM5 gan https://www.youtube.com/watch?v=cbGfc-JBxlYAM4 udah terjamin dan teruji, jadi ga perlu khawatir Nah ini yang ane sempat baca\". Semoga aja masalah kaya gini ga muncul lagi di generasi berikutnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 28, 2023, 04:10:14 AM",
      "body": "Quote from: mu_enrico on June 25, 2023, 01:08:30 AMQuote from: Sarah Azhari on June 25, 2023, 12:05:57 AMDenger-denger, kalau mau running node musti memiliki performa laptop yang mumpuni, saat ini baru kupakai hanya untuk download blockchain, masih ragu buat kupakai running full node bitcoin.Kalau yang ane denger, yang paling dibutuhkan adalah:1. Kestabilan koneksi internet (unlimited), karena nanti bakal download bergiga-giga data di awal sinkronisasi, dan bakal konek 24/7 setelah nodenya running.2. Device sanggup nyala 24/73. Watt kecil agar tidak tekor (karena nyala 24/7)Kalau untuk masalah spek seharusnya tidak begitu berat karena Bitcoin bisa running di Raspberry Pi 4 dan Odroid M1. Kedua device ini memenuhi ketiga persyaratan di atas. Kalau agan pakai leptop/PC takutnya biaya listrik bulanan membengkak...Thanks informasinya, Kalau masalah download data ketika awal sinkronisasi, laptopku ini sudah sepenuhnya download 520GB blockchain data menggunakan core wallet, cuma yang agak ragu ini masalah koneksi internet, apakah nanti bermasalah dengan perangkat keras laptop jika nanti internetnya shutdown secara tiba-tiba?. saat ini aku memakai internet 30 mbps. Sedangkan untuk masalah watt, saat ini aku memakai panel solar cell untuk mengisi daya laptop dan HP. Itu pun hanya sebatas coba-coba dengan memakai solar control 10 A dan batere 12 volt yang kubeli sekitar 1 jutaan perpaket, Lumayan cukup untuk ngecas HP serumah dan laptopku ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "June 30, 2023, 10:30:54 AM",
      "body": "Quote from: joniboini on June 28, 2023, 12:53:15 AMOk om makasih sarannya. PSU dan cooler lumayan OK sih, cuma motherboard ane yang sepertinya ga bagus karena temperature VRM tinggi banget. Salah beli mobo sepertinya, tapi ok\" aja sih selama ga dipakai untuk OC dll. Untuk flash BIOS dkk ane udah terbiasa sebenarnya, plus udah ada UPS jadi kalau mati listrik tiba\" sih kemungkinan besar tetap aman. Kalau VRM tinggi setau ane ga cocok dipakai buat high-end CPU gan, ya support sih tapi nanti biasanya kenak \"thermal throttle\" alias frekuensi ga bisa digeber naik lagi (performa jelek). Kalau Zen3 kan dia sebenarnya sudah \"auto\" OCnya jadi kalau ada ruang di temperature dia bisa naikin frekuensi lebih tinggi otomatis. Dulu kalau ane beli mobo juga pasti yang murah-murah karena ga dipakai macam-macam, tapi ketika pindah ke Zen3 mau tidak mau harus ambil yang bagus di review agar tidak kena throttle ketika upgrade CPU kelas atas (meskipun belum ada duit upgrade ).Mungkin kalau mau aman mentok di R5 aja gan, kalau ga mau gambling di R7 sambil nabung ganti platform (DDR5 sekalian) Rekomendasi di Intel (kalau ada duit) karena sudah 2 generasi dia support DDR5, sedangkan AMD baru 1. Alias lebih terbukti dan teruji.Quote from: Sarah Azhari on June 28, 2023, 04:10:14 AMThanks informasinya, Kalau masalah download data ketika awal sinkronisasi, laptopku ini sudah sepenuhnya download 520GB blockchain data menggunakan core wallet, cuma yang agak ragu ini masalah koneksi internet, apakah nanti bermasalah dengan perangkat keras laptop jika nanti internetnya shutdown secara tiba-tiba?. saat ini aku memakai internet 30 mbps. Sedangkan untuk masalah watt, saat ini aku memakai panel solar cell untuk mengisi daya laptop dan HP. Itu pun hanya sebatas coba-coba dengan memakai solar control 10 A dan batere 12 volt yang kubeli sekitar 1 jutaan perpaket, Lumayan cukup untuk ngecas HP serumah dan laptopku ini.kalau koneksinya down ya node-nya down nanti pas balik online ya dia resume download block lagi. Ga ada efek ke perangkat keras setau ane kalau internet down, palingan menambah beban listrik yang ga guna aja. Ane ga tau ya wallet tsb harus direstart manual atau tidak ketika internet down lama atau akan otomatis nyambung sendiri, atau akankah appsnya jadi unresponding di windows. Mungkin itu detailnya bisa tanya agan @Husna terkait Bitcoin core. Kalau di thread ini dari segi hardware leptop tidak ada masalah. Hanya saja ane ada sedikit keraguan di kemampuan solar cell untuk ngecharge laptop, apakah akan bikin baterai/charger laptop cepet jebol atau tidak. Ini diluar kemampuan ane soalnya belum berminat mainan solar cell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "July 01, 2023, 01:13:58 AM",
      "body": "Quote from: mu_enrico on June 30, 2023, 10:30:54 AMHanya saja ane ada sedikit keraguan di kemampuan solar cell untuk ngecharge laptop, apakah akan bikin baterai/charger laptop cepet jebol atau tidak. Ini diluar kemampuan ane soalnya belum berminat mainan solar cell.Aku belum pernah nyoba juga, selama ini kumain solar cell hanya sebatas ngidupin lampu taman saja, itu pun hanya sebatas ketertarikan untuk bahan penelitian thesis-ku. kalau kuhitung-hitung lumayan menghemat, apa lagi buat orang yang tinggal di pedesaan yang lampunya sering byar pet. Mengenai apa bikin batere/carger laptop cepat jebol atau anggak, kita bisa gunakan stabilizer, kebetulan aku dulu masih nyimpen bekas PC lama tahun jadul, kemungkinan masih berfungsi karena pernah dipakai buat menstabilkan daya listrik yang ngambil energinya dari motor bebek jadul honda c-70.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 04, 2023, 03:18:47 AM",
      "body": "Quote from: mu_enrico on June 30, 2023, 10:30:54 AMMungkin kalau mau aman mentok di R5 aja gan, kalau ga mau gambling di R7 sambil nabung ganti platform (DDR5 sekalian) Rekomendasi di Intel (kalau ada duit) karena sudah 2 generasi dia support DDR5, sedangkan AMD baru 1. Alias lebih terbukti dan teruji.Sip om. Kalau dipikir\" aktivitas ane bisa diatasi dengan CPU kelas R5, cuma kalau mau main game sekalian record kadang terasa framedrop, entah ini karena core yang kurang banyak atau karena ada bottleneck lain. Intel generasi terbaru apa beda jauh performanya dengan AMD om? Kalau generasi sebelumnya kan Intel menang tipis banget dengan kebutuhan daya yang lebih tinggi (afaik). Terakhir yang ane lihat video reviewnya si HU[1].[1] https://www.youtube.com/watch?v=UNDxKQP1_FQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 04, 2023, 09:57:16 AM",
      "body": "Quote from: joniboini on July 04, 2023, 03:18:47 AMSip om. Kalau dipikir\" aktivitas ane bisa diatasi dengan CPU kelas R5, cuma kalau mau main game sekalian record kadang terasa framedrop, entah ini karena core yang kurang banyak atau karena ada bottleneck lain. Kalau untuk streaming/recording pasti akan ada penurunan fps gan apalagi kalau hardware masih low-mid-end. Akan tetapi ada kasus unik AMD.Frame drop kalau pakai build AMD itu sudah umum gan, orang-orang menyebutnya AMDip Ini berkaitan dengan arsitekturnya, yang auto OC tadi. Ketika proc belum dikasih kerjaan berat, katakanlah dia jalan di base clock 3.7GHz, tapi ketika muncul kerjaan berat dia akan boost clock ke 4.6Ghz. Delay ngegas inilah yang bikin frame drop apalagi kalau di game-game kompetitif. Hal ini tidak terjadi di build Intel + Nvidia. Tidak hanya di CPU, tapi GPU juga sama, terlihat di low 1%-nya GPU AMD buruk sekali kalo dibandingkan dengan Nvidia.Build AMD IMO lebih cocok untuk PC gaming single/AAA non kompetitif (casual). Kalo ngejar fps dan latency apalagi kalau mau kompetitif larinya ke tim sultan sebelah.Quote from: joniboini on July 04, 2023, 03:18:47 AMIntel generasi terbaru apa beda jauh performanya dengan AMD om? Kalau generasi sebelumnya kan Intel menang tipis banget dengan kebutuhan daya yang lebih tinggi (afaik). Terakhir yang ane lihat video reviewnya si HUIntel mulai dari gen-12 sudah ok gan, tetapi ya harganya masih berasa lebih mahal. Kalau ngejar menang kalah ya pakai Intel, tapi kalau ngejar price/performance ya ane cenderung lebih suka AMD dengan segala problemnya. Tergantung generasinya si, misalnya- Zen3 vs 12th gen = Zen3 kebanyakan hanya bisa sampai 3800 Mhz memori (kecuali hoki menang silicon lottery), 12th gen yang versi k (unlocked) bisa sampai 4000 Mhz+ memori di gear 1. Intel masih menang, tapi Zen3 itu jauh lebih murah kalau dihitung CPU + Mobo. Lebih baik dari sisi price/performance. - Zen4 vs 13th gen = Ambil intel aja daripada pusing dengan semua permasalahan generasi pertama AMD yang udah banyak bertebaran, kecuali agan mau troubleshoot dan buka-buka/update bios. Watt kegedean di Intel tinggal undervolt aja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "July 22, 2023, 08:38:27 AM",
      "body": "Ane orang yang suka banget soal komputer, tapi engga paham secara mendetail mengenai spesifikasi-spesifikasinya. Sebenernya ane kepikiran buat upgrade komputer setelah 5 tahun pemakaian (2018-2023) ane udah bookmark beberapa part yang jadi target ane buat ganti PC ane ke yang baru. Mohon di kasih saran dan masukan soal build yang jadi target ane ini biar dapet insight yang lebih dalam lagi.Target rakit PC ane sbb :- Processor : Intel Core I3 13100F (1,860,000) alasan : ane masih setia sama intel karena masih termakan opini tukang servis tetangga ane soal beberapa kekurangan yang dimiliki AMD di kelas menengah. Ane sendiri ga begitu paham karena belum pernah pakai AMD sama sekali, tapi selama memakai intel, ane ngerasa nyama aja. Entah kalau dapat wejangan dari sini, mungkin ane bisa pikir lagi buat nyoba hal baru, yaitu pindah ke AMD.- Motherboard : Asus Prime B-760M DDR4 (2,275,000) alasan : soal ini, ane masih percaya sama brand Asus dan juga ane ambil seri B yang menurut ane ini seri middle dan yang penting ada slot M.2 NVME buat SSD ane.- Kartu Grafis : Asus GTX 1650 (2,544,000) alasan : budget untuk VGA ane ga bisa jor-jor an, karena kebutuhan ane untuk produktif engga butuh VGA spek tinggi. Dulu pernah pakai VGA ASUS GTX 760 DirectCU II OC ternyata listrik ane ga kuat. Soalnya cuma 900 Watt saja dan itu masih ada barang elektronik lain yang harus nyala setiap saat. - RAM : VGEN Tsunami 2X8GB (718,000) alasan : lokasi service centernya deket dengan rumah ane. Untuk brand lain, ane belum explore sih. Tapi untuk RAM VGEN ini bener-bener lifetime dan ane pernah klaim garansi juga. Prosesnya mudah dan ga nunggu sampe berjam-jam. Kalau misal ada rekomendasi lain ane seneng buat ngebandinginnya.- PSU : Corsair 550Watt (899,000) alasan : ga mau judi di PSU, karena pengalaman ane pakai PSU abal-abal selalu bikin masalah soal kelistrikan di motherboard. Ini ane alami waktu masih SMA dulu, dan ane pakai PSU yang harganya under 100 ribuan. Kalau ada rekomendasi PSU yang lebih worth to buy, ane bisa pertimbangin itu gan.Untuk disk, ane bakal pakai SSD yang lama, dan untuk casing ane juga bakal ganti baru biar fresh.Sekedar informasi daily usage komputer ane - Buat ngetik dan print dokumen tiap hari.- Buat desain dan edit/render video jarang-jarang, mungkin seminggu sekali.- Buat main game valorant pas weekend doang. Kadang kalau siang dah dirumah dan waktu longgar juga main game ini.Ada saran bagian mana yang bisa di tekan agar budget bisa lebih ramping? Secara total belanja diatas bakal makan budget 8jt, dan budget buat komponen PC menurut rencana awal ane adalah 6jt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 22, 2023, 06:42:32 PM",
      "body": "agan @bayu7adi,BuildJadi buildnya budget ya, kalau mau budget biasanya larinya ke AMD agar dapatnya lebih worth it.Di harga 13100F ada pilihan lain yang lebih oke, yaitu kek punya ane Ryzen 5 5600Ini battlenya: https://www.youtube.com/watch?v=JH8UTc6lwX8&t=917sNamun kalau sudah getol pengen intel kalau lebih memilih versi pendahulunya, yaitu 12100F yang harganya cukup lumayan terpautnya, tapi performanya beda tifis.MoboAsus sebenarnya overkill untuk build budget gan, cukup ambil Gigabyte aja udah cukup, 12100F ga bakal kenak termal throtle jadi pakai yang murah aja gpp.Kalau bisa dapat harga bagus cari Gigabyte b660m-ds3h di harga under 1,9jt (yang laris manis di tokped yang versi AMDnya cuma 1,5jt )Ada NVMEnya juga lah pastinya.Kalau ga ada mending ambil MSI udah ada wifinya dibandingkan Asus.Ini battlenya: https://www.youtube.com/watch?v=r3o1Ebk_jCA&t=1664sRAMUntuk 2x8GB DDR4 banyak banget pilihannya, tapi yang penting kalau mau VGEN ya ambil versi 3200Mhz.Kalau ane ambil kingston atau teamgroup aja yang lebih murah. Bisa dapat under 700rb untuk 3200MhzPSUCorsair itu brand premium gan, bisa ambil FSP aja lebih murah. Bisa dapat under 700rb untuk yang bronze.Untuk build agan tidak terlalu sensitif daya karena tarikannya kecil, yang kek gitu dulu seringkali dikasih PSU abal-abal juga awet (cuma ya gatcha, ga rekomended).GPUNambah dikit dapet RX 6600 baru, jauh lagi performanya https://www.youtube.com/watch?v=tPvgVzsERLYMinimal 2023 cari yang 8GB lah.Jadi build yang ane rekomen (disclaimer: DYOR & DWYOR) udah ngirit kira-kira:- 500rb proc- 250rb mobo- 200rb PSU= 950rbKemudian 500rb buat nombokin RX6600 masih sisa 450rb Kalau mau build AMD bisa lebih murah lagi pakai Ryzen 5600G, ga usah pakai GPU. Rajanya build murce. Tapi itu ga bakal bisa main game AAA lancar di 2023, kalo game online ya masih bisa.https://www.youtube.com/watch?v=cdcyyJyM8v8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "July 24, 2023, 07:03:35 PM",
      "body": "^ bener, setelah ane cek di tokped, combo i3 12100F + gigabyte b660m-ds3h + PSU FSP emang mangkas budget yang mana ane masih suka nyari referensi best value buat budget sekian.Tapi waktu ngebandingin Ryzen 5 5600 + GIGABYTE B550M-DS3H vs i3 12100F - LGA1700 + GIGABYTE B660M DS3H , lebih ekonomis yang versi intel i3 12100f. Selisih 260ribuan ini masih oke kah jika di lihat dari segi peforma yang ditawarin AMD Ryzen 5 5600 ?AMDProcessor Ryzen 5 5600 = 2,100,000GIGABYTE B550M-DS3H = 1,440,000Total = 3,540,000INTELi3 12100F - LGA1700 = 1,400,000GIGABYTE B660M DS3H = 1,877,000Total = 3,277,000",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 25, 2023, 09:49:18 AM",
      "body": "Quote from: bayu7adi on July 24, 2023, 07:03:35 PMTapi waktu ngebandingin Ryzen 5 5600 + GIGABYTE B550M-DS3H vs i3 12100F - LGA1700 + GIGABYTE B660M DS3H , lebih ekonomis yang versi intel i3 12100f. Selisih 260ribuan ini masih oke kah jika di lihat dari segi peforma yang ditawarin AMD Ryzen 5 5600 ?Kalau lebih sering multitasking lebih worth it pakai Ryzen 5600 karena core-nya lebih banyak, game-game sekarang juga kadang performanya burik kalau pakai 4 core, terutama game AAA. Untuk kasus perbandingan ini (I3 vs R5): single core Intel lebih kencang, hanya saja jumlah corenya sedikit, sedangkan single core AMD lebih lambat, tapi jumlah corenya lebih banyak. Kalau untuk penggunaan yang seperti agan utarakan, sepertinya lebih benefit kalau jumlah core-nya banyak.Link yang ane share di atas juga memperlihatkan performa Ryzen lebih baik, hanya saja dengan catatan untuk 12 game yang ditest HWU. Perhatikan juga kalau pakai GPU yang low-end perbedaannya tidak signifikan.Jadi ya beda tipis 260K itu hanya akan memberikan perbedaan performa yang tipis juga... .. Tapi gimana kalau bedanya cuma 60rb ..Kalau ane build kemaren berani gatcha ambil yang Ryzen 5600 tray (basically garansi inter, non resmi, rusak ya apes), lalu kipasnya beli sendiri merek lain (ane ambil ID Cooling), jadinya:1,5 jt + 400rb = 1,9 jt lebih adem dan lebih murah daripada beli yang resmi.* Kalau pakai kipas yang lebih murah bisa lebih irit lagi...*Ane berani soalnya ga pernah mengalami kasus proc rusak dari beberapa build yang sebelumnya DYOR & DWYOR.Namun untuk pemula ya ambil yang garansi-garansi aja deh, lebih tenang. Kalau bisa mengusahakan 260rb dan mau cobain AMD ya Ryzen 5600 lebih worth it IMO, that's what I did. Btw ini ngrakit sendiri atau dirakitin? Kalau ngrakit sendiri build AMD yang ini agak horor soalnya pin ada di proc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "July 25, 2023, 10:42:22 AM",
      "body": "Quote from: mu_enrico on July 25, 2023, 09:49:18 AMKalau ngrakit sendiri build AMD yang ini agak horor soalnya pin ada di proc.Apakah ada teknik spesial om untuk masang processor Ryzen yang satu ini? BTW yang buat horor gimananya?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 25, 2023, 11:10:18 AMLast edit: December 18, 2023, 12:36:38 PM by mu_enrico",
      "body": "Quote from: bayu7adi on July 25, 2023, 10:42:22 AMApakah ada teknik spesial om untuk masang processor Ryzen yang satu ini? BTW yang buat horor gimananya?Pinnya ada di proc:Sumur.Jadi harus hati-hati ketika masukin proc ke mobo, dan proc jangan sampai jatuh dsb, karena pinnya bisa bengkok. Kalau di Intel pinnya ada di mobo, jadi pasang CPU rasanya lebih tenang, lebih tenang juga kalau beli bekas. Tutorialnya bisa dicari sendiri di youtube bagaimana orientasi proc sesuai tanda panah. Intinya ada risiko pin bengkok kalau tidak hati-hati untuk AMD AM4, kalau Intel ga ada risiko itu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 26, 2023, 05:13:14 AM",
      "body": "Berdasarkan pengalaman ane masang 3600x di PC ane, selama agan teliti dan masang sesuai tanda panah semuanya bakal baik\" saja. Kalau sudah pas prosesor bakal masuk dengan mudah kok seingat ane. Bisa juga dipasang di atas tempat yang empuk kalau memang parno bakal jatuh dst. Jangan sampai tanganya licin juga kalau pas masang. Kalau pernah bongkar rakit sendiri memang bisa lebih tenang sih saat masang. Kalau agan benar\" baru dan tidak familiar dengan rakit PC mungkin bisa cari yang jual deket agan dan mau pasang sekalian.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}