{
  "id": "topic_5471345",
  "title": "renatopinto",
  "author": "renatopinto",
  "created_time": "October 23, 2023, 01:27:37 PM",
  "content": "I have an Amlogic A113D Control Board, which equips the Bitmain Antminer S19 90Th.It turns out that I went to install an update via the Pendrive and it stopped responding.The update I used was this:https://i.postimg.cc/7LwbtL9X/Vinish-1.pngThe Pendrive looked like this:https://i.postimg.cc/VkbHZfvS/vanish-2.pngThe board updated, the green light turned on, indicating that it was ready.I removed the pendrive and restarted.Now, the board no longer reads the pendrive, it doesn't even light up indicating the pendrive is connected (it has a light that lights up when it turns on).And the sign doesn't go up. Only the green light on the network card turns on and keeps showing, but it doesn't go up on the network, it doesn't get IP and it doesn't read the pendrive so I can reinstall the original bitmain.Has anyone ever experienced this? Is there any hard reset mode?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471345",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "October 23, 2023, 06:25:40 PM",
      "body": "The image you posted above is very blurred I can't seem to read where did you downloaded the firmware.It seems it was from vnish-firmware.com but this website seems fake no one mentioned this website before that this is legit.The firmware you downloaded bricks your control board.Isn't that the original firmware should have come from asic.to?If the OTG to USB flashing doesn't work anymore then you can try to flash the control board through a TTL cable you can find the guide from this link below.- https://www.zeusbtc.com/articles/asic-miner-troubleshooting/1082-recovery-method-of-miner-serial-port-virusHope this one will work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "renatopinto",
      "created_time": "October 23, 2023, 06:37:47 PM",
      "body": "Thanks for the answer.I just bought a USB TTL to try this. There is no other way.I downloaded the image from the website below. I don't know why the host downgraded my image resolution.URL: https://vnish-firmware.com/en/razgon-antminer-s19-s19i-s19pro-s19j-t19/> AMLOGIC CONTROL BOARD>> AMLOGIC SD (OTG-USB) VERSION 1.2.0 RC5 (autotune)>>> S19 AML SD IMAGE (88 chips) version 1.2.0-rc5(FILE) - File: VNISH_OFFICIAL-SD-s19-88-aml-sd-v1.2.0-rc5-install.tarDownload Link: https://vnish-firmware.com/en/VNISH_OFFICIAL-SD-s19-88-aml-sd-v1.2.0-rc5-install.tarMy mistake could be this OTG-USB version. I do not know what this is. :-(Best regards,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 24, 2023, 02:10:02 PM",
      "body": "Let us update here if USB to TTL would work.About the source where you download the firmware I never heard of this domain there is also vnish.net I do not know if these sites are legit but would you mind to download the firmware instead from asic.to for safety purposes?Or better download the stock firmware from Bitmain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "renatopinto",
      "created_time": "October 24, 2023, 02:18:31 PM",
      "body": "I was wrong to download this firmware. A big mistake.Yes, I can put any firmware you recommend. The board only turns on the network light, nothing else. And it doesn't read the pendrive, it doesn't even turn on the pendrive light, as if it had no power.I already bought the TTL cable, I'm waiting and it should arrive tomorrow. I bought this model with drivers:https://produto.mercadolivre.com.br/MLB-2200958817-1-x-cabo-ftdi-usb-a-para-ttl-rs232-pl2303hx-4-pinosnf-_JM?quantity=1I looked at how to upload the OS using TTL and it doesn't seem to be simple, but it isn't complex either. I am going to try.Thank you for your help, BTC UP and the machine stopped... :-( I'm an enthusiast, I bought 30 S19 90Th. But I still don't have that knowledge in terms of maintenance.Best Regards,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}