{
  "id": "topic_5470426",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "October 15, 2023, 02:32:13 PM",
  "content": "The message to newbies has always been the same since the beginning of time. From bitcoin creation to the very time altcoin started to pop up, till the era of NFTs, airdrops and other silly nonsense that shows up to deceive the naive ones. This is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"PS- Image source is from a Telegram group. I don't claim ownership of it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470426",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "October 15, 2023, 02:55:29 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMThe message to newbies has always been the same since the beginning of time. From bitcoin creation to the very time altcoin started to pop up, till the era of NFTs, airdrops and other silly nonsense that shows up to deceive the naive ones. This is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"It is indeed a powerful message and we all should follow it. But my dear friend not all fingers are the same, in the same way, this ecosystem (Earth) is full of different people with different mindsets and different purposes. If one is a businessman then the other is a farmer. Even if they both read in the same school and sat at the same bench. A mindset of a person takes him to where he has planned of. To those who think we thought to become X and become Y, they are just behind time, by making efforts and when the time comes, they will achieve their aim. Now you must be wondering, why I am saying all this shit, which you might already know about. I am saying it because, if a person on the left (in pic) making different investments and taking risks then it is his choice and the person on the right believes in BTC then he is also taking risks and that is his own choice. We all can't be on the same page and that is the reality of this world. But at least we can try. Let's say if a person is given two choices of choosing the ordinals or BTC and also taught by two persons, one is ordinal enthusiast who know, that there are people out there who made billions of dollars out of Ordinals and they will teach you how you can earn the same (either they are legit or fake) and at the same time there is a BTC enthusiast who will teach you about BTC and the same things that an ordinals enthusiast will teach you. And then there are many other options that a person has to choose from. What you/person will choose. he will make decisions according to the circumstances he is in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "October 15, 2023, 03:24:06 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMb]\"Just buy bitcoin and hold your own keys or else you are going to get scammed\"[/b]Hold your own private keys and don't leak it to others. Others include the wallet software builders and anyone who don't trust or don't want them to inherit your bitcoin.If you use a wallet software that has back doors, you even are not the only one who own private keys of your bitcoin.Reminder: do not keep your coins in online accountsUse wallets are: non custodial, open source and reproducible and already tested by Bitcoin experts.Check some reviews from reproducible tests.https://walletscrutiny.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Huppercase",
      "created_time": "October 15, 2023, 04:07:16 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMThe message to newbies has always been the same since the beginning of time. From bitcoin creation to the very time altcoin started to pop up, till the era of NFTs, airdrops and other silly nonsense that shows up to deceive the naive ones. This is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"PS- Image source is from a Telegram group. I don't claim ownership of it. This message is the most underated yet most needed message anyone in crypto needs, not to only newbies, including some people that are guilty of safekeeping thier coins on exchange but the thing is, people that wil listen are going to listen, people that will take corrections will take especially the ones that have been affected by quick scam exit, hacks and insider misappropretition of funds like mismanagement and others.Many people that are guilty of exchange hack and exits, if they know this earlier, they will not have been among the victims. Many of them are running after the next ROI altcoins on exchanges forgeting that chasing money without puting security into consideration is like trying to make money and live it your door step. I wish even the exchange can give warning to the users about how it is unsafe to keep coins with them, this will increased the rate of custodial savings of coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 15, 2023, 04:55:10 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PM\"Just buy bitcoin and hold your own keys or else you are going to get scammed\"You are damn right, even if this statement looks easy to follow but many failed to follow it and lost all of their funds, not only in BTC but in other investments like those made in altcoins, nuts, metaverse-related projects, etc. These investments, no doubt, made many people millionaires overnight, but also made many millionaires poor too. And that also happens in BTC, where if a person bought some BTC and now holding it for like 10 years.In the way, his BTC would be worth less than the amount he used to buy it and also would be more than that amount. I would say, to add another term of not watching your status if you have planned to do holding then don't look at your holding and how much you are making or losing.Because, that way, a holder will get into market sentiments, and by becoming emotionally attached to the market, he will make dumb decisions and might lose all of the funds. So the best practice for holders is to keep their funds in a wallet, of which the key you hold, and don't act quickly upon any news regarding to the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 15, 2023, 05:13:52 PM",
      "body": "To be honest if you want to be a crypto-currency enthusiast for a long time then I would say stick with Bitcoin especially if you are the type that can't handle losses. From experience those who are only involved with Bitcoin has lesser risk (not saying the risk is non existence) than those who goes in to other altcoins, projects, platforms. Yes altcoins may hold opportunities investor yarns for and for a cheap price but the days of ICO or the days of when any shit altcoins was profitable are gone. Bitcoin has all the features to remain ever solid, the only issue holding Bitcoin is holding it properly against hackers, scammers or your own personal incompetence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 16, 2023, 01:45:33 PM",
      "body": "Indeed the message is very powerful and it still holds the truth till time. Many shit coins and Cryptos have come and gone but Bitcoin has long been in existence and will still be. The message passed across is so simple and short and does not need much explanations to for clarification. If you want to profit from Bitcoin, buy and hold and take proper security measures to protect your bitcoin by holding in your own personal custody. Make sure you do hold your coin in your own personal wallet or self custodial wallet for a long time. Avoid third party exchanges as they can not guarantee your coin safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "October 16, 2023, 02:08:28 PM",
      "body": "Bitcoin is a digital crypto currency where there is no fear of being scammed when investing. If any coin is considered the most secure in the crypto world, it is undoubtedly Bitcoin. While people are regularly losing their money investing in other coins, people are sharing success stories investing in Bitcoin. If you want to invest in crypto platform then definitely do it in bitcoin because bitcoin will show you success not failure. And for those who think long-term investment in Bitcoin, remember that anyone who suggests long-term investment to you must have your best interests at heart. If you invest in Bitcoin for long period you will see good amount of profit at the end of long period but the advisor will not come to take your profit share so invest in Bitcoin and hold it for long period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "October 16, 2023, 05:05:03 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMThe message to newbies has always been the same since the beginning of time. From bitcoin creation to the very time altcoin started to pop up, till the era of NFTs, airdrops and other silly nonsense that shows up to deceive the naive ones. This is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"PS- Image source is from a Telegram group. I don't claim ownership of it. I like this advise that you are giving to the newbies, those that just joined the forum here. Before I come back to what I intended to talk about, I need the newbies here to learn a lot on this platform. They should take out of their judicious time to tour around this forum and learn, study and understand the intricacies of the Blockchain technology. This forum is an encyclopedia of topics that ravel around the cryptocurrencies, not Bitcoin alone. But can also serve as a one stop shop for your Bitcoin knowledge. Therefore, I will advise the newbies in this forum to garner more knowledge on here especially at the Beginners and Help board.Secondly, I will advise the newbies to also visit www.learnmeabitcoin.com and take advantage of the knowledge of Bitcoin that's deposited in that website. A step-by-step knowledge on the basics that everyone need to know as far as Bitcoin is concerned. Including the private key, the public key, seed phrase amongst other numerous topics there.Lastly, if you will take your time to learn, page-by-page the guides that have beem provided in the website, you will be able to understand why it is not only important but paramount to secure your private key and wouldn't allow it out by any chance. In fact, therein, you're advised the best ways to which you can secure your private key and other technical stuffs included.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 16, 2023, 05:31:40 PM",
      "body": "Quote from: ZAINmalik75 on October 15, 2023, 04:55:10 PMQuote from: alastantiger on October 15, 2023, 02:32:13 PM\"Just buy Bitcoin and hold your keys or else you are going to get scammed\"You are damn right, even if this statement looks easy to follow but many failed to follow it and lost all of their funds, not only in BTC but in other investments like those made in altcoins, nuts, metaverse-related projects, etc. These investments, no doubt, made many people millionaires overnight, but also made many millionaires poor too. And that also happens in BTC, where if a person bought some BTC and now holding it for like 10 years.Exactly, The Biggest losses I have experienced in this crypto industry when it comes to investment were my investment in altcoin and shitcoins, and that was when I had less information regarding Bitcoin compared to what I know of now, I do think this is the same case story with most newbies that have also lost in one way or the other. Information is key and this is why most investors who understand this now stick their investment only on Bitcoin or more percentage of their capital into BTC,  it is indeed safer with Bitcoin, just Hodl and have patience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "October 16, 2023, 07:28:20 PM",
      "body": "The message is lacking.  An investors need to learn about Bitcoin and the market movement.  Buying Bitcoin without knowing the market movement may make the investor end up buying at the top price.  This will render them to get paper losses and may take years to recover.  The advice on stashing it on the non-custodial wallet is a great advice but jumping into the Bitcoin market without any strategy or plan in mind may be disastrous if the person is just looking for a short term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "October 18, 2023, 01:38:16 PM",
      "body": "I believe the message is very clear - Buy only Bitcoin. But, what are we gonna do with these altcoins like Ethereum and BNB? For newbies, this should be the best option but for us who have been in the crypto market for many years, I don't think we just ignore altcoins. Maybe I was wrong but can't just ignore the fact that some altcoins are more profitable than Bitcoin. For me, altcoins are still a good investment but that is right, we should be careful in choosing them. And it also depends on the time we bought them. Scams just happen to those who have no knowledge about crypto and those who are greedy. If we know how to secure our funds from the hands of these scammers, they will just fail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 18, 2023, 02:19:04 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMThis is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"PS- Image source is from a Telegram group. I don't claim ownership of it. I have enhanced the image for many to see, this should be shared it's a good example of why newbies should just focus on Bitcoin only and forget everything else, newbies keep on supporting these trending coins in the hope that what they failed on Bitcoin as a late investor they can do on these trending coins.But they are not going to find it on these coins because they are pump and dump coins and they manipulate the price and do rug pull once you hold these coins A picture really paints a thousand words and this is one of the images of investing only in Bitcoin and not taking chances on trending coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "October 18, 2023, 02:31:24 PM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMThis is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"Hearing and reading about scammers, some people can think of scammers to be far away. The scammer can be your friend or even family, The scammer can be your mentor or someone you look up to and have made the mistake of trusting them with your keys. The scammer is not only an anonymous individual from somewhere around the world, the scammer can be someone close. If you always remember this, you will know that the only person you can really trust to hold your keys is you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "October 18, 2023, 04:10:36 PM",
      "body": "Quote from: Hypnosis00 on October 18, 2023, 01:38:16 PMI believe the message is very clear - Buy only Bitcoin. But, what are we gonna do with these altcoins like Ethereum and BNB? For newbies, this should be the best option but for us who have been in the crypto market for many years, I don't think we just ignore altcoins. Maybe I was wrong but can't just ignore the fact that some altcoins are more profitable than Bitcoin. For me, altcoins are still a good investment but that is right, we should be careful in choosing them. And it also depends on the time we bought them. Scams just happen to those who have no knowledge about crypto and those who are greedy. If we know how to secure our funds from the hands of these scammers, they will just fail. Let's just say the risk is greater in altcoins than bitcoin, altcoins still have owners while bitcoin does not - this is in my own view.You are not wrong that actually altcoins are also profitable, but you must know that it cannot be long-term but must be short-term that is my principle, even though we know altcoins have an increase if the altcoin season arrives, it's just that a big risk can still overshadow you from any loss of coin value that does not increase anymore.The best investment option is obviously Bitcoin by having its own key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChicksX",
      "created_time": "October 18, 2023, 05:02:05 PM",
      "body": "Quote from: $crypto$ on October 18, 2023, 04:10:36 PMQuote from: Hypnosis00 on October 18, 2023, 01:38:16 PMI believe the message is very clear - Buy only Bitcoin. But, what are we gonna do with these altcoins like Ethereum and BNB? For newbies, this should be the best option but for us who have been in the crypto market for many years, I don't think we just ignore altcoins. Maybe I was wrong but can't just ignore the fact that some altcoins are more profitable than Bitcoin. For me, altcoins are still a good investment but that is right, we should be careful in choosing them. And it also depends on the time we bought them. Scams just happen to those who have no knowledge about crypto and those who are greedy. If we know how to secure our funds from the hands of these scammers, they will just fail. Let's just say the risk is greater in altcoins than bitcoin, altcoins still have owners while bitcoin does not - this is in my own view.You are not wrong that actually altcoins are also profitable, but you must know that it cannot be long-term but must be short-term that is my principle, even though we know altcoins have an increase if the altcoin season arrives, it's just that a big risk can still overshadow you from any loss of coin value that does not increase anymore.The best investment option is obviously Bitcoin by having its own key.The Bitcoin network is arguably more secure because of its high hashrate, but I wouldn't necessarily agree with what you say about owners. Most popular altcoins have known creators or development teams but that doesn't mean they have any direct control of said project as it stands now, Litecoin being a prime example of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 18, 2023, 05:49:39 PM",
      "body": "That makes sense and it's true story for the most. We've got friends that have been in that scenario that we told them to buy Bitcoin and they're completely good.Well, honestly for those that have never listened but yet still made profit or did it the right time to sell that's good if that's what happened to many of them.But the majority of them never took profit, bought not Bitcoin but instead meme coins and other altcoins that don't even have liquidity. They just don't want to listen but they want to have an idea and want to show that they're better from someone they've heard the idea of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 18, 2023, 06:22:17 PM",
      "body": "Quote from: Stepstowealth on October 18, 2023, 02:31:24 PMQuote from: alastantiger on October 15, 2023, 02:32:13 PMThis is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"Hearing and reading about scammers, some people can think of scammers to be far away. The scammer can be your friend or even family, The scammer can be your mentor or someone you look up to and have made the mistake of trusting them with your keys. The scammer is not only an anonymous individual from somewhere around the world, the scammer can be someone close. If you always remember this, you will know that the only person you can really trust to hold your keys is you. Well you are right but I must say, when it comes to your keys, trust is not an option. Funny that even yourself can't be trusted because you could misplace them that is why it's important to write your private keys and recovery phrases and store in a secure location to avoid a situation of misplacement. It's a true and powerful message but people will still fall victims to these scammers because they are blinded by promises of getting rich quickly. Some fall quickly after being presented with a fake investment profile. That is why before investing, it is important to make a proper research so that you don't lose your keys to these as scammers as they tend to seek your private info such as security codes. Some go as far as tricking their victims into sending crypto to compromised wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "October 18, 2023, 06:50:12 PM",
      "body": "There are few times when the shitcoin market went crazy and the best time in my opinion was in 2017 when every project went to the moon and people who invested pennies made life-changing returns but it was one hell of a time and I don't think that time period will repeat.And the typical middle-class mindset is also the reason why they want things to happen fast so they think that taking risks will pay back but what they don't know is they don't really understand the concept of taking risks with their investment choice and fall for scams and shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 19, 2023, 04:38:03 AM",
      "body": "Quote from: alastantiger on October 15, 2023, 02:32:13 PMThe message to newbies has always been the same since the beginning of time. From bitcoin creation to the very time altcoin started to pop up, till the era of NFTs, airdrops and other silly nonsense that shows up to deceive the naive ones. This is the simple message being reiterated -  \"Just buy bitcoin and hold your own keys or else you are going to get scammed\"PS- Image source is from a Telegram group. I don't claim ownership of it. This a simple but valid information not just for newbies but for everyone. Buying only Bitcoin and keeping it in a safe decentralised wallet is important. If you don't have your keys, then you can lose your funds anytime. People have failed to learn from the mistakes of others until they become victims.   Quote from: jrrsparkles on October 18, 2023, 06:50:12 PMThere are few times when the shitcoin market went crazy and the best time in my opinion was in 2017 when every project went to the moon and people who invested pennies made life-changing returns but it was one hell of a time and I don't think that time period will repeat.And the typical middle-class mindset is also the reason why they want things to happen fast so they think that taking risks will pay back but what they don't know is they don't really understand the concept of taking risks with their investment choice and fall for scams and shitcoins.I think this is the reason why many people still put their money in shitcoins. The altcoin sector has been advertised as a get-rich-quick scheme and people don't care about the risk because of greed. Newbies are always the victims of these shitcoin scams because they lack the necessary knowledge about how the industry works. But some well-informed people don't care about the risk because of the projected gains but the best option anytime any day is Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}