{
  "id": "topic_5468863",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "October 02, 2023, 08:31:55 AM",
  "content": "Baka may gusto sa inyo magkaapply sa kraken meron silang position available may IT position na available, sa mga batikan natin jaan at matagal na sa industry na IT pro pagkakataon na ninyo ito narito ang source ng balita:https://bitpinas.com/business/kraken-hiring-philippines/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468863",
  "comments": [
    {
      "author": "Mr. Magkaisa",
      "created_time": "October 02, 2023, 09:19:06 AM",
      "body": "Quote from: tech30338 on October 02, 2023, 08:31:55 AMBaka may gusto sa inyo magkaapply sa kraken meron silang position available may IT position na available, sa mga batikan natin jaan at matagal na sa industry na IT pro pagkakataon na ninyo ito narito ang source ng balita:https://bitpinas.com/business/kraken-hiring-philippines/    -   Sa tingin ko walang magkakainterest mag-apply dyan, basta andito sa pinas nakalocate yung opisina siguradong hindi maganda ang offer.saka wala din naman akong pakialam sa kraken dahil hindi ko naman din ginagamit yan at wala akong account dyan. Siguro sa ibang pinoy baka magka-interest sila dyan subukan nila. Ang dami ko kasing kakilalang IT sila mismo nagsabi na karamihan dito sa pinas hindi maganda ang offer ng sahod, though may iilan na meron maganda ang offer. At yung iba naman ginamit nalang yung kanilang skills dito sa cryptocurrency mas nakinabang pa sila kesa sa meron silang employer. Na kung saan para sa akin ay tama naman at may punto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 02, 2023, 11:43:58 PM",
      "body": "ok ding magtrabaho sa mga ganitong company na involved sa Cryptocurrency kasi ang Cryptocurrency lalo na ang mga exchanges ay isa sa mga nangngunang industry sa Cryptocurrency kung maganda ang offer at competitive ang sahod laban sa ibang industry at passion mo talaga ang Cryptocurrency magandang opportunity ito, pwede ka ring kumuha ng experience dito kasi iba pa rin kung isa sa mga nasa resume mo ay mag trabaho ka o nagtatratrabaho ka isa isang malaking Cryptocurrency exchange.Sana may mga kababayan tayong maka apply dito at ma i share nila ang experience nila na magtrabaho sa malalaking exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "October 03, 2023, 12:43:50 AM",
      "body": "Quote from: Mr. Magkaisa on October 02, 2023, 09:19:06 AMQuote from: tech30338 on October 02, 2023, 08:31:55 AMBaka may gusto sa inyo magkaapply sa kraken meron silang position available may IT position na available, sa mga batikan natin jaan at matagal na sa industry na IT pro pagkakataon na ninyo ito narito ang source ng balita:https://bitpinas.com/business/kraken-hiring-philippines/    -   Sa tingin ko walang magkakainterest mag-apply dyan, basta andito sa pinas nakalocate yung opisina siguradong hindi maganda ang offer.saka wala din naman akong pakialam sa kraken dahil hindi ko naman din ginagamit yan at wala akong account dyan. Siguro sa ibang pinoy baka magka-interest sila dyan subukan nila. Ang dami ko kasing kakilalang IT sila mismo nagsabi na karamihan dito sa pinas hindi maganda ang offer ng sahod, though may iilan na meron maganda ang offer. At yung iba naman ginamit nalang yung kanilang skills dito sa cryptocurrency mas nakinabang pa sila kesa sa meron silang employer. Na kung saan para sa akin ay tama naman at may punto. Iba po sinusunod ng mga foreign company holiday ng bansa nila, at the same time ang sahod is mas mataas kesa sa sahod natin dito na company own or hindi full foreign, bakit ko ito nasabi dahil ang mga friends ko na ang company ay nasa ibang bansa at may opisina dito ay iba ang rate, at the same time tingin ko hindi sila ganun kasi hindi rin naman sila maliit na company, malay natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "October 03, 2023, 01:40:23 AM",
      "body": "Karamihan dapat billingual. Mukhang ito na magiging new meta sa mga bagong skills ngayon mapa related man sa crypto o hindi na trabaho. Kasi karamihan sa mga nakikita kong job postings bukod dito ay dapat bukod sa English language, may ibang other native language kang fluency (hindi tagalog). Kaya magiging madali lang ito doon sa mga dalawa ang wika na alam at yung isa ay other language tulad sa Chinese, Japanese, etc. Magandang opportunity ito para sa mga naghahanap ng work na related sa crypto at kapag mahire ka diyan at magkaroon ka ng working experience, mas lalong dadami ang opportunities na puwedeng dumating sa iyo. At isa ka pa sa parang naunang employee na based sa bansa natin kasi parang bukod sa coins.ph at ibang local exchanges, parang first time ko makita na kraken ata nagkaroon ng hiring at based ang office sa makati.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}