{
  "id": "topic_5467412",
  "title": "bluebit25",
  "author": "bluebit25",
  "created_time": "September 20, 2023, 04:04:10 AM",
  "content": "Bitcoin blowup: Domestic dispute turns crypto catastrophe with six-hour standoff in central ThailandQuoteA heated dispute over Bitcoin investment loss led to a domestic violence incident that escalated into a six-hour standoff with the police. The 35 year old husband, Kritsada, shot his wife and barricaded himself in their home in Uthai district, Ayutthaya province, before eventually surrendering to the authorities.I just found a news story and tried to find more content related to this story, and this is all I know about this story. It makes me imagine stories that I have encountered before in the investment environment, where losses occur and make people lose their original reason for earning money, which is also to bring home and build a better family life. I don't want to discuss the reasons for investment failure here, but from the story associated with bitcoin, it will also continue to happen, but in a different form. Bitcoin is getting more and more popular, and it is labeled with many different stories. I can see many people blaming Bitcoin as the cause of all the problems, but clearly the main problem is people causing them related to Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467412",
  "comments": [
    {
      "author": "SeriouslyGiveaway",
      "created_time": "September 20, 2023, 04:14:03 AM",
      "body": "Don't say it is all because of Bitcoin. Bitcoin is only one of many investment assets that can be chosen by investors. There are more stories like this with stock, real estates, gold investors. There are more stories of family conflicts from traders on Forex with overkill leverages.By writing those stories, that can be true or fiction, people only want to attack Bitcoin. They make Bitcoin is like a very risky investment choice and can destroy family happiness. In fact, happy or not, it depends on how that family works and how family members interact with each other, take care of each other as well as how they reach to consensus for family investment.Whatever investment asset is, if a husband or a wife arbitrarily steal family money to invest, it will cause serious conflict.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 20, 2023, 04:54:51 AM",
      "body": "This is one of the problem that lack of knowledge on what you are investing on will cause you. He lost his funds either due to his wallet compromise or he sold off at the wrong time due to FOMO. Many bad scenarios are related to bitcoin, of which it wasn't bitcoin that caused it but their own carelessness and unsafe practice. I guess that he used the family funds to invest, instead of using only the amount that he can afford to lose, this is how people that uses money not meant to buy bitcoin for bitcoin purchase would end up in one regrets or the other. If you are a family man and don't have spare money to invest never use money made for the family responsibilities or family saving to buy bitcoin because it isn't only your funds. Bitcoin investment needs patience for it to yield profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "September 20, 2023, 05:05:01 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMBitcoin is getting more and more popular, and it is labeled with many different stories. I can see many people blaming Bitcoin as the cause of all the problems, but clearly the main problem is people causing them related to Bitcoin.I think bitcoin cannot be blamed because bitcoin is just an asset or currency. Everyone can use bitcoin, including using bitcoin for criminal and fraudulent purposesThere are many stories in bitcoin, some have big profits, some have big losses. The disadvantage of investing in Bitcoin, especially if we are still beginners, is our ignorance of Bitcoin and the risks it carries. Most people see bitcoin as a quick way to become a millionaire, without wanting to learn about bitcoin. So it's their own fault, not bitcoin'sApart from the issue of knowledge about bitcoin, sometimes there are types of fraud that use bitcoin, it is like a ponzi scheme. My friend once experienced a scam like this, he invested in crypto and deposited a certain amount of money with the promise of monthly profits, the first 3 months he got money but after that there were no more payments, he invested quite a lot until his personal life was disturbed and his relationship with his wife was problematic , but now it's back to normalSo there are a lot of stories about bitcoin, and what's yours?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "September 20, 2023, 05:07:27 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AM~~~The fact is that bitcoin trading, and any cryptocurrency, has a certain feature. It lies in the fact that if you trade uncontrollably, then this activity ceases to differ from roulette in which the chances are 50-50 or even less. And that's exactly what this story is about. The guy didn't know about money management, and I'm sure he could go to the casino with the same chances of profit. And judging by his reaction after losing all the money - he has neither self-control nor awareness in his actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 20, 2023, 05:17:31 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMBitcoin is getting more and more popular, and it is labeled with many different stories. I can see many people blaming Bitcoin as the cause of all the problems, but clearly the main problem is people causing them related to Bitcoin.Exactly, there are already lots of news about domestic disturbance very similar to this case here that have nothing to do with bitcoin. We are going to see a lot more due to the increased economic hardship around the world too. But when bitcoin is involved the propaganda machines start getting active and choose it to spread FUD trying to slow down the adoption which they are too afraid of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "September 20, 2023, 05:21:05 AM",
      "body": "An old man kill a cashier in order to steal the funds, should we blame fiat?A robbery shot 5 people in jewelry store to steal gold, should we blame gold?After all the medias always exaggerate their title to drag people to think if Bitcoin is bad, we all know centralized entity and government are don't like Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 20, 2023, 05:49:01 AM",
      "body": "I just read the article and what I get from there was that an insecure man shot his wife and later shot himself in he leg out of fear that his wife would die, I don’t see how bitcoin affected them. They are couples out there that have lost more than this specific couple did, and up till this day they are still living peacefully without any violence. Although, they didn’t realize the full details of what actually transpired and if they should do you’ll notice that the time when the money was lost through bitcoin has been a long time, prolly the lost just amplified the misunderstanding between them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 20, 2023, 06:35:34 AM",
      "body": "Quote from: Cantsay on September 20, 2023, 05:49:01 AM I don’t see how bitcoin affected them. Same here mate, I barley get the connection of this story with Bitcoin. if he incures a loss from his investment in. Bitcoin that would be as a result of his own inability to safe keep his funds or maybe he gambled them. From what I see here, the man is aggressive and irresponsible which led to separation from his wife. We here alot of such news everyday, concerning domestic violence, just because they mentioned Bitcoin these internet bloggers decided to use it as a head up story for their page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "September 20, 2023, 07:02:55 AM",
      "body": "Often criminal cases involving a Bitcoin investor/trader are linked to Bitcoin even though it has nothing to do with it at all. Traders/investors, whether in any instrument, should understand the risks of their investment/trading - and they should be fully aware that their money can be lost at any time and they should be mentally prepared for that.So it is very unwise to blame investment instruments, especially Bitcoin, for causing someone stress or committing criminal acts because it is purely a personal action, and does not need to be linked to things that are actually unrelated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "September 20, 2023, 07:09:31 AM",
      "body": "Quote from: Hatchy on September 20, 2023, 06:35:34 AMQuote from: Cantsay on September 20, 2023, 05:49:01 AM I don’t see how bitcoin affected them. Same here mate, I barley get the connection of this story with Bitcoin. if he incures a loss from his investment in. Bitcoin that would be as a result of his own inability to safe keep his funds or maybe he gambled them. From what I see here, the man is aggressive and irresponsible which led to separation from his wife. We here alot of such news everyday, concerning domestic violence, just because they mentioned Bitcoin these internet bloggers decided to use it as a head up story for their page. It is really just that simply showing about bitcoin investment which would really be similarly could happen even on a typical or traditional investment on which it is really not that a good thing about blaming Bitcoin for this incident.It is really just that because of that rage because of losing investment via Bitcoin and this would really be basing up with their decisions which we know that losing money is never been a good thing but its impossible that you arent that aware or wary about the risks involved on the time that you do step your foot into this market on which losing could really be possible.Sad thing on here is that this do really ends up on separation and hurting his wife or tended to even kill which you you know that if you cant really be able to control your rage then it would really be definitely be ending up for you to do such things which you didnt expect that it would happen.Regret do always happen in the end and not in the beginning. This is why having that self control and temper is really that crucial specially with this investment where market is really thatunpredictable and anything could really happen in a snap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "September 20, 2023, 08:04:44 AM",
      "body": "Someone created a similar topic and I was the first to reply, although the person failed to drop a link to the real news which makes me think it's probably fake, so thanks for clearing the doubt, my replies was even off from what I just read in this link of yours now. It seems the man fell into scam somehow, I thought they had the fight because they both invested into Bitcoin using one single wallet and someone between the two went behind the back to spend some Bitcoin, but now thats not the case. Women will always be women, once a man lost everything they file for divorce, imagine if this man made more money, would she still file for divorce? This is one good way to know if someone really loves you or not. I like telling men to pretend losing it all and see what their women will do, the world is fill with lies and fake love today, if I am this man I will summon the courage and accept the fact that the wife is not worth to be my woman in the first place. This has nothing to do with Bitcoin, scammers hunts for bank accounts and empty the account, the same with crypto wallets too, anyone can become a victim to scammers at any time, with Bitcoin or no Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G_Besar",
      "created_time": "September 20, 2023, 08:33:21 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMI just found a news story and tried to find more content related to this story, and this is all I know about this story. It makes me imagine stories that I have encountered before in the investment environment, where losses occur and make people lose their original reason for earning money, which is also to bring home and build a better family life. I don't want to discuss the reasons for investment failure here, but from the story associated with bitcoin, it will also continue to happen, but in a different form. Stories like this are actually very easy to find in a household environment, because they can immediately go viral when the investment or money invested is in Bitcoin. However, in my area I rarely find this kind of thing because perhaps not many people here experience losses through Bitcoin and even if there is a loss, it doesn't really matter. So no one blames Bitcoin or anything related to cryptocurrency, be it investment or trading.QuoteBitcoin is getting more and more popular, and it is labeled with many different stories. I can see many people blaming Bitcoin as the cause of all the problems, but clearly the main problem is people causing them related to Bitcoin.People who blame Bitcoin when they experience losses are people who don't understand Bitcoin, because basically every mistake lies with themselves who may still not be able to manage their assets well or still don't understand when trading in the market and don't know the concept. investment in the long term. So it is very illogical if someone who experiences a loss blames Bitcoin because he himself believed in Bitcoin before he experienced a loss through the market or investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 20, 2023, 08:42:48 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMBitcoin blowup: Domestic dispute turns crypto catastrophe with six-hour standoff in central ThailandQuoteA heated dispute over Bitcoin investment loss led to a domestic violence incident that escalated into a six-hour standoff with the police. The 35 year old husband, Kritsada, shot his wife and barricaded himself in their home in Uthai district, Ayutthaya province, before eventually surrendering to the authorities.I just found a news story and tried to find more content related to this story, and this is all I know about this story. It makes me imagine stories that I have encountered before in the investment environment, where losses occur and make people lose their original reason for earning money, which is also to bring home and build a better family life. I don't want to discuss the reasons for investment failure here, but from the story associated with bitcoin, it will also continue to happen, but in a different form. Bitcoin is getting more and more popular, and it is labeled with many different stories. I can see many people blaming Bitcoin as the cause of all the problems, but clearly the main problem is people causing them related to Bitcoin.Seing bitcoin running bearish and then the investors are loosing is not a reason enough to engage in misunderstanding that would have led to domestic violence, bitcoin is not altcoin for crying out loud, when it falls it rises again, all that would have been done during the dump market season is to hold more for it to pass, if the two partners understand well what a volatile cryptocurrency is like bitcoin, maybe they could communicated it between themselves and just hold instead of resulting to fight.Domestic violence is not acceptable at any level and people should know that when there's no effective communication and information there will be misconception and having issues may become inevitable for the parties involved, or maybe there's more other things unclear to us that have aggravated the anger that led to the conflict between the two partners,  believe they would have been wrongly informed about bitcoin, if they had an adequate knowledge in bitcoin this may not have happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "September 20, 2023, 10:10:14 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMBitcoin blowup: Domestic dispute turns crypto catastrophe with six-hour standoff in central ThailandQuoteA heated dispute over Bitcoin investment loss led to a domestic violence incident that escalated into a six-hour standoff with the police. The 35 year old husband, Kritsada, shot his wife and barricaded himself in their home in Uthai district, Ayutthaya province, before eventually surrendering to the authorities.it is not about bitcoin actually , but it is about the attitude of the person involve , how he put himself into investing that he might lose and cannot accept that fact.even if this happened in stocks or real estate he will still have this act because he cannot handle the volatility of the investment world.I think he is not there to invest instead he wanted to become super rich in easy way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 20, 2023, 10:33:20 AM",
      "body": "They invested more than they can afford to lose, i believe if they had invested an amount they wouldn't mind losing, all of this would not have escalated this way, people have to learn that BTC was not created by Satoshi to make the wealthy, but as a p2p electronic cash. The husband shot his wife because he could not handle his stress and anxiety, many people lose all of their investments daily, but many of them don't turn dangerous and a threat, BTC was just the investment in this situation, it could have easily been another risky one too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "September 20, 2023, 10:43:11 AM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMBitcoin blowup: Domestic dispute turns crypto catastrophe with six-hour standoff in central Thailandthis is a bad sign of how the married being broken because of wrong understanding in cryptocurrency and now Bitcoin once again is beingblamed for this incident .but it is obvious that the wife is against the investment and only th husband pushes this in the reason of the argument.The cause of the incident was Kritsada’s loss of 700,000 baht in Bitcoin investments, which led to disagreements with his wife. The wife asked for a separation, which stressed Kritsada. He regularly visited his wife’s house out of fear that she might cheat on him. On the day of the incident, he entered his wife’s house hoping to reconcile but was met with resistance, leading to the aforementioned incident.https://thethaiger.com/hot-news/crime/bitcoin-investment-loss-sparks-domestic-violence-and-six-hour-police-standoff-in-ayutthayathis is according to the articles that I assumed the reason of the wanted of divorce from the wife's side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 20, 2023, 10:53:20 AM",
      "body": "As far as I know, \"money\" or more generic \"money problems\" are amongst the main causes of divorce. If it wouldn't have been Bitcoin, it would have been something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "September 20, 2023, 11:09:19 AM",
      "body": "Bitcoin has no issue with this. The husband has really a problem with his mind or emotional wellbeing as he does it because no matter how big your loss you don't blame someone unless you have something in your mind that you can do but mostly what I've noticed is that they commit suicide.That's huge money that got lost for sure. I wouldn't say that it's bitcoin as it has financial aspects it's not solely about bitcoin as we talk about the money associated with it they just use it as a means of investment. The possibility would be their life savings that they can go to the street or make them broke all their lives which that husband led to having that scenario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "September 20, 2023, 12:23:36 PM",
      "body": "Quote from: bluebit25 on September 20, 2023, 04:04:10 AMBitcoin blowup: Domestic dispute turns crypto catastrophe with six-hour standoff in central ThailandQuoteA heated dispute over Bitcoin investment loss led to a domestic violence incident that escalated into a six-hour standoff with the police. The 35 year old husband, Kritsada, shot his wife and barricaded himself in their home in Uthai district, Ayutthaya province, before eventually surrendering to the authorities.I just found a news story and tried to find more content related to this story, and this is all I know about this story. It makes me imagine stories that I have encountered before in the investment environment, where losses occur and make people lose their original reason for earning money, which is also to bring home and build a better family life. I don't want to discuss the reasons for investment failure here, but from the story associated with bitcoin, it will also continue to happen, but in a different form. Bitcoin is getting more and more popular, and it is labeled with many different stories. I can see many people blaming Bitcoin as the cause of all the problems, but clearly the main problem is people causing them related to Bitcoin.Most people have emotional issues like him. They invested all of their money and expected that it would give them a higher return but as we all know the crypto world is highly volatile and suddenly if the market goes dump they face a huge loss which they can't afford and lose control over his mind and body same case occurs with the person which is mentioned in the article. He loses all his investment and he is left with nothing in a situation of fear and anger he attempts to murder. As experienced people say invest those which you can afford to lose. So in this, there is no bad role of Bitcoin nor his wife but the only thing is that he lost his control and trading want patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}