{
  "id": "topic_5467277",
  "title": "GrLinkey",
  "author": "GrLinkey",
  "created_time": "September 19, 2023, 05:22:54 AM",
  "content": "I think that in the United States there is some kind of conspiracy between leftists and rightists. Left-wingers promote things like transgender laws because it benefits rightists (makes Americans vote for rightists), and right-wingers promote other things like banning abortion because it benefits leftists (makes Americans vote for leftists). Another example is the prohibition of abortions in Poland. Polls were conducted around the country regarding this decision, different polls contradicted each other; at the same time, polls showed that 75% of Poles want a referendum on this issue. I am sure that in this referendum the ban on abortion would be rejected, as in some US states.Another example is the closure of nuclear power plants in Germany. I believe that if a referendum had been held, the Germans would not have supported the closure of the stations. Switzerland has held several referendums on nuclear power plants; two referendums in 1984 and 1990 supported restrictions on the construction of new stations, but all referendums rejected stations phase-out, and the results of these referendums were contrary to the polls.Now Western sanctions against Russia are an example of hypocrisy. These sanctions mainly hit Russians with anti-Putin views who travel to the West; at the same time, Putin continues to sell oil as before. The scheme is as follows: until 2022, Russia sold oil to Europe, and Saudi Arabia to China, and now it’s the vice versa. I also heard that Germany is buying Russian oil through India.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467277",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "September 19, 2023, 10:39:17 AM",
      "body": "Oppression does exist in Western countries although it may take different forms compared to other regions. Western societies usually uphold democratic values, individual freedoms & equality, there are still instances of systemic discrimination, prejudice & marginalisation. These issues can be based on factors such as race, ethnicity, gender, sexuality, socioeconomic status or even religion. It is important to acknowledge & address these challenges in order to strive for a more inclusive & equitable society for all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "September 21, 2023, 12:45:49 PM",
      "body": "The West's divide and conquer or divide and rule policy is almost coming to an end with the formation of the BRICS which is gradually coming to disrupt the western power (USA and it's bloc) against the entire world. I know this will not continue forever. It will definitely come to a stop as there are other countries with growing economy that are getting into the limelight and are gaining control over their own economy. Such countries will emanate to become the next bloc of power like the BRICS (Brazil, Russia, India and South Africa).We cannot operate a One World Order where the USA will gain and maintain it's power over others divisibly. Interesting days are ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 21, 2023, 01:00:47 PM",
      "body": "Quote from: iBaba on September 21, 2023, 12:45:49 PMThe West's divide and conquer or divide and rule policy is almost coming to an end with the formation of the BRICS which is gradually coming to disrupt the western power (USA and it's bloc) against the entire world. I know this will not continue forever. It will definitely come to a stop as there are other countries with growing economy that are getting into the limelight and are gaining control over their own economy. Such countries will emanate to become the next bloc of power like the BRICS (Brazil, Russia, India and South Africa).We cannot operate a One World Order where the USA will gain and maintain it's power over others divisibly. Interesting days are ahead.This is apt. The reason for this oppression is economy and financing. I remember US will withdraw some aids from certain countries especially those of the technologically less developed if they don't support certain foreign policy like the gay rights. The domination is also felt in the nuclear power plants because that area is also very powerful for countries that want to show military strength and this is why they go after them but that subjugation is coming to an end like you said with BRICS increasing in number and with very strong countries in economic strength, military strength and population.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pingrapole",
      "created_time": "September 21, 2023, 02:53:04 PM",
      "body": "Your example is a reflection of the fact that the right and the left in America use a strategy of helping each other and convincing people that they are against each other but in principle they are the same.Referendums for shutting down nuclear power plants are intended to stop the general process.If you see only one hypocrisy, you will see more hypocrisy in the future.Not only Germany but many other countries Russian oil by third party is buying because it is difficult to solve the energy problem in the region without Russia's oil.When a country sees economic danger ahead, it adopts many policies, one of which is the oppression of the countries of the western world.BRICS is creating the current problem because the economic alliance is so strong that it will bring the hegemony of the West to the ground once and for all.No indigenous power hegemony and tyranny is permanent so new powers will arise and people will be oppressed in place of the old power because they cannot accept the pain of their old lost power, so they are different To Try to represent their state of mind step by step with your examples.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "September 22, 2023, 09:16:37 AM",
      "body": "Quote from: iBaba on September 21, 2023, 12:45:49 PMThe West's divide and conquer or divide and rule policy is almost coming to an end with the formation of the BRICS which is gradually coming to disrupt the western power (USA and it's bloc) against the entire world. I know this will not continue forever. For me, the end of the western domination will be a horrible event, because most countries in the planet are even more autocratic. I didn't say I am an enemy of the West; for me, the western democracy, even in current form, makes it an island of good among the land of evil.At the same time, I hope that such countries as India, Brazil, SA will become more democratic in future, so I am not sure that BRICS will become an enemy of the West.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hg_away",
      "created_time": "September 22, 2023, 11:36:05 AM",
      "body": "I cannot call this hypocrisy as much as it is the politics of the possible. Countries want to play on contradictions for the well-being of the people, either by saying one thing and doing the opposite or by trying to collect money in several ways. Almost most of the countries of the world committed massacres or heinous wars, but in the end there was prosperity for their people compared to the rest of the countries of the world. Therefore, as long as There are conflicting interests in which this policy will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "September 23, 2023, 03:48:58 PM",
      "body": "Quote from: GrLinkey on September 19, 2023, 05:22:54 AMI think that in the United States there is some kind of conspiracy between leftists and rightists. Left-wingers promote things like transgender laws because it benefits rightists (makes Americans vote for rightists), and right-wingers promote other things like banning abortion because it benefits leftists (makes Americans vote for leftists).It's not a conspiracy. The left wing radicals have disdain for everyone that isn't as radical as they are. A worldwide phenomenon indeed -- leftists in Europe are a bit more mild although in some countries like France, you have a strong coalition of radical and violent left wingers.Right wing nationalist groups hate their opposition, but they're so fringe and isolated it's hardly worth discussing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}