{
  "id": "topic_5455796",
  "title": "Billyscottland",
  "author": "Billyscottland",
  "created_time": "June 08, 2023, 08:53:41 PMLast edit: October 10, 2023, 10:32:44 PM by Billyscottland",
  "content": "Good afternoon, forum members. Now I'm working on my own token, presale, earlier in 2022 I've launched several projects, after the events of TerraLuna, FTX the launch of new tokens became irrelevant, now in the season of altcoins and memcoin boom the launch of new tokens is relevant again)).Test launched a week ago to test, everything still works. Looking for an investor partner to launch. The amount of investment needed is $7500. Implementation period of 1 week. Payback x3-x5 of the investment. All the technical part I undertake, for the project found ambassadors, bloggers to promote, marketing channels, site placement are all found. I know how everything is arranged) as a guarantee for the investor before the sale will give a pledge in tokens in advance. The project is not a scam, hanypot, etc.  There will be a full audit, verification of the project, prepared documentation.If interested, send a message in pm or in Telegram.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455796",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "June 08, 2023, 09:24:21 PM",
      "body": "Quote from: Billyscottland on June 08, 2023, 08:53:41 PM~earlier in 2022 I've launched several projectsJust out of curiosity, what happened to those projects?Quote from: Billyscottland on June 08, 2023, 08:53:41 PMnow in the season of altcoins and memcoin boom the launch of new tokens is relevant again)).Actually, it is not!Quote from: Billyscottland on June 08, 2023, 08:53:41 PMThe amount of investment needed is $7500. Implementation period of 1 week. Payback x3-x5 of the investment. Go to the nearest bank and get a loan.Quote from: Billyscottland on June 08, 2023, 08:53:41 PMThe project is not a scam, hanypot, etc. HAHAHAHAHA! Seems like you got a good sense of humor there!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Billyscottland",
      "created_time": "June 08, 2023, 10:28:26 PM",
      "body": "Quote from: Stalker22 on June 08, 2023, 09:24:21 PMQuote from: Billyscottland on June 08, 2023, 08:53:41 PM~earlier in 2022 I've launched several projectsJust out of curiosity, what happened to those projects?Quote from: Billyscottland on June 08, 2023, 08:53:41 PMnow in the season of altcoins and memcoin boom the launch of new tokens is relevant again)).Actually, it is not!Quote from: Billyscottland on June 08, 2023, 08:53:41 PMThe amount of investment needed is $7500. Implementation period of 1 week. Payback x3-x5 of the investment. Go to the nearest bank and get a loan.Quote from: Billyscottland on June 08, 2023, 08:53:41 PMThe project is not a scam, hanypot, etc. HAHAHAHAHA! Seems like you got a good sense of humor there!Let me start in order))In my previous projects I was a hired employee, they were not completely mine, I was engaged in programming, launching sales. When I understood a little bit about how promotion works, I started marketing.These projects are still working today, only I am not involved in them anymore.How not? Do you follow the market at all?)The amount of 7,500 is not the entire budget that is required to launch. The total amount of 37,500 of which 30,000 I invest from my own funds, and some I have taken on credit. That's why I can't take the 7,500 I'm missing on credit.Thanks for the sense of humor))) but as you saw I wrote that the project will hold a presale, presale will be at the launch sites, that is not the way that everyone goes and offer to buy))) will be open presale, to realize it must pass the contract audit, not one auditor will not miss scam)) verification, get a sign of security from outside developers launch site.Dear friend you can go to my threads, I answered many questions in detail in another thread about investor guarantees, about my plans, how the procedure will go. Thanks for the question, have a nice day))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 09, 2023, 04:54:57 PM",
      "body": "Quote from: Billyscottland on June 08, 2023, 10:28:26 PMLet me start in order))In my previous projects I was a hired employee, they were not completely mine, I was engaged in programming, launching sales. When I understood a little bit about how promotion works, I started marketing.These projects are still working today, only I am not involved in them anymore. Op that means you would have provided the launched projects of yours. Just the links of the projects would have been okay for us to see how good they are. And one thing again. There is no need for the announcement new legit project. If you really want to launch a Token Project, you would created a separate website to test the project and launch it but for coming to bitcoin website to announce a project that has not even completed is not too good. You would have laughed it first then come here to make some advertisement for people to visit the project. Well I wish you all the best and also congratulations for the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Billyscottland",
      "created_time": "June 09, 2023, 06:59:17 PM",
      "body": "Quote from: Agbe on June 09, 2023, 04:54:57 PMQuote from: Billyscottland on June 08, 2023, 10:28:26 PMLet me start in order))In my previous projects I was a hired employee, they were not completely mine, I was engaged in programming, launching sales. When I understood a little bit about how promotion works, I started marketing.These projects are still working today, only I am not involved in them anymore. Op that means you would have provided the launched projects of yours. Just the links of the projects would have been okay for us to see how good they are. And one thing again. There is no need for the announcement new legit project. If you really want to launch a Token Project, you would created a separate website to test the project and launch it but for coming to bitcoin website to announce a project that has not even completed is not too good. You would have laughed it first then come here to make some advertisement for people to visit the project. Well I wish you all the best and also congratulations for the project. In past projects I was a guest collaborator, so I'm not at liberty to talk about these projects directly, it was my contractual obligation. I can say that these were cryptotokens related to memes, ecology, artificial intelligence. I also took part in the development of a crypto game distributed in Brazil and also there was a web3 project for a cell phone application.Who told you that my project is not ready? I never said so. It's not my plan to tell all the details in public, but I can tell you that the product is ready. All the details I will give a partner.About the advertising here is very unprofessional, you need to promote it to a wider audience, I'm not interested in advertising on the forum, this is very foolish of me as a developer. I attracted bloggers, cryptocommunities in twitter and marketing platform specializing in the promotion of crypto projects, administrators of telegraph channels (the total sum of 5,000,000 subscriptions) that's what I call a wide audience, and this is just marketing for the launch))) So your assumption about advertising on the forum is very funny)))) You are very deluded to think so dismissive to my professionalism in crypto, go to my other theme on the forum where I answer all questions and prove my competence)Thanks for the congratulations. All the best to you too my friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "June 09, 2023, 08:00:09 PM",
      "body": "Quote from: Billyscottland on June 09, 2023, 06:59:17 PMIn past projects I was a guest collaborator, so I'm not at liberty to talk about these projects directly, it was my contractual obligation. I can say that these were cryptotokens related to memes, ecology, artificial intelligence. I also took part in the development of a crypto game distributed in Brazil and also there was a web3 project for a cell phone application.Oh, I see. Guest collaborator on multiple projects? Conveniently bound by contractual obligations that prevent you from providing any specific details. Well, I hope you understand why people find it hard to fully trust your claims. It is not personal, just a common reaction when transparency and tangible proof are missing. So, it would have been nice to see some concrete evidence or examples of your contributions if you want to build trust and convince others of your abilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Billyscottland",
      "created_time": "June 09, 2023, 08:33:19 PM",
      "body": "Quote from: Stalker22 on June 09, 2023, 08:00:09 PMQuote from: Billyscottland on June 09, 2023, 06:59:17 PMIn past projects I was a guest collaborator, so I'm not at liberty to talk about these projects directly, it was my contractual obligation. I can say that these were cryptotokens related to memes, ecology, artificial intelligence. I also took part in the development of a crypto game distributed in Brazil and also there was a web3 project for a cell phone application.Oh, I see. Guest collaborator on multiple projects? Conveniently bound by contractual obligations that prevent you from providing any specific details. Well, I hope you understand why people find it hard to fully trust your claims. It is not personal, just a common reaction when transparency and tangible proof are missing. So, it would have been nice to see some concrete evidence or examples of your contributions if you want to build trust and convince others of your abilities.Buddy stop flubbing in my threads, it makes no sense that you're all trying to expose my unprofessionalism)))Write to me personally if you're interested, let's talk about everything, I'll show and tell you everything with pleasure. All told in person, not here in public. Prove their abilities, that I can do, that did, win your confidence in one word)))You've read my previous posts about the background, I clearly said that the partner will give everything personally, you do not understand? If you do not understand at once, I pity you.P.S: looking through your previous posts on the forum, I see only the flood of hundreds of messages that do not bear any knowledge, get a feeling from your questions and answers on the forum, that you do not really understand crypto and the market. You know nothing but empty chatter, that's ok. Write to me and I will tell you a little bit more about crypto and about myself to make you at least a little bit more informed)) I'm waiting for your message, my dear friend. I'll call you a Fluder because looking at your communication on the forum it's obvious that your knowledge is not enough, I look at the profiles of those who I reply in the theme, look at my second theme, where you also wrote, there I reply to two users with high reputation, now they understand crypto, it can be seen by their questions and answers that they give at the forum, here you can compare them with your answers, and you'll see the difference. I'm not taking words out of thin air, just facts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "June 09, 2023, 09:41:22 PM",
      "body": "Quote from: Billyscottland on June 09, 2023, 08:33:19 PMI'm not taking words out of thin air, just factsAnd yet, you presented no factual information yourself. It seems that all we have here is \"empty chatter\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "June 18, 2023, 10:45:26 PM",
      "body": "In another post of yours that you created, I saw that you said that you had already found a partner, congratulations. but I don't understand why you didn't mention what the purpose of your project is: if it's some new exchange, or AI company, or meme currency about something related to religion, psychology, animals, anyway, there's a lot. I believe that mentioning the objective of your project would not be a problem, at least in my opinion I do not see how this would be a problem. but you are the one who decides because the project is yours and you have the right to do what you want, I also read in one of your posts where you said that you don't count much with this forum on the issue of marketingsince you said that you already worked on other projects so you better than anyone understand everything how it works and if you say you don't need the forum then and maybe you should be right. but it's strange that even so you came here and created many threads looking for a partner, anyway in this section you can create your Ann thread of your project when it's time for you to present it to the public, anyway good luck with your project",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}