{
  "id": "topic_5463207",
  "title": "yhiaali3",
  "author": "yhiaali3",
  "created_time": "August 14, 2023, 09:35:37 AM",
  "content": "السلام عليكم إخوانيقبل فترة حدثت معي مشكلة وكنت سأكتب عنها لكن لم يسفني الوقت حتى الآنالمشكلة بدأت بتاريخ 3 آب عندما قمت بإرسال جزء من رصيدي في المحفظة إلى المنصة، في العادة أقوم بتفقد رصيدي عن طريق مستكشف الكتل حتى لا أدخل للمحفظة في كل مرة وهنا كانت المفاجئة ، لقد ظهر رصيدي 0 في المستكشف مع أنني كنت أملك حوالي  0.007BTC في المحفظة. ظننت في البداية أن المحفظة قد تم تهكيرها وقمت بفتح المحفظة بسرعة لكنني وجدت الرصيد كما هو والحمد لله. قمت يتحديث المتصفح عدة مرات ولكن لم يتغير شيء وبقي الرصيد 0 بينما الرصيد الحقيقي موجود في المحفظة. المهم تكررت هذه العملية معي البارحة أيضا عندما قمت بإرسال بعض البيتكوين للمنصة ، حيث ظهر الرصيد في المستكشف 0 بينما هناك رصيد حقيقي في المنصة ، واليوم بعد أن استلمت أجري من الحملة يظهر الرصيد 0.0034BTC (أجري في الحملة) في المستكشف بينما رصيدي الحقيقي في المحفظة هو 0.0092BTC كما سيتضح معكم من الصور التي سأضعها. الصورة الأولى من المحفظة ويظهر فيها رصيدي الحقيقي وعملية السحب التي قمت بها وهي 0.0035BTC بتاريخ 13/8 وعملية السحب الأولى وهي 0.002BTC بتاريخ 3/8 :                                   وهنا صورة من المستكشف تظهر رصيدي بتاريخ اليوم وهو 0.0034BTC بينما في المحفظة رصيدي الحقيقي 0.0092BTC كما ذكرت:                                   وهذه الصورة من المستكشف تظهر عمليات سحب بأرقام خاطئة الأولى حيث تظهر أنه تم سحب 0.0065BTC لمستقبلين بينما الحقيقة أنني سحبت 0.0035BTC لمستقبل واحد، والثانية تظهر عملية سحب بقيمة 0.00775BTC لمستقبلين أيضا بينما في الحقيقة أنا أرسلت 0.002BTC لمستقبل واحد (وهذا واضح من خلال صورة المحفظة):                                 آسف على الإطالة لكني في الحقيقة هذه المشكلة حيرتني ولم أعرف السبب، لماذا هذا الخطأ والتعارض في البيانات بين المستكشف والمحفظة؟ هل ممكن أن يكون هناك مشكلة في المحفظة؟ هذا رابط المستكشف الخاص بمحفظتي لمن يرغب بإلقاء نظرة: https://blockchair.com/bitcoin/address/bc1qcgz7decp44zu8d26gjceuef0myz6j3ccljp5dm",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463207",
  "comments": [
    {
      "author": "Ulven",
      "created_time": "August 14, 2023, 12:57:24 PM",
      "body": "و عليكم السلام في الواقع أخي يحيى المعلومات التي قدمتها كلها صحيحة أعتقد أنك لم تفهم طريقة إشتغال البلوكتشين. عند الإرسال رصيد إلى عنوان ما فالمعاملة تتم  بتحويل  كل الرصيد إلى عنوانين الأول إلى المستلم و الثاني إلى عنوان جديد لمحفظتك.مثلا معرف المعاملة هذا:7c3fa06853f5da9c3a3040c406b9fa1db6f9e44dba49d95b25e2630fdb044f5eقمت بإرسال 0.002 إلى عنوان: 1KMQ52hpR3Mha7RPKjcTLuffgwoF8XXBWwو تم تحويل باقي الرصيد 0.00571800 إلى عنوان جديد لمحفظتك:bc1qpzgrxqy5wtgtt8yu5nf6wuz8rcqkg75fnxdh9jلذلك عند تفقد عنوانك على المستكشف تجد أن الرصيد هو 0 لأن أثناء إجرائك للمعاملة يتم إرسال كل الرصيد بحيث المستلم يستلم المبلغ الذي حددته و باقي المبلغ يتم تحويله إلى عنوان جديد لمحفظتك. أتمنى أن لا أكون مخطئاً هههههه",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 14, 2023, 03:26:54 PMLast edit: August 14, 2023, 07:57:38 PM by yhiaali3",
      "body": "Quote from: Ulven on August 14, 2023, 12:57:24 PMلذلك عند تفقد عنوانك على المستكشف تجد أن الرصيد هو 0 لأن أثناء إجرائك للمعاملة يتم إرسال كل الرصيد بحيث المستلم يستلم المبلغ الذي حددته و باقي المبلغ يتم تحويله إلى عنوان جديد لمحفظتك. أتمنى أن لا أكون مخطئاً ههههههشكرا أخي ألفين، في الواقع هذا الاحتمال الأول الذي خطر ببالي لكنني استبعدته لأنني قلت من غير المنطقي أن يظهر الرصيد 0 في المحفظة بينما يوجد رصيد في الواقع .ربما لأنني متعود أن أبعث كامل الرصيد في كل مرة لم أنتبه إلى هذه النقطة من قبل، في العادة أرسل كامل الرصيد ولا أبقي شيء في المحفظة أما منذ فترة قررت أن أترك جزء في المحفظة. لذلك تفاجأت عندما شاهدت الرصيد صفر. لكن سؤالي في الدرجة الأولى لماذا لا يكون هناك تطابق بالبيانات بين المحفظة والمتصفح؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "August 15, 2023, 10:55:58 PM",
      "body": "Quote from: yhiaali3 on August 14, 2023, 03:26:54 PMلكن سؤالي في الدرجة الأولى لماذا لا يكون هناك تطابق بالبيانات بين المحفظة والمتصفح؟لايوجد اي نوع من \"عدم التطابق\" اخي يحى كما نوه الاخ اوفين في الاعلى, الموضوع يحتاج.يجب ان نفرق بين الاتي:UTXOADDRESSWALLETولنبدا بالترتيب1- UTXO او Unspent transaction output :في البتكوين لايوجد شي اسمه تحويل رصيد من حساب لحساب, مايحدث هوا نقل ملكية جزء معين من عنوان لاخر, لايوجد شي اسمها \"رصيد\" محفظة على البلوكتشين كل مايوجد هوا UTXO ومن يمتلكها, يمكن لنفس العنوان ان يمتلك اكتر من واحدة, مثلا يمكن امتلاك 10 اجزاء من 0.1 باجمالي 1 بتكوين, هنا يمكن ان نقول ان العنوان يمتلك 1 بتكوين بينما في الواقع هوا لا يمتلك ذلك بل يمتلك عشرة 0.1, يمكن دمجها في جزء واحد في حال قام بارسال ال 10 Inputs في Output واحدة حيت سيكون له UTXO واحدة بقيمة 1 بتكوين.العنوان: كما تم شرحه في النقطة السابقة, العنوان لايوجد فيه شي, هوا فقط مجرد رقم, ولكن عند البحث عنه في البلوكتشين فانت في الواقع تبحت على UTXO اللملوكة لذلك العنوان, ويقوم المتصفح بجمع تلك القيمة ويقول لك ان هدا العنوان لديه 1 واحد بتكوين بدلا ان من ان يقول ان لديه 10*0.1.المحفظة: المحفظة يمكن ان تحتوي على الاف العنواين, وكل عنوان يمكن ان يمتلك الاف ال UTXOs فالناتج الاجمالي الذي تراه في المحفظة هوا اجمالي ال UTXOs الواقعة تحت سيطرة العنواين التي تمتلكها, يمكنك الاطلاع على ال addresses من محفظة الكتروم وسوف تتفاجيء انك تملك العديد من العنواين وليس عنوان واحد.الان لناخد تحويل ال 0.0065BTC الذي قلت فيه انك قمت بتحويل 0.0035BTC فقط.https://www.blockchain.com/explorer/transactions/btc/bc43cf5014707cca4fe55f4bf459d45be7a0ac567c4df4c6e2229294bdf71237لاحظ هنا ان هدا التحويل يوجد به 2 inputs and 2 outputs.رصيد عنوانك bc1qcgz7decp44zu8d26gjceuef0myz6j3ccljp5dm في ذلك الوقت كان 0.0065 ولكن تذكر ماقلت في الاعلى, الرصيد لايعني شي, فعنوانك كان يمتلك 2 UTXO واحدة بقيمة 0.0035 تحصلت عليها من هدا العنوان bc1qvzqk9g7fwp3vfeztfy70677y9j5l3yq3e9ex4t والاخرى بقيمة 0.003000 تحصلت عليها من هدا العنوان  3KwPvRduFCweK27XMuos3JHZFkTs8yz1SMيعني انك لم تستقبل ال 0.0065 في مرة واحدة.حسنا : في ذلك الوقت ان اخبرت المحفظة انك تريد تحويل 0.0035 ماتفعله المحفظة هوا اولا محاول ايجاد UTXO بقيمة اكبر من هدا الرقم في حال وجودها سوف تستخدمها هي فقط, في حال عدم وجوده سوف تقوم باستخدام اكتر من UTXO ونظرا لانك لم تقم بحساب رسوم التحويل فان 0.0035 غير كافية لارسال 0.0035 , فلو كنت ارسلت 0.0035 - التكاليف, لكان هناك فقط مرسل واحد ومستقبل واحد ولكن هدا لم يكن, فالمحفظة هنا استعانت ب UTXO اخرى بقيمة 0.003000 وهنا مايفسر وجود 2 inputs ستجدها مصنفة على FROM في الرابط الذي وضعته في الاعلى.حسننا الان ماذا حدث ؟ نظرا لانه لايمكن ان ترسل جزء من UTXO وتبقي الباقي يعني ان المحفظة عليها ارسال 0.0035 + 0.003000 = 0.0065 ولك لان هدا الرقم اكبر من الذي تريد ارساله فقامت بارسال 0.0035 كاملة للعنوان الذي ادخلته حضرتك وهوا 1KMQ52hpR3Mha7RPKjcTLuffgwoF8XXBWw (يبدو كعنوان منصة لانه Lagecy) وقامت بارسال الباقي الى عنوان اخر تمتلكه المحفظة الخاصة بك وهوا bc1qu393pmyeztsret887mvxp3nx836gnaas9m3y58.ان قمت بايعاد السناريو وارسلت 0.0035 - التكاليف كان سوف يكون تحويل واحد بقيمة 0.0035 لعنوان واحدلو قمت بارسال 0.0065 - التكاليف كان سوف يكون هنا تحويل 1 من 2 Inputs لعنوان واحد.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 16, 2023, 05:57:07 AM",
      "body": "Quote from: mikeywith on August 15, 2023, 10:55:58 PMQuote from: yhiaali3 on August 14, 2023, 03:26:54 PMلكن سؤالي في الدرجة الأولى لماذا لا يكون هناك تطابق بالبيانات بين المحفظة والمتصفح؟لايوجد اي نوع من \"عدم التطابق\" اخي يحى كما نوه الاخ اوفين في الاعلى, الموضوع يحتاج.يجب ان نفرق بين الاتي:UTXOADDRESSWALLETما شاء الله أخي ميكي انت مدرسة حقيقية، رغم أنني كنت محرج في البداية من كتابة الموضوع إلا أنني اكتشفت فعلا أن هناك الكثير من التفصيلات التقنية التي ما أزال أجهلها وربما يجهل الكثيرون رغم مرور كل هذا الوقت بالعمل في مجال كريبتو. لا أعرف ربما السبب قلة المصادر حول هذه المواضيع التفصيلية باللغة العربية، مثلا أنا أعرف هذه الأشياء التي ذكرتها UTXO و ADDRESS و WALLET بشكل عام لكنني لا أعرف التفاصيل التي ذكرتها حول UTXO وطريقة عمل المحفظة بالتفصيل التقني. صراحة أصابني الإحراج بعد كتابة الموضوع لأنني كما ذكرت أول مرة تصادفني هذه الحالة كوني كنت أرسل دائما كامل الرصيد إلى المنصة التي أتداول بها حيث أقوم بالتداول بقسم والقسم الآخر أحوله إلى عملتي المحلية من أجل المصاريف الشهرية ، لكني الآن أتمنى أن ارتكب المزيد من هذه الأخطاء حتى أتعلم المزيد  لأنه فعلا كما يقولون الأخطاء هي أكبر معلم. والإنسان بحاجة إلى التعلم وزيادة معرفته بشكل دائم. شكرا لك أخي ميكي على هذا الشرح الممتع وإتحافنا بمعلومات جديدة كل مرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 16, 2023, 06:14:59 AM",
      "body": "أظنك يا صديقي يحي تعرضت لمفهوم Change Address و هو تعبير عن العنوان الذي يذهب اليه الجزء من البيتكوين الذي لم تقم بارساله. ستجد هذا العنوان على اغلب المعاملات في اي بلوك بما ان ليس الجميع ينفقون كل ما تحويه عناوينهم في كل تحويلة و يبقى لهم جزء في محفظتهم. هذا يشبه عندما تشتري شيء و تسلم البائع ورقة نقدية بقيمة اكبر من قيمة السلعة التي تريد شراءها فيقوم البائع بارجاع باقي النقود لك او ما تسمونه انتم في الشام \"الفكة\".للتوضيح فانه اثناء تحديد بيانات المعاملة يمكن اضافة ذلك العنوان الذي ستستقبل عليه البقية يدويا باحتساب حجم المخرجات زائد رسوم المعاملة و طرحها من قيمة المدخلات الجملية. ايضا يمكن ان تضع نفس العنوان الذي في الادخال كعنوان Change و سيستقبل بيتكوين المتبقى من البيتكوين الذي كان يحتوي. المحفظات تقوم بهذا اليا و بما انك تستعمل محفظة الكتروم يمكنك التحقق من عنواوين التغيير Change addresses في خانة العناوين اين ستجد قائمة بها في الأسفل مشار اليها باللون الأصفر. أيضا فان البعض من متصفحات البلوكشين يشيرون في صفحة بيانات المعاملة الى عنوان التغيرر. متصفح Blockchair لديه هذه الخاصية.المعلومات التي قدمها ميكي في التعليق السابق اكثر من كافية و هي توضح ببساطة طريقة عمل التحويلات تقنيا. أتمنى أن تكون الأفكار واضحة في اذهان الجميع لأن هذا الخلط حصل و يحصل مع الجميع حتى مع الأعضاء الأكثر خبرة لأنه و ببساطة الاغلبية يستخدمون محفظاتهم على منصات التداول التي لا تمكنهم من مفاتيحهم الخاصة و تقوم بكل شيء بدلا عنهم. يعني لن تتاح لهم ابدا فرصة التعرف على هذه التفاصيل التقنية المهمة الا اذا كانوا يملكون محفظات خاصة. هذا و تبقى فرص التعلم قائمة بالنسبة لرواد المنتديات و متابعي النقاشات الذين هم للأسف أيضا نسبة قليلة.صديقي يحي ليس هناك أي حرج في طرج الموضوع و جميعنا يستفيد من هذه المواضيع حتى الأعضاء ذوي الخبرة بالاضافة الى زوار المنتدى من غير المسجلين. أيضا فانا اذكر انه تم طرح نقاش هذه التفاصيل في مواضيع سابقة هنا في القسم العربي و لكن فقط لا يمكن تمييزها بسهولة بما انها لم تكن في مواضيع مستقلة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 16, 2023, 08:52:10 AM",
      "body": "Quote from: Kavelj22 on August 16, 2023, 06:14:59 AMصديقي يحي ليس هناك أي حرج في طرج الموضوع و جميعنا يستفيد من هذه المواضيع حتى الأعضاء ذوي الخبرة بالاضافة الى زوار المنتدى من غير المسجلين. أيضا فانا اذكر انه تم طرح نقاش هذه التفاصيل في مواضيع سابقة هنا في القسم العربي و لكن فقط لا يمكن تمييزها بسهولة بما انها لم تكن في مواضيع مستقلة.بارك الله فيك أخي Kavelj22 على التوضيح البسيط والمفهوم. نعم إذا لم يتم استخدام هذه الأشياء فلن نتعلم كل شيء حولها، تبقى هذه المفاهيم جديدة وبحاجة وقت للاطلاع على تفاصيلها. بالنسبة لهذا الموضوع نعم سيكون ذو فائدة كبيرة لي وللمبتدئين وكذلك الزوار بما أن المصادر العربية قليلة في هذا الشأن، وهذه فائدة المنتدى صراحة هي تبادل الأفكار والمعلومات. هناك كثير من هذه المواضيع والمعلومات القيمة متناثرة في النقاشات ضمن مواضيع مختلفة لو تمكن أحد الأعضاء من جمعها في موضوع واحد منسق أو عدة مواضيع حسب الأفكار سيكون مشروع كبير للقسم العربي ربما أفكر بالعمل عليه في المستقبل إذا سمحت لي الظروف.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 16, 2023, 10:06:51 PM",
      "body": "الأخوة اجابو على تساؤلك اخي يحيى بشكل مفصل و دقيق، لذلك لا يوجد ما يمكن أن اضيفه في هذا الموضوع.فقط أردت أن أشارك معلومة ربما تفيدك. حسب ما فهمت من موضوعك فانت تفضل متابعة رصيد محفظتك، او عنوانك بشكل أصح، من خلال المتصفح لتجنب فتح المحفظة بشكل متكرر. الاشكال هنا هو ارسال بقية المبلغ المرسل إلى عنوان جديد في كل مرة مما يجعل تتبع رصيدك امر صعب و يستغرق بعض الوقت. إذ عليك أن تفتح اخر عملية تحويل من المتصفح لتعرف العنوان الذي تم ارسال الباقي اليه.حسب ما فهمت أيضا، فإنك تستعمل نفس العنوان لاستقبال البيتكوين لذلك موضوع الخصوصية ليس بأشكال كبير بالنسبة لك. في هذه الحالة انصحك بتعطيل خاصية ارسال الباقي إلى عنوان جديد في اعدادات الكتروم.عند تعطيل الخاصية، عند تحويل اي مبلغ سيتم ارسال الباقي لنفس العنوان المرسل منه. بهذه الطريقة يمكنك استعمال المتصفح لمتابعة رصيدك و لا تحتاج ان تقلق بشأن البحث عن العنوان الجديد في كل مرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 17, 2023, 06:07:26 AM",
      "body": "Quote from: khaled0111 on August 16, 2023, 10:06:51 PMالأخوة اجابو على تساؤلك اخي يحيى بشكل مفصل و دقيق، لذلك لا يوجد ما يمكن أن اضيفه في هذا الموضوع.فقط أردت أن أشارك معلومة ربما تفيدك. حسب ما فهمت من موضوعك فانت تفضل متابعة رصيد محفظتك، او عنوانك بشكل أصح، من خلال المتصفح لتجنب فتح المحفظة بشكل متكرر. الاشكال هنا هو ارسال بقية المبلغ المرسل إلى عنوان جديد في كل مرة مما يجعل تتبع رصيدك امر صعب و يستغرق بعض الوقت. إذ عليك أن تفتح اخر عملية تحويل من المتصفح لتعرف العنوان الذي تم ارسال الباقي اليه.حسب ما فهمت أيضا، فإنك تستعمل نفس العنوان لاستقبال البيتكوين لذلك موضوع الخصوصية ليس بأشكال كبير بالنسبة لك. في هذه الحالة انصحك بتعطيل خاصية ارسال الباقي إلى عنوان جديد في اعدادات الكتروم.عند تعطيل الخاصية، عند تحويل اي مبلغ سيتم ارسال الباقي لنفس العنوان المرسل منه. بهذه الطريقة يمكنك استعمال المتصفح لمتابعة رصيدك و لا تحتاج ان تقلق بشأن البحث عن العنوان الجديد في كل مرة. شكرا لك أخي خالد هذه هي مشكلتي بالضبط. أريد تفقد الرصيد بدون فتح المحفظة كل مرة لذلك سأعمل بنصيحتك وأقوم بتعطيل خاصية ارسال الباقي إلى عنوان جديد في  محفظة الكتروم.الخصوصية تهمني أيضا ، لكن أنا استخدم هذه المحفظة بشكل مؤقت فقط من اجل استقبال الدفع من الحملة لذلك استخدم نفس العنوان دائما في كل الحملات أو المسابقات التي أشترك فيها بالمنتدى. أنا في العادة كما ذكرت أقوم بنقل جميع البيتكوين إلى المنصة التي أتداول فيها حيث أخصص جزء بسيط للتداول والقسم الآخر أحوله إلى عملة بلدي المحلية من أجل المصاريف الشهرية ، ولكن منذ فترة قررت أن أقوم ب DCA في هذه المحفظة بما أنه تبقى أقل من سنة على هالفينغ البيتكوين وكما هو متوقع عند الجميع سيكون هناك ارتفاع في السعر كما حدث في المرات السابقة ، وهنا حصلت المشكلة أو سوء الفهم معي عندما أصبحت أنقل جزء وأترك الباقي. لذلك الآن أفضل حل بالنسبة لي أن أقوم بإرسال جزء إلى المنصة لتصريفه والجزء الآخر أنقله إلى محفظة جديدة خاصة ب DCA . شكرا لك أخي خالد للنصيحة ولكل الأخوة الذين ساهموا في هذا الموضوع.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "August 18, 2023, 01:03:29 AM",
      "body": "Quote from: khaled0111 on August 16, 2023, 10:06:51 PMحسب ما فهمت أيضا، فإنك تستعمل نفس العنوان لاستقبال البيتكوين لذلك موضوع الخصوصية ليس بأشكال كبير بالنسبة لك. في هذه الحالة انصحك بتعطيل خاصية ارسال الباقي إلى عنوان جديد في اعدادات الكتروم.عند تعطيل الخاصية، عند تحويل اي مبلغ سيتم ارسال الباقي لنفس العنوان المرسل منه. بهذه الطريقة يمكنك استعمال المتصفح لمتابعة رصيدك و لا تحتاج ان تقلق بشأن البحث عن العنوان الجديد في كل مرة. اخي خالد, استخدام عنوان جديد الغاية منه ليست فقط الخصوصية, وانا اتعب من ان معظم المقالات العربية او الاجنبية لا تتطرق لكون ان السبب الاخر والذي قد يعتبر اهم هوا \"الحماية\".عمليا لكي تقوم بهجوم على Elliptic Curve Digital Signature Algorithm لاي عنوان يتطلب عليك معرفة ال Public key الخاص به.مايجهله الكثير ان العنوان هوا ليس Public key بس هوا مجموعة رموز مشفرة ب RIPEMD-160.نبدة بسيطة عن كيفية تكون عنوان البتكوين1- تكوين البرافيت كي  (المفتاح الخاص)2- ادخالها على ECDSA Curve Algorithm للحصول على 3- المفتاح العام public key 4- ادخال الاخيرة على RIPEMD-160 للحصول على 5- العنوان في حال لم تقم بارسال اي تحويل من العنوان فعندها لا احد يعرف المفتاح العام الخاص بك, ولكي يتمكن من الحصول على المفتاح الخاص, عليه اولا الحصول على المفتاح العام.مانعرفه حتى الان عن قدرة كسر كل هده التشفيرات والحمايات هوا الاتي:1- Shor's algorithm : يسخدم ضد ECDSA Curve Algorithm عند استخدامه ب كوانتوم كومبيوتر, فان الحماية هنا تتضائل من مئات الترليونات الى بضعة ملاين, يعني عمليا, بعد مرور عشرة سنوات او عشرين او خمسين سنة او الله يعلم عندما يصبح استخدام Shor's algorithm فعليا ومجدي سوف يكون الحصول على المفتاح الخاص الخاص من المفتاح العام امر ممكن2- Grover's algorithm: يستخدم ضد RIPEMD-160 ولكن باستخدامه فان فرص كسره تنقص من تريلونات الترليونات من التريلوينات الى تريولنات التريلونات, يعني من \"مستحيل جدا جدا\" الى \"مستحيل جدا\" مما يعني انه بالمجمل لكي تتحصل على البرافيت كي من عنوان بتكوين الامر علميا مستحيل حتى بعد زمن, ولكن لكي تتحصل على برافيت كي من بابلك كي, الامر \"اقل استحالة\" مع مرور الوقت.طبعا كل هده نظريات للمستقبل لانه حتى الان لايوجد اي تطبيق عملي تم الافصاح عنه للعيان انه تم استخدام Shor's algorithm للحصول على مفتاح خاص لاحد عنواين البتكوين, وحتى وان وجد سواء الان او بعد عقود, فانه ليس من المنطقي ان يتم استخدام كل تلك الموارد لاختراق عنواني او عنوان الاخ يحى وترك العنواين التي تحمل مليارات الدولارت   ولكن من باب الاحتياط ولاننا لا نعرف الى اي مدى وصلت التقنية الخفية, فانه عند عدم استخدامك لنفس العنوان تكون قد ضاعفت حماية اموالك بمراحل عديدة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "August 18, 2023, 04:39:09 AM",
      "body": "Quote from: mikeywith on August 18, 2023, 01:03:29 AMاخي خالد, استخدام عنوان جديد الغاية منه ليست فقط الخصوصية, وانا اتعب من ان معظم المقالات العربية او الاجنبية لا تتطرق لكون ان السبب الاخر والذي قد يعتبر اهم هوا \"الحماية\".عمليا لكي تقوم بهجوم على Elliptic Curve Digital Signature Algorithm لاي عنوان يتطلب عليك معرفة ال Public key الخاص به.مايجهله الكثير ان العنوان هوا ليس Public key بس هوا مجموعة رموز مشفرة ب RIPEMD-160.نبدة بسيطة عن كيفية تكون عنوان البتكوين1- تكوين البرافيت كي  (المفتاح الخاص)2- ادخالها على ECDSA Curve Algorithm للحصول على3- المفتاح العام public key4- ادخال الاخيرة على RIPEMD-160 للحصول على5- العنوانفي حال لم تقم بارسال اي تحويل من العنوان فعندها لا احد يعرف المفتاح العام الخاص بك, ولكي يتمكن من الحصول على المفتاح الخاص, عليه اولا الحصول على المفتاح العام.شكرا لك أخي على هذه المعلومات القيمة بالفعل، منذ دخلت هذا المجال وقرأت عشرات المقالات وأنا دائما أسمع أن العنوان هو نفسه Public key !!! وأن إنتاج Privet Key يتم عن طريق public key فقط، صراحة لم أقرأ مثل هذه المعلومات التفصيلية. تفاجأت بالمعلومة صراحة وإذا لم يكن هناك إزعاج أتمنى أن تشرح أكثر حول هذه النقطة وخاصة النقطة الأخيرة لأنها مهمة جدا يعني: إذا قمت بإنشاء عنوان بيتكوين ولم تقم بإرسال أي معاملة منه فهذا يعني أنه لايمكن معرفة public key؟سؤال آخر لوسمحت: في مثل هذه الحالة التي تتكلمون عنها أي توليد عنوان جديد بعد كل معاملة هل يكون Public key للعنوان الأخير هو نفسه Public key للعنوان الأول الذي تم إرسال المعاملة منه؟ وهل يمكن معرفة Public key للعنوان الاخير بما أن العناوين جميعها تعود إلى نفس المحفظة بالأساس؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 18, 2023, 05:49:58 AM",
      "body": "Quote from: Trawda on August 18, 2023, 04:39:09 AMتفاجأت بالمعلومة صراحة وإذا لم يكن هناك إزعاج أتمنى أن تشرح أكثر حول هذه النقطة وخاصة النقطة الأخيرة لأنها مهمة جدا يعني: إذا قمت بإنشاء عنوان بيتكوين ولم تقم بإرسال أي معاملة منه فهذا يعني أنه لايمكن معرفة public key؟سؤال آخر لوسمحت: في مثل هذه الحالة التي تتكلمون عنها أي توليد عنوان جديد بعد كل معاملة هل يكون Public key للعنوان الأخير هو نفسه Public key للعنوان الأول الذي تم إرسال المعاملة منه؟ وهل يمكن معرفة Public key للعنوان الاخير بما أن العناوين جميعها تعود إلى نفس المحفظة بالأساس؟ لكل عنوان الPublic Key الخاص به أو يمكن القول العكس تماما أي أن العنوان هو من يتم استخراجه من الPublic key و الذي بدوره يمكن ان يحصل يوما ما في المستقبل بعد ان تتقدم التكنولوجيا الى مستويات لا نعلمها بعد ان يتم النجاح في استخراج الPrivate key من ذلك المفتاح و لهذا ينصح دوما ان لا يتم استعمال نفس العنوان اكثر من مرة لانه ان حصل و نجح ذلك التطور فان ذلك العنوان سيصبح عرضة للاختراق. هذه فرضية بعيدة جدا بكل المقاييس الحالية و لكنها تبقى فرضية قائمة بما أننا نعرف كيف يمكن ان تحصل و لا نعرف فقط وقت حدوثها الذي قد يكون اسرع بكثير من المتوقع.دعني أطمئنك أنه ليس هناك خطر حاليا في استخدام نفس العنوان الا في ما يخص حماية الخصوصية و أنه الى حين ذلك الوقت الذي قد تتطور فيه تكنولوجيا فك التشفير فالأكيد ستظهر وسائل حماية أكثر لأنه ببساطة لو حصل و انتشرت هذه التكنولوجيا الخطيرة فالأكيد ستسبب انهيار كامل نظام البيتكوين و لن يصبح للمسروقات اي معنى. لا أحد من مصلحته أن يحصل هذا الا ان كانت غايته فقط تخريبية.أتمنى أن أكون قد أجبت على أسئلتك كلها في هذه الأفكار الملخصة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "August 18, 2023, 02:26:27 PM",
      "body": "Quote from: Trawda on August 18, 2023, 04:39:09 AMتفاجأت بالمعلومة صراحة وإذا لم يكن هناك إزعاج أتمنى أن تشرح أكثر حول هذه النقطة وخاصة النقطة الأخيرة لأنها مهمة جدا يعني: إذا قمت بإنشاء عنوان بيتكوين ولم تقم بإرسال أي معاملة منه فهذا يعني أنه لايمكن معرفة public key؟سؤال آخر لوسمحت: في مثل هذه الحالة التي تتكلمون عنها أي توليد عنوان جديد بعد كل معاملة هل يكون Public key للعنوان الأخير هو نفسه Public key للعنوان الأول الذي تم إرسال المعاملة منه؟ وهل يمكن معرفة Public key للعنوان الاخير بما أن العناوين جميعها تعود إلى نفس المحفظة بالأساس؟ نعم المفتاح العام لا يمكن معرفته الا لمن يمتلك المفتاح الخاص او عند القيام بتوقيع معاملة من ذلك المفتاح الخاص اي عند ارسال معاملة.اما بخصوص النقطة الاخيرة، كل مفتاح خاص يمكن ان ينتج مفتاح عام واحد فقط، ولكن المحفظة تسخدم Hierarchical Deterministicيعني انه يمكن لنفس المحفظة بنفس ال seed ان تنشاء اكتر من مفتاح خاص، يعني ف كل مرة تقوم فها بالتحويل تنشاء مفتاح خاص جديد ينبثق منه مفتاح عام جديد وعنوان جديد.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "August 18, 2023, 04:14:17 PM",
      "body": "شكرا للأخوة  Kavelj22 و mikeywith على ردودكم وصلت الفكرة. أنا سعيد بالتفاعل هنا في المنتدى خاصة القسم العربي. هناك الكثير من التساؤلات لكن سأحاول البحث والتوسع قليلا في الموضوع.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}