{
  "id": "topic_5448281",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "April 10, 2023, 06:17:15 PMLast edit: April 11, 2023, 02:43:08 PM by JamesBorn",
  "content": "It's just occur my mind in around 2012 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.I was not able to achieved one bitcoin then, and when is already too late I could not afford even one tenths of it. Today same friends was bordering me to buy from them are billionaires living large. Sometimes when I see their houses and cars it feels to me like a new regrets.Dudes, people who grab this opportunity earlier are really financial therapies. Am really sorry about the error and for those of accusing me of posting wrong information, I did not intentionally put 2008 is typing errors no one who is into crypto currency that does know when bitcoin came out. Am sorry for the mistake.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448281",
  "comments": [
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 10, 2023, 07:10:22 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMIt's just occur my mind in around 2008 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.Its funny pa say, because are you sure it was Bitcoin you heard of far back in 2008? Because in 2008 Bitcoin never existed, as it was launched in 2009, a year after, of which nobody took it serious back then simply because it had no meaningful tangible value, and its mining was free compared to now which is very expensive, which only if you had $1 or a P.C, you could have afforded to buy or mined more than 1000 BTC back then in 2009.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "April 10, 2023, 09:32:48 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PM~~~Funny how one does not even need to completely read through the entire post to figure out that the post was made up. Op, it seems like you have forgotten the story you told the forum when you newly created your account here in bitcointalk. Just to refresh your memory I quoted the post below for you to read yourself. Quote from: JamesBorn on February 17, 2023, 02:23:36 PMHello guys, I have had quite good and bad experience trying to learn bitcoin, in 2012 someone came with blablabla stories of bitcoin, guy's is not funny! I turn deef ears to it but after a while I keep hearing crypto currency, so in 2016 that's about 5 years interval I decided to give it a try by putting all money I have work so hard to go back to school because they said the more volume of your money the more good trading experience but unfortunately it wasn't juices in my favour and I lost almost everything in attempt trying to recovered.But in 2018 I say to myself I must not give up on this bitcoin, I guess every business or career has failed before the good phase, so I try again with my little savings but this time around I caught big fish before the deep finally takes place, I jakpa, lol, that's run away but by the grace of God that good experience has given my admission into university, I paid my tuition fees through bit[Suspicious link removed]d experience. I will not give up no matter anything, we keep pushing. I must achieved good and better experience with bitcoin, nice having me here too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "April 10, 2023, 10:46:43 PM",
      "body": "Only the OP knows what's it's true intentions regarding this post is, but I guess what ever intention that was, it has failed the OP. Failed to spice the content properly that even a passaby can detect the story are all cooked up. Try to make your lie look much real another time, so that you will at least have few people to believe you and few others to doubt you.. If you where to know about Bitcoin earlier before now (5# could have shown on your past post histories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "April 10, 2023, 10:50:02 PM",
      "body": "Quote from: Cantsay on April 10, 2023, 09:32:48 PMQuote from: JamesBorn on April 10, 2023, 06:17:15 PM~~~Funny how one does not even need to completely read through the entire post to figure out that the post was made up. Op, it seems like you have forgotten the story you told the forum when you newly created your account here in bitcointalk. Just to refresh your memory I quoted the post below for you to read yourself. Quote from: JamesBorn on February 17, 2023, 02:23:36 PMHello guys, I have had quite good and bad experience trying to learn bitcoin, in 2012 someone came with blablabla stories of bitcoin, guy's is not funny! I turn deef ears to it but after a while I keep hearing crypto currency, so in 2016 that's about 5 years interval I decided to give it a try by putting all money I have work so hard to go back to school because they said the more volume of your money the more good trading experience but unfortunately it wasn't juices in my favour and I lost almost everything in attempt trying to recovered.But in 2018 I say to myself I must not give up on this bitcoin, I guess every business or career has failed before the good phase, so I try again with my little savings but this time around I caught big fish before the deep finally takes place, I jakpa, lol, that's run away but by the grace of God that good experience has given my admission into university, I paid my tuition fees through bit[Suspicious link removed]d experience. I will not give up no matter anything, we keep pushing. I must achieved good and better experience with bitcoin, nice having me here too.OP is caught by his own bullet. It is amusing how some people decide to create untrue stories in order to grab attention.That the OP decides to disregard his previous post so quickly is so appalling. You did a good job of awakening his memory in that direction. He has come to realize that he is a big liar for not investing in bitcoin when it was still in its early stages (2009)Was the OP thinking that we should all be sad for him for not investing in bitcoin in his early stage when his friends did",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "April 10, 2023, 11:18:55 PM",
      "body": "OP, you can see how long I've been a member of this forum (years) but don't for one minute assume that I'm some rich OG.  Just like you I could have bought bitcoin at a relatively low price, and had I just invested a few thousand dollars back in my early days....well, I wouldn't be among the super-weathly, but I'd be sitting pretty right now.Which I'm not, because I did nothing of the sort.  On the other hand, I'm hesitant to ever say it's too late because I've told that to myself many times over the years and later found out I was dead wrong.  If you have to learn a lesson from your experience: \"Don't be like TSC (that's me!)\".  Either you believe in bitcoin or you're against it or you sit there on the fence while all the opportunities pass you by.  If I had the chance to start all over again, I'd be a believer and a buyer from the get-go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "April 10, 2023, 11:37:06 PM",
      "body": "Quote from: CryptoHeadlineNews on April 10, 2023, 07:10:22 PMQuote from: JamesBorn on April 10, 2023, 06:17:15 PMIt's just occur my mind in around 2008 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.Its funny pa say, because are you sure it was Bitcoin you heard of far back in 2008? Because in 2008 Bitcoin never existed, as it was launched in 2009, a year after, of which nobody took it serious back then simply because it had no meaningful tangible value, and its mining was free compared to now which is very expensive, which only if you had $1 or a P.C, you could have afforded to buy or mined more than 1000 BTC back then in 2009.Haha, it's funny and you got him busted with this which is clearly not saying the truth. It might OP means it was back in April 2013 when Bitcoin first reached a price of $100, not in 2008 which at that time don't have an exchange market to buy Bitcoin.  How come @OP huh...?I've been for years in crypto but until now I didn't have even a single number of Bitcoin. If you have that large amount now, might you also suspect money laundering when you exchange it into fiat, it's very risky either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "April 10, 2023, 11:43:34 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMIt's just occur my mind in around 2008 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.I was not able to achieved one bitcoin then, and when is already too late I could not afford even one tenths of it. Today same friends was bordering me to buy from them are billionaires living large. Sometimes when I see their houses and cars it feels to me like a new regrets.Dudes, people who grab this opportunity earlier are really financial therapies. I wonder if the OP meant to write a different year instead of 2008, because Bitcoin didn't exist in 2008. This makes me confused about what you are saying. I don't feel like I should believe your story, but it's true that people who bought or mined a lot of Bitcoin in the early days were very lucky if they didn't sell or lose them. They could be millionaires by now, or even more than that. Anyway, OP should re-check their typing and correct the year at least, so the story sounds more believable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "April 11, 2023, 02:10:22 AM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMIt's just occur my mind in around 2008 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will.Bitcoin genesis block was mined at 3rd January 2009 so how did you know about it in 2008.  Bitcoin did not have its price around $100 a few years since 2009.Bitcoin price history [2009 - 2020]QuoteMy friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.What does unit mean?I guess you talked about 100 bitcoins, not units. There are many Bitcoin units and when you used units, it is confusing.[Did you know?] Bitcoin Table of Units",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "April 11, 2023, 04:08:43 AM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMIt's just occur my mind in around 2008 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.I was not able to achieved one bitcoin then, and when is already too late I could not afford even one tenths of it. Today same friends was bordering me to buy from them are billionaires living large. Sometimes when I see their houses and cars it feels to me like a new regrets.Dudes, people who grab this opportunity earlier are really financial therapies. It is a mind game! It's not just you, rather a lot of people including me lost the chance to own bitcoins early. I could have purchased bitcoin at 300 USD range and I actually had money to do so. But I didn't really realize how big it can go up to. Otherwise, I would have been a millionaire by now. But here I am, still living paycheck to paycheck. But do I have regrets? Oh hell no! It's a mistake and I try to learn from it. Regrets are pretty bad things. If you have a job, a car, and a house, please note, that you come in the top 4% of the population of the world. It's not bad either. So take pride on what you have. Don't regret on what you have lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "April 11, 2023, 04:21:31 AM",
      "body": "op I don't really understand what you mean, and I want to ask you, is it true that btc cost 100$ in 2008, because as far as I know the price of btc in 2008 didn't reach 100$.and is this your experience or not?I think there is no need to regret the past that will not change your life, think about the present and don't make mistakes that will make your future bleak...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "April 11, 2023, 07:48:20 AM",
      "body": "Quote from: The Sceptical Chymist on April 10, 2023, 11:18:55 PMOP, you can see how long I've been a member of this forum (years) but don't for one minute assume that I'm some rich OG.  Just like you I could have bought bitcoin at a relatively low price, and had I just invested a few thousand dollars back in my early days....well, I wouldn't be among the super-weathly, but I'd be sitting pretty right now.Which I'm not, because I did nothing of the sort.  On the other hand, I'm hesitant to ever say it's too late because I've told that to myself many times over the years and later found out I was dead wrong.  If you have to learn a lesson from your experience: \"Don't be like TSC (that's me!)\".  Either you believe in bitcoin or you're against it or you sit there on the fence while all the opportunities pass you by.  If I had the chance to start all over again, I'd be a believer and a buyer from the get-go.I believe everyone familiar with Bitcoin and its recent history would have one or two things to say, but this might either be positive or negative. I share in your burden of thought on what has been missed since I also missed a lot when it comes to Bitcoin investment. It's painful to mention that I started hearing of Bitcoin in 2011 and I had a lot of transactions with it but never saved a dime till I joined BTT. How painful could that be?I've also been in the field of trading and investment for almost 2 decades, which makes it more painful as a life-changing opportunity just slipped between my fingers despite playing with the trading chart daily. I've missed several millions of dollars due to this.Still, it's not too late. I will only admonish you to be serious about it and be more speculative in order to gain substantially through it. I started trading and investing in Bitcoin last year and it's 'so far so good' due to my experience in trading. Aside from trading the futures, I hold it but I move it to USDT or $USD when a long-term bearish trend is detected. Then buy it back when a bullish trend is detected.This has helped me in maximizing profits with the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesBorn",
      "created_time": "April 11, 2023, 03:08:05 PMLast edit: April 11, 2023, 09:23:08 PM by JamesBorn",
      "body": "Quote from: Cantsay on April 10, 2023, 09:32:48 PMQuote from: JamesBorn on April 10, 2023, 06:17:15 PM~~~Funny how one does not even need to completely read through the entire post to figure out that the post was made up. Op, it seems like you have forgotten the story you told the forum when you newly created your account here in bitcointalk. Just to refresh your memory I quoted the post below for you to read yourself. Quote from: JamesBorn on February 17, 2023, 02:23:36 PMHello guys, I have had quite good and bad experience trying to learn bitcoin, in 2012 someone came with blablabla stories of bitcoin, guy's is not funny! I turn deef ears to it but after a while I keep hearing crypto currency, so in 2016 that's about 5 years interval I decided to give it a try by putting all money I have work so hard to go back to school because they said the more volume of your money the more good trading experience but unfortunately it wasn't juices in my favour and I lost almost everything in attempt trying to recovered.But in 2018 I say to myself I must not give up on this bitcoin, I guess every business or career has failed before the good phase, so I try again with my little savings but this time around I caught big fish before the deep finally takes place, I jakpa, lol, that's run away but by the grace of God that good experience has given my admission into university, I paid my tuition fees through bit[Suspicious link removed]d experience. I will not give up no matter anything, we keep pushing. I must achieved good and better experience with bitcoin, nice having me here too.OP, I didn't see any differences from what I posted before, I only mistakenly post 2008 which is typing errors but if is about me posting similar thread before I will agreed because one might not recall everything you share before since the forum start. So I apologize for the date noted early. Pls this forum is also for correction I expect some people to do so not everyone condemning your post probably because of mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 11, 2023, 08:12:46 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMAm really sorry about the error and for those of accusing me of posting wrong information, I did not intentionally put 2008 is typing errors no one who is into crypto currency that does know when bitcoin came out. Am sorry for the mistake.Nobody is above mistake my friend and as such you don't have to get angry when people try to correct you, because at first, I thought maybe you never knew what you were talking about. But I'm happy you have been able to come up to say it was a mistake and yet correction has been made. I will like to suggest that if you using a mobile device, I will advise you download an app called \"Grammarly\" on Playstore as it can help you to write a well constructive statement with zero grammatical errorsQuoteIt's just occur my mind in around 2012 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out.I just made some research on Google and got to notice that the closing price for Bitcoin (BTC) in 2012 was $13.45, on December 31, 2012, of which the $100 your friend invested back then could have afforded to buy 7.43 BTC, which in today's current price, amount into $210,000 @ $30k per BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "April 11, 2023, 08:34:21 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMIt's just occur my mind in around 2012 first time I heard people talking about bitcoin, some media friends were texting and DM my facebook, BBM to buy bitcoin at a very low rate of $100 but I seriously kick against the opportunity to store bitcoin as many units as I will. My friend bought 100 units then and stored it to some points when it turns $3000 and he sold them out. I do not incline to buying or investing, unless of course you understand this, then you should not get into it without knowledge and skills.I was not able to achieved one bitcoin then, and when is already too late I could not afford even one tenths of it. Today same friends was bordering me to buy from them are billionaires living large. Sometimes when I see their houses and cars it feels to me like a new regrets.Dudes, people who grab this opportunity earlier are really financial therapies. Am really sorry about the error and for those of accusing me of posting wrong information, I did not intentionally put 2008 is typing errors no one who is into crypto currency that does know when bitcoin came out. Am sorry for the mistake.It's understandable to have regrets about not investing in Bitcoin earlier, but it's important to focus on the present and future opportunities in the crypto space. Bitcoin and other cryptocurrencies are still relatively new and there are many emerging projects that have the potential for growth and success. It's never too late to start investing and exploring the possibilities of this exciting industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "April 11, 2023, 09:09:20 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMAm really sorry about the error and for those of accusing me of posting wrong information, I did not intentionally put 2008 is typing errors no one who is into crypto currency that does know when bitcoin came out. Am sorry for the mistake.Always try to make amends to things wrongly done and you hust did the perfect thing by repositioning your steps, it's never too late to start a new turn no matter how far you've gone, those attack were not targeted on you but on the wrong you did, it is very important for you to work on yourself in many ways, this will also help you to maintain a good reputation in what you may later want to offer due to the bad occurrences of the past, take heed lest you fall again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 11, 2023, 09:27:14 PM",
      "body": "Quote from: JamesBorn on April 10, 2023, 06:17:15 PMI see their houses and cars it feels to me like a new regrets.You only regret this opportunity because you know about it. There are hundreds of such opportunities passing you buy every year and you don't have regrets because you don't know of their existence.My friend had a lot of trash at home because his grandfather never threw out anything and he had a lot of copper wiring, engines and all that. He was cleaning up and sold all that copper stuff for scrap in 2017 and 2018 and was happy to get a lot of money for it, because according to him it was a good time to sell as copper was up by 50%. Now copper is up more than 100% from the time he sold and he probably regrets it, but that's only because he knows about it and checks the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "April 12, 2023, 08:49:23 AM",
      "body": "OP, for you to regret your ignorance on investing in bitcoin in the early years of bitcoin, shouldn't be the problem or a way out. You should wake up from your disbelief on bitcoin and grab the opportunity to invest now. You still have enough time to correct your mistake and to make profit from bitcoin as it is not late to invest. There is no specific time to buy bitcoin, all you need to do is to believe that bitcoin will add positive value to your earning,when you hold for long.Your stories are different, it is better you come out real and don't cook lies to feed us with to fish for merit. This is a big community and whatever you post is noted by forum members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "April 12, 2023, 01:44:24 PM",
      "body": "Quote from: JamesBorn on April 11, 2023, 03:08:05 PMQuote from: Cantsay on April 10, 2023, 09:32:48 PMQuote from: JamesBorn on April 10, 2023, 06:17:15 PM~~~Funny how one does not even need to completely read through the entire post to figure out that the post was made up. Op, it seems like you have forgotten the story you told the forum when you newly created your account here in bitcointalk. Just to refresh your memory I quoted the post below for you to read yourself. Quote from: JamesBorn on February 17, 2023, 02:23:36 PMHello guys, I have had quite good and bad experience trying to learn bitcoin, in 2012 someone came with blablabla stories of bitcoin, guy's is not funny! I turn deef ears to it but after a while I keep hearing crypto currency, so in 2016 that's about 5 years interval I decided to give it a try by putting all money I have work so hard to go back to school because they said the more volume of your money the more good trading experience but unfortunately it wasn't juices in my favour and I lost almost everything in attempt trying to recovered.But in 2018 I say to myself I must not give up on this bitcoin, I guess every business or career has failed before the good phase, so I try again with my little savings but this time around I caught big fish before the deep finally takes place, I jakpa, lol, that's run away but by the grace of God that good experience has given my admission into university, I paid my tuition fees through bit[Suspicious link removed]d experience. I will not give up no matter anything, we keep pushing. I must achieved good and better experience with bitcoin, nice having me here too.OP, I didn't see any differences from what I posted before, I only mistakenly post 2008 which is typing errors but if is about me posting similar thread before I will agreed because one might not recall everything you share before since the forum start. So I apologize for the date noted early. Pls this forum is also for correction I expect some people to do so not everyone condemning your post probably because of mistakes.To the OP, it's funny how your yet to identify the error or should I call it lies you made in your post in order to catch the attention of members here, your previous post about how and when you started your crypto journey has been seen and you call it an error yet you think everyone is condemning you right? You can't forget any thing about your previous post unless it was either fabricated or not completely true and that's why you cannot remember the exact year you once talked about.Yes the forum is for correction but basically it is for learning and during the process of learning you can feel condemned when your actually being corrected so I will advise you to accept the criticism and work towards getting better especially with the information you give here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "April 12, 2023, 08:55:35 PM",
      "body": "Quote from: The Sceptical Chymist on April 10, 2023, 11:18:55 PMOP, you can see how long I've been a member of this forum (years) but don't for one minute assume that I'm some rich OG.This is the best lifestyle to live to avoid unnecessary dm from fake people around claiming to love you or in support of your career. Those rich OGs that show to the public that they have the funds to spend and live a better life mostly end up having so many fake people around them who claim they are loyal fans. Life is meant to be simple and that's why I like people like you that are always sincere with humble lifestyle even though they have everything it takes in there finger tips. Quote  Just like you I could have bought bitcoin at a relatively low price, and had I just invested a few thousand dollars back in my early days....well, I wouldn't be among the super-weathly, but I'd be sitting pretty right now. I could remember vividly the song we used to sing then when I was in primary school when we are about to take our launch. It goes like this...  Some have food but can not eat  Some can eat but have no food   We have food and we can eat  Glory be to God almighty The song reminds me of those days I used to hear about Bitcoin investment, seeing friends investing in Bitcoin but for me I had the opportunity but no fund to start up my cryptocurrency career. I have no food but I can eat...I have no fund but I am willing to invest.  This is how we miss opportunity not because we are not interested investing in Bitcoin but we don't have the funds. @The Sceptical Chymist  your own case might be quite different but I knew that I missed the opportunity too because of lack of fund to get myself a Bitcoin. Life could be very difficult at some level but what we need to do is to keep doing what we are doing with improvement to get the best out of life. Quote  On the other hand, I'm hesitant to ever say it's too late because I've told that to myself many times over the years and later found out I was dead wrong.  If you have to learn a lesson from your experience: \"Don't be like TSC (that's me!)\".I think I have learnt a lot from many folks here without them knowing. Most time I look at my past lifestyle and now seeing consistent improvement. I believe opportunity will keep coming irrespective whether I am prepared to grab it or not. The market is down which is another opportunity for us to grab some Bitcoin from the market. Hope to keep flowing like the current of an ocean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}