{
  "id": "topic_5460114",
  "title": "unknowncustomer",
  "author": "unknowncustomer",
  "created_time": "July 17, 2023, 04:52:57 PM",
  "content": "Hi,Just a noob question.I \"created\" a Linux air gapped computer to create a multisig wallet with Electrum.Thus I generated the seed through the Linux version of Electrum.Will I be able to restore the wallet with electrum on MacOS or Windows or should I necessary reuse a Linux version of Electrum ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460114",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "July 17, 2023, 04:54:16 PM",
      "body": "Yes, that's completely fine. There's no difference in using different operating systems, and that includes the android version as well. As long as you have your seed phrases, you should be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 17, 2023, 04:55:03 PM",
      "body": "Quote from: unknowncustomer on July 17, 2023, 04:52:57 PMWill I be able to restore the wallet with electrum on MacOS or Windows or should I necessary reuse a Linux version of Electrum ?Yes.You have your seed phrase you have your coins. Make sure you backup your seed phrase, it is only what that is required to recover your coins. You can also use the wallet file too for recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 20, 2023, 09:35:21 AM",
      "body": "Electrum is a cross-platform application made with Python, so the wallets and seeds that you have created on any computer (not just Linux), can be restored on any other computer, regardless of operating system type or platform version - although restoring wallets created with new versions of Electrum on a computer with an old version of Electrum is not advisable for compatibility reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "July 20, 2023, 10:48:43 AM",
      "body": "Quote from: unknowncustomer on July 17, 2023, 04:52:57 PMWill I be able to restore the wallet with electrum on MacOS or Windows or should I necessary reuse a Linux version of Electrum ?I agree with 3 posts above, but if you want to save and use a wallet file to restore it, there is a different location that you can find specifically on another OS.On Windows - Users\\AppData\\Roaming\\Electrum\\walletsOn Mac Os - (shift+cmd+G) and ~/.electrumOn Linux - Home folder, ~/.electrumThen, when you want to restore, in step 2, choose and select a wallet folder where you save it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abdussamad",
      "created_time": "July 20, 2023, 09:15:59 PM",
      "body": "Quote from: Sarah Azhari on July 20, 2023, 10:48:43 AMQuote from: unknowncustomer on July 17, 2023, 04:52:57 PMWill I be able to restore the wallet with electrum on MacOS or Windows or should I necessary reuse a Linux version of Electrum ?I agree with 3 posts above, but if you want to save and use a wallet file to restore it, there is a different location that you can find specifically on another OS.On Windows - Users\\AppData\\Roaming\\Electrum\\walletsOn Mac Os - (shift+cmd+G) and ~/.electrumOn Linux - Home folder, ~/.electrumThen, when you want to restore, in step 2, choose and select a wallet folder where you save it.It's easier to use the save backup command in the file menu of electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "July 20, 2023, 11:39:04 PM",
      "body": "Quote from: unknowncustomer on July 17, 2023, 04:52:57 PMWill I be able to restore the wallet with electrum on MacOS or Windows or should I necessary reuse a Linux version of Electrum ?You'll be able to restore the wallet with Electrum on any OS it doesn't matter if the seed was generated in Linux. If you're using Electrum input the seed and it'll restore your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 29, 2023, 07:33:23 AM",
      "body": "Quote from: OmegaStarScream on July 17, 2023, 04:54:16 PMYes, that's completely fine. There's no difference in using different operating systems, and that includes the android version as well. As long as you have your seed phrases, you should be fine.Well, it is clear that seed phrase can be restored in any version of electrum, regardless of OS.I have a different question in the context of the thread title \"Electrum Linux vs MacOS/Windows\" (but slightly different from the thread discussed here) to those who are technically strong.Do electrum from different OS differ in terms of security? That is, are the electrum of the same version developed for Linux, Windows and MacOS identical. This is not about the security of the OS itself, but specifically about electrum.Are wallet.dat files interchangeable from different versions (different OS's) of electrum? Is it possible to access the wallet (with a password) by copying wallet.dat from Windows OS to Linux OS (or MacOS) and vice versa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 29, 2023, 09:34:51 AM",
      "body": "Quote from: m2017 on July 29, 2023, 07:33:23 AMThat is, are the electrum of the same version developed for Linux, Windows and MacOS identical. This is not about the security of the OS itself, but specifically about electrum.As far as I'm aware, the source code is the same regardless of the OS that you use. You can also build and develop it on your own if you don't want to download the app file[1]. Also, they don't use wallet.dat[2] like Bitcoin core. You should be able to copy and paste the wallet file regardless of the OS. CMIIW.[1] https://github.com/spesmilo/electrum#development-version-git-clone[2] https://electrum.readthedocs.io/en/latest/faq.html#where-is-my-wallet-file-located",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 29, 2023, 10:49:40 AM",
      "body": "Quote from: joniboini on July 29, 2023, 09:34:51 AMQuote from: m2017 on July 29, 2023, 07:33:23 AMThat is, are the electrum of the same version developed for Linux, Windows and MacOS identical. This is not about the security of the OS itself, but specifically about electrum.As far as I'm aware, the source code is the same regardless of the OS that you use. You can also build and develop it on your own if you don't want to download the app file[1]. Also, they don't use wallet.dat[2] like Bitcoin core. You should be able to copy and paste the wallet file regardless of the OS. CMIIW.[1] https://github.com/spesmilo/electrum#development-version-git-clone[2] https://electrum.readthedocs.io/en/latest/faq.html#where-is-my-wallet-file-locatedIt's clear. Thanks for your prompt reply. Perhaps I will experiment with the wallet file on different OSes to see for myself.Yes, you are absolutely right in noting that the wallet file that is created in electrum is not wallet.dat (i was wrong). Just checked that. But a new question arose: in what format is the electrum wallet created? In the type column, it is only indicated that this is a file. No mention of format.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "July 29, 2023, 01:35:12 PM",
      "body": "Quote from: unknowncustomer on July 17, 2023, 04:52:57 PMWill I be able to restore the wallet with electrum on MacOS or Windows or should I necessary reuse a Linux version of Electrum ?Not only will the seed be compatible with other versions, regardless of the OS, but so will the wallet files.  As Abdussamad mentioned the easiest way to transfer wallets from one computer to another is create backups of the wallet files, and transfer them over to the other system, and again, the OS of the two systems is inconsequential.Baking up and restoring your wallet files is the preferred method, because any data you saved in the file will remain.  For example, if you have labels set for some addresses, or if you've locked or frozen any UTXOs or addresses, all that data will be restored since that data is stored in the wallet file.  If you restore your wallet via seed phrase, you'll have all your coins, but all that additional data will be lost.Quote from: m2017 on July 29, 2023, 10:49:40 AMBut a new question arose: in what format is the electrum wallet created? In the type column, it is only indicated that this is a file. No mention of format.It's a json file, but that's essentially a clear text file that's organized in a specific order.  Electrum doesn't care what file extension is applied to the file, as long as the data is organized in json format.  The wallet file could have no extension, a .txt extension, a .json extension, or make up your own.  It doesn't matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "July 31, 2023, 06:00:55 PM",
      "body": "Quote from: DireWolfM14 on July 29, 2023, 01:35:12 PMQuote from: m2017 on July 29, 2023, 10:49:40 AMBut a new question arose: in what format is the electrum wallet created? In the type column, it is only indicated that this is a file. No mention of format.It's a json file, but that's essentially a clear text file that's organized in a specific order.  Electrum doesn't care what file extension is applied to the file, as long as the data is organized in json format.  The wallet file could have no extension, a .txt extension, a .json extension, or make up your own.  It doesn't matter.If the Electrum wallet file is password protected and encrypted which should be the default, then it is an text file by content that looks like ASCII garbage.If it's only password protected but not encrypted then you will see the content as a JSON text file where the sensitive parts (seed recovery words and extended private key) are encrypted and not directly readable.When you remove the password protection (not recommend, do this in a secured air-gapped environment!) the wallet file will have all its content glory exposed as JSON text file.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "August 02, 2023, 11:20:59 AM",
      "body": "You've given helpful replies so OP should've lauded users for explaining. I've asked help for Electrum wallet, EPS, Bitcoin & Windows. I've thanked for giving invaluable advice. It's disappointing watching absence from the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 08, 2023, 05:40:08 AM",
      "body": "I have created a seed phrase for Electrum on \"Tails\" (Linux) and then imported those word phrases into Electrum for Windows before, but I have not done this for a Mac. I presume that the word phrases are not unique to any specific operating system, so you can import it into any Electrum wallet, no matter what OS you are using. Ps : Do not use \"Tails\" without a Persistent volume, because you will lose it. It comes with a default Electrum wallet installed, but it is mostly outdated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 08, 2023, 06:24:49 AMLast edit: August 08, 2023, 07:05:59 AM by ranochigo",
      "body": "Quote from: Kakmakr on August 08, 2023, 05:40:08 AMI have created a seed phrase for Electrum on \"Tails\" (Linux) and then imported those word phrases into Electrum for Windows before, but I have not done this for a Mac. I presume that the word phrases are not unique to any specific operating system, so you can import it into any Electrum wallet, no matter what OS you are using. Ps : Do not use \"Tails\" without a Persistent volume, because you will lose it. It comes with a default Electrum wallet installed, but it is mostly outdated.  Electrum seeds are backwards compatible, and you would be able to import a seed that is generated by an older version of the Electrum (pre-V2) in the wallet today. You can use Tails without a persistent volume so long as you make the effort to backup and import the seeds everytime you're using it. It is better for privacy that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 16, 2023, 01:21:53 PM",
      "body": "Quote from: Kakmakr on August 08, 2023, 05:40:08 AMI have created a seed phrase for Electrum on \"Tails\" (Linux) and then imported those word phrases into Electrum for Windows before, but I have not done this for a Mac. I presume that the word phrases are not unique to any specific operating system, so you can import it into any Electrum wallet, no matter what OS you are using. -snip-In some circumstances, it is worth noting the derivation path because even if the seed is the same, the resulting wallet address can differ depending on the wallet type.Quote from: joniboini on July 29, 2023, 09:34:51 AMQuote from: m2017 on July 29, 2023, 07:33:23 AMThat is, are the electrum of the same version developed for Linux, Windows and MacOS identical. This is not about the security of the OS itself, but specifically about electrum.As far as I'm aware, the source code is the same regardless of the OS that you use. You can also build and develop it on your own if you don't want to download the app file[1]. Also, they don't use wallet.dat[2] like Bitcoin core. You should be able to copy and paste the wallet file regardless of the OS. CMIIW.[1] https://github.com/spesmilo/electrum#development-version-git-clone[2] https://electrum.readthedocs.io/en/latest/faq.html#where-is-my-wallet-file-locatedI once tried using Electrum 2.9.0 portable on Windows 7, copied the wallet file created there, and then opened it on the Electrum 4.4.3 version of macOS:Quote from: Husna QA on May 20, 2023, 11:41:25 AM-snip--snip-",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "August 16, 2023, 01:33:59 PMLast edit: October 07, 2023, 03:58:16 PM by o_e_l_e_o",
      "body": "Quote from: Husna QA on August 16, 2023, 01:21:53 PMIn some circumstances, it is worth noting the derivation path because even if the seed is the same, the resulting wallet address can differ depending on the wallet type.BIP39 seed phrases can indeed be used to derive multiple address types at multiple derivation paths, but this is not the case for Electrum seed phrases and so you do not need to back up a derivation path. Electrum seed phrases have a version number encoded within them (as the first 8 or 12 bits of a hash of the seed phrase), meaning Electrum will only ever recover one specific script type at one specific derivation path for each seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}