{
  "id": "topic_5436053",
  "title": "famososMuertos",
  "author": "famososMuertos",
  "created_time": "January 19, 2023, 07:47:22 PM",
  "content": "Cada quien se comprá lo que quiere del color que desea y sus decisiones en torno a como invierte su dinero le competen de igual manera.Un color no tiene porqué interponerse a ese juicio de razón.  QuoteHow is the crash related to my property? I am [in the] crypto and finance industry for 10 years. I am not selling anything, nor promoting. If someone made bad decisions and lost money, it's their fault and not my cars Fuente:https://www.cnbc.com/amp/2023/01/19/davos-mystery-of-orange-bitcoin-car-revealed-and-owner-slams-critics.htmlY qué con Davos? Qué es el Foro Económico Mundial de Davos 2023? ¿Quién asiste y cuándo y dónde es?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436053",
  "comments": [
    {
      "author": "Porfirii",
      "created_time": "January 20, 2023, 10:01:35 AM",
      "body": "Quote from: famososMuertos on January 19, 2023, 07:47:22 PMCada quien se comprá lo que quiere del color que desea y sus decisiones en torno a como invierte su dinero le competen de igual manera.Un color no tiene porqué interponerse a ese juicio de razón.  QuoteHow is the crash related to my property? I am [in the] crypto and finance industry for 10 years. I am not selling anything, nor promoting. If someone made bad decisions and lost money, it's their fault and not my cars Fuente:https://www.cnbc.com/amp/2023/01/19/davos-mystery-of-orange-bitcoin-car-revealed-and-owner-slams-critics.htmlY qué con Davos? Qué es el Foro Económico Mundial de Davos 2023? ¿Quién asiste y cuándo y dónde es?Bueno, en realidad el mercado de las criptomonedas, como casi todos, es un mercado de suma cero, en el que para que alguien gane debe haber algún otro que pierda. Por lo tanto, es cierto que su coche no tiene la culpa, pero depende de cómo haya conseguido el dinero para comprarlo puede que él sí tenga la culpa de que haya habido gente que perdiera su dinero (pump&dumps sería el caso más evidente, pero estoy seguro de que hay fórmulas más sutiles). Ahora bien, esto no es característica exclusiva del mercado de las criptos, y un Bentley negro de Wall Street no generaría los mismos comentarios que el mercedes naranja.En cuanto a Davos, parece que se debate el futuro de las CBDCs en el mismo. Habrá que estar atento a lo que se haya comentado estos días al respecto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 20, 2023, 12:04:50 PM",
      "body": "Ese es el auto en discordia, simplemente por ser anaranjado y tener el logo Bitcoin en pequeño está generando todo ese caos. Pero bueno, es de esos tipos de publicidades random para bitcoin, al final la crypto no tiene realmente promotores enfocados y toda la publicidad sale de forma random como en esta ocasión. Y esto no está mal, mientras se hable de Bitcoin vamos por buen camino, hablen bien o hablen mal, pero que hablen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 20, 2023, 03:02:08 PM",
      "body": "Por lo visto, el evento se celebró el año pasado en Mayo, en lugar de enero como este año (supongo que tendría algo que ver con la pandemia).En ese momento, ya llevó su flamante coche naranja con el logotipo de bitcoin en el frontal, al punto que la reportera de Coindesk se fijó lo suyo en el coche, y con eso ya sabía de su presencia en el evento. Será que su coche es bastante conocido por aquellos lares …(ver video): https://uk.movies.yahoo.com/ukrainian-exchange-kunas-michael-chobanian-195600443.htmlNota: En otro plano de cosas, mirad lo que hay en el otro lado de la cera a mitad de video, y sobre lo cual comenta Michael Chobanian, el dueño del coche, que es de origen Ucraniano.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "January 20, 2023, 03:22:30 PMLast edit: January 20, 2023, 03:51:09 PM by famososMuertos",
      "body": "Quote from: seoincorporation on January 20, 2023, 12:04:50 PM ...El asunto es...que si Davos fuera en la equivalencia LE pues no hubiera tal noticia, seguramente la gente diría \" ...llegó el colega hacer sus post!\".   ---Es en el contexto su significado. Ojo, no quiero hacerme leer como partidario a favor o encontra de los varios mensajes que se entremezclan ahí en la percepción de cada individuo.Pero sin duda en el extenso o colateral que resulta el mismo Davos en la congregación de la élite de... quienes controlan, seguramente el tema bitcoin no es tema de pasillos de esta élite.Edit:Post arriba.Que ya tiene confianza, conocé la zona (   ) es su segunda vez, así que seguramente sabía del resultado.Pues buena entrevista que inclusive le lleva a la situación de Ucrania. Es el encargado de una cripto fundación. Y bueno, llevar al mismo Davos estas pruebas de los crímenes de guerra, pues no es más que decir que juzgar por la maleta ( auto) a su propietario te lleva a un personaje que no era el que imaginamos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 21, 2023, 09:36:06 AM",
      "body": "No me parece mala la asociación del vehículo a bitcoin, a la par que a Chobanian, dentro del marco de ser el dueño de un Exchange. Aunque sea un aspecto netamente superficial (lo que importa es el negocio y los números detrás que lo sustenten y puedan atraer a inversores), es de aquellas cosas que se retienen en la retina. Claro que uno ha de buscar con algo de espero el logotipo de bitcoin en el capó del vehículo, que grande no es (casi que mejor).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 18, 2024, 07:58:57 AM",
      "body": "Desconozco si el coche naranja con el logotipo de Bitcoin ha estado este año rondando el entorno de Davos como lo hizo el año precedente, y esa parece haber sido la tónica general del foro en lo relativo a bitcoin y las criptomonedas. En la edición del 2023, éstas tuvieron un papel destacado dentro de las jornadas, para pasar a un plano muy discreto en el 2024, edición acaparada por la IA.Si la pérdida de protagonismo es buena, mala, o ni una cosa ni otra queda a criterio de cada cual … Ver:https://www.criptonoticias.com/comunidad/la-inteligencia-artificial-eclipsa-a-bitcoin-en-davos/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 18, 2024, 10:10:08 AM",
      "body": "Quote from: DdmrDdmr on January 18, 2024, 07:58:57 AMDesconozco si el coche naranja con el logotipo de Bitcoin ha estado este año rondando el entorno de Davos como lo hizo el año precedente, y esa parece haber sido la tónica general del foro en lo relativo a bitcoin y las criptomonedas. En la edición del 2023, éstas tuvieron un papel destacado dentro de las jornadas, para pasar a un plano muy discreto en el 2024, edición acaparada por la IA.Si la pérdida de protagonismo es buena, mala, o ni una cosa ni otra queda a criterio de cada cual … Ver:https://www.criptonoticias.com/comunidad/la-inteligencia-artificial-eclipsa-a-bitcoin-en-davos/En mi opinión personal, creo que Bitcoin y las monedas alternativas que de verdad aportan algo significante al ecosistema en realidad no han perdido protagonismo en dónde realmente ellas hacen la diferencia, que es en el uso diario y el volumen que le dan más personas que ven en ellas una herramienta para realizar transacciones y compras que de ninguna otra forma sería posible hacer, ya sea por circunstancias de la economía de su país o por algún otro motivo. Creo que la publicidad boca a boca entre las personas puede ser tan poderosa como una campaña de gra des proporciones, solo que algo más lenta, pero los resultados se equiparan. Creo que el que Bitcoin tenga publicidad decentralizada es bastante apropiado, teniendo en cuenta cuáles son los valores de su concepción.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "January 18, 2024, 10:48:12 PM",
      "body": "Quote from: DdmrDdmr on January 18, 2024, 07:58:57 AM...//:::...Si la pérdida de protagonismo es buena, mala, o ni una cosa ni otra queda a criterio de cada cual … Su intervención era esperada, Milei y es quizás lo más cerca al flamante auto naranja del año pasado, por el hecho noticioso relacionado a bitcoin, el coche no asoma parece este año, aunque nos queda un día oficial.En todo caso, me trajo la idea de Milei pues le queda muy bien lo que mencionas, a interpretación, y el sitio web por ejemplo lanza este titular:QuoteMilei habló de Bitcoin en Davos sin mencionarlo realmenteEl presidente de Argentina dio su mensaje de libertad económica y resaltó la importancia de la adopción de bitcoin sin siquiera mencionarlohttps://www.criptonoticias.com/comunidad/milei-bitcoin-davos-foro-economico-argentina-suiza/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 20, 2024, 02:17:57 PM",
      "body": "Bueno, por lo menos alguien de El Salvador sí ha tenido a bien ser explícito en su charla en Davos sobre Bitcoin. Concretamente, el presidente de la Comisión Nacional de Activos Digitales, quien defendió su uso como moneda de curso legal, y repasó su marco legal asociado.Claro que viendo la foto de la participación de Juan Carlos Reyes en el evento (estética, señal de WC, candelabro, techo), uno sospecha que no es que esté en la sala central del Foro Económico Mundial. De hecho, el evento sí se celebró en Davos, pero dentro del marco de Crypto 2030, otro evento paralelo con bastante menos glamour …Ver:https://www.criptonoticias.com/comunidad/elsalvador-ley-bitcoin-davos-juancarlosreyes-mineria/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "January 20, 2024, 04:19:13 PM",
      "body": "Buena lectura de \"Tells\".Pues digamos que está en Davos y la cartera (literal) del expositor lo pone en mejor pódium   He buscado detalles del candelabro, pero no he conseguido nada, digo buscado un vídeo para tener apreciación de la cobertura, pero nada.Pero si he conseguido este vídeo que si bien es como siempre un vídeo dirigido por un Youtuber toma lo relevante de Milei.Que, para Davos 2030 sería genial ver un Milei, Bukele pero que curiosamente podrían no estar, esperemos que sea porque no los invitaronhttps://youtu.be/JlVrxb3ntJQ?si=c8Mm8tYFumVylopW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 21, 2024, 02:29:32 PM",
      "body": "Parece que sí, que en los minutos de descuento del Foro de Davos sí hubo un panel que versó sobre las criptomonedas, ya con algunos nombres de relieve dentro de la criptoesfera, y con un escenario más digno que el reportado anteriormente en este hilo relativo a un evento paralelo en Davos.Según leo el resumen del panel, no hay nada que destacar: rajada sobre las monedas meme, solicitud de más regulación por parte de algunos (sobre todo en EEUU parece ser, con Mica como espejo …), la bondad de las ETFs, lo mismo sobre las monedas privadas/estatales estables reguladas, y una chorrada al final del artículo sobre Satoshi que no tiene ni pies ni cabeza. Ver:https://www.territoriobitcoin.com/el-foro-de-davos-finalizo-con-la-mirada-en-las-criptomonedas/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}