{
  "id": "topic_5467672",
  "title": "Paul090",
  "author": "Paul090",
  "created_time": "September 22, 2023, 05:57:40 AM",
  "content": "Bubblebot provides a comprehensive suite of features within a single Telegram bot, including spot trading, futures trading, multi-token staking, and hedging/risk management for various crypto assets. This all-in-one platform aims to offer a convenient and versatile experience for cryptocurrency enthusiasts and traders.Bubble token holders have the exciting opportunity to engage in a range of activities within our ecosystem. This includes participating in Future trading and Spot trading with stop loss capabilities, allowing for flexible and strategic trading options. Additionally, Bubble token holders can earn rewards in multiple tokens, including UniBot, PAAL, and various meme coins.Total Reward distribution in USDT = $30,0001. NEW! Youtube campaign - We will pay 5$ to each user who will fill the report correctly. Your account can participate only one time.2. Signature campaign: Legendary/Hero - $300/month, max 12 participants; Senior Member - $100/month, max 7 participants; Full Member - $70/month, max 10 participants.3. Content (articles): $10-200 for each approved article.4. Video: $20-200 for each approved video.5. Translations: ANN - $100,  White Paper - $100, website - $100, bounty thread - $50 and $0,5 for each subsequent post in the translated ANN or bounty threads.6. Telegram: $50-100 for promoting the project in your chat or channel.7. Affiliate program for online stores, services, platforms, and exchanges: $100-500.8. Reddit post in CryptoMoonShots $50, other reddit communities $209. Instagram post about Bubblebot $810. Tiktok viral video $50 - $100, team will approve GENERAL BOUNTY TERMS & CONDITIONS 1. THE BOUNTY CAMPAIGN WILL RUN UNTIL THE TEAM DECIDES TO STOP IT2. The bounty spreadsheet is updated every month from the 1st to 6th day. The payouts for each month will be sent between the 6th and the 15th of the following month. For example, bounty payouts for August will be sent between September 6 and September 15.3. Bounty will be paid in USDT. 4. The use of multiple accounts, spamming, bots etc. Are forbidden.5. Bounty manager decides to accept or do not accept any text, video or other content. The bounty manager should not explain why he accept or do not accept the content. You must be prepared that any work you perform will not be paid. You cannot make any claims. If these rules do not suit you, please refuse any type of participation in our bounty campaign.6. The team retains the right to modify the campaign rules. Follow the updates in this thread.7. Newbie accounts can participate in content and video campaigns. INDIVIDUAL BOUNTY CAMPAIGN RULESPayment:You will be paid $10-200 for each approved article. The exact amount will depend on the originality of the content, the number of views and comments, and the size of the website's audience.Rules:- Low-quality articles will not be accepted;- Your content must be original;- Accepted languages: English, Spanish, German, Japanese, Chinese, Korean, French, Portuguese, Turkish;- Accepted blogging platforms: Medium, Steemit, Golos, Newbium, Quora;- You can also publish your article on any website dedicated to cryptocurrency or finance;- Your article must be at least 500 words long and contain at least 2 images (the images must be relevant but don't have to be taken from our website or our social media channels), at least 2 links to our website, and mention BubbleBot by name at least twice;- Your article must be interesting to read – not just a chunk of text taken from our website;- Whenever possible, place a link to your BTT account at the end of your article as a proof of your authorship (this is an obligatory rule for articles published on Medium, Steemit, Golos, Newbium, and Quora)- Due to the huge number of low-quality articles and the use of multiple accounts. Content campaign rules change: From the 28 of September 2019 newbie accounts can't join Content campaign.- Articles retelling what is on the site. will not be accepted. We need high-quality authoring content.How to submit:After publishing your article, post a link to it in this thread. Do not forget to add a telegram username in it.Payment:You will be paid $20-200 for each approved video. The exact amount will depend on the originality of the content, the number of views and comments, and the size of your vlog's audience.Rules:- Low-quality videos will not be accepted. We will only pay for interesting videos, so try to come up with an interesting topic. We will not accept videos where you just read aloud the text from our landing page.  - Accepted languages: English, Spanish, German, Japanese, Chinese, Korean, French, Portuguese, Turkish;- Your video must be at least 4 minutes long;- You must mention BubbleBot by name at least 3 times;- Add our hashtags and links to our website, White Paper, social media channels, and our Medium blog.How to submit:After publishing your video, post a link to it in this thread. Do not forget to add a telegram username in it.Payment:ANN - $100,  White Paper - $100, website - $100, bounty thread - $50 and $0,5 for each subsequent post in the translated ANN or bounty threads.Rules:- All languages are accepted;- It's forbidden to use Google Translate and similar tools;- You must be a native speaker and the translation must be of high quality;- Any additional posts that you write (worth $0,5 each) must not be spammy or meaningless. You can publish the news from our social media, links to new articles on Medium, etc.How to join:-Apply in this thread using the following format:#Authentication PostType of campaign: TranslationBitcointalk Username: [username]Language:Portfolio link:Telegram username:ERC20 wallet address:Payment:$50-100 for promoting the project in your chat or channel.Rules:- Your channel or chat must have real human followers, not bots;- Send us your detailed offer before we accept you to the telegram campaign.- only agreed posts can be acceptedHow to join:You can apply in this thread by posting a link to your Telegram channel or chat. Make sure to to mention if you write promotional posts yourself, how long the post will stay at the top, your pricing, etc. Alternatively, send us all this info in a PM.Payment:Referral program for online stores, services, platforms, and exchanges: $100-500.Rules:- You must add the Bubble token to your platform or website (you can act as an intermediary);- Your reward will depend on the amount of services rendered, their quality, and the number of users on your platform or website.How to join:Visit app.bubblebot.finance and generate your custom referral linkWe will pay 5$ to each user who will fill the report correctly. Your account can participate only one time.How to join:- Every participant should go to the website https://bubblebot.finance on their native language- On the website you should watch video than go to the YouTube page of that video- On the YouTube video page you should subscribe for BubbleBot channel, “Like” the video and put a comment under it.- Put one more comment under another user comment- \"Like\" three different comments under the video- Find a video about stabecoins. Post a comment onder that video about BubbleBot token and leave the link https://bubblebot.finance in the comment.- After that you should find using search two more videos about BubbleBot and “Like” them.- Fill our the report with account name, links, etc. https://forms.gle/gxg5KUE9boK3FZdM6Rules:- You youtube account should be more that 60 days old.- Joining with multiple accounts is not allowed.- Youtube account must be original. Fake, dead, inactive and bot accounts will not be accepted.- Your comment should be informative. We will not accept posts as \"Good project\". Post minimum 2-3 sentences with your thoughts about Bubble Bot.  Please watch video before you post a comment- If you don't fill out the form, your participation will be disqualified.- Don't fill the form twice, someone who fills the form twice will get disqualified !- The report should contain - at least 2 video you found and “Liked”, and your youtube account to check comments.- Your account can participate in that bounty only 1 time- The newbie account on bitcointalk are not accepted due to multi-accounts using.- With filling the report table please post the same in the bounty threadPayment:The maximum number of participants is limited. We will select active members of the forum who post valuable content.Legendary/Hero - $300/month, max 12 participants;Senior Member - $100/month, max 7 participants;Full Member - $70/month, max 10 participants.Rules:- You must wear the project's signature, avatar and secondary signature under the avatar after you receive PM from the bounty manager about acceptance;- You must write at least 50 posts each month. If you've entered the campaign once the month has already started, the necessary number of posts will be calculated proportionately.- You must post at least 20 different days within each month.- Spam, short meaningless posts, insults, and trolling are forbidden and will be punished by your removal from the bounty campaign without a payout.- We retain the right to remove any participant from the signature campaign at any moment and for any reason.- Posts in Politics, Society and Off-topic sections will not be counted.- Participants with a negative \"trust\" are not allowed.How to join:Apply in this thread using the following format:#Authentication PostType of campaign: SignatureBitcointalk Username: [username]ERC20 wallet address:- Only users approved by the bounty manager can participate in the signature campaign.- An invitation will be sent PM to each selected candidate.- The list of accepted users will be in the bounty spreadsheet.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467672",
  "comments": [
    {
      "author": "Shohag.btc",
      "created_time": "September 22, 2023, 05:59:40 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: shohag.btcForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=2688205Telegram Username: @shohagbtcParticipated Campaigns: Twitter, BSC  Wallet  address:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sojibrana842",
      "created_time": "September 22, 2023, 05:59:55 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: sojibrana842Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=2870358Telegram Username: @Sojib842Participated Campaigns: Twitter,Telegram, Facebook BSC Address: 0x5768f6C65E8fa56E7Bb2BD0c45Cff377CbB3FA97",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Talha.2066",
      "created_time": "September 22, 2023, 06:00:44 AM",
      "body": "#Proof Of Registration Bitcointalk username:Talha.2066Bitcoin profile link: https://bitcointalk.org/index.php?action=profile;u=3535802Telegram username:@sobuj1000Join Campaign : Twitter, Telegram, DiscordBSC wallet: 0xB7415417B030af25c2856f6e52904470B1931E43",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Easin5285",
      "created_time": "September 22, 2023, 06:22:37 AM",
      "body": "#PROOF OF REGISTRATION Forum Username: Easin5285 Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3399783 Telegram Username: @yasin52859 Participated Campaigns: Twitter, Article, Facebook, Telegram, Reddit ,Discord, Tiktok BSC Wallet Address: 0xa7d7387CAd83e624897d61a66696C0692ba9A6A7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marzia2580",
      "created_time": "September 22, 2023, 06:25:22 AM",
      "body": "#PROOF OF REGISTRATION#Forum Username: marzia2580Forum Profile Link. https://bitcointalk.org/index.php?action=profile;u=3542138Participated Campaign:  Twitter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdnadim2",
      "created_time": "September 22, 2023, 06:28:16 AM",
      "body": "#Authentication PostType of campaign: Telegram,YouTubeBitcointalk Username: mdnadim2ERC20 wallet address: 0x65Ce7Bb2cd5e2D48EaCe5700631ECA04B5e2F909",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redhack",
      "created_time": "September 22, 2023, 07:04:33 AMLast edit: October 14, 2023, 01:36:48 AM by redhack",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: redhack ERC20 wallet address: 0x0855cDC18900245beCD493aa6591F87eDD10b9e8Edit: This post was made by hacker. The address doesn't belong to me.I recovered my account today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nadeem790",
      "created_time": "September 22, 2023, 07:10:55 AM",
      "body": "proof of authentication:Username:Nadeem790Bitcoin talk profile link: https://bitcointalk.org/index.php?action=profile;u=3577904Telegram Usename: @NaniwalaCampaign participated: Video, Article,twitter , telegram Bsc wallet: address:0x7b047813E58c8F70B15Db49357425B003D2e6AeF",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bellalhassan439",
      "created_time": "September 22, 2023, 07:49:06 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: Gegrasing780Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3577832;sa=forumProfileTelegram Username: @Siyam7867Participated Campaigns: Twitter, Telegram, Discord, Facebook BSC  Wallet Address: 0xaaF5A5CF1309c242Bc966F3a8ab3A8A962930124",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marketer03",
      "created_time": "September 22, 2023, 08:46:50 AM",
      "body": "Proof of Authentication PostBitcointalk Username: Marketer03Bitcointalk Profile Link: https://bitcointalk.org/index.php?action=profile;u=3572999Telegram Username: @saim_ali03Campaign Participated: Twitter, Telegram BSC Wallet Address: 0xBca8Cc958aECF273bBb2D6d5f98F014dd269132e",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mstarek",
      "created_time": "September 22, 2023, 09:00:31 AM",
      "body": "#Proof Of AuthenticationBitcointalk username: mstarekBitcointalk profile link: https://bitcointalk.org/index.php?action=profile;u=3473209Telegram username:@mstarekParticipating Campaigns: Twitter facebook telegram Instagram Discord, tik tok, youtube, article BSC address:  0x2CA96d3e915C70DeD6EC077f579057941635C4b0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jhontwis",
      "created_time": "September 22, 2023, 09:16:46 AM",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: jhontwisERC20 wallet address: 0x791fC571Fb950150B02C01CB859aA99197C3B1b0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tartibaya",
      "created_time": "September 22, 2023, 09:44:21 AM",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: tartibayaERC20 wallet address: 0x6C955085ea3a91447337DC4679626d2f2a42DBB9",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jameshugo17",
      "created_time": "September 22, 2023, 09:47:36 AM",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: jameshugo17ERC20 wallet address: 0x4c3f637168cb08DbE3e3Fc8ca2e05D9194E46246",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gulypz",
      "created_time": "September 22, 2023, 09:59:38 AM",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: gulypzERC20 wallet address: 0x791fC571Fb950150B02C01CB859aA99197C3B1b0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackAdamm",
      "created_time": "September 22, 2023, 10:01:22 AM",
      "body": "#Authentication PostType of campaign: TranslationBitcointalk Username: [BlackAdamm]Language: Turkish Portfolio link: https://docs.google.com/spreadsheets/d/149-gBPuue0W7y2BoZkDFWEiqkK__R2hVbT-Gv9WKzX4/edit?usp=drivesdkTelegram username: @BlackAdamm0ERC20 wallet address: 0xCb55c62d853765B122f33C28312E6432aaD6179B",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabbarlana",
      "created_time": "September 22, 2023, 10:07:17 AM",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: cabbarlanaERC20 wallet address: 0x6C955085ea3a91447337DC4679626d2f2a42DBB9",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannapulu",
      "created_time": "September 22, 2023, 10:11:45 AM",
      "body": "#Authentication PostType of campaign: SignatureBitcointalk Username: hannapuluERC20 wallet address: 0x4c3f637168cb08DbE3e3Fc8ca2e05D9194E46246",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simonhaba742",
      "created_time": "September 22, 2023, 10:33:08 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: simonhaba742Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3579517Telegram username: @CrlKvnParticipated Campaigns: Twitter, TelegramBSC Wallet Address: 0xb81de75ebff14cc2b639f36ae8df96df63d1b51a",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}