{
  "id": "topic_5407586",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "July 25, 2022, 02:15:28 PM",
  "content": "Un hacker ha puesto a la venta datos de 5,4M de cuentas Twitter, incluyendo el correo electrónico y el número de teléfono móvil asociado, aunque uno los tuviese ocultas en su perfil:Los datos se obtuvieron aparentemente explotando una vulnerabilidad ya reportada en enero 2022 y parcheada a los pocos días, por lo que no me queda claro si son datos que datan con anterioridad al parcheo, o si han logrado un nuevo camino de acceso.El caso es que, puestos a haber datos de esta naturaleza en circulación, no es descartable que alguien realizase con base a estos datos un intento de phishing, aprovechando conocer datos privados (para dar más credibilidad) y la existencia de una gran comunidad cripto en Twitter. No es que sea un hecho que seguro vaya a suceder, pero no es descartable…Ver: https://hive.blog/hive-120109/@goodmorningbtc/hackedtwitterdataof54muserslistedforsale-2u5qrk7ac9qnq91k8r9u",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407586",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "July 27, 2022, 01:13:43 AM",
      "body": "Ayer hice GS de esa noticia y la respuesta del buscador fue tímida en el resultados de las fuentes, hoy ya tiene resultados normales + millones   , y puedo decir que los datos corresponden a esa fecha, enero 2022 al menos en el marketing de venta, asì que de hackeo anteriores?, esa pregunta dejaremos para el comprador, pero se esta ofreciendo asì.QuoteAun así, la información ha estado antes en otras manos, las cuales ahora desean enriquecerse. Steven Taylor, de Restore Privacy ha comentado de su propia voz que se han estado comunicando con el malhechor para llegar a un acuerdo a la vez que para recopilar algo más de información.El cibercriminal demanda, al menos, 30.000€ por una base de datos antigua y fruto de una \"incompetencia de Twitter\". Su propuesta de venta se encuentra activa en Breachs Forums y desde la administración del foro se ha verificado que es un anuncio con información verídica.Fuente:https://internetpasoapaso.com/hacker-venta-datos-5-millones-cuentas-twitter/Aunque las fuentes confunden al tener sendos títulos como: Nuevo Hackeo pero luego enmiendan, pero como sucede ahora pareciera que todas se cuelgan del encabezado, y al menos varias web siguen el clásico \"Copy&Paste\".internetpasoapaso.com › Nuevo hackeo masivo a Twitter en plena crisis 】 2022Asì se muestran en los resultados de GS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 27, 2022, 03:25:36 AM",
      "body": "Si la empresa Twitter ya estaba en problemas después de que Elon Musk decidió cancelar su compra, ahora esta noticia será otro golpe bajo.Hay una forma para saber si hemos sido vulnerados en el pasado con este tipo de vulnerabilidades y esta es verificar nuestro correo en servicios como: https://haveibeenpwned.com/Tal vez muchos no lo saben, pero empresas viejas como Hi5 y MySpace, sufrieron ataques los cuales comprometieron a todos sus usuarios. Por esto es una buena práctica cambiar de contraseñas de vez en cuando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 27, 2022, 08:40:22 PM",
      "body": "Ví esta noticia hace unos días, gracias por dar la alerta, se trate de una vulnerabilidad reciente o una que ya ha sucedido hace meses esto tiene que ser un recordatorio para cualquier tenedor de Bitcoin de evitar utilizar el número de teléfono para la doble verificación de seguridad en página de exchanges (Twitter tiene ambos: una gran comunidad cripto y una base de datos gigante de números de teléfono).Si no fuese suficiente con los rumores de insolvencia y la banca rota de más de un exchange/cripto servicio de mediana reputación (Celsius), esto es otra razón más para retirar los satoshis a nuestras wallets personales. Si se hace trading, dejar solo lo necesario para las posiciones a corto plazo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 28, 2022, 08:16:10 AM",
      "body": "He mirado por encima en el foro donde se colgó esta BD (el hilo ya no está allí, pero Google sigue indexándolo), y hay una cantidad ingente de BDs de todo tipo allí colgadas, generalmente con ánimo de lucro, algunas de ellas relacionadas con el ámbito cripto de manera explícita como sería de esperar.Uno realmente debe asumir que tarde o temprano, datos personales de sus cuentas en negocios de toda índole van a ser hackeados, y tener ese chip puesto por defecto a fin de no bajar la guardia (sea en el ámbito cripto, el bancario u otros).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 28, 2022, 03:39:25 PM",
      "body": "Quote from: seoincorporation on July 27, 2022, 03:25:36 AM...//,,,,Hay una forma para saber si hemos sido vulnerados en el pasado con este tipo de vulnerabilidades y esta es verificar nuestro correo en servicios como: https://haveibeenpwned.com/+1Siempre de tener a la mano y verificar de cuando en cuando.Quote from: seoincorporation on July 27, 2022, 03:25:36 AM...//....,,,Tal vez muchos no lo saben, pero empresas viejas como Hi5 y MySpace, sufrieron ataques los cuales comprometieron a todos sus usuarios. Por esto es una buena práctica cambiar de contraseñas de vez en cuando.Dicen por aquí se te cayo la Cédula, esas son referencias únicas que llegan a nuestra memoria mientras escribimos   todavía no entiendo como el \"pueblo\" eligió a Facebook, es que hasta en eso, aunque el resultado no creo que hubiere sido diferente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}