{
  "id": "topic_5433525",
  "title": "LeGaulois",
  "author": "LeGaulois",
  "created_time": "January 08, 2023, 08:53:41 PM",
  "content": "Tel est le projet de loi déposé par les députés du groupe socialiste de l’Assemblée nationale (Proposition de loi n°672 visant à lutter contre les dérives des influenceurs sur les réseaux sociaux)Ce projet de loi ne concerne pas seulement la crypto à vrai dire, ca concerne un petit peu tout ce petit monde de délabrés cérébrales (apparemment, ca s'appel des \"influenceurs\"). Faut dire que, de ce que j'avais vu, entre faire de la pub pour se faire rénover la chatte, ou les femmes qui perdent leurs cheveux après avoir vu une pub pour shampoing, les arnaques CPF, ou de trading, ca mériterait bien un bon coup de pied dans la fourmilièreQuoteArt. L. 122‑27. – I. – Sont interdits, pour les personnes mentionnées à l’article L. 122‑26 [ndlr : les « influenceurs »], la promotion sur les réseaux sociaux des produits, prestations et actes suivants :(…) 2° Les placements ou investissements financiers et actifs numériques entraînant des risques de perte pour le consommateur ; (…) »https://journalducoin.com/bitcoin/bitcoin-prive-pub-proposition-loi-veut-interdire-promotion-cryptos/Y'en a qui vont bien trouver le moyen de chercher à débattre sur ce qu'est un influenceur.\"ah ben non, moi j'ai que 500k d'abonnés. Il faut au moins 1 million\"\"Je fais la pute juste pour un nombre restreint de personnes, 500k! Regardez lui là bas, il poste de la merde, il a plus d'abonnés que moi\"\" C'est Magali Berdah qui m'a dit faire ca, j'y peux rien\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433525",
  "comments": [
    {
      "author": "Halab",
      "created_time": "January 09, 2023, 09:41:00 AM",
      "body": "Vague de défenestration à venir à Dubai ? Mouais, en effet carrément interdire les cryptos c'est un peu rude. Un message du genre \"manger et bouger 5 fruits et légumes par jour, attention les cryptos c'est volatile, not a financial advice\" aurait été plus judicieux.Le plus triste dans tout ça c'est qu'il faille une loi, alors que juste l'utilisation de son cerveau suffit...En tout cas, si le sujet t'intéresse Nono a besoin de toi : https://dialogue-make.org/fr/concertation-influenceurs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 09, 2023, 12:00:46 PMLast edit: January 09, 2023, 12:12:40 PM by LeGaulois",
      "body": "Quote from: Halab on January 09, 2023, 09:41:00 AMOui à Dubai, dans des prisons dorées, mais quand il s'agit de se faire soigner, ou accoucher, on revient en France. Bah attend, ils ne sont pas dingues.Puis ces agences, elles ont fait leur beurre pendant des années sans se poser de questions. Maintenant que ca leur tombe sur la gueule, ils disent \"Aidez nous à encadrer cette profession!\" \"C'est un nouveau métier\" (alors que pas du tout, ca existe avant même l'invention de la télé)Je trouve ca fou d'avoir besoin de faire une concertation citoyenne pour quelque chose de simple à régler. Certes c'est une démarche démocratique mais ca fait un peu pitié. On dirait du \"on sait pas trop comment faire, alors on vous demande votre avis\".Sur quelque chose de pourtant simple à faire (et ce, sans que ca prenne des mois, voire des années), ils n'y arrivent pas. Ca promet pour des problèmes beaucoup plus complexe.la protection des consommateurs:Il suffit que ca soit règlementé de la même façon que les autres, c'est à dire suivre le code de la consommation.Et si besoin il y a, punir de la même façon.On va pas faire selon le produit/endroit ou tu l'as acheté. Autrement, on est parti pour faire des règlementations selon si tu as acheté ta baguette chez le boulanger, au supermarché, ou à un dépôt de pain.les droits et les obligations de l’influenceurSi il font la promotion d'arnaques, de produits dangereux, et autres trucs bizarre, ils faut qu'ils soient sanctionnés par la loi. Au même titre que les trucs IRL. C'est pourtant simple.Qu'est ce qu'il m'arriverait si je faisais de la pub pour du tabac ou de l'alcool? Ou si je faisais la promotion d'un ponzi? Je serai puni par la justice bien entenduLorsque j'avais cherché sur les RS, pour voir ce que faisait exactement ces influenceurs, j'ai halluciné, c'est que des SEGPA gogoles. Alors c'est ca la télé-réalité? Eh ben...Puis quand tu vois leur communauté (des gamins en grande majorité), tu te dis que la jeunesse est foutue, c'est la pénurie de QI.C'est la France de demain.Pour la crypto, il doit y avoir pas mal de merde également, entre les shitcoins, les scams, les ICOs stupides, etc... Au moins on en verrait plus.En tant que crypto-raciste, si j'en vois un faire la promotion d'autre chose que Bitcoin, je le balance.Et je pourrais peut etre même porter plainte en disant que cette personne a essayé de me laver mon cerveau et à chercher à m'entrainer dans des trucs obscures.(J'ai vu le drapeau européen, j'ai éteint la vidéo direct. J'en peu plus, à chaque fois j'ai la manie de regarder derrière, pour voir le mobilier et pour voir si ce drapeau est là. Je rumine à chaque fois. Le pire, c'est que je sais très bien qu'il va être là. Je suis tellement en overdose que je m'en servirais même pas comme paillasson)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 09, 2023, 12:46:10 PM",
      "body": "Ce n'est malheureusement pas une très bonne nouvelle pour le monde des cryptos francophone je trouve. Dans l'exposé des motifs de la proposition de loi, ils semblent clairement viser les cryptos en les listant en premier. QuotePire, des contenus destinés à la vente sont parfois plus problématiques que la promotion d’un simple rouge à lèvres : cryptomonnaies, opérations de chirurgie esthétique, produits de contrefaçon, produits du dropshipping[...], pronostics de paris sportifs, formations prises sur le compte personnel de formation (CPF) https://www.assemblee-nationale.fr/dyn/16/textes/l16b0672_proposition-loiJe ne connais pas du tout les influenceurs cryptos francophones, GW pourra peut-être nous donner quelques noms, mais ça veut dire concrètement que des mecs comme Hasheur ne vont plus pouvoir s'exprimer sur youtube, twitter et autre RS.Ces gens ne m'intéressaient pas particulièrement pour être honnête mais je pense qu'ils pouvaient avoir un rôle d'évangélisation auprès des adolescents et des jeunes adultes.En tous les cas, mettre les cryptos sur le même plan que les opérations de chirurgie et produits pharmaceutiques au niveau de leur dangerosité je trouve ça très exagéré. En général, les adolescents n'ont pas grand chose à perdre financièrement mis à part leur argent de poche.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Halab",
      "created_time": "January 09, 2023, 03:26:06 PM",
      "body": "Quote from: Saint-loup on January 09, 2023, 12:46:10 PMmais ça veut dire concrètement que des mecs comme Hasheur ne vont plus pouvoir s'exprimer sur youtube, twitter et autre RS.J'ai faillit poser la question au sujet d'Hasheur et consorts. Mais normalement, il n'entre pas dans la catégorie d'influenceur, car des personnes comme Nabilla ou Kim Kardashian ou d'autres que j'ai pû voir sont vraiment en mode \"allez-y mettez votre fric dans ce token à tête de chien, tkt, ça va faire *100\" et ils sont payés pour dire ça. Ca fait longtemps que j'ai regardé Hasheur, mais il n'est pas comme ça et il n'est pas payé. (Faut juste que ce ne soit pas retro-actif car il a quelques vieilles casseroles au cul.) QuoteCes gens ne m'intéressaient pas particulièrement pour être honnête mais je pense qu'ils pouvaient avoir un rôle d'évangélisation auprès des adolescents et des jeunes adultes.En tous les cas, mettre les cryptos sur le même plan que les opérations de chirurgie et produits pharmaceutiques au niveau de leur dangerosité je trouve ça très exagéré. En général, les adolescents n'ont pas grand chose à perdre financièrement mis à part leur argent de poche. Pour les ados oui, mais pour les jeune adultes j'ai des doutes. Dernièrement, j'ai eu l'occasion de parler avec 2 personnes, dont le jeune frère est à Malte et le fils sont dans les cryptos (ils sont dans la vingtaine tous les 2). Je n'ai donc pas parlé directement à ces personnes et mes 2 interlocuteurs (le grand frère et le père) n'y connaissaient rien du tout, mais ce frère et ce fils avaient l'air d'être plutôt en mode casino pour rouler ensuite en Lambo. Ont-ils été influencé par ces influenceurs ? Je ne sais pas, et ce n'est que 2 exemples donc il ne faut pas en faire une généralité, mais on est loin du DCA pépère pour préparer sa retraite. Mais voir les influenceurs de la télé-réalité en évangélisateur des cryptos auprès des jeunes, pitié non .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 09, 2023, 04:04:15 PM",
      "body": "Quote from: Halab on January 09, 2023, 03:26:06 PMQuote from: Saint-loup on January 09, 2023, 12:46:10 PMmais ça veut dire concrètement que des mecs comme Hasheur ne vont plus pouvoir s'exprimer sur youtube, twitter et autre RS.J'ai faillit poser la question au sujet d'Hasheur et consorts. Mais normalement, il n'entre pas dans la catégorie d'influenceur, car des personnes comme Nabilla ou Kim Kardashian ou d'autres que j'ai pû voir sont vraiment en mode \"allez-y mettez votre fric dans ce token à tête de chien, tkt, ça va faire *100\" et ils sont payés pour dire ça. Ca fait longtemps que j'ai regardé Hasheur, mais il n'est pas comme ça et il n'est pas payé. (Faut juste que ce ne soit pas retro-actif car il a quelques vieilles casseroles au cul.) C'est possible mais l'article parle de gens qui font \"la promotion directement ou indirectement de produits,\" \"contre rémunération, y compris lorsque celle‑ci est constituée par des avantages en nature\" sans autre précision. Est-ce que les rémunérations qu'il perçoit de sa (ou ses) sociétés entrent dans ce champ? Ca ne me semble pas impossible.En tous les cas, il semble bien être considéré comme influenceur au sens courant du terme. https://blogfr.influence4you.com/top-10-des-influenceurs-crypto/https://start.lesechos.fr/innovations-startups/portraits-innovateurs/les-influenceurs-a-suivre-pour-tout-comprendre-aux-cryptos-1409776QuoteArt. L. 122‑26. – Toute personne physique ou morale qui fait la promotion directement ou indirectement de produits, actes ou prestations contre rémunération, y compris lorsque celle‑ci est constituée par des avantages en nature, de manière active sur les réseaux sociaux et qui, par son statut, sa position ou son exposition médiatique dispose d’une audience pouvant influencer la consommation du public exerce l’activité d’influenceur.Quote from: Halab on January 09, 2023, 03:26:06 PMMais voir les influenceurs de la télé-réalité en évangélisateur des cryptos auprès des jeunes, pitié non .Ca fait un peu condescendant de dire ça mais pour moi l'élitisme va à l'encontre de la démocratisation, si on veut que Bitcoin soit adopté par la \"plèbe\", il faut se mettre à son niveau. Une monnaie, ca doit être utilisable par tout le monde, y compris par les gens les moins \"intelligents\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Halab",
      "created_time": "January 09, 2023, 04:27:40 PM",
      "body": "Quote from: Saint-loup on January 09, 2023, 04:04:15 PMC'est possible mais l'article parle de gens qui font \"la promotion directement ou indirectement de produits,\" \"contre rémunération, y compris lorsque celle‑ci est constituée par des avantages en nature\" sans autre précision. Est-ce que les rémunérations qu'il perçoit de sa (ou ses) sociétés entrent dans ce champ? Ca ne me semble pas impossible.En tout cas, les liens affiliés (\"cliquez sur mon lien, c'est pour aider la chaine\") ça va être fini.A voir comment ça va être régulé : au scalpel ou à la tronçonneuse.QuoteEn tous les cas, il semble bien être considéré comme influenceur au sens courant du terme. https://blogfr.influence4you.com/top-10-des-influenceurs-crypto/https://start.lesechos.fr/innovations-startups/portraits-innovateurs/les-influenceurs-a-suivre-pour-tout-comprendre-aux-cryptos-1409776Purée, à part Hasheur, j'en connais un ou deux de la liste de tes 2 articles. QuoteCa fait un peu condescendant de dire ça mais pour moi l'élitisme va à l'encontre de la démocratisation, si on veut que Bitcoin soit adopté par la \"plèbe\", il faut se mettre à son niveau. Une monnaie, ca doit être utilisable par tout le monde, y compris par les gens les moins \"intelligents\".Si Hasheur est l'élite, ça va, la barre est pas trop haute. C'est un bon vulgarisateur.Mais entre l'élite et le fond de cuve, on peut trouver un équilibre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elma",
      "created_time": "January 09, 2023, 08:52:39 PM",
      "body": "J'ai pas regardé dans le détail (surtout à partir de quel moment, on devient \"influenceur\") mais si je comprends bien, ils vont dézinguer des vulgarisateurs qui auront parlé de cryptos (ou de moules à gâteaux) ? Que les français, du coup ? Les \"étrangers\" peuvent continuer ?Ils vont tuer le p'tit commerce national !Et si l'influenceur/vulgarisateur est français mais crèche à Dubaï. Toujours pas le droit ?Rien qu'ici, parfois on peut être influenceur. Surtout dans la partie altcoin, moi le premier, j'ai joué de mon influence (pas immense, et devant une audience parfois très restreinte) en vous présentant des projets. Bien sûr, j'y croyais toujours. Mais on pourrait dire que je l'ai fait par intérêt personnel financier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rocou",
      "created_time": "January 10, 2023, 05:40:31 PM",
      "body": "Quote from: LeGaulois on January 09, 2023, 12:00:46 PMmais quand il s'agit de se faire soigner, ou accoucher, on revient en France. Hein? Mais pourquoi? Il faut être cons pour revenir en France pour s'y faire soigner avec le manque de médecins et les hôpitaux décrépits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 10, 2023, 09:25:28 PMLast edit: January 10, 2023, 09:36:28 PM by LeGaulois",
      "body": "Quote from: Rocou on January 10, 2023, 05:40:31 PMDit comme ca, je ne sais pas. Je me dis que de toute façon si il s'agit d'aller aux urgences, tu vas à l'hôpital le plus proche. Si tu fais un AVC par exemple, tu ne vas pas aller prendre l'avion pour venir en France. Si c'est pour faire des soins de maintenance/upgrade, ces gens doivent aller dans des cliniques privées, ou aller dans des pays dans l'UE. Avec la carte vitale grise, tu peux te faire soigner dans l'UE et être pris en charge par la CPAM de la même façon. (C'est des cartes valables 2 ans).En tout cas, ca reste un des principales arguments, avec celui des impôts.Regarde le prix d'un accouchement en France (séjour tout compris) par exemple (moyenne de 2400€ de ce que je lis), alors imagine aux Émirats arabes unis. Ca coute un sacré pognon de se faire soigner là-bas.(D'ailleurs si il fallait faire payer les gens de leur poche 2400€ à chaque gamin, je suis certains que les gens découvriraient l'existence du préservatif et la pilule, et ne feraient pas autant de gosses)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 10, 2023, 10:59:08 PMLast edit: January 10, 2023, 11:32:13 PM by Saint-loup",
      "body": "Quote from: elma on January 09, 2023, 08:52:39 PMJ'ai pas regardé dans le détail (surtout à partir de quel moment, on devient \"influenceur\") mais si je comprends bien, ils vont dézinguer des vulgarisateurs qui auront parlé de cryptos (ou de moules à gâteaux) ? Que les français, du coup ? Les \"étrangers\" peuvent continuer ?Ils vont tuer le p'tit commerce national !Et si l'influenceur/vulgarisateur est français mais crèche à Dubaï. Toujours pas le droit ?Rien qu'ici, parfois on peut être influenceur. Surtout dans la partie altcoin, moi le premier, j'ai joué de mon influence (pas immense, et devant une audience parfois très restreinte) en vous présentant des projets. Bien sûr, j'y croyais toujours. Mais on pourrait dire que je l'ai fait par intérêt personnel financier.C'est vrai tu as raison, cette loi ne change rien à la difficulté que beaucoup vivent et streament depuis l'étranger et sont difficilement atteignables par les règlementations françaises. Beaucoup bossent apparemment pour des sociétés françaises comme Shauna Events, ce qui permet de garder un certain levier sur eux je pense mais que se passera-t-il lorsque même ces sociétés de marketing seront installées là-bas?De toutes façons si ils sont condamnés par la justice française, la décision ne peut pas s'exécuter là-bas, il faut qu'ils soient recondamnés là-bas \"exequatur\" si on veut saisir leurs biens.Ce qui est très triste c'est qu'il me semble que la plupart des influenceurs cryptos francophones sont français et vivent en France eux...Pour ce qui est des critères, un décret d'application est prévu mais l'article de loi parle de disposer \"d’une audience pouvant influencer la consommation du public\" ce qui est un peu bizarre comme formulation, mais qui montre qu'il faut avoir quand même un certain niveau de notoriété.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elma",
      "created_time": "January 11, 2023, 06:35:05 PM",
      "body": "Quote from: Saint-loup on January 10, 2023, 10:59:08 PMPour ce qui est des critères, un décret d'application est prévu mais l'article de loi parle de disposer \"d’une audience pouvant influencer la consommation du public\" ce qui est un peu bizarre comme formulation, mais qui montre qu'il faut avoir quand même un certain niveau de notoriété.Encore une loi bien flouer et sujette à interprétation sur laquelle les juges se feront plaisir à faire de la jurisprudence. Jurisprudence qui bien sûr aura plusieurs versions bien différentes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rocou",
      "created_time": "January 11, 2023, 08:05:27 PM",
      "body": "Quote from: LeGaulois on January 10, 2023, 09:25:28 PMEn tout cas, ca reste un des principales arguments, avec celui des impôts.Regarde le prix d'un accouchement en France (séjour tout compris) par exemple (moyenne de 2400€ de ce que je lis), alors imagine aux Émirats arabes unis. Ca coute un sacré pognon de se faire soigner là-bas.(D'ailleurs si il fallait faire payer les gens de leur poche 2400€ à chaque gamin, je suis certains que les gens découvriraient l'existence du préservatif et la pilule, et ne feraient pas autant de gosses)Je n’ai jamais compris ce genre d’argumentation. Dans tous les pays du monde il existe des assurances santé. Il n’y a qu’en France où il ne s’agit pas d’une assurance mais un prélèvement basé sur les revenus  On ne paie jamais un accouchement nulle part sauf si on n’a pas pris d’assurance. C’est un choix.En France, la cotisation est prise de force, ailleurs on a davantage le choix, de ne pas prendre d’assurance ou de choisir une couverture à l’instar de ce que font les mutuelles françaises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 12, 2023, 12:19:34 AM",
      "body": "Ca sera du cas par cas, et j'ai presque envie de dire 'heureusement', parce que si c'est Non à tout ca deviendrait un vrai sac de nœuds.Dans ce cas, l'émission Crypto sur BFM TV, pourrait rentrer dans la case influenceurs, donc faudrait supprimer cette émission. De même que Capital ou autres sites/blogsJe ne sais pas si vous avez tilté mais ca concerne aussi tout ce qui est \"placements ou investissements financiers\". C'est très très large avec beaucoup de choses à inclure.Bon, je jette un raisonnement en prenant en compte les 2 côtésle problèmela solutioncomment appliquer.le problème:Beaucoup de gens se font avoir dans la crypto, que ce soit à travers des shitcoins, des ponzis, des services, des produits...La crypto c'est le far west, ou chacun fait ce qu'il veut, et en général l'humain n'as pas toujours des bonnes intentions.Il n'y a pas que dans la crypto que ca arrive, oui, (c'est sans doute pour ca qu'il y a d'ajouté \"placements ou investissements financiers\")Tu peux trouver des scams d'immobilier, de MLM (Salut à toi jeune entrepreneur. La question est vite répondue), des produits dangereux, des services...Est il légitime que l'Etat cherche à protéger les citoyens, les consommateurs?Que ce soit de la crypto ou autre investissement, là comme ca, je suis peut être méchant ou égoïste, mais j'ai envie de répondre\"Je m'en bas les couilles. Qu'ils se démerdent les gens. On ne va pas tout le temps leur mettre la cuillère à la bouche\"Bah c'est vrai quoi; on parle quand même d'argent et jusqu'à présent ca ne tombe pas du ciel. Les gens n'ont qu'a s'éduquer sur quoi ils foutent leur argent.Mais, si c'est quelqu'un de ta famille, c'est différent: par exemple si tu te rends compte que ton fils dépense son argent de poche dans des conneries tu vas mettre le hola, tu vas vouloir le protéger et peut être même le punir. Tu vas lui expliquer pourquoi c'est pas bien.Bon vous allez dire \"Mais l'Etat c'est pas mon père!\".Ca fait quoi, 50 ans que la ceinture est obligatoire en voiture. Cela, dans le but de nous protéger. A t'il été légitime que le pays nous protège en faisant ca. Oui. Même principe avec l'alcool au volant.Donc de façon général, oui il est légitime que l'Etat cherche à protéger les citoyens. Après on peut bien entendu débattre sur quoi, comment, ou.la solutionInterdire et punir ceux qui te portent préjudice (que ce soit à ta finance, à ta santé,etc...) Seulement sur internet, avec la crypto, pas facilePrévenir: c'est une question d'éducation et apprendre aux gens, mais comme je disais, c'est aux gens de se démerder. C'est quand même triste d'en arriver à un point ou c'est l'Etat qui doit t'apprendre comment gérer tes finances, ou te dire que tu es entrain d'investir dans une arnaqueC'est soit la crypto partout, ou soit la crypto nul part. Il faut être juste et que les règles soient les mêmes, peut importe le support, que ce soit un réseau social, un blog, une émission de télé ou un magazine. Et la je me contredis un peu sachant que je disais \"Crypto sur BFM TV, pourrait rentrer dans la case influenceurs, donc faudrait supprimer cette émission. De même que Capital ou autres sites/blogs\"Oui mais c'est quand même ca qui fait connaitre la crypto aux gens. En fait, y'a du bon et du mauvais, comme partout, et comme partout, faut éloigner les parasites.comment appliquer.c'est pas trop mon problème  Je paie des politiciens pour caPas très clair tout ca, je sais, je suis partagé mais j'aurais plutôt tendance à dire que c'est pas si mal (en considérant que le but est de protéger). Si le but est de nous priver (de liberté, de bitcoin, de ...) évidemment ce n'est pas la même choseQuoteOn ne paie jamais un accouchement nulle part sauf si on n’a pas pris d’assurance. C’est un choix. ben justement faudrait faire payer. Parait qu'on est trop sur Terre, et puis d'ou vient l'argent",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "January 12, 2023, 09:18:53 AM",
      "body": "Quote from: LeGaulois on January 12, 2023, 12:19:34 AMEst il légitime que l'Etat cherche à protéger les citoyens, les consommateurs?Que ce soit de la crypto ou autre investissement, là comme ca, je suis peut être méchant ou égoïste, mais j'ai envie de répondre\"Je m'en bas les couilles. Qu'ils se démerdent les gens. On ne va pas tout le temps leur mettre la cuillère à la bouche\"Bah c'est vrai quoi; on parle quand même d'argent et jusqu'à présent ca ne tombe pas du ciel. Les gens n'ont qu'a s'éduquer sur quoi ils foutent leur argent.Mais, si c'est quelqu'un de ta famille, c'est différent: par exemple si tu te rends compte que ton fils dépense son argent de poche dans des conneries tu vas mettre le hola, tu vas vouloir le protéger et peut être même le punir. Tu vas lui expliquer pourquoi c'est pas bien.Bon vous allez dire \"Mais l'Etat c'est pas mon père!\".Oui exactement. Peut-être que tu es plus mesuré parce que tu es plus vieux () mais là à chaud j'ai envie de dire, si ton fils déconne, ben tu prends tes responsabilités en tant que parent, l'état n'a pas grand chose à voir là-dedans. Mais après, je changerai peut-être d'avis le jour où j'aurai des gosses.Quote from: LeGaulois on January 12, 2023, 12:19:34 AMCa fait quoi, 50 ans que la ceinture est obligatoire en voiture. Cela, dans le but de nous protéger. A t'il été légitime que le pays nous protège en faisant ca. Oui. Même principe avec l'alcool au volant.Donc de façon général, oui il est légitime que l'Etat cherche à protéger les citoyens. Après on peut bien entendu débattre sur quoi, comment, ou.Avec une petite nuance tout de même : si tu conduis bourré, tu te mets en danger, mais surtout tu mets les autres en danger également, d'où l'interdiction qui me semble justifiée. Pour la ceinture, si tu ne la mets pas, j'ai envie de dire c'est toi qui vois, ça ne m'impacte pas. Même si au fond je ne suis pas contre l'obligation (parce que le bénéf en terme de sécurité est évident).Comme tu dis, oui, il est légitime que l'état cherche à protéger les citoyens, mais le débat est bien sûr nécessaire. Est-ce protéger les citoyens que d'interdire tout ce qui pourrait potentiellement faire perdre un peu d'argent aux plus crédules ? Est-ce protéger les citoyens que de les habituer à ce que l'état filtre tout ce qui est potentiellement dangereux, les incitant à se dire que \"si c'est autorisé, c'est que ça doit pas être une arnaque\" ?Donc oui, débat + voir au cas par cas... (Edit: cas par cas vis-à-vis du produit/service, mais un même traitement pour tous les supports/média)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elma",
      "created_time": "January 12, 2023, 04:52:41 PM",
      "body": "Pour la ceinture, si tu mets ta tête ou plus dans le pare-brise et que tu t'en sors, la reconstruction risque de coûter cher à la société, à la sécu, aux autres. Voilà aussi pourquoi l'Etat s'en mêle.Après, j'aime bien ton raisonnement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 27, 2023, 03:24:58 PM",
      "body": "Il y a des plaintes qui ont été déposé pour escroquerie en bande organisée par un collectif de victimes contre des influenceurs. Dont un mec qui faisait de la promo pour investir dans le trading crypto. \"j'ai tout pété avec Solana\" \"j'ai acheté des maisons et tout\" \"je vais essayer d'en acheter encore 10\"On les surnomme \"les Balkany de Dubaï\"Une des plaintes concerne aussi un projet de NFT (Animoon je crois) qui a fait un exit scam.Ca commence à prendre forme tout ca. Blata va difficilement s'en sortir. Je vois pas ce qu'il va pouvoir utiliser pour se défendre.Puis, surfer sur la culture arabo-musulmane pour faire du haram... encore un bon luiLes personnes accusées ont également eu leur compte Insta-snapchat suspendu.Avec le sourire qui va avec",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "April 23, 2023, 11:39:02 PM",
      "body": "L'amendement a été finalement rejeté à l'Assemblée nationale. C'est bon, plus besoin d'être en sueur...Encore un autre casJe vois comme titre dans ma feed \"Nounours et cryptomonnaies à Dubaï\". Je me dis \"qu'est ce que c'est que cette histoire de nounours\" Quelque 700 investisseurs ont perdu plus d’un million d’euros dans le projet de film d’animation « Plush », promu par la star Kev AdamsDes trucs de NFT de nounours   Y'a plus rien qui va dans ce pays.C'est un article payant, mais vous pouvez regarder cette vidéo qui résume la chose.Des gens, appelé influenceurs faisant des pubs pour une arnaque. Y'en a un qui est bien connu. Surtout des jours ci...- \"Vous allez ruiner des gens!\"- \"Mais non frérot... on va ruiner personne...\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}