{
  "id": "topic_5489443",
  "title": "Vincom",
  "author": "Vincom",
  "created_time": "March 19, 2024, 12:57:40 AMLast edit: March 19, 2024, 01:07:43 AM by Vincom",
  "content": "The concept of tokenization has been around since 2017. It essentially involves creating digital tokens on a blockchain that represent ownership rights in real-world assets. This \"on-chain\" approach facilitates easier exchange and trading, ultimately increasing the asset's liquidity [1]. This innovation has grabbed the attention of traditional financial giants like JPMorgan and BlackRock, fueling the RWA trend within the crypto market [2, 3]. Initially, the focus was on tokenizing securities for smoother trading.A surprise twist: instead of tokenizing securities, we've seen the securitization tokens with the launch of the BTC spot ETF in January [4]. This innovation allows traditional investors to easily purchase exposure to Bitcoin through ETF, bypassing the complexities of directly acquiring and storing BTC themselves. The BTC spot ETF has unlocked tens of billions of dollars in investment from traditional markets, fueling a surge in the price of Bitcoin. Notably, even though these ETF providers are currently acquiring their Bitcoin on the OTC market, the impact on the broader market is undeniable. As the price of Bitcoin rises, the entire crypto market expands, creating opportunities for crypto investors to profit.Larry Fink, CEO of BlackRock, once said: \"ETFs are step one in the technological revolution in the financial markets. Step two is going to be the tokenization of every financial asset\" [5], but if in the future, most securities can be tokenized, then BTC spot ETF can also be tokenized. Then we will have a crazy value chain: value (energy) => tokenization (BTC) => securitization (BTC spot ETF: IBIT, FBTC, HODL...) => tokenization (BTC spot ETF token: IBIT token, FBTC token, HODL token...).Tokens reverting to just tokens - a red flag for the market. While we envision integrating crypto into the stock market through tokenized securities, established financial institutions are already weaving traditional securities into the crypto market with a BTC spot ETF. It's worth noting that some crypto investors see the BTC spot ETF as a sign of Bitcoin's progress. However, I believe it might be a strategic move by the stock market to establish itself within the crypto sphere, potentially steering investors towards BTC spot ETF rather than encouraging them to understand blockchain technology and self-custody their Bitcoin. Could BTC Spot ETF be Wall Street's Trojan horse?I would like to know your opinion on this issue:Do you support securitization or tokenization?BTC spot ETF is the maturity or degeneration of BTC?Does BTC spot ETF have any negative impact on BTC and the crypto market?References:[1] Tokenization: Real World Assets, Real World Benefits[2] JPMorgan debuts tokenization platform, BlackRock among key clients: Report[3] The Rise of Real World Asset Tokenization (RWA): Unlocking Asset Liquidity[4] Spot Bitcoin ETFs Explained: Everything You Need to Know[5] BlackRock’s Larry Fink says bitcoin ETFs are just the first step in the technological revolution of finance",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5489443",
  "comments": [
    {
      "author": "notocactus",
      "created_time": "March 19, 2024, 01:29:28 AM",
      "body": "Currently, there is no tokenized of Bitcoin Spot ETFs, they are shares on stock market.If there is anything to be deployed for tokenization of Bitcoin Spot ETF shares, it will not be different than Wrapped tokens. In cryptocurrency market, we have many Wrapped Bitcoin tokens (altcoins) and it already happened some years ago.Having Bitcoin Spot ETFs is a big achievement for Bitcoin community as we are already invaded further into TradFi (Traditional Finance) and we have less worry about accusations, attacks like Bitcoin is a fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "March 19, 2024, 07:05:08 AM",
      "body": "QuoteA surprise twist: instead of tokenizing securities, we've seen the securitization tokens with the launch of the BTC spot ETF in January [4]. This innovation allows traditional investors to easily purchase exposure to Bitcoin through ETF, bypassing the complexities of directly acquiring and storing BTC themselves. The BTC spot ETF has unlocked tens of billions of dollars in investment from traditional markets, fueling a surge in the price of Bitcoin. Notably, even though these ETF providers are currently acquiring their Bitcoin on the OTC market, the impact on the broader market is undeniable. As the price of Bitcoin rises, the entire crypto market expands, creating opportunities for crypto investors to profit.Are you suggesting that Bitcoin is a token? I don't get the whole point of your forum thread. Are you complaining about the Bitcoin spot ETFs? Are you one of the people, who think that Blackrock and the institutional investors will \"take control over Bitcoin\" via the ETFs? I guess that this is your main thesis here.Bitcoin spot ETFs are just financial derivatives. They don't change how the Bitcoin blockchain works. They can only influence the BTC price.If the ETFs help in pumping the price everyone is happy. If another bearish market occurs, I can assume that most Bitcoiners will start b*tch and complain about the ETFs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 19, 2024, 08:08:33 AM",
      "body": "Quote from: Vincom on March 19, 2024, 12:57:40 AMThe BTC spot ETF has unlocked tens of billions of dollars in investment from traditional markets, fueling a surge in the price of Bitcoin. Notably, even though these ETF providers are currently acquiring their Bitcoin on the OTC market, the impact on the broader market is undeniable.I disagree. As you've already guessed ETF guys don't go on the usual centralized exchanges to purchase bitcoin to be able to affect the price like the way you described. Additionally they don't constantly buy bitcoin to be able to contribute to the constant rise. Instead they make bulk purchases every time they want to offer for of their ETF crap to more people who sign up. That means even if they were to affect the market, their effect should be instant and one time only not a constant rise over weeks or months.It would be like saying \"a whale that made a one time purchase of something like 10000BTC is the reason for the rally that lasted 2 months\"! Such one time purchase could shock the market and cause a rise in a couple of hours but it won't last for 2 months.At the end of the day, the rise that we saw (from $30k to $60k in 4+ months) is the result of actual money coming into the real market purchasing real bitcoins not the money that goes into ETF purchasing IOUs. One of the major reasons for it is the upcoming halving.In any case I like you title when you refer to ETF as a trojan horse but I don't really agree with the rest of your topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 19, 2024, 09:26:59 AM",
      "body": "Quote from: Vincom on March 19, 2024, 12:57:40 AMDo you support securitization or tokenization?It all depends on the adopted mode of application to these, if it will not create a loophole to the expected security measures and privacy of every users then its as a good and welcomes idea to see into action, what people needs is their privacy and any modification that will renders such into vulnerable is as better as nothing. Quote from: Vincom on March 19, 2024, 12:57:40 AMBTC spot ETF is the maturity or degeneration of BTC?We shouldn't get it all wrong, they are both for the growth and development of the bitcoin network, but we must not forget that bitcoin spot ETF have to depend on bitcoin market price and these has no any negative impact on the way of expectations to the market performance of bitcoin. Quote from: Vincom on March 19, 2024, 12:57:40 AMDoes BTC spot ETF have any negative impact on BTC and the crypto market?No",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 19, 2024, 07:23:20 PM",
      "body": "Quote from: Vincom on March 19, 2024, 12:57:40 AMDo you support securitization or tokenization?BTC spot ETF is the maturity or degeneration of BTC?Does BTC spot ETF have any negative impact on BTC and the crypto market?I don't support any innovation that is that has the potential of distorting the natural operations of Bitcoin. The coin is designed to be a decentralized currency that should be used without intermediaries.Bitcoin ETF has attracted so much publicity and money to the Bitcoin industry but as you rightly pointed out it might be a Trojan horse. It is because it moves people to centralisation thereby defeating the purpose of Bitcoin. These institutions have the funds to carry out expensive and captivating commercials that will make people gradually forget that they can buy real Bitcoin without any intermediary. Some people believe that these rich investors will soon have the power to manipulate the market at will. They might be able to create FUD or FOMO but the impact will be minimal and short. Quote from: Vincom on March 19, 2024, 12:57:40 AMThis innovation allows traditional investors to easily purchase exposure to Bitcoin through ETF, bypassing the complexities of directly acquiring and storing BTC themselves. I don't know the process of buying Bitcoin Shares through any ETF but I don't think buying Bitcoin directly and storing it is that complex. Anybody who can handle am online banking app can comfortably manage a Bitcoin wallet. [/list]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "InCap Live",
      "created_time": "March 19, 2024, 08:12:02 PM",
      "body": "Allowing people to buy ETF shares is a big victory for Bitcoin, with many new people and dollars flowing in. A percentage of those investors will eventually be interested in learning more about owning and protecting real BTC. Fees and \"paying the higher prices for each transaction\" will make great income for the ETF companies, and help motivate the savvy investors to start looking for better ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "March 19, 2024, 08:14:25 PM",
      "body": "Quote from: Die_empty on March 19, 2024, 07:23:20 PMQuote from: Vincom on March 19, 2024, 12:57:40 AMDo you support securitization or tokenization?BTC spot ETF is the maturity or degeneration of BTC?Does BTC spot ETF have any negative impact on BTC and the crypto market?I don't support any innovation that is that has the potential of distorting the natural operations of Bitcoin. The coin is designed to be a decentralized currency that should be used without intermediaries.Bitcoin ETF has attracted so much publicity and money to the Bitcoin industry but as you rightly pointed out it might be a Trojan horse. It is because it moves people to centralisation thereby defeating the purpose of Bitcoin. These institutions have the funds to carry out expensive and captivating commercials that will make people gradually forget that they can buy real Bitcoin without any intermediary. That is definitely possible but I think even with much effort, it won’t get that far.There are a lot of investors who were against ETFs but I think it helps to propel theprice upward but it does not mean I will be favoring centralized way of purchasing bitcoin than its counterpart. I believe that a lot of people feel the same way. From an investor’s point of view, the emergence of ETFs is a good thing allowing more people to buy bitcoin. It’s not that they can’t buy it themselves but rather it’s the thought ofhaving a trusted, credible and reliable place to buy bitcoin in is what makes them favor ETFs. With this in mind, I hope bitcoin becomes mainstream enough that we can go back to itsoriginal purpose which is to become a payment method through a peer to peer transaction. [/list]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vincom",
      "created_time": "March 19, 2024, 10:11:51 PM",
      "body": "Quote from: pooya87 on March 19, 2024, 08:08:33 AMI disagree. As you've already guessed ETF guys don't go on the usual centralized exchanges to purchase bitcoin to be able to affect the price like the way you described. Additionally they don't constantly buy bitcoin to be able to contribute to the constant rise. Instead they make bulk purchases every time they want to offer for of their ETF crap to more people who sign up. That means even if they were to affect the market, their effect should be instant and one time only not a constant rise over weeks or months.It would be like saying \"a whale that made a one time purchase of something like 10000BTC is the reason for the rally that lasted 2 months\"! Such one time purchase could shock the market and cause a rise in a couple of hours but it won't last for 2 months.At the end of the day, the rise that we saw (from $30k to $60k in 4+ months) is the result of actual money coming into the real market purchasing real bitcoins not the money that goes into ETF purchasing IOUs. One of the major reasons for it is the upcoming halving.In any case I like you title when you refer to ETF as a trojan horse but I don't really agree with the rest of your topic.BTC spot ETF has a real impact on BTC price and the entire crypto market, I believe it is the reason that created a new history for BTC when we have a new ATH before Halving. Besides the media impact, although the money flow into Spot ETF does not directly create buying pressure on CEXs, it has a positive impact on price volatility through many ways and stages. I will probably present this in a separate topic in the future for us to discuss.Even though I see such a positive impact, I still realize that Spot ETF is eroding the core value of BTC, which is the self-custody of assets that Satoshi always encouraged: ordinary investors choose not to buy BTC but buy spot ETF, and the storage of BTC is entrusted to large investment funds, and these funds become intermediaries that manage and charge fees from investors. That is clearly not what I want for the development of the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "March 20, 2024, 07:15:56 PM",
      "body": "I don't think there's any risk here and no threat to bitcoin from ETFs. Ultimately we can't stop someone from buying. If ETFs want to buy bitcoin and people want to buy ETF shares, the market is working as intended. Even if they buy a lot of bitcoin the only concern I might have is what happens if they go bankrupt or lose it? People's lives will be destroyed and they could easily choose self-custody and have the same profit with much more safety.ETFs pump price, so I can't say no to that. They also popularize bitcoin in the media. Would you buy time on national TV to advertise bitcoin? I guess not, but ETFs do. They not only talk good about their funds but also about the underlying asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vincom",
      "created_time": "March 22, 2024, 12:13:58 AM",
      "body": "Quote from: coolcoinz on March 20, 2024, 07:15:56 PMI don't think there's any risk here and no threat to bitcoin from ETFs. Ultimately we can't stop someone from buying. If ETFs want to buy bitcoin and people want to buy ETF shares, the market is working as intended. Even if they buy a lot of bitcoin the only concern I might have is what happens if they go bankrupt or lose it? People's lives will be destroyed and they could easily choose self-custody and have the same profit with much more safety.ETFs pump price, so I can't say no to that. They also popularize bitcoin in the media. Would you buy time on national TV to advertise bitcoin? I guess not, but ETFs do. They not only talk good about their funds but also about the underlying asset. We all see the positive impact of BTC spot ETFs, but the negative impacts will always exist alongside them. As I mentioned in the topic, I am worried that the BTC market or the crypto market may be invaded by large institutions in the traditional financial market and the values of Bitcoin may be forgotten when investors are encouraged to participate in owning spot ETFs instead of self-custody BTC.BTC was created by Satoshi with the purpose of decentralizing financial instruments in the economy, but spot ETFs are making the opposite happen. I understand that everyone is equal in participating in and using the Bitcoin network, but what BTC spot ETFs offer may go against the decentralized value of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 22, 2024, 01:51:29 AM",
      "body": "First off, tokenization has been around before 2017. In a sense, we can consider it a Trojan horse. After all, with this offer, the market is attracted to it, an option that is completely centralized, off the chain, with a number of layers of middlemen, in custody, and so on. Furthermore, the full sense of ownership, control, transparency, and others are also compromised. This is the same market which should have been convinced of the philosophies of Bitcoin.All in all, what's being compromised with the advent of spot Bitcoin ETFs are no less than the main principles of Bitcoin. There's no more peer-to-peer with spot Bitcoin ETFs. Bitcoin is money no more. Quote from: tranthidung on March 19, 2024, 01:29:28 AMHaving Bitcoin Spot ETFs is a big achievement for Bitcoin community as we are already invaded further into TradFi (Traditional Finance) and we have less worry about accusations, attacks like Bitcoin is a fraud.May be true, may be not. But we can also say that with spot Bitcoin ETFs it is traditional finance that's invading Bitcoin. There are compromises from both sides.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vincom",
      "created_time": "March 22, 2024, 10:55:33 PM",
      "body": "Quote from: Darker45 on March 22, 2024, 01:51:29 AMFirst off, tokenization has been around before 2017. In a sense, we can consider it a Trojan horse. After all, with this offer, the market is attracted to it, an option that is completely centralized, off the chain, with a number of layers of middlemen, in custody, and so on. Furthermore, the full sense of ownership, control, transparency, and others are also compromised. This is the same market which should have been convinced of the philosophies of Bitcoin.All in all, what's being compromised with the advent of spot Bitcoin ETFs are no less than the main principles of Bitcoin. There's no more peer-to-peer with spot Bitcoin ETFs. Bitcoin is money no more. May be true, may be not. But we can also say that with spot Bitcoin ETFs it is traditional finance that's invading Bitcoin. There are compromises from both sides. There's no such thing as a free lunch BlackRock and other ETF providers have been trying very hard to get spot BTC ETFs, their purpose is to profit from the management fees of traditional investors. They want BTC to come to the traditional market, not to bring traditional investors to the crypto market to buy and custody BTC themselves. They don't care about the decentralization or self-custody of Bitcoin!The positive impact of spot BTC ETFs is very clear, and we have to trade off some of the risks and potential of the crypto market to get it. I hope that we are not too naive and spot ETFs can really help BTC and the crypto market develop in the long term with more users and new money flow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "March 22, 2024, 11:02:21 PM",
      "body": "Quote from: coolcoinz on March 20, 2024, 07:15:56 PMI don't think there's any risk here and no threat to bitcoin from ETFs. For now, there's no foreseeable risk or threat to bitcoin, we all know how sneaky the banks are when it comes to finances and I don't think that they're any different when it comes to bitcoin ETF, they're probably figuring out how to make the most money out of it while at the same time giving the people that have invested in bitcoin and their ETFs the illusion that it's in our favor, I'm sure that they're doing that even though it's just a theory, I think that it's an illogical thing for them to do if they let things be and not do anything about it, at least that's my take on this one. In regards to the question of OP if this is a maturization or degeneration of BTC, I think that it's a maturization, the degeneration part is the ordinals and inscriptions that's causing the transaction fees more expensive than usual, anything that improves bitcoin to me is a maturization, the opposite would always be degeneration or downgrade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "March 22, 2024, 11:24:41 PM",
      "body": "Quote from: Vincom on March 19, 2024, 12:57:40 AMBTC spot ETF is the maturity or degeneration of BTC?It can't be called degeneracy because Satoshi and Core developers didn't put any features in Bitcoin that would prevent centralized use of it. The very nature of Bitcoin allows such use. There nothing anyone can do to stop insitutions from buying BTC and locking it in ETF. So it's rather a sign of maturity, that Bitcoin survived long enough to be recognized by the mainstream economy as a valuable asset and not a temporary mania. And it's possible to theorize about negative effects of centralization of a large part of supply, but it's important to take a step back and remember that everyone is free to use Bitcoin however they like, including selling it to ETFs. Because ETFs can't really tell you how to use your coins either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "March 23, 2024, 02:24:52 AM",
      "body": "Quote from: Vincom on March 19, 2024, 12:57:40 AMI would like to know your opinion on this issue:Do you support securitization or tokenization?BTC spot ETF is the maturity or degeneration of BTC?Does BTC spot ETF have any negative impact on BTC and the crypto market?I neither support the securitization or tokenization of BTC. It makes Bitcoin look like a product or investment tool instead of a currency. The approval of spot ETFs is certaintly the degeneration of BTC as it integrates itself into the corrupt financial system it was meant to replace in the first place. Large institutional investment companies will acquire all of the BTC (or most of it), leaving us with no ability to self-custody our coins (therefore increasing centralization). The network itself will remain decentralized, though. Only if most of the miners and node operators aren't owned by institutions, governments, and/or companies. Price-wise, ETFs are good for Bitcoin because they add greater demand on the market. But they're bad because of the reasons mentioned earlier. Everybody wants to make money, so no one will care if BTC becomes centralized as long as they turn a profit. The future is not as bright as we thought it would be. Lets enjoy the ride while it lasts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "March 23, 2024, 04:33:11 AM",
      "body": "IMO, the BTC spot ETF creates a historic milestone for bitcoin and the cryptocurrency market. This event is bringing a lot of positive changes by the time it is confirmed.1. yep2. the maturity3. I think that negativity is only due to the perspective of looking at the problem, the reality is that there are problems associated with any subject but we are in an exciting market phase so the positivity prevails more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "InCap Live",
      "created_time": "March 23, 2024, 02:51:55 PM",
      "body": "Quote from: hatshepsut93 on March 22, 2024, 11:24:41 PMQuote from: Vincom on March 19, 2024, 12:57:40 AMBTC spot ETF is the maturity or degeneration of BTC?It can't be called degeneracy because Satoshi and Core developers didn't put any features in Bitcoin that would prevent centralized use of it. The very nature of Bitcoin allows such use. There nothing anyone can do to stop insitutions from buying BTC and locking it in ETF. So it's rather a sign of maturity, that Bitcoin survived long enough to be recognized by the mainstream economy as a valuable asset and not a temporary mania. And it's possible to theorize about negative effects of centralization of a large part of supply, but it's important to take a step back and remember that everyone is free to use Bitcoin however they like, including selling it to ETFs. Because ETFs can't really tell you how to use your coins either.You nailed it hatshepsut93! Please give this person some rep if you can. BTC is supposed to be about freedom and people can voluntarily participate in centralized activities and institutions if they want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vincom",
      "created_time": "March 24, 2024, 09:53:02 PM",
      "body": "Quote from: Abiky on March 23, 2024, 02:24:52 AMI neither support the securitization or tokenization of BTC. It makes Bitcoin look like a product or investment tool instead of a currency. The approval of spot ETFs is certaintly the degeneration of BTC as it integrates itself into the corrupt financial system it was meant to replace in the first place. Large institutional investment companies will acquire all of the BTC (or most of it), leaving us with no ability to self-custody our coins (therefore increasing centralization). The network itself will remain decentralized, though. Only if most of the miners and node operators aren't owned by institutions, governments, and/or companies. Price-wise, ETFs are good for Bitcoin because they add greater demand on the market. But they're bad because of the reasons mentioned earlier. Everybody wants to make money, so no one will care if BTC becomes centralized as long as they turn a profit. The future is not as bright as we thought it would be. Lets enjoy the ride while it lasts.We are seeing the positive impacts of spot BTC ETFs on the entire crypto market, and we enjoy this because we are making a profit from the price increase of the tokens. As you said, things could get worse when BTC becomes a financial instrument like others in the hands of the Wall Street wolves, and we will only be like sheep and be deprived of the core values of Bitcoin that Satoshi tried to build. I'm afraid that at some point, the majority of BTC will be held in ETFs instead of being self-custody by real users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "March 26, 2024, 12:53:54 PM",
      "body": "Quote from: Vincom on March 24, 2024, 09:53:02 PMWe are seeing the positive impacts of spot BTC ETFs on the entire crypto market, and we enjoy this because we are making a profit from the price increase of the tokens. As you said, things could get worse when BTC becomes a financial instrument like others in the hands of the Wall Street wolves, and we will only be like sheep and be deprived of the core values of Bitcoin that Satoshi tried to build. I'm afraid that at some point, the majority of BTC will be held in ETFs instead of being self-custody by real users.Well, institutional investment companies have only been able to acquire around 1℅ of the circulating supply (particularly BlackRock). The rest is held by centralized exchanges, and self-custodied wallets. People just need to stop selling their coins to these entities to avoid monopolizing BTC in the long run. Selling P2P or F2F (Face-to-Face) to another person ensures Bitcoin remains an equitable cryptocurrency for all. As long as the core Blockchain network remains decentralized, there should be nothing to worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}