{
  "id": "topic_5412508",
  "title": "RockBell",
  "author": "RockBell",
  "created_time": "September 05, 2022, 08:03:34 PM",
  "content": "My passion for Bitcoin and Bitcointalk led me to host a Bitcoin Live session at the radio station where I work on September 1st, the first Ember month of 2022. I am a radio presenter, and I anchor night rides, entertainment talks about politics, movies, and current issues in the country, and I also pick calls sessions where listeners call in and ask questions or answer questions when asked, and I sometimes do giveaways to encourage more people to join the session.Bitcoin has gotten a lot of attention over the years, but many people still don't understand the basics of Bitcoin and crypto in general. Since joining this forum, I've been conducting research, and whenever groups of young talented adults discuss crypto, the arguments they present sometimes differ from what I'm learning.Our parents have always wondered what Bitcoin is and why the youths see it as a new dimension of niche, while others believe it is a Ponzi scheme that will one day run away with people's money, just as they have suffered at the hands of previous Ponzi schemes such as MMM and Racksterli, which have gup down people's millions.I sat down and thought about what I could do to educate our community about Bitcoin so that people would not be afraid of it and how they could learn more about it. I discussed it with my Managing Director, who was pleased with the idea, and I drafted out how I will be discussing Bitcoin with the locals.The draft of my Bitcoin Discussion.This was the discussion topic I drafted, and it was approved by the manager the day before I went live. He's heard of bitcoin, and to persuade him further, I set up a wallet for him just to prove what I'm proposing is real, and I'm glad he accepted. He cautioned me not to delve too deeply into Bitcoin as an alternative form of payment because he does not want our radio station to be shut down by the government or to irritate top officials. However, I did a small amount because the truth about bitcoin needs to be heard.When I was on the air at the radio station, I was talking about my table of contents during the evening session.Some images I took during my presentation in the studio with the help of my partner, who is more into music and DJing; he had to allow me to do bitcoin discussion alone after we had the parental guide session. He also knows a little about bitcoin and already has an account with some exchanges such as Binance and Quidax. He stayed and listened the entire time at the other end. I didn't include his pictures due to privacy reasons.Following the discussion of my draft, we received one-on-one calls from the parents and youths. They called, and I asked their names, allowing them to ask any bitcoin-related questions they had, and I noted some of them:QUESTIONS FROM THE PARENTS- Is Bitcoin secured and how do you earn from it?ANSWER: Bitcoin was the first coin created, and it has never been hacked in terms of security, it is highly secure. It is a peer-to-peer network that is heavily defended by trusted people from around the world, and a single person cannot successfully attack the network. Its network has been operational for over ten years and is still functioning properly. In fact, it is growing on a daily basis because the network hash rate has reached an all-time high, implying that more people are flocking to protect the bitcoin network.Bitcoin could be earned when it was still in its early stages but now, you can only earn as a miner, but you can buy a small amount and hold it.- Is Bitcoin only for young people?ANSWER: Bitcoin is for everyone; you can buy it and give it to anyone you want, and you can buy it as a special gift for your old people and children and keep it for them until they reach the age of maturity.- Can someone manage it for you (since they are always kind of busy)No, don't give anyone access to your bitcoin. Take bitcoin and handle it as carefully as you would your debit card pin; bitcoin should be treated as if it were a secret you were taking to the grave.- Asked about the legality of BitcoinBitcoin is not yet legal in the country, nor is it illegal; however, due to political nepotism, banks have been prohibited from enabling bitcoin transactions. I advise them to use peer-to-peer because it is the only way to buy bitcoin right now.QUESTIONS ASKED BY YOUTHS -what is the least amount you can start with?       ANSWER: You can buy bitcoin of any amount but some p2p recommends a minimum of $10 which is around #7,000      -what are the advantages of being on bitcointalk and how to be a member?      ANSWER: Bitcointalk is just like any other forum, like Nairaland (Nigeria's largest forum), where you can learn more about bitcoin, ask questions about bitcoin, and get answers to questions you don't understand. You also meet people from other countries, and there are Nigerians who participate in the forum.      - Differences between wallet and exchange.      ANSWER: An exchange is a place where you people trade, you can buy and sell bitcoin there but don't store your bitcoin on exchanges. Always hold your bitcoin on a personal wallet and make sure you have the private key well protected from the public.Many questions were raised, but time was limited; however, I told them a free class will be held soon for those who are interested.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412508",
  "comments": [
    {
      "author": "_act_",
      "created_time": "September 05, 2022, 08:18:51 PM",
      "body": "Quote from: RockBell on September 05, 2022, 08:03:34 PMBitcoin could be earned when it was still in its early stages but now, you can only earn as a miner, but you can buy a small amount and hold it.Why small amount? I would prefer to have my money in bitcoin after a significant bear market, the best time to buy bitcoin. Well, I can accept that people should buy small amount, but they should know that bitcoin is a speculative asset and can be a store of value and a hedge against inflation if holding it for a long period of time.People can speculate, buy bitcoin and still earn more money from it, a way to invest in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "September 05, 2022, 08:38:55 PM",
      "body": "Quote from: _act_ on September 05, 2022, 08:18:51 PMQuote from: RockBell on September 05, 2022, 08:03:34 PMBitcoin could be earned when it was still in its early stages but now, you can only earn as a miner, but you can buy a small amount and hold it.Why small amount? I would prefer to have my money in bitcoin after a significant bear market, the best time to buy bitcoin. Well, I can accept that people should buy small amount, but they should know that bitcoin is a speculative asset and can be a store of value and a hedge against inflation if holding it for a long period of time.People can speculate, buy bitcoin and still earn more money from it, a way to invest in bitcoin. First of all, this is one of Nigeria radio station where I work.People see Biitcoin is high risky investment, so many of them due to lack of misunderstanding and orientation,introducing it to a bigginer you need to let them know it bit by bit and help them master how the volatility affect price.You don't explain bitcoin to people and tells them to go put all their life savings, that's not how adoption works and again, remember this is a live show which you need to apply caution and sense so that I don't end up jeopardizing myself and the people I work with.Always apply caution to people that are new to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 05, 2022, 08:45:38 PM",
      "body": "Nigeria with its teeming population of young and middle aged individuals has the potential to champion the blockchain revolution globally. Despite the government's unfriendliness towards digital currencies, P2P trades are still high and businesses still operate with cryptocurrencies.Well written table of content and also good answers to the questions raised. If I'm to put in any suggestions, it would be that I do not really see any benefit in Bitcoin as a legal tender. It doesn't have to replace fiat and can function conveniently as an alternative currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "September 05, 2022, 09:21:39 PM",
      "body": "I wish I had some merits to send. I admire your zeal to spread Bitcoin to the masses, by doing so you put your voice and following to good use. You gave good answers to the questions, usually when people hear about such things on radio, it's usually about real estate, investment opportunities mostly pyramid schemes, forex trading e.t.c. It will be nice if the radio can give you a show to talk about Bitcoin and cryptocurrency, it could be a 20 minute Bitcoin segment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "September 05, 2022, 11:57:46 PM",
      "body": "More ways of spreading about the word of bitcoin is happening all around. In particular Nigeria takes the lead and what the person have done is good. This will create awareness and keep the people away from fear. Many people will be having interest to invest/trade with cryptocurrency, but the lack of proper understanding and fear about the government keeps them restricted. Hope Nigeria will serve as an example to the young generation to its neighbouring countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 06, 2022, 12:14:29 AM",
      "body": "Quote from: RockBell on September 05, 2022, 08:03:34 PMMy passion for Bitcoin and Bitcoin talk led me to host a Bitcoin Live session at the radio station where I work Great Job OP! you hold such an important and powerful position, a position that can be leveraged on to share information to thousands of people as the radio still remains one of the most efficient tools for communication and it attracts and gets through to people even in the very rural areas, where other forms of media can't get to. I advocate for more live sessions if possible, we all need to keep sharing this good news of bitcoins to every ear willing to hear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 06, 2022, 09:36:38 AM",
      "body": "I believe you've done alot in making that show a reality and i see alot benefiting from that you just did, also you should not forget to always include the risk thereof in bitcoin for those that fail to acquire it knowledge before jumping into it or those that does it the wrong way, there are strategies and approaches to acquiring bitcoin which must be well understood before starting, then you also need to talk about the security of bitcoin with blockchain technology, importance of having your keys with you and how to avoid scam in general because alot have fall a victim of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "September 06, 2022, 09:41:50 AM",
      "body": "Guys you're doing a great job!Having presented the topic about bitcoin in a radio is already big. Although I usually see podcast types of discussion and the topic is bitcoin but if it's broadcasted in your local neighborhood, this is something big already for me.I guess next time if you will have another broadcast discussion, have someone invited from the forum through an online conference or zoom meeting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "September 06, 2022, 01:58:57 PM",
      "body": "You have done an excellent job by volunteering your time to educate people about Bitcoin. If we could find more people like you to do the same, the rate of Bitcoin adoption in Nigeria would be much higher than it is now. I wish I had the opportunity to educate my own people in my village; I would gladly do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "September 06, 2022, 03:13:35 PM",
      "body": "Great work mate. I love the enthusiasm and tenancity Nigerians are beginning to show in creating awareness for bitcoin and cryptocurrency at large. In the core Northern part of Nigeria radios are mostly used. I think this initiative of yours will go long way here. I can't wait to have stores/malls accepting bitcoin as form of payment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "landheer",
      "created_time": "September 07, 2022, 02:15:57 AM",
      "body": "what you do is a positive activity, namely the way you broadcast on the radio and also many people ask you about bitcoin and that is a unique and good thing, so that people know what bitcoin is. In this part of the world, there are now more and more people giving lessons about bitcoin to the public and in different ways, some are teaching bitcoin by coming to school and so on. and I think in the future bitcoin will definitely have more fans and enthusiasts because now people are starting to realize and know about bitcoin. because many people are giving lessons about bitcoin. online and offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 07, 2022, 03:39:44 AM",
      "body": "I must confess that this action is a bold and good initiative. One advantage of using the radio mass media as a form of sharing information is that it it could a very large audience and radio is very cheap that almost every household in Africa can afford it. You even made it more interesting by giving your target the opportunity to asked questions. Using interactive method of learning is a very good teaching method that enhances extensive and quick understanding.Quote from: Dunamisx on September 06, 2022, 09:36:38 AMI believe you've done alot in making that show a reality and i see alot benefiting from that you just did, also you should not forget to always include the risk thereof in bitcoin for those that fail to acquire it knowledge before jumping into it or those that does it the wrong way, there are strategies and approaches to acquiring bitcoin which must be well understood before starting, then you also need to talk about the security of bitcoin with blockchain technology, importance of having your keys with you and how to avoid scam in general because alot have fall a victim of this. But your focus now should be just introducing and explaining the Bitcoin space to them. The choice of using or investing in Bitcoin should be there choice. It is also important you introduce them to the risk involve in using and investing in Bitcoin. Also ensure they are aware of the existence of scammers and privacy intruders, hence they must learn about cybersecurity and privacy. Keeping their password and keys safe are skills that must be encourage. They must also be aware that there are other shitcoins that claim or promises huge profits on investment. Tell them that if it is not Bitcoin, then they are dealing with shitcoins and most of them are scam clothed with crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 07, 2022, 04:08:19 AM",
      "body": "Quote from: Zlantann on September 07, 2022, 03:39:44 AMI must confess that this action is a bold and good initiative. One advantage of using the radio mass media as a form of sharing information is that it it could a very large audience and radio is very cheap that almost every household in Africa can afford it. You even made it more interesting by giving your target the opportunity to asked questions. Using interactive method of learning is a very good teaching method that enhances extensive and quick understanding.Quote from: Dunamisx on September 06, 2022, 09:36:38 AMI believe you've done alot in making that show a reality and i see alot benefiting from that you just did, also you should not forget to always include the risk thereof in bitcoin for those that fail to acquire it knowledge before jumping into it or those that does it the wrong way, there are strategies and approaches to acquiring bitcoin which must be well understood before starting, then you also need to talk about the security of bitcoin with blockchain technology, importance of having your keys with you and how to avoid scam in general because alot have fall a victim of this. But your focus now should be just introducing and explaining the Bitcoin space to them. The choice of using or investing in Bitcoin should be there choice. It is also important you introduce them to the risk involve in using and investing in Bitcoin. Also ensure they are aware of the existence of scammers and privacy intruders, hence they must learn about cybersecurity and privacy. Keeping their password and keys safe are skills that must be encourage. They must also be aware that there are other shitcoins that claim or promises huge profits on investment. Tell them that if it is not Bitcoin, then they are dealing with shitcoins and most of them are scam clothed with crypto.Atimes i know that newbies in cryptocurrency do get discouraged whenever they had an ugly experience that involve them loosing their fund of which they may be unaware that such could also happens, now the put the whole blame on you that introduced them into it thinking that maybe you lie to them in deception and that may ever be the reason for such person never to forgive you because it might have cost them alot after fully depending on it for sustainace, that's why an information about bitcoin must not be withhold while dishing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 07, 2022, 04:36:31 AM",
      "body": "You've got a really cool job! And you're also presenting a really cool topic! Congratulations!I'm curious, how many hours is your shift? I wish you successfully managed to present Bitcoin well enough while also accommodating some breaks for ads, and probably plays some music in between discussions as well. And then you also took calls for some questions. Anyway, I just hope the \"what is Bitcoin\" consumed a good amount of your discussion time since it is the most important. I hope it also included the underlying technologies of Bitcoin. I guess this is what should really convince people of it. Although you could quickly mention that Bitcoin came from zero to $70,000, and it could be enough for everybody to be really curious about it, it actually reinforces the Ponzi misconception of Bitcoin rather than addresses it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "September 07, 2022, 07:35:59 PM",
      "body": "This is great.  Thanks for helping to educate those in your area.Here are some additional thoughts on the questions you received:Quote from: RockBell on September 05, 2022, 08:03:34 PM- Is Bitcoin securedThat depends on what you mean by \"secured\".  If you are asking if it is a certificate that represents some other form of tangible value (such as a stock certificate representing the value of a company, or a loan being secured\" by collateral) then no.  However, if you are asking if it has a robust and reliable security system preventing unauthorized access, then absolutely yes.The software that runs the bitcoin system has been reviewed by thousands of people. There are no known cases of any breach of the network in over a decade and there are hundreds of billions of U.S. dollars worth of value being secured so we can pretty confidently say that there is plenty of incentive for someone to spend a lot of money trying.  The fact that nobody has succeeded yet given that incentive is a strong indication that it is one of the most secure systems in the world today.However, while the network itself is extremely secure, protecting the bitcoins belonging to any individual is the responsibility of that individual.  The software that is used to access your bitcoins generally contains the keys (or secrets) that are used to manage that value. If an individual is careless with those keys/secrets then it is possible for an attacker to gain access to that information and use it to take/control that person's bitcoins.  If you are going to manage your bitcoins yourself, it is therefore very important to protect those keys from being accessed by others through malware, hacking, phishing, or other scams.Alternately, if you don't feel comfortable with your own ability to secure your keys, there are companies/services that will hold custody of your bitcoins for you and will manage the security for you.  There is a risk in that option that the company/service you choose is either untrustworthy or incompetent.  Everyone has to figure out their own risk tolerance and make their own decision as to whether they feel they can do a good enough job of protecting their keys, or if they feel they need to trust someone else to do it for them.If you choose to manage your access yourself, there are systems available (such as hardware wallets, and cold wallets) to make that process easier for those that have accumulated an amount of bitcoin that they become nervous about securing.Quote from: RockBell on September 05, 2022, 08:03:34 PMand how do you earn from it?Bitcoin is money.  You \"earn from it\" the same way as you \"earn from\" any other money. You can create a product or provide a service and accept bitcoin as payment in exchange. You can beg for bitcoin and hope that some charitable person will give you some for free, you can attempt to steal or scam someone out of their bitcoin, or you can exchange one form of money (such as your local currency) for it.  As the exchange rate between bitcoin and your local currency changes over time, there is an opportunity to exchange back and forth acquiring your local currency when it is stronger and acquiring bitcoin when your local currency becomes weaker in comparison.  The historical trend over the past 10 years has been for the bitcoin currency to increase in strength quite a bit over all local currencies. Therefore, it has historically been beneficial to acquire as much bitcoin as one can afford to risk, and then over time end up with increasing purchasing power as the bitcoin exchange rate increases. There is no guarantee that this will continue to be true, and even if id does continue to be true for many more decades there isn't any guarantee that it will be true over any arbitrary time period (hours, days, weeks, months, years, etc).Quote from: RockBell on September 05, 2022, 08:03:34 PM- Is Bitcoin only for young people?As I said, Bitcoin is money.  Therefore, bitcoin is for anyone that uses money. It does currently require some access to (and comfort using) technology (internet, software, computer or smartphone, etc), though you may be able to get a technology savy person in your family or household to assist you with acquiring and/or using some if you aren't comfortable doing so on your own.Quote from: RockBell on September 05, 2022, 08:03:34 PM- Can someone manage it for you (since they are always kind of busy)As mentioned earlier, this is a risky thing to do.  There have been many cases in the past of people trusting someone (or some service) to manage their bitcoin for them, and then after a while that trusted person or service vanishes with all the bitcoin wealth accumulated by all the people for whom they were managing bitcoin. There also have been cases of incompetent people or services losing bitcoin to hackers or scammers. Much like physical cash, if you give access to your bitcoin and someone runs off with it, the ONLY way to get it back is to find them and force them to give it back (for example through the threat of violence or through lawsuits).Quote from: RockBell on September 05, 2022, 08:03:34 PM- Asked about the legality of BitcoinYour answer to this one was very good. It is important to understand that every jurisdiction is different and that the vast majority of jurisdictions in the world have no laws AGAINST acquiring, holding, spending, or selling bitcoin itself. If you are buying or selling very large quantities and/or exchanging with a large number of people, then some jurisdictions in the world might require you to have some sort of money service business license or comply with various anti-money-laundering processes.Quote from: RockBell on September 05, 2022, 08:03:34 PM -what is the least amount you can start with?I exchanged $0.01 with someone once, but since there is a small transaction fee involved in sending the bitcoin from one person to the other that will generally be a silly idea. Before acquiring, figure out what fees you're chosen method is likely to incur.  I'd generally suggest trying to keep the total fees (transaction fees, exchange fees, etc) below 1%.  So, if the sum of all the fees is likely to be $0.10, then $10 is a reasonable starting point.More important is to figure out what your personal risk tolerance is.  The exchange rate between bitcoin and local currency changes all the time, and many times that exchange rate will spend a significant amount of time at a level where the market rate of the bitcoin you own is significantly less than you exchanged for it.  If you spent $10 acquiring your bitcoin, and the exchange rate drops such that the market value of that bitcoin is only $4.70 for a year or two, it might be a bit frustrating, but you won't likely be devastated by it.On the other hand, if you've saved up $8,000 that you were planning on spending on college tuition next year, and you decide to sink it ALL into bitcoin. It might be very upsetting if the exchange rate drops shortly thereafter to a point where the market value of your bitcoin is only $3,100, and even more upsetting if it doesn't recover above $3,600 for a few years.Quote from: RockBell on September 05, 2022, 08:03:34 PM-what are the advantages of being on bitcointalk and how to be a member?Like any forum, there is a lot of nonsense on the bitcointalk forum along with some scams. Verify anything you learn there, and take the time to figure out who generally gives good information.  There are, though, many people active on the forum with many years of experience assisting others with learning. It's a great place to share thoughts, concerns, ideas, and to gain knowledge.Quote from: RockBell on September 05, 2022, 08:03:34 PM - Differences between wallet and exchange.An \"exchange\" is a person/company that provides a way for those who have local currency (and want to acquire bitcoin) to connect with those who have bitcoin (and want to acquire local currency).  In most cases, the exchange handles the transfer of the funds (bitcoin and local currency) between the individuals, and many times does so without any need for those individuals to even know who the other is. To facilitate this, then generally require that you (at least temporarily) give them control over the amount of value you want to exchange (either of your local currency or of your bitcoin depending on which you have and which you are trying to acquire).  There is some risk involved in this, so you want to be careful choosing the service that you'll use.  If you're comfortable enough with the technology and process, there are some peer-to-peer exchanges that reduce the amount of control you need to turn over.A \"wallet\" is the software (or in some cases hardware) that you use to manage access to your bitcoins. It is where the keys/secrets are stored that give you control over your bitcoins. It provides you a view of how much bitcoin you control. It provides a method for sending transactions. It provides a set of \"addresses\" you can tell to others so that they can use those addresses to send you some bitcoin.Some exchanges or services that take custody of your bitcoins for you will provide you with an \"account\" in their system that you can use to see how many bitcoins they are managing for you and which you can use to tell them where you'd like them to send some bitcoins on your behalf.  Some of those services even call these accounts \"wallets\". They are not the same as an actual bitcoin wallet though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "September 07, 2022, 08:04:57 PM",
      "body": "Hopefully one day I would be invited as a special guest in a local radio station to educate the masses on what really Bitcoin is all about especially for those who have been misinformed or uninformed. I am not there to shill them about Bitcoin, but rather share what's good in it especially the real use cases, fundamentals and the future of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "September 07, 2022, 11:19:03 PM",
      "body": "Good job OP, I have notice one thing within the locals and you just brought it to my attention. Whenever there is a new tech that involves money, the smart and educated ones usually take advantage of it from others(the scammers do refer it to as update), glad that you are informing and educating the locals around you so they don't fall victims of these guys. I think what contributed to these Ponzi schemes is the inadequate direction of finance and exposure, people love means to get quick money and that is exactly what scammers use as a fishing net to farm their money.Quote from: RockBell on September 05, 2022, 08:03:34 PM       ANSWER: You can buy bitcoin of any amount but some p2p recommends a minimum of $10 which is around #7,000We also have p2p usually refers to as merchants, some of them have vendors, you can contact them like we do have some in the forum from the Naija board and you may be able to buy as low as that and they have a reputation here as well, it is better you contact them physically, that way nobody can run away with your money. I know a guy I do sell to times and meet sometimes when it involves large transactions because I dislike using centralized exchanges since I did more research about them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "September 07, 2022, 11:54:03 PM",
      "body": "Quote from: cheezcarls on September 07, 2022, 08:04:57 PMHopefully one day I would be invited as a special guest in a local radio station to educate the masses on what really Bitcoin is all about especially for those who have been misinformed or uninformed. I am not there to shill them about Bitcoin, but rather share what's good in it especially the real use cases, fundamentals and the future of it. Are you well known speaker, then you'll be invited. If not, we need to work on it. For now you can create your own podcast. People who are good speakers can take an opportunity and educate people, because they get more chances to talk on different topics. Whenever they talk of some other topic, making a small discussion about bitcoin could interest the participants to know more about it. Another thing we need to first educate the ones next to us, if we're able to convince them it is a big success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "September 08, 2022, 09:40:22 AM",
      "body": "Quote from: DannyHamilton on September 07, 2022, 07:35:59 PMThis is great.  Thanks for helping to educate those in your area.Here are some additional thoughts on the questions you received:Quote from: RockBell on September 05, 2022, 08:03:34 PM- Is Bitcoin securedThat depends on what you mean by \"secured\".  If you are asking if it is a certificate that represents some other form of tangible value (such as a stock certificate representing the value of a company, or a loan being secured\" by collateral) then no.  However, if you are asking if it has a robust and reliable security system preventing unauthorized access, then absolutely yes.The software that runs the bitcoin system has been reviewed by thousands of people. There are no known cases of any breach of the network in over a decade and there are hundreds of billions of U.S. dollars worth of value being secured so we can pretty confidently say that there is plenty of incentive for someone to spend a lot of money trying.  The fact that nobody has succeeded yet given that incentive is a strong indication that it is one of the most secure systems in the world today.However, while the network itself is extremely secure, protecting the bitcoins belonging to any individual is the responsibility of that individual.  The software that is used to access your bitcoins generally contains the keys (or secrets) that are used to manage that value. If an individual is careless with those keys/secrets then it is possible for an attacker to gain access to that information and use it to take/control that person's bitcoins.  If you are going to manage your bitcoins yourself, it is therefore very important to protect those keys from being accessed by others through malware, hacking, phishing, or other scams.Alternately, if you don't feel comfortable with your own ability to secure your keys, there are companies/services that will hold custody of your bitcoins for you and will manage the security for you.  There is a risk in that option that the company/service you choose is either untrustworthy or incompetent.  Everyone has to figure out their own risk tolerance and make their own decision as to whether they feel they can do a good enough job of protecting their keys, or if they feel they need to trust someone else to do it for them.If you choose to manage your access yourself, there are systems available (such as hardware wallets, and cold wallets) to make that process easier for those that have accumulated an amount of bitcoin that they become nervous about securing.Quote from: RockBell on September 05, 2022, 08:03:34 PMand how do you earn from it?Bitcoin is money.  You \"earn from it\" the same way as you \"earn from\" any other money. You can create a product or provide a service and accept bitcoin as payment in exchange. You can beg for bitcoin and hope that some charitable person will give you some for free, you can attempt to steal or scam someone out of their bitcoin, or you can exchange one form of money (such as your local currency) for it.  As the exchange rate between bitcoin and your local currency changes over time, there is an opportunity to exchange back and forth acquiring your local currency when it is stronger and acquiring bitcoin when your local currency becomes weaker in comparison.  The historical trend over the past 10 years has been for the bitcoin currency to increase in strength quite a bit over all local currencies. Therefore, it has historically been beneficial to acquire as much bitcoin as one can afford to risk, and then over time end up with increasing purchasing power as the bitcoin exchange rate increases. There is no guarantee that this will continue to be true, and even if id does continue to be true for many more decades there isn't any guarantee that it will be true over any arbitrary time period (hours, days, weeks, months, years, etc).Quote from: RockBell on September 05, 2022, 08:03:34 PM- Is Bitcoin only for young people?As I said, Bitcoin is money.  Therefore, bitcoin is for anyone that uses money. It does currently require some access to (and comfort using) technology (internet, software, computer or smartphone, etc), though you may be able to get a technology savy person in your family or household to assist you with acquiring and/or using some if you aren't comfortable doing so on your own.Quote from: RockBell on September 05, 2022, 08:03:34 PM- Can someone manage it for you (since they are always kind of busy)As mentioned earlier, this is a risky thing to do.  There have been many cases in the past of people trusting someone (or some service) to manage their bitcoin for them, and then after a while that trusted person or service vanishes with all the bitcoin wealth accumulated by all the people for whom they were managing bitcoin. There also have been cases of incompetent people or services losing bitcoin to hackers or scammers. Much like physical cash, if you give access to your bitcoin and someone runs off with it, the ONLY way to get it back is to find them and force them to give it back (for example through the threat of violence or through lawsuits).Quote from: RockBell on September 05, 2022, 08:03:34 PM- Asked about the legality of BitcoinYour answer to this one was very good. It is important to understand that every jurisdiction is different and that the vast majority of jurisdictions in the world have no laws AGAINST acquiring, holding, spending, or selling bitcoin itself. If you are buying or selling very large quantities and/or exchanging with a large number of people, then some jurisdictions in the world might require you to have some sort of money service business license or comply with various anti-money-laundering processes.Quote from: RockBell on September 05, 2022, 08:03:34 PM -what is the least amount you can start with?I exchanged $0.01 with someone once, but since there is a small transaction fee involved in sending the bitcoin from one person to the other that will generally be a silly idea. Before acquiring, figure out what fees you're chosen method is likely to incur.  I'd generally suggest trying to keep the total fees (transaction fees, exchange fees, etc) below 1%.  So, if the sum of all the fees is likely to be $0.10, then $10 is a reasonable starting point.More important is to figure out what your personal risk tolerance is.  The exchange rate between bitcoin and local currency changes all the time, and many times that exchange rate will spend a significant amount of time at a level where the market rate of the bitcoin you own is significantly less than you exchanged for it.  If you spent $10 acquiring your bitcoin, and the exchange rate drops such that the market value of that bitcoin is only $4.70 for a year or two, it might be a bit frustrating, but you won't likely be devastated by it.On the other hand, if you've saved up $8,000 that you were planning on spending on college tuition next year, and you decide to sink it ALL into bitcoin. It might be very upsetting if the exchange rate drops shortly thereafter to a point where the market value of your bitcoin is only $3,100, and even more upsetting if it doesn't recover above $3,600 for a few years.Quote from: RockBell on September 05, 2022, 08:03:34 PM-what are the advantages of being on bitcointalk and how to be a member?Like any forum, there is a lot of nonsense on the bitcointalk forum along with some scams. Verify anything you learn there, and take the time to figure out who generally gives good information.  There are, though, many people active on the forum with many years of experience assisting others with learning. It's a great place to share thoughts, concerns, ideas, and to gain knowledge.Quote from: RockBell on September 05, 2022, 08:03:34 PM - Differences between wallet and exchange.An \"exchange\" is a person/company that provides a way for those who have local currency (and want to acquire bitcoin) to connect with those who have bitcoin (and want to acquire local currency).  In most cases, the exchange handles the transfer of the funds (bitcoin and local currency) between the individuals, and many times does so without any need for those individuals to even know who the other is. To facilitate this, then generally require that you (at least temporarily) give them control over the amount of value you want to exchange (either of your local currency or of your bitcoin depending on which you have and which you are trying to acquire).  There is some risk involved in this, so you want to be careful choosing the service that you'll use.  If you're comfortable enough with the technology and process, there are some peer-to-peer exchanges that reduce the amount of control you need to turn over.A \"wallet\" is the software (or in some cases hardware) that you use to manage access to your bitcoins. It is where the keys/secrets are stored that give you control over your bitcoins. It provides you a view of how much bitcoin you control. It provides a method for sending transactions. It provides a set of \"addresses\" you can tell to others so that they can use those addresses to send you some bitcoin.Some exchanges or services that take custody of your bitcoins for you will provide you with an \"account\" in their system that you can use to see how many bitcoins they are managing for you and which you can use to tell them where you'd like them to send some bitcoins on your behalf.  Some of those services even call these accounts \"wallets\". They are not the same as an actual bitcoin wallet though. The more you enlighten me, the more I wish you had been by my side as I was hosting the show. There are so many enlightening words here, and the forum is fascinating thanks to everyone who has encouraged me and contributed. When the program is ready to launch, I would love to have you and many others on a zoom meeting to provide more information to the locals. This is going to be a fascinating segment, and truth be told, I will love having you there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}