{
  "id": "topic_5412939",
  "title": "Detritus",
  "author": "Detritus",
  "created_time": "September 09, 2022, 12:42:39 AM",
  "content": "On the 5th of February 2021, CBN  (Central Bank of Nigeria) puts a ban on banks and regulated institutions from dealing with bitcoin and  cryptocurrencies in general. With respect to the ban, there was a rise of UpTo 27% in the use of p2p  bitcoin and crypto transactions across Nigeria.Nigerian naira was traded at #380 naira against US dollar, some months later the rate increased to #416 and goes above N560 and year later but as of today I sold 142.8 USD at the rate of 1USD to #707 (Naira) which gave me a total of #101,111 (one houndred & one  thousand, houndred & eleven Naira). Last year, Africa is sited as the largest country in P2P transactions in the world by volume. According to the report of Chainalysis which shows Nigeria is the top 10 countries worldwide in the adoption of bitcoin.Currently, the Nigeria Export Processing Zones Authority (NEPZA) is in discussions with one of the leading crypto exchange Binance, and some Talent City that specialize in building a special economic zone. the reason is to establish a special economic zone for bitcoin and cryptocurrencies in West Africa. NEPZA whishes to establish a partnership binance and talent cities. This economic zone will reportedly mirror the Dubai Virtual Free Zone.If Nigeria is seeking to create the first economic free zone for bitcoin and cryptocurrency in West Africa through the Nigeria Export Processing Zones Authority (NEPZA) as the press has release, I thinks this is going to be awesome 😎As stated by Adesoji Adesugba the NEPZA managing director, which says the goal of NEPZA is to engender a flourishing virtual free zones to take advantage of a near trillion dollar virtual economy in blockchains and digital economy.Furthermore, NEPZA explained that if a partnership is reached, the final product would mirror that of the Dubai Virtual Free Zone.On 21/12/2021 Binance Signs Agreement with Dubai World Trade Centre Authority to Establish an Industry Hub for Global Virtual Assets. The signed memorandum of understanding was intend to make Dubai a hub for bitcoin & cryptocurrency related products / services by creating a new international virtual asset ecosystem.How ever, as Dubai and Nigeria look to establish special economic zones that can benefit bitcoin & other cryptocurrencies, let's take Próspera as example of the existing customizable economic frame work/zone.Reference: https://www.google.com/amp/s/bitcoinmagazine.com/.amp/business/nigeria-binance-partner-for-economic-zone-in-west-africahttps://www.google.com/amp/s/www.binance.com/en/amp/support/announcement/46d81eb19a224cba807e078dc95aa886",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412939",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "September 09, 2022, 06:27:44 PM",
      "body": "There's a topic created already as similar thread, i encourage you make use if the search botton before posting, moreover its more than two days ago this came out, so by now you should have expected such being talked about already onbthe forum or search through for clarification before posting, you can as well lock the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "September 09, 2022, 08:19:05 PM",
      "body": "Quote from: 348Judah on September 09, 2022, 06:27:44 PMThere's a topic created already as similar thread, i encourage you make use if the search botton before posting, I dislike when people point out mistakes but fail to correct them. I expected you to have shared the link to the alternate thread which you claim has been posted before but you never did. So however, here is the link..Nigeria FG to partner BinanceThou, I do not encourage duplicate thread posting on the forum, but I think if you should, try writing your thread from a different point of view that makes people understand a particular concept from a different angle just like bloggers do when writing a blog post. Just like the O.P did, emphasizing on the crypto restrictions leading to the fail in the value of dollar to Naira rate, of which currently traded at #707 per 1USD,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Detritus",
      "created_time": "September 09, 2022, 10:00:48 PM",
      "body": "Quote from: 348Judah on September 09, 2022, 06:27:44 PMThere's a topic created already as similar thread, i encourage you make use if the search botton before posting, moreover its more than two days ago this came out, so by now you should have expected such being talked about already onbthe forum or search through for clarification before posting, you can as well lock the thread.  I Am not new in the forum and I know how to use the search botton, I figured out something like this topic may have been created but I did not find anything relating when I searched. But in any case, I had my personal experience in the post about the case of US Dollar. Thanks though 348Jufah for letting me know, and cryptoHeadlineNews for sharing the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "September 10, 2022, 05:50:07 AM",
      "body": "I love this partnership with Binance and I am hoping that nothing will be able to block this vision into the future and things or plans can be big realities at the appropriate time. I am seeing that Nigeria is getting to be the hub of cryptocurrency in Africa and their government should learn to recognize and capitalize on this. There are so many ways one can de dealing with cryptocurrency and yet at the same time having the right control over things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}