{
  "id": "topic_5470627",
  "title": "ssr33",
  "author": "ssr33",
  "created_time": "October 17, 2023, 03:45:57 AM",
  "content": "Cointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.This news raised the price of Bitcoin in a short time.where can I find the famous fake news in the last 5 years?thx guys",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470627",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "October 17, 2023, 07:01:45 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.This news raised the price of Bitcoin in a short time.where can I find the famous fake news in the last 5 years?thx guys The news was shared by Cointelegraph on X (AKA Twitter), and now, after investigating and confirming the news from Blockrock and Bloomberg, they deleted the post. You can read the whole story on the following page:Clarification on sharing false spot Bitcoin ETF newsAnd if you are looking for a tweet in which they said, that Ishare's ETF got approved, it also exists in the page I shared. I hope you will get your answers after reading it. Here is another tweet they made as an apology.source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ssr33",
      "created_time": "October 17, 2023, 07:11:10 AM",
      "body": "Quote from: Faisal2202 on October 17, 2023, 07:01:45 AMQuote from: ssr33 on October 17, 2023, 03:45:57 AMThe news was shared by Cointelegraph on X (AKA Twitter), and now, after investigating and confirming the news from Blockrock and Bloomberg, they deleted the post. You can read the whole story on the following page:Clarification on sharing false spot Bitcoin ETF newsAnd if you are looking for a tweet in which they said, that Ishare's ETF got approved, it also exists in the page I shared. I hope you will get your answers after reading it. Here is another tweet they made as an apology.https://talkimg.com/images/2023/10/17/RoFFa.pngsourceYes, I have read this article. I realize that fake news has a great impact on the price of Bitcoin, so I want to know what famous fake news has caused Bitcoin price fluctuations in recent years.I have looked at some news sites but there is no column about fake news. That’s why I posted this post to ask for advice",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "October 17, 2023, 07:15:43 AM",
      "body": "Quote from: Faisal2202 on October 17, 2023, 07:01:45 AMThe news was shared by Cointelegraph on X (AKA Twitter), and now, after investigating and confirming the news from Blockrock and Bloomberg, they deleted the post. You can read the whole story on the following page:Clarification on sharing false spot Bitcoin ETF newsNews channels should beware of spreading fake news. This was unprofessional of cointelegraph and this action by them have led to many turmoil in the bitcoin community. So many people believe and rely on their source of news and would have also reacted when they saw the news from them. They should be verifying the source of their news before sharing so as not to lose the trust of many of their readers. There later tweet is a good way to correct their mistake, hope they don’t repeat same in the future as bitcoin price action is in a very critical stage now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 17, 2023, 07:20:08 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.Cointelegraph should keep its apology to itself and I wonder what would be the fate of those that were in the sell position, will the apology give them back the money already lost? The news outlet should be very ashamed of itself and I hope big bags who lost to this unprofessional act would sue them to know the gravity of what they've done.It's not by force to dispense what you didn't verify.Quotewhere can I find the famous fake news in the last 5 years?I don't think such exist in the crypto space, but using Google for individual cases might be the soluton.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ssr33",
      "created_time": "October 17, 2023, 07:43:30 AM",
      "body": "Quote from: EarnOnVictor on October 17, 2023, 07:20:08 AMI don't think such exist in the crypto space, but using Google for individual cases might be the soluton.I know that rekt.news records the scandals of blockchain projects, so I was curious if there is any fake news aggregation website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 17, 2023, 07:56:37 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.How to get rich scheme.1. Apply as intern on coindesk2. Make a leverage 100x bet on bitcoin3. Post approval of SEC on bitcoin etf application4. Close position and resign. Boom! Instant millionaire by a crazy pump on news.Damn this was so fast happened last night like literally a lot of people got swayed by the news. Clearly show how Bitcoin can nonstop pumped when those bittcoin etf got approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "October 17, 2023, 08:40:44 AM",
      "body": "Quote from: Faisal2202 on October 17, 2023, 07:01:45 AMThe news was shared by Cointelegraph on X (AKA Twitter), and now, after investigating and confirming the news from Blockrock and Bloomberg, they deleted the post. You can read the whole story on the following page:Clarification on sharing false spot Bitcoin ETF newsAnd if you are looking for a tweet in which they said, that Ishare's ETF got approved, it also exists in the page I shared. I hope you will get your answers after reading it. Here is another tweet they made as an apology.sourceHow possibility with bigger media of cryptocurrency publishing not accurate information, why not research and make analyze first about their information update have been true or not. I doubt with cointelegraph have have commercial interests to make pump and dump in short time. Have future trading model make it easy for cointelegraph opening buy order before publishing about news SEC approving bitcoin ETF and after few minutes later they try clarification about fake news publishing. Its model adopted by whales when opening their position in future trading, they have already publish with positive news and clarification few minutes later when price have been up. I remember with update news when Litecoin accepted by Amazon but the company not accepted yet before some media make clarification about their information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "October 17, 2023, 08:45:50 AM",
      "body": "Having different sources is good. While the mentioned site is very popular, there are other sources out there that can provide reliable information. If they are apologizing for the fake news, is this the first time that it has happened? If so, I think they can still be considered a reliable outlet. But for significant news like that, it's important not to rely on just one media source. There are many outlets that would report the same news, which would indicate that the news isn't fake.Regardless of the reasons for posting fake news, this mistake has already tarnished their reputation. So, readers will have to think twice about fully relying on their news. This is not good for transparent reporting as they promise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "October 17, 2023, 08:49:37 AM",
      "body": "Quote from: cryptoaddictchie on October 17, 2023, 07:56:37 AMQuote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.How to get rich scheme.1. Apply as intern on coindesk2. Make a leverage 100x bet on bitcoin3. Post approval of SEC on bitcoin etf application4. Close position and resign. Boom! Instant millionaire by a crazy pump on news.Damn this was so fast happened last night like literally a lot of people got swayed by the news. Clearly show how Bitcoin can nonstop pumped when those bittcoin etf got approved. This will be the most insane thing ever done. Cointelegraph is actively examining what caused the posting of that news concerning bitcoin ETF. Who knows, maybe it was an intern who planned this to boost his earnings from a trade that would eventually lead to the price of bitcoin skyrocketing as a result of the news breaking about bitcoin ETF. This appears to be a new opportunity to become a millionaire, but since the event has already occurred, everyone will be sceptical of any subsequent news about it and will confirm and reaffirm the veracity before reacting to the news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 17, 2023, 09:02:46 AM",
      "body": "Quote from: Ndabagi01 on October 17, 2023, 08:49:37 AMWho knows, maybe it was an intern who planned this to boost his earnings from a trade that would eventually lead to the price of bitcoin skyrocketing as a result of the news breaking about bitcoin ETF. Or the cointelegraph itself. Who knows but this kind of error is unacceptable since many have been liquidated especially if they edited their first post. Unfortunate things to happened since they are a big news platform which are followed and subscribed by a lot of users even the whales who are watching from the sideline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "October 17, 2023, 09:32:32 AM",
      "body": "Current Telegraph has already apologized for spreading the fake news but I think they need to work on themselves they need to always make sure that the news is genuine before they post out for the world to see current Telegraph is a big crypto feed platform that is why the news affected many people and they lose money trying to Long the market for profit.This will also serve as a warning to all crypto investors that all crypto news feeds can't always be accurate, sometimes they may feed the world lies, next time when news about crypto gets online people will be very careful to make financial decisions, not until they clarified that the news is from a genuine source. I was aware of the news because I have activated some crypto news on my smartphone so I always get notified immediately the news is online, but after seeing the news I was not very happy about it because I believe that the ETF approval is too fast I was expecting this approval at the end of the year or very early into the next year 2024, but now I am happy that it's not a genuine news. Let's be more careful of the news spread online about crypto, before you make any decision make sure that the news is real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 17, 2023, 10:41:22 AM",
      "body": "All those who get information from such bad sources do not deserve to have something good happen to them. From some other sources, it seems that someone from their team made very nice money, and the apology is free anyway.https://twitter.com/rollbitcom/status/1713919556568113503When I just remember that that news portal paid members of this forum to shill links and that we barely got rid of them, and today they have become some kind of source of \"crypto news\", then I am not surprised that so many people are ill-informed and completely lost. My advice is not to follow them anymore, and not to post their links on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 17, 2023, 10:43:24 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.This news raised the price of Bitcoin in a short time.They really owe the world an apology and whoever is behind that monitor, the intern they say, is likely gonna feel ashamed of what has happened. This incident will make them better and will verify before they publish a news that will be read globally. The next time they make an error, then there could be possible legal consequences that they have to face.Quote from: ssr33 on October 17, 2023, 03:45:57 AMwhere can I find the famous fake news in the last 5 years?thx guys I can't find an overview or list of the fake news that has happened for the past 5 years. I think if you're looking for them, all you have to do is to allot time and search them manually since everything are published on the web. And if you're going to search for most of them, they'll definitely appear with certain keywords that you're looking for.Quote from: Lucius on October 17, 2023, 10:41:22 AMFrom some other sources, it seems that someone from their team made very nice money, and the apology is free anyway.https://twitter.com/rollbitcom/status/1713919556568113503The heck. What a nice payday for that intern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 17, 2023, 11:08:15 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMwhere can I find the famous fake news in the last 5 years?What has fake news got to do with your request for such, are you going to work on the previous events to see how they were being operated in other for you to know how to channel yours and release one as well, because am still surprised on what will historical fake news do to you, maybe you hunt around the internet by yourself if the recent one already provided isn't enough for you, fake news is not what one should brag about or create mind for showing interest on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 17, 2023, 11:24:09 AM",
      "body": "Quote from: Faisal2202 on October 17, 2023, 07:01:45 AMQuote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.This news raised the price of Bitcoin in a short time.where can I find the famous fake news in the last 5 years?thx guys And if you are looking for a tweet in which they said, that Ishare's ETF got approved, it also exists in the page I shared. I hope you will get your answers after reading it. Here is another tweet they made as an apology.source The apology is insignificant as it is believed to be a professional premeditated handiwork that was carefully done to trigger the crypto market as what could be the resultant effect on the ETF approval.More like an early experimental design done to test how the market reaction could be like at the approval of bitcoin spot ETF and obviously the market price really did reacted in an upward way in less than 120 minutes before the news was debunked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "October 17, 2023, 11:27:06 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMThis news raised the price of Bitcoin in a short time.Such news can raise the price or can dump it too.Quotewhere can I find the famous fake news in the last 5 years?Why do you care about fake news but don't care to find facts?Knowing about facts will help you to be less or non affected by fake news, fud in this market. It is a better way for your to survive in this market, avoid loss and can take advantage of panic sell, liquidations to buy the *ing dips and do dollar cost averaging DCA.If you are still interesting in finding fake news, you can find them therehttps://99bitcoins.com/bitcoin-obituaries/https://buybitcoinworldwide.com/bitcoin-is-dead/I don't waste my time to read all of fake news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 17, 2023, 11:47:10 AM",
      "body": "Quote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.This news raised the price of Bitcoin in a short time.where can I find the famous fake news in the last 5 years?thx guys Several times, news was published that only later turned out to be fake, but it rarely happened that the source that published the fake news also published a denial and an apology.I would single out here some statements/news by Elon Musk or the manipulation of news about the acceptance of Bitcoin in China. Every time it caused a raising price, but now it just looks like price manipulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "October 17, 2023, 11:56:12 AM",
      "body": "Quote from: cryptoaddictchie on October 17, 2023, 07:56:37 AMQuote from: ssr33 on October 17, 2023, 03:45:57 AMCointelegraph issues apology after falsely announcing that BlackRock's Spot Bitcoin ETF was approved by the SEC.How to get rich scheme.1. Apply as intern on coindesk2. Make a leverage 100x bet on bitcoin3. Post approval of SEC on bitcoin etf application4. Close position and resign. Boom! Instant millionaire by a crazy pump on news.Damn this was so fast happened last night like literally a lot of people got swayed by the news. Clearly show how Bitcoin can nonstop pumped when those bittcoin etf got approved. I think that's a great idea Maybe I was the only one who felt relieved after seeing that the news turned out to be fake and made Bitcoin correct again. Because I'm not ready for a bullrun because I still haven't finished collecting my bitcoin chunks. And it seems that when the Bitcoin ETF is actually approved by the SEC then the market will move faster as it did last night. And I'm seeing a lot of bitcoin flowing out of exchanges today. Massive accumulation appears to be taking place. Maybe people are starting to realize that bull markets can move quickly without waiting for them to finish accumulating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 17, 2023, 04:34:45 PM",
      "body": "Quote from: ssr33 on October 17, 2023, 07:11:10 AMYes, I have read this article. I realize that fake news has a great impact on the price of Bitcoin, so I want to know what famous fake news has caused Bitcoin price fluctuations in recent years.I have looked at some news sites but there is no column about fake news. That’s why I posted this post to ask for adviceI doubt if you will find any fake news category on any news website, there might be some news websites that have this category but I am not aware of any (website) but I can mention some news that are not too recent but crypto is not that old dear. so everything is still young here. hehe. Well, here is another piece of news, I found for you and you can read it from the respective link I provided. Bitcoin drops $2,000 in value as South Korea announces planned trading ban-->The price of Bitcoin fell by more than 20% as a result of this news.To be honest, I think you should spend some time by your own and then you will come to realize that, everything seems a little bit scripted (IYKYK).I have read many articles and many news, but this is definitely not the new one, but you have to find them using your research skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}