{
  "id": "topic_5440185",
  "title": "dragonvslinux",
  "author": "dragonvslinux",
  "created_time": "February 17, 2023, 01:02:35 PMLast edit: September 10, 2023, 12:54:25 PM by dragonvslinux",
  "content": "Thought I'd share this liquidity map that I came across recently.... While some of you will know of the Liquidation Data chart from CoinGlass, this Liquidity Map from DecenTrader instead shows where leverage traders have protected their positions.Interesting to note is the amount of short positions with liquidation prices between $25K and $26K compared to long positions between $14K and $15K right now. While there was already some liquidations yesterday with prices reaching $25K, it's clear there's still a lot more positions with liquidation prices all the way to $30K. This is the confirmation that a short squeeze to higher levels remains possible, in case there was any doubt.Quote from: DecenTraderThis particular chart is a Bitcoin liquidations map. It shows the liquidation areas of Bitcoin traders who are using 3x, 5x, 10x leverage. It shows areas of liquidations for both long and short positions i.e. for traders who are buying, and also for those who are selling.Bottom line: Traders remain uber bearish right now. Despite bears claiming that the market is too bullish, clearly leverage traders are overtly bearish right now around current prices.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440185",
  "comments": [
    {
      "author": "Wapfika",
      "created_time": "February 17, 2023, 01:12:54 PM",
      "body": "The number of open short position on Bitfinex is currently on ATL. I believe the upcoming bearish movement will be brutal once this bear regained their position in the market. The number of short position keeps declining since the last rally started. I agree that bearish movement is still not over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "February 17, 2023, 01:39:11 PM",
      "body": "Quote from: Wapfika on February 17, 2023, 01:12:54 PMThe number of open short position on Bitfinex is currently on ATL. I believe the upcoming bearish movement will be brutal once this bear regained their position in the market. The number of short position keeps declining since the last rally started. I agree that bearish movement is still not over.This is literally the exact opposite of what I was pointing out. There is an opportunity for a big short squeeze right now if prices reach $26K, there is clearly no opportunity for a long squeeze (unless prices fall to $14K).To counter your point though, Bitfinex data is barely relevant. For example their daily trading volume is $150m compared to the likes of the top derivatives exchanges like Binance at $72b or ByBit and OkX at $15b and $18b. If not obvious, the amount of derivative trading on Bitfinex is less than 0.15% of all derivative trading. It's like looking at Bitmex for longs vs shorts data, it doesn't even make up 1% either, or looking at Bitstamp for overall volume when compared to the biggest exchanges their volume is abysmal. This is why it's important to always look at the overall market data, not one isolated exchange.Now to look at the Bitfinex data. The leverage market is 99% long right now (100:1). OMG. Until you realise they've been 90% long (10:1) since ATH. I still remember some OGs pointing to the 98% long leverage (50:1) around $20K levels last year and pointing out how it was a setup for a massive long squeeze, but this never happened, even with the drop to $15K. Instead leverage just returned to it's base around 90% long.If this data is good for anything (it probably isn't), it shows that these OG participants consistently go against the overall trend and do so successfully (at least 90% do), likely due to using low leverage or high collateral, baring in mind these are users that have been invested in Bitcoin since as early as 2013 so generally are a lot more experienced than the likes of Bybit or Binance traders.Notably they otherwise stacked up 2x on longs back in May/June, but managed to avoid liquidation even with prices dropping by 50%. That should tell you something...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 18, 2023, 05:07:04 AM",
      "body": "I saw those charts before and I am wondering how exactly do they calculate these liquidation levels? Because I don’t think the amount of leverage a trader uses is posted anywhere. Only way to know there is a liquidation is when it’s posted afterwards with some exchanges.So I am assuming this looks at the volume at a particular price but the way I see it there is someone going long and someone going short for each trade. And you don’t know the leverage so the chart would be symmetrical but it’s not and this is why I am confused how they come up with these charts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "February 18, 2023, 01:15:24 PM",
      "body": "Quote from: adaseb on February 18, 2023, 05:07:04 AMI saw those charts before and I am wondering how exactly do they calculate these liquidation levels? Because I don’t think the amount of leverage a trader uses is posted anywhere. Only way to know there is a liquidation is when it’s posted afterwards with some exchanges.So I am assuming this looks at the volume at a particular price but the way I see it there is someone going long and someone going short for each trade. And you don’t know the leverage so the chart would be symmetrical but it’s not and this is why I am confused how they come up with these charts.Yes you're right. I had thought it was somehow API based and a count of active trades, but is instead based on historical liquidity around different price levels. So in this case, it seems more based on the liquidations that occurred from the bear trap on 12/05/22 when price dropped from $29K to $25.3K before returning to $30K (which I assume would have liquidated a lot of bears).In hindsight, this chart should definitely be taken with a pinch of salt. As it's not necessarily true that there are lots of stop losses / liquidation prices between $25K and $26K even if there were in the past.QuoteThe areas with the tallest liquidity lines on the chart are price levels with significant liquidity. The market price will often trend towards these areas. It is important to note that each bar does not represent an exact number of liquidations, but is a count relative to the other liquidation levels.[/url] Therefore it shows how likely it is that the market will be affected by the liquidations and liquidity there.Source: https://www.decentrader.com/liquidity-maps/?coin=btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "February 20, 2023, 09:49:32 AM",
      "body": "Quote from: dragonvslinux on February 17, 2023, 01:39:11 PMBitfinex is less than 0.15% of all derivative trading. That's exacly what I wanted to post after reading Wapfika post. Bitfinex charts have zero analytical value and are super easy to manipulate. Quote from: dragonvslinux on February 17, 2023, 01:02:35 PMBottom line: Traders remain uber bearish right now. Despite bears claiming that the market is too bullish, clearly leverage traders are overtly bearish right now around current prices.Fit best in a \"suckers' Rally\" narrative also called \"disbelief\":People don't trust this pump. 500 days in bear market made them forget how bull run looks like. Just like in APR 2019. This is a very great setup for a short squeez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 26, 2023, 09:32:44 PM",
      "body": "If you look at the open interest and the funding rates for Bitcoin you will see that whenever bitcoin has a big dip, many shorts jump in, causing OI to increase and funding rate to go down, and usually we have a big rally right after.Then we see OI go up and funding rate go up again and we got longs chasing and again we end up dipping, where the shorts again jump in. So I think this means we are neutral because there is no decision right now whether to be bullish or bearish. We will most likely chop around for the next few weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "February 26, 2023, 11:59:22 PM",
      "body": "We still haven’t had a retest of 20k, I think we could possibly see a dip to 20k & it’ll be interesting to see what happens if we do go there. Is support good enough or are new lows possible? We can see 25k is resistance, we're just ranging right now until there is a break below 20k or above 25k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 27, 2023, 12:49:06 AM",
      "body": "Quote from: DeathAngel on February 26, 2023, 11:59:22 PMWe still haven’t had a retest of 20k, I think we could possibly see a dip to 20k & it’ll be interesting to see what happens if we do go there. Is support good enough or are new lows possible? We can see 25k is resistance, we're just ranging right now until there is a break below 20k or above 25k.If we go to $20K do you think it will hold? Besides the 2017 peak, $20K was never a good support or resistance areas. In 2017 it looks like $20K was front ran and the actual high was like $19700.Either way.When we hit $20k in 2021, did it act as resistance? No not at all. Basically was a bear trap. And later in late 2022 when we hit $20K was it support? Not really. We went further into $18K or so. So even if it touches $20K in the next few weeks, I don't think it will be a good indicator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "February 27, 2023, 10:10:40 AM",
      "body": "Quote from: adaseb on February 27, 2023, 12:49:06 AMQuote from: DeathAngel on February 26, 2023, 11:59:22 PMWe still haven’t had a retest of 20k, I think we could possibly see a dip to 20k & it’ll be interesting to see what happens if we do go there. Is support good enough or are new lows possible? We can see 25k is resistance, we're just ranging right now until there is a break below 20k or above 25k.If we go to $20K do you think it will hold? Besides the 2017 peak, $20K was never a good support or resistance areas. In 2017 it looks like $20K was front ran and the actual high was like $19700.Either way.When we hit $20k in 2021, did it act as resistance? No not at all. Basically was a bear trap. And later in late 2022 when we hit $20K was it support? Not really. We went further into $18K or so. So even if it touches $20K in the next few weeks, I don't think it will be a good indicator.I would say it acted as a resistance \"just a bit\", if you look at the charts you can see that we cracked above 15k in early November, but we couldn't crack above 20k until late December, yet after we did, it took us less than a month to go to 57k as well. It means that it took us a month to go 5k higher, and then another month for us to go 35k higher as well.We really don't know what will happen in bitcoin, we may crack above 30k in a month, and then suddenly it may crack above 60k in another month, or maybe for another 2 months we will stay here, or maybe we will go down 5k. None of it is known, anything could happen, and it is proven by the previous movements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "February 27, 2023, 04:01:08 PM",
      "body": "Quote from: adaseb on February 27, 2023, 12:49:06 AMWhen we hit $20k in 2021, did it act as resistance? No not at all. Basically was a bear trap. And later in late 2022 when we hit $20K was it support? Not really. We went further into $18K or so. So even if it touches $20K in the next few weeks, I don't think it will be a good indicator.Yeah, I always saw $10k as the only time psychological resistance really meant anything. $20k only because it was the ATH, and then once that was passed, it hardly mattered as support (and as you say, after that, as resistance).Don't think there are any more psychological points other than $10k (and ATH).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "February 27, 2023, 05:01:47 PM",
      "body": "Quote from: buwaytress on February 27, 2023, 04:01:08 PMQuote from: adaseb on February 27, 2023, 12:49:06 AMWhen we hit $20k in 2021, did it act as resistance? No not at all. Basically was a bear trap. And later in late 2022 when we hit $20K was it support? Not really. We went further into $18K or so.Yeah, I always saw $10k as the only time psychological resistance really meant anything. $20k only because it was the ATH, and then once that was passed, it hardly mattered as support (and as you say, after that, as resistance).Don't think there are any more psychological points other than $10k (and ATH).I'd say maybe $50K. It's half of $100K (previous bull target for many including myself) and probably where a lot of people wished they sold in hindsight, in order to buy twice as much at current prices.Quote from: buwaytress on February 27, 2023, 04:01:08 PMSo even if it touches $20K in the next few weeks, I don't think it will be a good indicator.Without wanting to sound like a broken record, unlike any other time price was at $20K, the 200 Day MA is currently priced around there, as well as it being the average price since August 2022 highs around $25K. I'm not saying $20K is some significant physiological level anymore, as it certainly wasn't that relevant last year when price traded above and below, but could very well be seen as a support level in near future.I also anticipate many will be getting very bearish around $20K, fearing the worst, whereas after the golden cross on Daily time-frame (50 & 200), it'd potentially be a great buying opportunity for many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "February 28, 2023, 02:05:01 PM",
      "body": "Quote from: dragonvslinux on February 27, 2023, 05:01:47 PMQuote from: buwaytress on February 27, 2023, 04:01:08 PMDon't think there are any more psychological points other than $10k (and ATH).I'd say maybe $50K. It's half of $100K (previous bull target for many including myself) and probably where a lot of people wished they sold in hindsight, in order to buy twice as much at current prices.You're right, actually, now that think of it. It's very nicely poised at roughly 75% of ATH and the hallway mark that includes me as one so certain that was the minimum target (a big reason I completely missed the top, particularly when 60k was breached twice).Quote from: buwaytress on February 27, 2023, 04:01:08 PMSo even if it touches $20K in the next few weeks, I don't think it will be a good indicator.I also anticipate many will be getting very bearish around $20K, fearing the worst, whereas after the golden cross on Daily time-frame (50 & 200), it'd potentially be a great buying opportunity for many.[/quote]Yeah the 200 is really the only one left I pay attention to. People are still bearish even now, so yeah, 20k especially sub -- and it won't matter if it happens sooner or later, but this year -- will break a lot of resolve. I don't mind saying I'm very comfortable in this range or lower, so my DCA squeezes as much juice as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FUCKBSVFUCK",
      "created_time": "May 02, 2023, 06:08:32 AM",
      "body": "I don't think it's going to be a good idea to keep leverage in the long term. It's a matter of time and we're in a bear.    If you look at the history of the crypto market, you'll see that it's pretty much the same as it was back in the day. The price of Bitcoin has been on the decline for a long time and it's not that long ago that people were able to get a hold of it.    But I'm not a fan of it, I've been in the market for a long time and I'm happy to see it go up and down in terms of price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "May 04, 2023, 03:46:05 PM",
      "body": "Quote from: buwaytress on February 28, 2023, 02:05:01 PMQuote from: dragonvslinux on February 27, 2023, 05:01:47 PMQuote from: buwaytress on February 27, 2023, 04:01:08 PMDon't think there are any more psychological points other than $10k (and ATH).I'd say maybe $50K. It's half of $100K (previous bull target for many including myself) and probably where a lot of people wished they sold in hindsight, in order to buy twice as much at current prices.You're right, actually, now that think of it. It's very nicely poised at roughly 75% of ATH and the hallway mark that includes me as one so certain that was the minimum target (a big reason I completely missed the top, particularly when 60k was breached twice).Also bare in mind $15K was 75% of ATH from around $20K with price reaching almost $14K in 2019.Quote from: buwaytress on February 28, 2023, 02:05:01 PMQuote from: dragonvslinux on February 27, 2023, 05:01:47 PMQuote from: buwaytress on February 27, 2023, 04:01:08 PMSo even if it touches $20K in the next few weeks, I don't think it will be a good indicator.I also anticipate many will be getting very bearish around $20K, fearing the worst, whereas after the golden cross on Daily time-frame (50 & 200), it'd potentially be a great buying opportunity for many.Yeah the 200 is really the only one left I pay attention to. People are still bearish even now, so yeah, 20k especially sub -- and it won't matter if it happens sooner or later, but this year -- will break a lot of resolve.Well I guess it turned out $20K was the great buying opportunity all along, as a classic re-test of 200 Day MA after golden cross  As for the liquidity map, since this topic was recently bumped, there's a clear gap up to $31K (as this is where price recently reached). Otherwise to the downside there is an increase in liquidity from around $23K with not a lot aorund $25K. Many people still expect $25K, even $26K, to act as support if price corrects to the downside. But personally, based on liquidity and trading volume, I find $23K more likely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "May 04, 2023, 04:53:09 PM",
      "body": "Quote from: dragonvslinux on May 04, 2023, 03:46:05 PMQuote from: buwaytress on February 28, 2023, 02:05:01 PMYeah the 200 is really the only one left I pay attention to. People are still bearish even now, so yeah, 20k especially sub -- and it won't matter if it happens sooner or later, but this year -- will break a lot of resolve.Well I guess it turned out $20K was the great buying opportunity all along, as a classic re-test of 200 Day MA after golden cross  As for the liquidity map, since this topic was recently bumped, there's a clear gap up to $31K (as this is where price recently reached). Otherwise to the downside there is an increase in liquidity from around $23K with not a lot aorund $25K. Many people still expect $25K, even $26K, to act as support if price corrects to the downside. But personally, based on liquidity and trading volume, I find $23K more likely.So it turned out to be so indeed. Don't think we're quite so ready to wave farewell to that border, even if the hubbub on the news circles is that we're seeing the peak of USD interest and that means no further pressure -- but if we do revisit it will be short, followed by a beautiful bounce back to levels now.Still decent buying levels now even with 23k support (which means today's price is \"only\" a 20+% premium)...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}