{
  "id": "topic_5452304",
  "title": "bkelly13",
  "author": "bkelly13",
  "created_time": "May 10, 2023, 10:10:52 PM",
  "content": "If the U.S. goes into default on its debts, what do you expect the reaction will be in the BTC world?What about other crypto currencies?My naive view is that BTC and other currencies should gain value.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452304",
  "comments": [
    {
      "author": "franky1",
      "created_time": "May 10, 2023, 10:58:27 PMLast edit: May 10, 2023, 11:39:28 PM by franky1",
      "body": "1. US is the IMF reserve and the manager of international loan policy.. they can rig their own credit rating. 2. defaulting to other countries can be cured by a few things, such examples are:a.the loans it makes to other countries can be cancelled out against the loans other countries made to the us. 1for1thus bringing the amounts down. (writing off debt)b.rigging the forex rate to change how much breadloaf/labour value of money is owed to other countriesEG if $1 =€1.10 they can change that to €2.20 and half the debt owed by measuring the debt in €expected back to the eu3. the US can just QE new money domestically without needing to get loans from any countries..with all that said fiat is a scam.they can create as much as they like and dont need a vote from their populous to loin in or out more either..  they tax you where taxes are suppose to pay for public services for the populous to benefit from.. but they are now finding excuses to not pay for public services (road/bridge repairs/emergency services) and instead want taxes to pay the rich corporations that dont offer public services. yep the populous pays into the tax treasury but no longer get the same amount out in public populous benefit/servicesbitcoin however is not tethered to US economy even if its priced in it. bitcoin has its own international community where bitcoin has its own usecase and functionality meaning its own price discovery,that said if we use a breadloaf value/labour value EG $7.50 was min wage now moving to $15... $1.25 was bread now $2.50. bitcoins growth has exceeded that in deflation in less time. so dollars inflation doesnt pair to bitcoins deflationwhen people hate the dollar they cannot exactly move 100% to another currency for daily life because fiat still controls things like wage requirements, taxes, bills, debts. however some will try to find ways to lock value up from their savings into crypto investments. however the large traders that could affect the crypto market price substantially will do OTC trading, meaning not directly affecting the bitcoin price. there will be some price drama. but it can go both wayspeople losing daily spend fiat lifestyle ability will sell their investments to survive a fiat life. or those already settled in a cozy fiat life with no debts/payments to make to survive will invest into crypto...however the downside is limited.bitcoin has a fundamental infrastructure \"bottom\" which aligns with the lowest most efficient mining cost on the planet. no one wants to sell for less than anyone on the planet can mine for. so unless there is a mega hashrate drop. there is a bottom that is non zero. at the moment this bottom was $15k moving to $20k. which means the downside can only go to $20k but the upside this year so far can go upto $130k due to same fundamental measures of the same, for the topsno one knows the amount, timing or price it can be in the future but the signs are there would be more of an upside chance than a downside chance in the near future. but no one knows for sure.. it can go both ways",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 11, 2023, 04:30:49 AM",
      "body": "Quote from: bkelly13 on May 10, 2023, 10:10:52 PMIf the U.S. goes into default on its debts, what do you expect the reaction will be in the BTC world?What about other crypto currencies?My naive view is that BTC and other currencies should gain value.This is called the impossible assumption, and it will not happen because the decision is political. Whenever the politicians agree, the problem will be solved, and the political agreement is possible, due to the disastrous effects of such a decision on the voters who bring these politicians, and the politicians are very sensitive to the vote of middle class members, and therefore the United States will not be late in paying its debts as long as The global financial system in its current form.In the short term, a strong correction will occur due to the panic that will occur in the markets, but soon the price will recover, and we may see levels above $40,000 for this year.Recession indicators confirm that it will be temporary, so we will see levels between $24,000 and $35,000 until the end of the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 11, 2023, 05:18:43 AM",
      "body": "QE will be good for the crypto but then they might not like it as well. And it will result in people not trusting USD. They do have options like raising the debt ceiling or just cut spending. Recession will come like 2008 and cycle again. It will keep going and will have another recession in the next decades.  The fact that it keeps coming back, there is no real solution to this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 11, 2023, 01:26:26 PM",
      "body": "The USA can always just print enough to pay what it has to in order to avoid a default, as well as raise a debt ceiling to borrow more. So I don't think the USA will ever default on its foreign debt, to be honest. But even if somehow the default occurs, it's not automatically an economic catastrophe for the USA and its currency because it's more of a reputational than practical damage, and the USA is still in very high demand and has too much of an influence to truly suffer from it. Thus, I'd say that there wouldn't be any impact on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "May 11, 2023, 01:30:12 PM",
      "body": "What if I tell you that the US is already in debt since the 2008 crash? They just simply print more money to balance it out but that doesn't mean the financial condition of the country is doing good.What if you are told the wrong reserve values and the actual reserve is something different? Here I am talking about gold. What if they are selling gold reserve to fund their economy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bkelly13",
      "created_time": "May 11, 2023, 01:31:06 PM",
      "body": "Quote from: Husires on May 11, 2023, 04:30:49 AMThis is called the impossible assumption, and it will not happen because the decision is political. I don't see that as impossible at all.  Considering the incredibly antagonistic view each party has of the other, and indeed of the general public members of each party, I see it as a real possibility.  That it is a political decision is what makes it a real possibility.  If things go really bad each side will self-righteously blame the other. I don't have sufficient knowledge to proclaim a probability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bkelly13",
      "created_time": "May 11, 2023, 01:34:39 PM",
      "body": "Quote from: ImThour on May 11, 2023, 01:30:12 PMWhat if I tell you that the US is already in debt since the 2008 crash? They just simply print more money to balance it out but that doesn't mean the financial condition of the country is doing good.What if you are told the wrong reserve values and the actual reserve is something different? Here I am talking about gold. What if they are selling gold reserve to fund their economy?In debt, oh yes, tremendously, and getting worse with no probable end in sight.  Gold no longer backs up the U.S. dollar.  What really backs the dollar and keeps it value is the confidence people have in it.  Confidence expressed by every single transaction that uses the dollar.  Confidence supported by the ability of the U.S. to produce goods and services that may be purchased with the dollar.Regarding the original question: I suspect there is no person, or group, who has sufficient information to make a solid prediction.  But, I suspect that world wide cryptocurrencies will tend to go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 11, 2023, 02:29:10 PM",
      "body": "Quote from: duckalis on May 10, 2023, 11:42:51 PMGeoff Kendrick, the head of forex research at Standard Chartered, believes that if the US defaults on its debt obligations, the price of BTC would rise 70% to more than $40,000. He called a possible default an unlikely event that could still caouse serious consequences. Therefore, investors who consider BTC a safe haven will pour their funds into the major coin if the market falls.If a default is declared, the surge in BTC price won’t start immediately. The surge would be preceded by a fall of around $5000, after which the coin would rise by $25,000. While BTC will follow a bullish trend, prices of other cryptos may decline.I pretty much agree with this.A default would cause mass chaos for the US economy and the Dollar, and therefore likely cause mass economic chaos globally. Probably all assets would drop, including Bitcoin and Gold, initially as fear spreads. But I think very quickly people would realize they need to get out of the dollar as well and the only place to go would be Gold and Bitcoin. Gold would probably go up like 20%, while yeah I could see Bitcoin doubling very quickly in that sort of situation.Though if the US did default, I think the obstructionist politicians that caused the default would come to the table and end the default rather quickly to fix the problem. But even if it only lasted a few days it would damage the US's and the Dollar's strength in the world and so it would still greatly help Bitcoin. I think you'd have a lot more people saving money in Bitcoin rather than Dollars as a result of a debt default.And yeah it's likely that altcoins would drop as Bitcoin gained, because when things are crashing you don't throw money into highly risky valueless speculative things like altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "May 11, 2023, 02:39:59 PM",
      "body": "Quote from: thecodebear on May 11, 2023, 02:29:10 PMQuote from: duckalis on May 10, 2023, 11:42:51 PMGeoff Kendrick, the head of forex research at Standard Chartered, believes that if the US defaults on its debt obligations, the price of BTC would rise 70% to more than $40,000. He called a possible default an unlikely event that could still caouse serious consequences. Therefore, investors who consider BTC a safe haven will pour their funds into the major coin if the market falls.If a default is declared, the surge in BTC price won’t start immediately. The surge would be preceded by a fall of around $5000, after which the coin would rise by $25,000. While BTC will follow a bullish trend, prices of other cryptos may decline.I pretty much agree with this.A default would cause mass chaos for the US economy and the Dollar, and therefore likely cause mass economic chaos globally. Probably all assets would drop, including Bitcoin and Gold, initially as fear spreads. But I think very quickly people would realize they need to get out of the dollar as well and the only place to go would be Gold and Bitcoin. Gold would probably go up like 20%, while yeah I could see Bitcoin doubling very quickly in that sort of situation.Though if the US did default, I think the obstructionist politicians that caused the default would come to the table and end the default rather quickly to fix the problem. But even if it only lasted a few days it would damage the US's and the Dollar's strength in the world and so it would still greatly help Bitcoin. I think you'd have a lot more people saving money in Bitcoin rather than Dollars as a result of a debt default.And yeah it's likely that altcoins would drop as Bitcoin gained, because when things are crashing you don't throw money into highly risky valueless speculative things like altcoins.Don't be dramatic. The US debt limit is $31.4 trillion, and the current level of the US national debt is $31.7 trillion. The debt ceiling was reached on January 19, 2023, in other words, the technical default has already occurred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bkelly13",
      "created_time": "May 11, 2023, 05:09:58 PM",
      "body": "Quote from: be.open on May 11, 2023, 02:39:59 PMDon't be dramatic. The US debt limit is $31.4 trillion, and the current level of the US national debt is $31.7 trillion. The debt ceiling was reached on January 19, 2023, in other words, the technical default has already occurred.This is what I think is true, but do not know for a fact.Yes, we have exceeded the debt limit.  But, and a very big but, the people in the treasury, and/or other agencies, are prioritizing the items to be paid right now and no due bills have been missed.  That says that technically speaking, we have not defaulted.  However, they can only juggle a few weeks more before there are actual defaults.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 12, 2023, 04:31:25 PM",
      "body": "I do not think that it would be possible for US to ever default on their debt at all. I think the best thing about US debt is that it is unending and keeps growing and you could always trust that it will keep going bigger and bigger. They were talking about just a few trillion dollars which is already a lot, just a decade or so ago, and now they are talking about 20+ trillion dollars easily.I am not sure when it was but I remember it was about 4-6 trillion range and everyone was going crazy about how huge that was, because not many nations in the world could have that much, USA could be the first one to get there probably. Now it is 5 times that much and people are acting as if that is normal and they are going on, so they would never default it when they could just make more of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "May 12, 2023, 04:52:56 PM",
      "body": "Quote from: bkelly13 on May 10, 2023, 10:10:52 PMIf the U.S. goes into default on its debts, what do you expect the reaction will be in the BTC world?What about other crypto currencies?My naive view is that BTC and other currencies should gain value.US can simply print more money out of thin air and repay the debt and it as simple as that for them.But they won't do so because it will burn their economy due to very high inflation and interest hikes.They will probably do it slowly and gradually decrease their debts. Fiat will not be more sustainable at one point and I hope it comes soon.We are so in need of alternate financial system. Crypto has so much room to grow and needs to mature before we can finally use it as an alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "May 12, 2023, 06:54:49 PM",
      "body": "Quote from: pawanjain on May 12, 2023, 04:52:56 PMUS can simply print more money out of thin air and repay the debt and it as simple as that for them.But they won't do so because it will burn their economy due to very high inflation and interest hikes.They will probably do it slowly and gradually decrease their debts. Fiat will not be more sustainable at one point and I hope it comes soon.We are so in need of alternate financial system. Crypto has so much room to grow and needs to mature before we can finally use it as an alternative.They've already tried printing more dollars out and it's resulted in inflation. They used the funds to create a social welfare state during COVID and they accepted inflation as a consequence. Modern Monetary Theory states that no country that prints its own money will go bankrupt. And there is no doubt in my mind that they would replicate the COVID strategy again if they needed to pay of debt seeing their adamance to spend money that did not exist during COVID.Debt isn't inherently bad. If the U.S. had the economic growth to sustain the liabilities they were taking on then it would be a different story. Except the debt to GDP ratio has been disproportional since Bill Clinton was in office so you can't count on the U.S. ever paying it off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "May 12, 2023, 09:08:51 PM",
      "body": "Quote from: ImThour on May 11, 2023, 01:30:12 PMWhat if I tell you that the US is already in debt since the 2008 crash?LOLLearn some history.What if I tell you that the U.S. has been in debt continuously since the year 1837.Quote from: ImThour on May 11, 2023, 01:30:12 PMWhat if you are told the wrong reserve values and the actual reserve is something different? Here I am talking about gold.Why does the gold reserve matter?  The U.S. currency hasn't been backed by gold since 1971.Quote from: ImThour on May 11, 2023, 01:30:12 PMWhat if they are selling gold reserve to fund their economy?Maybe they are. Maybe they aren't.  Why does it matter?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}