{
  "id": "topic_5450942",
  "title": "Takiwaza",
  "author": "Takiwaza",
  "created_time": "May 02, 2023, 09:52:37 AM",
  "content": "Hello Everyone , having a Great Day?I have something to share with all of you Guys.................. Will have a New Event that you should try it for yourself    Here is the link that you can read and see  https://k8.io/promotions/Daily-Deposit-BonusDaily 100% Deposit BonusContent：Get 100% Bonus on your first deposit on the day!How to join：100% bonus up to $3,000 is applicable to the first deposit of the day;Please contact our live support to receive the bonus and complete 15x wagering of your deposit plus bonus before withdrawing your winnings.VIP Level                        Bonus Amount              Daily Bonus Limit   Wager RequirementIron - Silver                             100%                         $300                      x15Gold - Platinum 4                     100%                           $1,000                   x15Platinum 5 - Diamond                 100%                           $3,000                 x15Terms and Conditions:The promotion is according to UTC+0 time zone. Only one offer can be claimed per deposit, and it cannot be in conflict with other deposit bonus promotions;Please note that the wager requirements for this promotion only counts towards slot machine games, other games will not be counted;Email, phone number and KYC level 2 verification must be completed before this bonus can be claimed;Each account (including but not limited to IP address, device information, and wallet address) is only eligible for this bonus once. Duplicate applications will not be accepted;To avoid any discrepancies in interpretation, K8 reserves the right to make the final interpretation of this promotion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450942",
  "comments": [
    {
      "author": "swiftxi",
      "created_time": "May 02, 2023, 11:47:45 AM",
      "body": "Tryed with 10$, I won 0.5$.Its hard to win anything settings are super low",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}