{
  "id": "topic_5465507",
  "title": "nur1labs",
  "author": "nur1labs",
  "created_time": "September 03, 2023, 01:14:56 PMLast edit: September 04, 2023, 06:53:32 AM by nur1labs",
  "content": "PrologIndonesia as island country have many culture and good people. We see this is make people to people using delivered items, food or any groceries is using apps. And sometimes people easy order something. In this country we known people as market. The market self is hard if some people not know technology for using apps. then we build some platform where people easy connect between farmer to distributor to market to auditor to people. Auditor market need as validate of items or store self. This maybe not just Indonesia case but some apps not care about this. So we build this as full platform as trusted.NurGolds is 1st Platform Have The Unprediction Value Of Gold. The project is abour the Gron Platform as main base to using by NurGolds NetworkNurGolds aims to world wide platform for everyday backend by goldName : NurGoldsTicker : NURSType : CryptocurrencyEngine : MuBdI Blockchain PlatformSupply : 15.000.000Type Solve Problem : Proof Of StakeBackend : GoldWhy NurGolds?NurGolds project is bases for using in Gron Platform. Gron Platform build for rich future E-Commerce. Gron Platform Features is GronBike, GronStore, GronCar.NurGolds using as base for gold saving. We build since start on roadmap(see site). NurGolds using by daily saving without people worries the money gone. Many people using not good using potential of Gold. in NurGolds you can spending, using or saving gold.What is Gron Platform?Gron Platform growth for make easy people using apps to everyday.Gron Platform using apps model for using daily life not just for rich people but not rich can using. Gron Platform priority is daily using like groceries so they can make it available for using daily. But not many know as Gron Platform using bases blockchain for not just using but saving. Gron Platform build for this to make sure people after buying or maybe become selller they can saving to by keep using Gron Platform.Gron Platform has GronBike, GronCar, Gron Store and Gron Wallet. People can easy using by Gron Wallet to saving some Gron Coin to NurGolds coin to invesment or saving gold. Or you can using Gron Store to selling or buying for daily life like groceries with good reputation of sellers. You can using GronBike to go to another place with safe, trust, and good driver. Even GronCar same for long trip.Market Circulation?Market Circulation by Gron Platform with doing economic and saving side. Both importan as using, invesment and daily life. With NurGold as Gold saving and Gron Platform as Ecommerce to buy and selling items every day. So far combined as best system for living and securing. In Pandemic people hard to saving money event using it. If now they can using Gron Platform as daily using and Nurgolds as saving for gold.How to join NurGolds?Go to site below to join our site belowSites : LinkLanguage :Russia : Sites : LinkTelegram Channel : LinkTelegram Group : LinkDiscord : LinkPre-ICo Schedule is 1 month and after that ICO start. We make sure you guys as first starter got more bonuses. Pre-Ico will build for Starting up so if anyone still see website bugs or anything keep report. we keep update information.Value Gold stable now. hurry to place seat of future Ecommerce with Gold. Note : we made bitcoin talk as sponsorhip not about money but opportunity bitcointalk give us to presentation about our project. thank you for all team bitcointalk. and Member too.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465507",
  "comments": [
    {
      "author": "jaya2016",
      "created_time": "September 03, 2023, 01:26:34 PM",
      "body": "This is talks about how technology and apps have influenced the way people in Indonesia interact with delivery, food and shopping. This highlights how some people may have difficulty accessing this technology. This text also discusses NurGolds, which is a platform linked to the value of gold. This appears to be a project related to a platform called Gron Platform. This text mentions NurGolds as a Proof of Stake type cryptocurrency, based on the MuBdI Blockchain Platform. What do you think about the use of technology and applications in delivery of goods, food and shopping in Indonesia, as described in this?What do you know about NurGolds and how do you interpret its role in the use of gold? What do you think about Proof of Stake type cryptocurrencies backed by gold, as mentioned in this? I'm very interested in this. And for its use for the long term. And requires input from many people to expand its use. cheers...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nur1labs",
      "created_time": "September 03, 2023, 01:46:06 PM",
      "body": "Quote from: jaya2016 on September 03, 2023, 01:26:34 PMWhat do you think about the use of technology and applications in delivery of goods, food and shopping in Indonesia, as described in this?many in indonesia or maybe some of ecommerce not using blockchain and not backend by gold. with this project our goal to made the blockhain bases by ecommerce and using gold behind it. This make stable economicQuote from: jaya2016 on September 03, 2023, 01:26:34 PMWhat do you know about NurGolds and how do you interpret its role in the use of gold? NurGolds roles is become stable or make platform is have economic value between fiat <-> crypto currency <-> platformQuote from: jaya2016 on September 03, 2023, 01:26:34 PMWhat do you think about Proof of Stake type cryptocurrencies backed by gold, as mentioned in this? Proof Of Stake in this Gron Platform is easy. just example you top up the money to platform then in the platform you can press saving money. In this case staking is active without people know. What we know today people in more than here is using fiat and not know cryptocurrency. So our goal is to make cryptocurrency knowledge by using our platform. So far 3 power for Gold. Using, Spending and Saving Gold. That it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "September 03, 2023, 01:55:03 PM",
      "body": "its just basically token like e-money that already exist, dunno why you create this without any function, and no needed for blockchain here for typical use casei know how this is goes, and as you know implementing your project need to be regulated to work with normal market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nur1labs",
      "created_time": "September 03, 2023, 02:16:55 PMLast edit: September 03, 2023, 04:38:08 PM by nur1labs",
      "body": "Quote from: fmz89 on September 03, 2023, 01:55:03 PMits just basically token like e-money that already exist, dunno why you create this without any function, and no needed for blockchain here for typical use casei know how this is goes, and as you know implementing your project need to be regulated to work with normal marketbasically now people just know using fiat as ecommerce. we never heard gold running in ecommerce. well we different but we keep improved what other people tell. thank you for opinion. we just wanna make stable economic. plus this not token this coin. It's self running blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaya2016",
      "created_time": "September 03, 2023, 02:55:23 PM",
      "body": "I understand that you have doubts about the usefulness of tokens like NurGolds in the context of digital currencies. It's true, there are many digital currencies or e-money that have existed before.The reason behind the creation of NurGolds may have to do with the multiple uses that its developers aim to achieve. In some cases, tokens like these can be used for specific purposes such as investments, payments, or even in certain industries such as precious metals such as gold.Your criticism about there being no need for blockchain in some use cases may be valid. Blockchain is often used to address specific problems that require transparency, security and decentralization. However, not all projects require blockchain technology.Rules and regulations are very important in the development of a project like this, especially when it involves financial transactions. Adherence to the applicable guidelines is a very important step in building successful and trusted projects in the market.This discussion can help to understand more deeply about these kinds of projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nur1labs",
      "created_time": "September 03, 2023, 03:29:31 PM",
      "body": "Quote from: jaya2016 on September 03, 2023, 02:55:23 PMI understand that you have doubts about the usefulness of tokens like NurGolds in the context of digital currencies. It's true, there are many digital currencies or e-money that have existed before.The reason behind the creation of NurGolds may have to do with the multiple uses that its developers aim to achieve. In some cases, tokens like these can be used for specific purposes such as investments, payments, or even in certain industries such as precious metals such as gold.Your criticism about there being no need for blockchain in some use cases may be valid. Blockchain is often used to address specific problems that require transparency, security and decentralization. However, not all projects require blockchain technology.Rules and regulations are very important in the development of a project like this, especially when it involves financial transactions. Adherence to the applicable guidelines is a very important step in building successful and trusted projects in the market.This discussion can help to understand more deeply about these kinds of projects.This make our different with other e-commerce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}