{
  "id": "topic_5463872",
  "title": "shitpost pioneer",
  "author": "shitpost pioneer",
  "created_time": "August 19, 2023, 11:17:12 PM",
  "content": "Right now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463872",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "August 19, 2023, 11:30:18 PM",
      "body": "There will be for sure a new bull market in the coming months, but we can not also over look the fact that we are already on the bearish season, Bitcoin price is already down by more than 10% over the past days, and same with ETH but ETH seems to be recovering by 5%+ from what it have previously dump with after the recent news of it getting approved by the SEC on Bitcoin ETF. It is just a matter of time for the crypto market to recover again, maybe before the end of September we might see a green market again, as of the month of August I don't see any great price upward movement coming soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "August 19, 2023, 11:37:05 PM",
      "body": "Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. Bitcoin was pushing another coin to be dumped. Please look at this https://www.investing.com/news/cryptocurrency-news/spacex-sold-373m-worth-of-bitcoin-acquired-in-20212022-report-3156924Bitcoin needs a lot of volume to push it back again to the 29k -30k. One of the companies that holds a lot of btc was just liquidating its crypto. Im not even sure what's gonna be the future of bitcoin. I can consider spacex leaves crypto is bad signal.We must be patience until market turns to be bullish again soon. Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMBut Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. The price of bitcoin and ethereum are still very strong at this moment but it seems like that it's lack of buying volume. This is not bad but i hope there will be more volume to come for bitcoin. It may stuck in the same place this time. Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMWhat is your personal expectation? Slowly but surely crypto will be going up again in the future. The market being shaken by the dump from one of big company in the world. I would not be surprised to see that everything turn into the red due to the bitcoin dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 19, 2023, 11:40:39 PM",
      "body": "Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation? Relax mate. We are in the midst of month of August and this is the time where mostly believe of ghost month where everything went down. Obviously sensitive traders and people who are into this belief are probably converted into stable for a while and waiting for this to end and surely will buy back once the market regain again. I dont know but its normal when this month arrived. Btc and eth chart are both fine and we just need more volume to compensate those -10%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shitpost pioneer",
      "created_time": "August 19, 2023, 11:49:38 PM",
      "body": "Quote from: cryptoaddictchie on August 19, 2023, 11:40:39 PMQuote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation? Relax mate. I'm always relax, Sir. Quote from: cryptoaddictchie on August 19, 2023, 11:40:39 PMBtc and eth chart are both fine and we just need more volume to compensate those -10%Yes, we need more people for buy. If everyone (or most people) who own Bitcoin now, do not sell it, while many new people buy it, it will result in a big market demand and it's a very good base to start an extended bull market on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "August 19, 2023, 11:53:14 PM",
      "body": "Basically, we repeated the pattern we've seen already in March to June (when Bitcoin fell slowly from 30K to 25K). The difference is that the Bitcoin Dominance in this sub-cycle is substantially higher, this means altcoins are in a bear market since March already.I believe there are however some signs to be optimistic:- BitVol (implied volatility)/EthVol. Even if very recent volatility is growing again, these indicators are still very low. Low BitVol and EthVol values always preceded bull runs in the past (at least since 2019). But sometimes there were short dumps before the bullish turn, so we could be in such a situation again.- Possible double Bitcoin bottom at 25K. This could stabilize the whole market again.- Possibly, a volume uptrend after August with positive outcome for BTC and altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jasonjm",
      "created_time": "August 20, 2023, 04:57:29 AM",
      "body": "I think the bear will be dominant in the next couple of months. After that, the BTC price will start to increase and the bull will probably take control. In 2024 we might see a new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "miruha333",
      "created_time": "August 20, 2023, 05:26:51 AM",
      "body": "Quote from: jasonjm on August 20, 2023, 04:57:29 AMI think the bear will be dominant in the next couple of months. After that, the BTC price will start to increase and the bull will probably take control. In 2024 we might see a new ATH. That's very early for growth. And bitcoin's peak usually comes after six months of halving. I don't expect growth any time soon. Maybe in the winter, if economic conditions are favourable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "August 20, 2023, 11:23:08 AM",
      "body": "Quote from: cryptoaddictchie on August 19, 2023, 11:40:39 PMQuote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation? Relax mate. We are in the midst of month of August and this is the time where mostly believe of ghost month where everything went down. Obviously sensitive traders and people who are into this belief are probably converted into stable for a while and waiting for this to end and surely will buy back once the market regain again. I dont know but its normal when this month arrived. Btc and eth chart are both fine and we just need more volume to compensate those -10%Upon seeing this comment I just realized that we are in a ghost month. It's a Chinese belief but knowing how big its economy is and its worldwide contribution then I won't be surprised if many non-Chinese are also practicing the same beliefs when it comes to the open market. There were years also in the past when I used to sell nearly all of my holdings in favor of USDT and then buy I'll just buy again later. Lately, I am starting from scratch so my holding is not big and it's probably the same reason why I am not very sensitive and forgot the ghost month. Anyways, at least I am able to accumulate more altcoins and bitcoin this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 20, 2023, 12:16:55 PM",
      "body": "10% drops in price are nothing, most of us here more than 5 minutes have seen multiple 50% plus dumps over the years. Use dumps as an opportunity to sweep up cheap coins/tokens. Most people panic sell but the smart guys amongst us buy the fear. A bull market will come, don’t worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 20, 2023, 12:37:57 PM",
      "body": "Quote from: inthelongrun on August 20, 2023, 11:23:08 AMUpon seeing this comment I just realized that we are in a ghost month. It's a Chinese belief but knowing how big its economy is and its worldwide contribution then I won't be surprised if many non-Chinese are also practicing the same beliefs when it comes to the open market.Yes with that scenario Im sure even non Chinese would eb caution. But if you are a holder, then nothing to worry cause everyone knows after the ghost month it will be the real market movement. This drop is now occuring due to that reason but as September approaches that will be the start of a new market trend.If you got more stables then you could add many altcoin in this bargain sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "August 20, 2023, 01:40:07 PM",
      "body": "Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation? Despite the price decline of Bitcoin and major altcoins, I was not worried yet nor I should have to. I was aware of the possible drop and I guess we all know about it because we are here in a volatile market. And to say that 2023 is in the recovering year for crypto and even during the time of the bull season, price corrections are still present. It is not wondering why the situation goes like this as FUDs certainly have a huge impact on the market trend. But this is not the reason to think and assumes that we are turning back bearish again, I was still optimistic for the upcoming days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandji02",
      "created_time": "August 20, 2023, 01:41:14 PM",
      "body": "I prefer not to predict anything in the short term. Pumps and dumps are temporary. But I don't think we're gonna see a bull market too soon. I just wonder if crypto will stay for a moment or will go down even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 20, 2023, 01:44:23 PM",
      "body": "Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation? If you browse the price chart of Bitcoin during April to June this year. Bitcoin price slide from 30k to 25k on same manner but it recover slowly after that. There's a bad news that time about inflation or something but the price recovered after a few days of 25K support hold the dip.I expect price recovery soon because there's no real bad news in crypto space unlike previous heavy that is really backed by bearish news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "August 20, 2023, 05:44:19 PM",
      "body": "Quote from: DeathAngel on August 20, 2023, 12:16:55 PM10% drops in price are nothing, most of us here more than 5 minutes have seen multiple 50% plus dumps over the years. Use dumps as an opportunity to sweep up cheap coins/tokens. Most people panic sell but the smart guys amongst us buy the fear. A bull market will come, don’t worry. I won't have to panic about such slight drop as 10% on bitcoin or etheruem. Bitcoin move from around $29k to $26k is not much to fuss about. In fact some whales are still keeping their cups open to make a DCA on further drop because the larger aim is next year's halving and not really what is happening now. The bull run for next year is predicted to be massive and speculated to jump into 6 digits, that is going to be massive",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "miruha333",
      "created_time": "August 21, 2023, 07:24:40 AM",
      "body": "Quote from: Pandji02 on August 20, 2023, 01:41:14 PMI prefer not to predict anything in the short term. Pumps and dumps are temporary. But I don't think we're gonna see a bull market too soon. I just wonder if crypto will stay for a moment or will go down even more.I don't like making predictions. I neither believe in nor know how to make them. I think all predictions are designed to influence users to do what the market maker wants. The market will grow, but not right now, especially since several countries are currently facing economic hardship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "August 21, 2023, 08:37:28 AM",
      "body": "The current situation in the market has left us feeling frustrated as it has declined. I think many of us are hoping for an upward trend, but we all understand that the cryptocurrency market is known for its unexpected fluctuations. It's important for us to be prepared for such unpredictable shifts. However, at the moment, the market conditions are not favorable, and the fear factor has also increased. The total trading volume of the crypto market itself conveys a lot of information. Therefore, it's hard to make any definitive statements right now. We'll have to wait and see what the market's next move will be – whether it will break below the support level or break through the resistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "August 21, 2023, 09:07:55 AM",
      "body": "Quote from: shitpost pioneer on August 19, 2023, 11:17:12 PMRight now, it is looking very bearish for our coins because recently, we had a big loss. Bitcoin and Ethereum almost dropped 10%. But Bitcoin and Ethereum are still up from previous gains. It is very difficult if we will have new bull market or new bear market ahead. What is your personal expectation? We all understand the volatility of this market, anyway if we look back a bit we've had a pretty exciting time around the beginning of 2023, I think there will be a decrease and a correction around the mark $20000 or even deeper. However, in terms of long term and looking for profit opportunities, I think people in this market need a capital management strategy to maintain their investment in a long term way, a familiar fact here nothing goes up forever, nothing goes down forever .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hitsnorth",
      "created_time": "August 21, 2023, 09:15:16 AM",
      "body": "My expectations are that the market either will be a bit steady or will go down even more. I wouldn't mind any of those options, grabbing cheap coins is always great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 21, 2023, 10:22:01 AM",
      "body": "Quote from: asriloni on August 19, 2023, 11:37:05 PMBitcoin needs a lot of volume to push it back again to the 29k -30k. One of the companies that holds a lot of btc was just liquidating its crypto. Im not even sure what's gonna be the future of bitcoin. I can consider spacex leaves crypto is bad signal.We must be patience until market turns to be bullish again soon. Things like this happen, and we have no control over their decision to dump their shares, still based on the article Quote Many technology firms and financial institutions continue to hold Bitcoin and other cryptocurrencies. I'm surprised about what happened we all gearing up for a bull run because of the coming halving but if there are dumpers there are takers also so I expect massive buys in the coming weeks.This is a good entry point for those who want to accumulate for the coming halving I'm trying to accumulate as much as possible because anytime we will soon see the price moving up again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}