{
  "id": "topic_5405759",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "July 09, 2022, 10:58:42 PM",
  "content": "Sri Lanka'da son bir kaç günde gerçekleşen olayları çoğunuz izlemişsinizdir. Özellikle bugün sarayın basılması ve önemli yerlerin ele geçirilme görüntüleri izlediğimde beni oldukça etkiledi. Olayın magazinsel tarafıyla değil gerçekte neler olduğuyla ilgilendim. Neler olduğunu anlamak için doğrudan para biriminin durumuna bakmak istedim.Grafikte gördüğünüz müthiş sıçrama son bir kaç günün olaylarıyla ilgili değil mart ayında gerçekleşiyor. Ülkede dolar kalmaması sonucunda ülke ödemeleri gerçekleştiremez hale geliyor ve kısıtlamalar başlıyor. Günde 12 saat elektrik kesintisi, kişilere yakıt satışının yasaklanması gibi ciddi kısıtlamalardan bahsediyorum. Bu olayların sonucunda da halk isyan ediyor. Çok borcunuz varsa ve döviziniz yok ise yerel para biriminizin değeri hızla sıfıra gider. Döviz mevduatlarını bankalarda tutan kişiler yok muydu sizce ? Ve bu kişiler şu an bankalardaki dolarını fiziksel olarak çekmek isteseler alabilirler mi ?Paranız hangi cins olursa olsun Dolar, Euro, altın yada BTC. Kişisel olarak muhafaza edemiyorsanız, devlet koruması altında olduğu söylenen bankalarda bile duruyorsa ve doğrudan harcama yetkisi size ait değilse o para gerçekte sizin değildir. Bitcoini özel ve önemli yapan şey tam olarak budur. Gerçekten sahip olurken hiç kimseden izin almadan harcayabilir yada zahmetsiz saklayabilirsiniz. Çoğu insan hala gerçekte ne olduğunu bilmese de gerçekten global (hatta evrensel) olan tek para birimidir.* Grafik kaynağı: tradingview",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405759",
  "comments": [
    {
      "author": "execijutiere",
      "created_time": "July 10, 2022, 02:53:35 PM",
      "body": "Mümkünse zaten bankalarda para tutmamanın önemi çok büyük.Fiziksel altın veya dolar tutuyorsanız sizin için bir sorun yok ama bunu eğer bankalar aracılığıyla hesaplar arasında tutuyorsanız o sizin gibi gözüken ama kontrolü sizde olmayan bir para haline dönüşebiliyor örnekte görüldüğü gibi.O yüzden fiziksel elinde tutabildiğiniz dünyaca sayılı şeylere yatırım yapmak bu yüzden önemli. Bu bitcoin olur,altın olur veya dolar. Önemli olan heryerde geçebilecek bir varlığa yatırım yaptığındır. Bu günlerde görüyoruz ki bitcoin ve kripto paralarla bile ödeme almaya devam eden ve yeni başlayan bir sürü şirket mevcut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 11, 2022, 06:21:08 AM",
      "body": "QuoteParanız hangi cins olursa olsun Dolar, Euro, altın yada BTC. Kişisel olarak muhafaza edemiyorsanız, devlet koruması altında olduğu söylenen bankalarda bile duruyorsa ve doğrudan harcama yetkisi size ait değilse o para gerçekte sizin değildir.Bitcoini özel ve önemli yapan şey tam olarak budur. Gerçekten sahip olurken hiç kimseden izin almadan harcayabilir yada zahmetsiz saklayabilirsiniz. Çoğu insan hala gerçekte ne olduğunu bilmese de gerçekten global (hatta evrensel) olan tek para birimidir.kripto para borsalarını günümüz bankaları gibi düşünebiliriz. şimdi sokağa çıkıp insanlara sorsan kaç kişi sana \"evet hacım bitcoinleri kendime ait olan cüzdanda tutuyorum.\" yanıtını verir? ethereum, bir ödeme aracı olmasa da onu niye yazmıyorsun aga? sadece BTCBTCBTCBTCBTCBTC yeter la:))tüm dünyada tansiyon inanılmaz bir şekilde yükseliyor. pandemi+savaş ortamı insanların nefes alacak alanının kalmasına neden oldu. bir de bunun üstüne becereksiz ve kötü niyetli yöneticiler gelince insanlar patlama noktasına geldi. olay sadece sri lanka ile kalacak gibi durmuyor. dünya resmen yanıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}