{
  "id": "topic_5441493",
  "title": "Justtoons",
  "author": "Justtoons",
  "created_time": "February 28, 2023, 03:21:25 AM",
  "content": "As we all know, the 2023 elections results that took place on the 25 of February is yet to be released. All Nigerians are hoping and waiting for the results to be released as this would decide the countries economic growth for the next 4years. Rumors has it that the independent electoral commission (INEC) is still working on the results but has promised to release the today, on the 28 of February. We all hope that the right person wins and changes Nigeria positively so our coming years would be fruitful both financiallyBTC and economically.   May our efforts not be in vain. Amen",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441493",
  "comments": [
    {
      "author": "Merit.s",
      "created_time": "February 28, 2023, 06:53:46 AM",
      "body": "I smell something fishery in INEC,all the assurance they gave to Nigerian citizens on conducting a free and fair election is barbash. As reports from observers and party agents said that INEC has failed to upload the result from the PU to Abuja immediately after the elections are over in PU. INEC came up with silly excuses like,no network, inability to access password and low battery. Imagine small children talk,this has proved to Nigerians that it is INEC that is rigging our elections and giving us bad leaders that the citizens didn't vote for. Nigerians are patiently waiting to hear who is the winner of Saturday's election and I think INEC is looking for a way to manipulate the election in favour of their candidate. Gos will disgrace and frustrate whoever wants to change the votes of the people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "February 28, 2023, 11:49:40 AM",
      "body": "Nigerians are patiently waiting as all fingers are crossed. As INEC are currently working on the results, we hope the result will not be manipulated. We also pray that whoever is the choosen one will change Nigeria and make it a better place for us all. We hope this time around that the economy also changes for good because the present economy in Nigeria is not favourable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}