{
  "id": "topic_5432384",
  "title": "d5000",
  "author": "d5000",
  "created_time": "December 30, 2022, 01:39:23 PMLast edit: December 31, 2022, 02:15:44 PM by d5000",
  "content": "Mir kam gerade die naheliegende Idee, man könnte doch hier im Forum gegen Ende jeden Jahres Bilanz ziehen und Events sammeln, die Bitcoin positiv oder negativ beeinflusst haben können. So haben wir in ein paar Jahren eine Art \"Bitcoin-Geschichte\". (Wurde das eigentlich vorher schon mal hier im Forum gemacht? Wenn ja, bin ich für Links dankbar.)Vom Preis her kann man natürlich sagen, dass es ein überaus negatives Jahr war. Um 65% hat der Bitcoin seit Januar verloren, im Vergleich zum ATH 2021 sind die Verluste über 70%. Dennoch gab es auch eine Menge positiver Entwicklungen.Also fang ich mal an:Positiv:Mit der Zentralafrikanischen Republik erkennt der zweite Staat Bitcoin als offizielles Zahlungsmittel an (wenn auch nicht ganz ohne Probleme).Brasilien verabschiedet eine überaus krypto-freundliche Regulierung.Auch Städte und Gemeinden unterstützen Bitcoin, in Europa besonders Lugano mit seinem \"Plan B\" und der \"Bitcoin-Botschaft\".Mit Terra/Luna kommt es zu einer Marktbereinigung bei einigen besonders \"shittigen\" Shitcoins Ein Quasi-PoW-Verbot (genauer: Handelsverbot für PoW-Coins auf offiziellen Börsen) in der EU wird abgewendet.Die letzten Fassungen der MiCa (EU-Bitcoin-Regulierung) sind im großen und ganzen vernünftig (das werden einige Altcoiner und Mini-Börsenbetreiber allerdings anders sehen ...).Die Bolt Card bzw. LNURL-Kartenzahlungen generell als technische Neuheit. Finde die Idee genial.Ein minimal positives Detail gibt es sogar beim Kurs: Der Tiefstwert im Jahr nach dem ATH (also: 10. November 2021 - 10. November 2022) lag mit rund 77% unter dem ATH höher als 2017/18 (84%) und ähnlich wie 2013/14 (76-78% je nach Börse). 2013/14 lag das absolute Low noch tiefer als 2018, es lag aber mehr als ein Jahr hinter dem ATH. Ich schreibe das deshalb so \"vorsichtig\", weil wir ja noch nicht wissen, ob der Bottom dieses Bären \"in\" ist oder nicht. Positiv ist das vor allem, weil ja die allgemeine globale Marktsituation (Aktienmärkte, Zinspolitik etc.) 2014 und 2018 wesentlich besser für Bitcoin als 2022 war.Paypal bietet jetzt eine richtige Bitcoin-Integration, man kann es also als Wallet benutzen (danke Lafu!)Negativ:Der Kursverlauf: -65%, von rund 47K am 1. Januar auf unter 17K spricht eine deutliche Sprache. Die internationale wirtschaftliche Situation war überaus negativ für Bitcoin. Durch hohe Zinsen - als Reaktion auf die erhöhte Inflation, ausgelöst vor allem durch den Ukrainekrieg - wurden riskante Geldanlagen weniger attraktiv, was sehr wahrscheinlich ein Grund für die Kurseinbrüche darstellt.FTX natürlich. Zeigt, das auch große Börsen immer noch nicht so ernsthaft geführt werden, wie man es nach 13 Jahren Bitcoin erwarten könnte.Als Nebenprodukt von FTX: die Erkenntnis, dass viele Bitcoin-Unternehmen in riskanter Weise miteinander verzahnt sind und Dominoeffekte drohen.Mit der AML Directive der EU (die die FATF Travel Rule umsetzen soll) wird eine sehr strenge Geldwäsche-Börsenregulierung angedacht, Börsen sollen zukünftig schon relativ geringe Beträge weitermelden.Die Adoption in El Salvador verläuft schleppend, wichtige Projekte wie die \"Volcano Bonds\" werden immer weiter verschoben. Immerhin: An der Bitcoin-Politik wird festgehalten, der Dip wird gekauft, die Bevölkerung gibt Bitcoin eine mittelmäßige Note (4,6/10).PS: Schlagt gerne weitere Events für Positiv/Negativ vor, die nehme ich dann hier auf.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432384",
  "comments": [
    {
      "author": "1miau",
      "created_time": "December 30, 2022, 06:10:17 PM",
      "body": "Nun, wenn wir reflektieren wollen, wie gut (oder schlecht) das Jahr für Bitcoin war, darf natürlich ein Bitcoin-Chart nicht fehlen: Bis 01. Mai 2022 sah das wirklich nicht schlecht aus aber die vielen Skandale kamen natürlich alle erst danach, wie Terra Luna und FTX. Dennoch denke ich, dass wir früher oder später einen Bärenmarkt gesehen hätten und nach dem Allzeithoch Ende 2021 kamen wir 2022 nicht über 45k hinaus. Ein weiteres Allzeihoch wäre daher vermutlich eh nicht möglich gewesen, da der Kurs bereits zu stark nachgegeben hatte mit 35k am 23.01.2022. So gesehen ist das eine natürliche \"Abkühlung\" des Bitcoin-Preises und das bietet ebenfalls Chancen, Bitcoin technisch weiterzuentwickeln. Siehe die gute Bärenmarkt Durchhalteparole von d5000: Bärenmärkte sind gut für die technische Entwicklung von Bitcoin.Allgemein hat Bitcoin 2022 technisch viel erreicht, um hier nur mal Lightning und Taproot zu nennen. Das wird viel Wert sein, wenn Bitcoin wieder mehr nachgefragt wird, vor allem wenn Shitcoins damit werben, \"innovativer\" zu sein. Daher: ja, es gab viele Verluste dieses Jahr aber die Chance, dass 2023 (erheblich) positiver wird, ist nicht zu verleugnen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "December 30, 2022, 07:10:12 PMLast edit: December 30, 2022, 08:59:29 PM by Lafu",
      "body": "Wie bereits schon erwähnt war dieses Jahr oder die Bilanz für Bitcoin recht durchwachsen und mit vielen hindernissen geplagt.Ich finde die Adoption von Bitcoin in einigen Länder aufjedenfall positivZudem auch wie 1miau bereits geschrieben hat ist Lightning und Taproot auch ein plus.Zu erwähnen ist bestimmt auch das sich mit Paypal auch dort was für Bitcoin in eine richtige richtung entwickelt hatZu den negativen sachen wie FTX brauche ich natürlich nichts zu sagen und denke das dies der Haupgrund für den jetzigen Preisstand ist.Das mit dem Dominoeffekt denke ist bei fast allen großen Börsen oder Investoren so , fällt der erste und größte fallen alle anderen auch.Ich persönlich blicke aber mit guter zuversicht in das jahr 2023 und es wird bestimmt wieder ein aufwind kommen.Lasse mich da überraschen den ändern können wir es ja eh nicht.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "December 30, 2022, 08:58:07 PMLast edit: December 30, 2022, 09:48:20 PM by d5000",
      "body": "Quote from: Lafu on December 30, 2022, 07:10:12 PMZu erwähnen ist bestimmt auch das sich mit Paypal auch dort was für Bitcoin in eine richtige richtung entwickelt hatPayPal ist ein guter Punkt, danke. Hab ich gleich aufgenommen. Zur Erinnerung: Die Bitcoin-Funktion von PayPal gibt es schon seit 2020, aber erst seit diesem Jahr kann man die Coins (jedenfalls bei US-Konten) bewegen, also auf eigene Wallets transferieren.Taproot wurde schon 2021 eingeführt, habe ich deshalb draußen gelassen.Ich habe noch mal beim Negativen den Punkt Kursverlauf etwas \"aufgesplittet\". Die internationale Situation (also vor allem die erhöhten Zinsen) als Einflussfaktor ist eher unabhängig von den Kurskapriolen zu sehen, denn besagte Kapriolen gibt es ja auch aus rein spekulativen Gründen (Blasenbildung).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "December 31, 2022, 08:08:24 AM",
      "body": "Quote from: d5000 on December 30, 2022, 01:39:23 PMPS: Schlagt gerne weitere Events für Positiv/Negativ vor, die nehme ich dann hier auf.Tipp für etwas positives. Auch wenn man nicht „alles“ in Lugano mit Bitcoin bezahlen kann, es gab ein Event am 28+29 Oktober 2022. Wäre BTC in diesem Jahr nicht so stark gedroppt, dann wäre die Drohnen-Show viel stärker um die Welt gegangen. Des weiteren kooperieren El Salvador und Lugano um die Bitcoin Adaption voran zu treiben: https://planb.lugano.ch/Bitcoin Drohnen Show in Lugano / Schweizhttps://bitcointalk.org/index.php?topic=5418816",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 31, 2022, 08:27:06 AM",
      "body": "Quote from: MinoRaiola on December 31, 2022, 08:08:24 AMAuch wenn man nicht „alles“ in Lugano mit Bitcoin bezahlen kann, es gab ein Event am 28+29 Oktober 2022. Wäre BTC in diesem Jahr nicht so stark gedroppt, dann wäre die Drohnen-Show viel stärker um die Welt gegangen. Des weiteren kooperieren El Salvador und Lugano um die Bitcoin Adaption voran zu treiben: https://planb.lugano.ch/War denn schon mal jemand vor Ort und hat sich angeschaut wie gut dort tatsächlich im Alltag mit bitcoins gezahlt werden kann? Finde solche shows sind eine gute Werbung aber zumeist ist der Effekt sehr begrenzt wenn die Leute merken sie können ihre Bitcoins nicht Verwendung (und dann der Preis eventuell noch fällt)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}