{
  "id": "topic_5399996",
  "title": "dragospirvu75",
  "author": "dragospirvu75",
  "created_time": "May 24, 2022, 01:25:51 PM",
  "content": "Hello guys! It's hard for me to understand the lightning network, but I want to join it. I don't mean the technology behind it, I mean how to use of it.If anyone could answer me, I would be grateful.1) What is the most used bitcoin lightning wallet (phone/pc)?2) Do the addresses looks the same as the normal ones or are different?3) How to send bitcoin to a lightning wallet (from a purchase of bitcoin form exchange/ from a normal wallet)?4) If I want to spend bitcoin, the shop needs to have lightning network or is it enough to have normal address/qr code?Thank you in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399996",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "May 24, 2022, 01:31:56 PM",
      "body": "Quote from: dragospirvu75 on May 24, 2022, 01:25:51 PM1) What is the most used bitcoin lightning wallet (phone/pc)?I've only used mobile wallets, my current favourites are BlueWallet (custodial) and Phoenix Wallet (non-custodial, except for channel opening). Lightning Network Stores has many more options.Quote2) Do the addresses looks the same as the normal ones or are different?There are no \"addresses\", only invoices.Quote3) How to send bitcoin to a lightning wallet (from a purchase of bitcoin form exchange/ from a normal wallet)?Funding the wallet varies per wallet. You'll see what you need after you install one. Some exchanges nowadays offer LN withdrawals too.Quote4) If I want to spend bitcoin, the shop needs to have lightning network or is it enough to have normal address/qr code?They'll need to specifically accept LN.My advice: install BlueWallet on your phone, go to the above website, and click Faucet. That should give you enough sats to test.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "May 24, 2022, 01:32:40 PM",
      "body": "Quote from: dragospirvu75 on May 24, 2022, 01:25:51 PMHello guys! It's hard for me to understand the lightning network, but I want to join it. I don't mean the technology behind it, I mean how to use of it.If anyone could answer me, I would be grateful.1) What is the most used bitcoin lightning wallet (phone/pc)?2) Do the addresses looks the same as the normal ones or are different?3) How to send bitcoin to a lightning wallet (from a purchase of bitcoin form exchange/ from a normal wallet)?4) If I want to spend bitcoin, the shop needs to have lightning network or is it enough to have normal address/qr code?Thank you in advance!LoyceV already beat me to the punch... I still decided to post my answer since it sometimes has a different point of view (with the same end result) as LoyceV's answers.1) i run c-lightning, which requires a full node... But i hear a lot of people using electrum, or even a phone wallet like \"wallet of satoshi\" or \"bluewallet\" since we're talking about very small amounts (don't keep large amounts on a phone wallet!!!!)2) not really... you have a wallet to create on-chain channel opening and closing transactions, and this wallet has regular addresses... But once you have an open channel, you create and pay invoices... There are addresses behind the scenes, but you won't be shown an address when you have to pay a lightning invoice, so (as an enduser) you don't have to worry about them3) just like a regular wallet. You'll be shown an address which you can fund. Once you have a funded address, you can use this unspent output to open a channels with an other user.4) if you lock up all funds in your lightning wallet into open channels, the shop will need to accept lightning payments. If your lightning wallet still has some unspent outputs that aren't locked into a channel, you can use them to make on-chain payments aswell. Albeit, these payments are not lightning payments, just regular transactions...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragospirvu75",
      "created_time": "May 24, 2022, 01:34:18 PM",
      "body": "Great, thank you guys for your answers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 24, 2022, 01:40:45 PM",
      "body": "These can be helpful to know about and more about light lightning networkA Beginner's guideline to Bitcoin Lightning NetworkThe Lightning Network FAQUsing a noncustododial wallet for lightning network which would be interesting for you to learn. You can use Electrum for thisElectrum Lightning Network walkthroughOther lightning network walletshttps://99bitcoins.com/bitcoin/lightning-network/wallets/Crypto exchanges that accept lightning networkLightningExchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragospirvu75",
      "created_time": "May 24, 2022, 03:31:05 PM",
      "body": "I will look on them, thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 26, 2022, 04:18:37 PM",
      "body": "Quote from: mocacinno on May 24, 2022, 01:32:40 PM1) i run c-lightning, which requires a full node... But i hear a lot of people using electrum, or even a phone wallet like \"wallet of satoshi\" or \"bluewallet\" since we're talking about very small amounts (don't keep large amounts on a phone wallet!!!!)I consider c-lightning more as a LN node than a wallet, as it has no GUI interface that makes it easy to open the wallet and send an invoice. It's way too easy to mess up with RPC commands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "May 27, 2022, 07:41:06 AM",
      "body": "Quote from: NotATether on May 26, 2022, 04:18:37 PMQuote from: mocacinno on May 24, 2022, 01:32:40 PM1) i run c-lightning, which requires a full node... But i hear a lot of people using electrum, or even a phone wallet like \"wallet of satoshi\" or \"bluewallet\" since we're talking about very small amounts (don't keep large amounts on a phone wallet!!!!)I consider c-lightning more as a LN node than a wallet, as it has no GUI interface that makes it easy to open the wallet and send an invoice. It's way too easy to mess up with RPC commands.True, but on the other hand, they released RTL just for this purpose: being a wallet gui on top of c-lightning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 27, 2022, 07:52:15 AM",
      "body": "Quote from: mocacinno on May 27, 2022, 07:41:06 AMQuote from: NotATether on May 26, 2022, 04:18:37 PMQuote from: mocacinno on May 24, 2022, 01:32:40 PM1) i run c-lightning, which requires a full node... But i hear a lot of people using electrum, or even a phone wallet like \"wallet of satoshi\" or \"bluewallet\" since we're talking about very small amounts (don't keep large amounts on a phone wallet!!!!)I consider c-lightning more as a LN node than a wallet, as it has no GUI interface that makes it easy to open the wallet and send an invoice. It's way too easy to mess up with RPC commands.True, but on the other hand, they released RTL just for this purpose: being a wallet gui on top of c-lightning That may be a bit much for someone who comes here to ask which wallet to use. After trying several wallets, I came to the conclusion that manual channel opening is less convenient than \"automatic\" wallets. And that's coming from someone who prefers manual coin control for all on-chain transactions.Note that this only applies to small amounts. I wouldn't risk anything substantial this way. The amounts are so small, I even use phone wallets without password for convenience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "May 27, 2022, 03:01:11 PM",
      "body": "Quote from: LoyceV on May 27, 2022, 07:52:15 AMThat may be a bit much for someone who comes here to ask which wallet to use. After trying several wallets, I came to the conclusion that manual channel opening is less convenient than \"automatic\" wallets. And that's coming from someone who prefers manual coin control for all on-chain transactions.Note that this only applies to small amounts. I wouldn't risk anything substantial this way. The amounts are so small, I even use phone wallets without password for convenience.Agreed, and that's why my initial post in this thread pointed at electrum, \"wallet of satoshi\" and \"bluewallet\" and stated that c-lightning requires a full node to run I was merely trying to relay the message that i don't use electrum's lightning functionality, nor \"wallet of satoshi\" or \"bluewallet\" myself '(since i use c-lightning, which requires a full node), so i was basically pointing the OP to 3 wallets i had heared about, but clearly stating that i have never used them before (for their lightning functionality) as i use a wallet that's harder to operate... But sometimes in a discussion we lose track of the original question and start having more off-topic discussions (for example, whether or not c-lightning is newbie friendly... which it isn't, or wether or not c-lightning can actually be called a wallet... which it can if you use RTL on top of c-lightning... I hardly ever use RTL to open channels, create invoices or pay... I fire up RTL because it gives a nicer overview of my node's channels and funding, but that's about it... everything else goes via the cli ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}