{
  "id": "topic_5438387",
  "title": "GazetaBitcoin",
  "author": "GazetaBitcoin",
  "created_time": "February 06, 2023, 05:11:28 PM",
  "content": "Autor: GazetaBitcoinTopic original: Governs' oppression of bitcoiners may turn against themGuvernele îi oprimă pe bitcoineri de peste zece ani. Înțelegând că bitcoinerii câștigă bani reali fiat din tranzacțiile crypto, guvernele din toată lumea au început să-i oprime, pentru a pune mâna pe banii pe care acești oameni i-au dobândit fără vreun ajutor din partea Statului. Oamenii muncesc, sunt plătiți pentru munca lor, dar Statul vrea partea sa.Opresiunea a crescut odată cu trecerea timpului. Pentru a-i putea sili pe oameni să plătească, guvernele din lumea largă au creat niște legi care nu existau înainte, încercând să centralizeze ceea ce a fost menit a fi descentralizat. Iar oamenii, în lăcomia lor, au ajutat Statul să-i stoarcă și mai mult.Prometeus le-a dat oamenilor focul, pentru a-și încălzi locuințele și a-și prepara mâncarea, dar oamenii l-au folosit pentru a-și incendia vecinii. Similar, Satoshi a dăruit Bitcoin oamenilor, pentru a-i ajuta să se elibereze de sclavia impusă de guverne și bănci, pentru a efectua tranzacții peer-to-peer, fără intervenția vreunui intermediar, dar oamenii, în lăcomia lor, au creat exchange-urile crypto centralizate.Unii oportuniști au crezut că se vor îmbogăți operând astfel de case de schimb. Unul dintre ei este Charlie Shrem (Yankee (BitInstant)). Un tânăr entuziast, care a adoptat Bitcoin de pe băncile școlii. Mai târziu, lansează BitInstant, unul dintre primele exchange-uri crypto și care, la un moment dat, rula aproape 30% din tranzacțiile Bitcoin. Ulterior ajunge la închisoare, pentru ajutor și complicitate la operarea unei firme ce nu avea licență de a lucra cu finanțele. A fost numit \"primul infractor cu Bitcoin\".De la cazul lui Shrem guvernele au început să fie și mai stricte cu bitcoinerii. Un articol din 2018 informa că \"Așa-numita “Bitcoin Maven”, care a admis că opera un exchange nelicențiat unde preschimba bitcoin cu bani gheață și unde spăla bitcoin [...] a fost condamnată astăzi la 12 luni și o zi de închisoare într-un penitenciar federal, trei ani de supraveghere și o amendă de 20.000$\".Exchange-urile crypto au înflorit și la fel s-a întâmplat și cu utilizatorii lor, fără a înțelege că acționează împotriva principiilor fundamentale ale Bitcoin: peer-to-peer / anonimitate / pseudo-anonimitate / evitarea intermediarilor. Noi legi au apărut odată cu casele de schimb crypto, forțându-le să impună KYC clienților.Lăcomia oamenilor i-a împins pe aceștia să:- își riște banii păstrați la exchange-uri, întrucât nu se aflau în posesia cheilor private- își riște banii, întrucât exchange-urile au fost sparte de hackeri- își riște datele personale, întrucât multe exchange-uri au fost sparte, iar hackerii s-au folosit de datele clienților sau chiar le-au vândut pe dark web (ceea ce a reprezentat înca un risc pentru acești oameni, din cauză că oricând se puteau trezi cu vreun infractor la ușă, care să-i tâlhărească dupa ce cumpărase date personale cu 1$ bucata  pe dark web)- își riște banii, întrucât multe exchange-uri le-au blocat conturile- își riște banii, întrucât multe bănci le-au blocat conturile, după ce au aflat că banii proveneau din tranzacții crypto- își riște banii dar și libertatea, în caz că nu se supun noilor legi emise de guvern.Totuși, doar câțiva și-au învățat lecția. Poate că doar aceia care au trăit vreuna din situațiile de mai sus.Și, pe măsură ce timpul trece, \"legile crypto\" devin și mai aspre și mai complexe. În multe cazuri, ele devin și mai ridicole sau ridică mai și mai multe întrebări la care nimeni nu are răspuns.În Romania, de pildă, prima lege crypto a fost emisă în 2019 dar, până atunci, riscai să fii acuzat de evaziune fiscală, de a avea dosar penal sau riscai chiar să fii închis pentru nedeclararea veniturilor obținute din crypto, în pofida faptului că nu exista niciun cadru legal. Contabilii nu știau cum să declare aceste venituri ale clienților, iar autoritățile dădeau din umeri la întrebările oamenilor. După emiterea legii, la începutul lui 2019, bitcoinerii trebuiau să plătească un procent de 10% din profitul realizat în anul anterior. Și, dacă profitul era mai mare decât cuantumul a 12 salarii minime pe economine, trebuiau să plătească alți 10% din cât totalizau cele 12 salarii minime. Banii din cea de-a doua taxă au fost direcționați către sistemul sanitar. Cei care înregistrau pierderi în anul anterior nu aveau nimic de plătit.Și totuși, legea nu a fost clară. Ce ar trebui să facă un miner? Dacă a obținut profit în anul anterior, dar nu a reușit să-și acopere în întregime investiția în echipamentul hardware pe care l-a cumpărat, se afla în postura de a avea profit sau pierdere? Și ce s-ar întâmpla cu acei mineri care nu au păstrat facturile echipamentelor hardware? Nimeni nu știe.În viitor noi taxe pot apărea. Șî mai complexe, și mai ridicole.În orice caz, Bitcoin nu a fost conceput pentru așa ceva. Nu a fost creat pentru a le crea oamenilor și mai multe probleme, nici pentru a-i băga la închisoare în caz că nu cotizează Statului partea sa, o parte la care Statul nu a contribuit cu nimic. Totul este pe dos față de cum ar trebui să fie.În loc ca guvernele și băncile să devină irelevante, în loc ca intermediarii să fie scoși din joc, acțiunile oamenilor au dat și mai multă putere acestor entități. Iar acum, aceste entități contraatacă, oprimând și mai mult oamenii. Toate exchange-urile colectează datele utilizatorilor, pentru a le livra pe tavă autorităților. Bitcoinerii merg senini la exchange-urile crypto  - nimeni nu știe de ce – și le oferă gratuit și benevol banii proprii și datele personale. Pentru a fi siguri că redevin sclavi, utilizatorii își asociază și conturile de la exchange-uri cu conturile bancare, permițând astfel și băncilor să le blocheze fondurile după bunul plac, precum și să le dea datele pe mâna autorităților.Mai sunt și mulți care obțin bani fiat din activitățile crypto și care, necunoscând legile foarte complexe, devin ținte sigure în fața autorităților.În orice caz, cred că o limită va face ca toate acestea să înceteze. Toate utilizările incorecte ale Bitcoin, toate stoarcerile efectuate de guverne și bănci, toate abuzurile exchange-urilor crypto.Și limita va fi atinsă atunci când destui vor suferi din cauza lăcomiei, din cauza naivității, din cauza prostiei. Când destui vor avea dosare penale și când destui vor ajunge în pușcării. Doar o suferință drastică va putea deschide ochii oamenilor.Și, când aceasta se va petrece, bitcoinerii vor renunța, în sfârșit, la exchange-uri. Abia atunci nu-și vor mai păstra în conturile bancare banii fiat obținuți din crypto. Unii poate că vor evita chiar și folosirea banilor fiat. Dacă toate acestea se vor întâmpla, abia atunci oamenii vor începe să folosească Bitcoin așa cum a fost el gândit de Satoshi: pentru propriul lor beneficiu, pentru a face ca guvernele și băncile să fie irelevante, pentru eliminarea tuturor intermediarilor, pentru anonimizarea finanțelor, pentru a fi propriii lor bancheri, pentru a fi posesorii cheilor lor private, în locul exchange-urilor.Și, când toate acestea vor avea loc, toate opresiunile impuse anterior de guverne se vor întoarce împotriva acestora. Ele nu vor mai putea face alte victime, intrucât cei ce fuseseră victime știu cum să se protejeze și cum să folosească în mod corect Bitcoin. Și atunci, prada va deveni prădătorul.Nu știu cât timp va trece până când toate aceste lucruri vor deveni realitate. Dar presimt că, mai devreme sau mai târziu, oamenii vor realiza că au suferit destul, și atunci vor spune: \"Ajunge!\". Și își vor deschide ochii și vor înțelege cum să folosească Bitcoin. Nu pentru beneficiul Statului, ci pentru propriul beneficiu!Topicul este auto-moderat pentru evitarea spam-ului.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438387",
  "comments": []
}