{
  "id": "topic_5403565",
  "title": "325btc",
  "author": "325btc",
  "created_time": "June 22, 2022, 05:56:58 AM",
  "content": "They say dollar going weaker and weaker usa economy dont look good....but here is the thing...the wall street is in usa not in russia not in china and by no means wall streeet moguls and bankers can become poor overnight.Until we dont see same wall street who rules over everything from new york and chigaco we can not expecting china and russia strengh....or anyone has some info that wall street offices and data centers will be moved out of usa ? Until no moves the usa remain economically strong second might be london uk becouse there is city of london where is a lot trading going on so uk might be second important country after usa so economics of usa and uk cant go lower then russia or china there is no wall street in china either....world economic is run by wall street how they turn numbers up and down so we are depend of this factors. Also dont forget that bank of new york they direct REPO transactions no country has so far no rights for this until we dont  see china or russia will set up REPO department to connect the markets with money liquitity we can not talk about china or russia power over usa the country who controls repo funds like fed and federal resrrve bank of ny does it will say how we role thats it. Second point forget about gas oil food supply....if you have money you buy it so only matter is the who controls money supply.I hope i clearified how the economy works.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403565",
  "comments": [
    {
      "author": "jackg",
      "created_time": "June 22, 2022, 03:59:26 PM",
      "body": "I think China's equivelant to wall street is probably in Hong Kong but that was owned by the UK and still has a large amount of dual nationals (afaik).The difference between these is that you can invest in stocks from a lot more countries than are able to invest in Chinese stocks (this is a thing that's changing as you can buy etfs for chinese companies but not individual stocks).The similarities economically are the same across most regions at the moment though - China has a lot more economic issues due to covid still spreading a lot over there and being quite an isolated economy. Russia isn't a very functional economy either, there's a reason you don't hear much about it and I've seen estimates their current strategy of taking over old businesses that leave is going to cause a lot of supply chain problems and cash flow issues (at least to get it started).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 22, 2022, 05:12:15 PM",
      "body": "There are multiple factors before you can call an economy weak or strong. If you choose based on wall street or NASDAQ, that3just ine side of the story. One thing you need to understand that alongnwith US, China is a self-reliant country. Russia is also going towards the same goal. In the entire world, only China and Russia has the power and guts to disregard US sanctions and carry on trades. So if China and Russia form an war alliance, that will not be a good news for the US and the world. I strongly believe that there should be a balance in power for a better and peaceful world. Middle east lacks such leader in them and US is slowly destroying middle eastern countries in the name of fighting terrorism. US would have invaded North Korea by now if China wasn't standing strong with them. If Russia stayed strong with Middle east, the Iraq, Syria and Afghanistan was wouldn't have happened. There are a lot of unknowns and it's very difficult to guess the dynamics of world politics. But I believe one strongest country is not good for the world. There has to be someone similarly strong to maintain a balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pomogator",
      "created_time": "June 22, 2022, 05:22:42 PM",
      "body": "I think it is not very correct to take as a basis only the stock market of the country, even though it is the world market. Don't forget that Russia is a very strong and independent country because of its natural resources. China is also a global manufacturer of various things. It is very strange to talk only about the stock market, especially since this bubble will burst soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 22, 2022, 05:25:58 PM",
      "body": "Its why the current war could result to multipolar to which you may mean the balance of power.  In terms of military tech, Russia and China wouldn't be this agressive in pushing back US from intervening internal affairs if they are not capable enough.  But he is right about finance advantage of US as they can use USD to weaken all countries finances. The revolution had already started though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "June 22, 2022, 06:27:05 PM",
      "body": "Ofcourse they are not going to loose their value overnight, who is the wall street composed of ? Rich ? Do they even consider the middle class and the lower Middle class ? They are even asked to hold off the jobs so that they can control this inflation which I do think is extremely ridiculous which does mean that in case of war or whatever they might be engaged , they might loose a lot of money in ammos and army as well, they can go weaker over the years and thus china might take over since they are already having cheap oil exports from the Russian Government. It's not overnight for sure but it's something that will work gradually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "June 22, 2022, 08:34:11 PM",
      "body": "Quote from: 325btc on June 22, 2022, 05:56:58 AMThey say dollar going weaker and weaker usa economy dont look good....but here is the thing...the wall street is in usa not in russia not in china and by no means wall streeet moguls and bankers can become poor overnight.Until we dont see same wall street who rules over everything from new york and chigaco we can not expecting china and russia strengh....or anyone has some info that wall street offices and data centers will be moved out of usa ? Until no moves the usa remain economically strong second might be london uk becouse there is city of london where is a lot trading going on so uk might be second important country after usa so economics of usa and uk cant go lower then russia or china there is no wall street in china either....world economic is run by wall street how they turn numbers up and down so we are depend of this factors. According to investopedia \"Wall Street has such a significant impact on the global economy because it is the trading hub of the biggest financial markets in the world’s richest nation. Wall Street is home to the venerable New York Stock Exchange, which is the undisputed leader worldwide in terms of average daily share trading volume and total market capitalization of its listed companies. The Nasdaq Stock Exchange, the second-largest exchange globally, also has its headquarters on Wall Street\" to this effect you will understand why even when they say the economy of usa is weak or not doing great does not mean a collapse is about to happen, it means not as it use to be, according to the source, \"Wealth Effect, Consumer Confidence, Business Investment plays major role when there is a favorable economic condition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 22, 2022, 08:39:34 PM",
      "body": "Quote from: 325btc on June 22, 2022, 05:56:58 AMThey say dollar going weaker and weaker usa economy dont look good....but here is the thing...the wall street is in usa not in russia not in china and by no means wall streeet moguls and bankers can become poor overnight.Until we dont see same wall street who rules over everything from new york and chigaco we can not expecting china and russia strengh....or anyone has some info that wall street offices and data centers will be moved out of usa ? Until no moves the usa remain economically strong second might be london uk becouse there is city of london where is a lot trading going on so uk might be second important country after usa so economics of usa and uk cant go lower then russia or china there is no wall street in china either....world economic is run by wall street how they turn numbers up and down so we are depend of this factors. Also dont forget that bank of new york they direct REPO transactions no country has so far no rights for this until we dont  see china or russia will set up REPO department to connect the markets with money liquitity we can not talk about china or russia power over usa the country who controls repo funds like fed and federal resrrve bank of ny does it will say how we role thats it. Second point forget about gas oil food supply....if you have money you buy it so only matter is the who controls money supply.I hope i clearified how the economy works.Great description! I applaud! It's just that for some reason many people decided that if Russia has a certain amount of gas and oil, and China has Ali Baba, then they are the rulers of the earth. In fact, Russia is a raw material appendage of the West, nothing more than a backward and undeveloped country, with a poor population (Moscow is not Russia, it is a separate entity). And China is the supplier of what the US wants. But not vice versa. And Russia for China is also a raw material appendage and a convenient territory, especially Chinese historical territory, where China will sooner or later settle its population and proclaim the restoration of historical justice ....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 22, 2022, 08:59:55 PM",
      "body": "Quote from: fiulpro on June 22, 2022, 06:27:05 PMOfcourse they are not going to loose their value overnight, who is the wall street composed of ? Rich ? Do they even consider the middle class and the lower Middle class ? They are even asked to hold off the jobs so that they can control this inflation which I do think is extremely ridiculous which does mean that in case of war or whatever they might be engaged , they might loose a lot of money in ammos and army as well, they can go weaker over the years and thus china might take over since they are already having cheap oil exports from the Russian Government. It's not overnight for sure but it's something that will work gradually. China is rising but I don’t think Russia can follow USA though there are some growth on their economies despite of the sanctions, its hard to tell if its just a sugar coating or not. The economy of USA is actually not good right now, the inflation is high compare to China and they are also drowning to Chinese debt, slowly we are feeling it. It wont go down easily though, it will take time and I hope by that time the government already knows what to do because honestly, we are all affected by this especially with USA where many counties depends on their economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arallmuus",
      "created_time": "June 22, 2022, 10:37:27 PM",
      "body": "Quote from: cabron on June 22, 2022, 05:25:58 PMBut he is right about finance advantage of US as they can use USD to weaken all countries finances. The revolution had already started though.It has always been this way hasnt it. The world economy always related to the US as well as their country's economy and there isnt that many country that could actually get out of this ( well China could might be )Quote from: goaldigger on June 22, 2022, 08:59:55 PMbut I don’t think Russia can follow USA though there are some growth on their economies despite of the sanctions, Even without the sanctions, I honestly doubt that Russia would be able to stand on top of the economic system. Wether everyone is going to be agree with this or not, its either US or maybe China on top and there wont be any other country that probably could do so for the next 30 years or so",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "June 22, 2022, 11:01:50 PMLast edit: June 22, 2022, 11:29:06 PM by Hydrogen",
      "body": "Quote from: 325btc on June 22, 2022, 05:56:58 AMThey say dollar going weaker and weaker usa economy dont look good....but here is the thing...the wall street is in usa not in russia not in china The united states is the largest buyer of chinese made goods. High gas and food prices in the USA will greatly diminish disposable income of american consumers. Which will reduce the amount of money they have to throw at chinese imported goods. China and the USA are large trading partners. Any significant reduction in the economy of one will significantly affect the other. Russia does not rely on either china or the USA for major business or trade, which leaves them insulated from most major shock which could occur there.Everyone scrambles to invest their money in inflation protected assets, in eras of recession and inflation. One of the first places to look is commodities. Raw materials like oil and wheat. Russia has a good HODL of commodities with their oil and recent seizure of ukraine's wheat supply. Russia's investment portfolio is full of commodities as if they were preparing for recession and high inflation for many years.The UK on the other hand is not known for commodity HODL and may not have much to offer investors in times of inflation or recession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 23, 2022, 02:02:22 PM",
      "body": "Quote from: arallmuus on June 22, 2022, 10:37:27 PMQuote from: cabron on June 22, 2022, 05:25:58 PMBut he is right about finance advantage of US as they can use USD to weaken all countries finances. The revolution had already started though.It has always been this way hasnt it. The world economy always related to the US as well as their country's economy and there isnt that many country that could actually get out of this ( well China could might be )Quote from: goaldigger on June 22, 2022, 08:59:55 PMbut I don’t think Russia can follow USA though there are some growth on their economies despite of the sanctions, Even without the sanctions, I honestly doubt that Russia would be able to stand on top of the economic system. Wether everyone is going to be agree with this or not, its either US or maybe China on top and there wont be any other country that probably could do so for the next 30 years or soA reason for the BRICS alliance to develop a system with a reserve currency backed by commodity. The bloc includes China too. A system like this will outrage EU and the West which will make the members not rely to the current financial system.  QuoteAccording to the Russian president, the member states are also developing reliable alternative mechanisms for international payments. Earlier, the group said it was working on setting up a joint payment network to cut reliance on the Westernhttps://www.google.com/amp/s/m.economictimes.com/news/international/world-news/brics-working-on-new-global-reserve-currency-and-alternative-mechanism-for-intl-payments-vladimir-putin/amp_articleshow/92407851.cms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bustabitsboy",
      "created_time": "June 23, 2022, 06:04:30 PM",
      "body": "Russia and China are powerful countries. Russia is developing its economy thanks to sanctions, China supports it in this. India joined this alliance and I think these powerful powers have every chance to bypass the USA. Negotiations are currently underway to switch trade completely from dollars to rupees. This is a big breakthrough and support for the economies of these countries. Now new centers of power are emerging and this must be taken into account. These countries have large territories, a large population, a powerful army, and high technology. There is something to think about...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 23, 2022, 09:23:35 PM",
      "body": "Quote from: bustabitsboy on June 23, 2022, 06:04:30 PMRussia and China are powerful countries. Russia is developing its economy thanks to sanctions, China supports it in this. India joined this alliance and I think these powerful powers have every chance to bypass the USA. Negotiations are currently underway to switch trade completely from dollars to rupees. This is a big breakthrough and support for the economies of these countries. Now new centers of power are emerging and this must be taken into account. These countries have large territories, a large population, a powerful army, and high technology. There is something to think about...If you didn’t read Russian fake propaganda, you would perfectly understand that Russia for China is just an appendage that sells any resources to it for cheap, as others refuse them! A simple example that you can easily check is that Russia's budget, in the area of ​​oil revenues, is built on a price of $70+ per barrel. The indicative (this is not the real purchase price) of Urals oil is 100+ dollars, Europe refuses it, and China agreed to buy it, no more than 40 dollars per barrel. For myself, and I don’t rule it out for sale  For one thing, let me remind you why Russia agrees to such conditions - and it simply has nowhere to store excess oil produced, and it is FORCED to sell at least to someone, at least for some money, otherwise it will have to conserve the fields, and after the sanctions, technologically backward Russia itself will not be able to launch them on a new one! Everything is extremely simple, and you do not need to invent something!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 23, 2022, 09:49:12 PM",
      "body": "Quote from: bustabitsboy on June 23, 2022, 06:04:30 PMRussia and China are powerful countries. Russia is developing its economy thanks to sanctions, China supports it in this. India joined this alliance and I think these powerful powers have every chance to bypass the USA. Negotiations are currently underway to switch trade completely from dollars to rupees. This is a big breakthrough and support for the economies of these countries. Now new centers of power are emerging and this must be taken into account. These countries have large territories, a large population, a powerful army, and high technology. There is something to think about...We might see those news but we don’t really what’s happening until it happened. USA is still strong and their economy can rise again, its just that the focus is not with them anymore and they have to be more aware of this. Russia and China is doing things in a bad way and we should not condemn it, other countries should have a strong relationship to be more safe, the EU is still there and I know they are prepared for the worst case scenario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "June 23, 2022, 09:53:17 PM",
      "body": "Quote from: avikz on June 22, 2022, 05:12:15 PMThere are multiple factors before you can call an economy weak or strong. If you choose based on wall street or NASDAQ, that3just ine side of the story. One thing you need to understand that alongnwith US, China is a self-reliant country. Russia is also going towards the same goal. In the entire world, only China and Russia has the power and guts to disregard US sanctions and carry on trades. So if China and Russia form an war alliance, that will not be a good news for the US and the world. I strongly believe that there should be a balance in power for a better and peaceful world. Middle east lacks such leader in them and US is slowly destroying middle eastern countries in the name of fighting terrorism. US would have invaded North Korea by now if China wasn't standing strong with them. If Russia stayed strong with Middle east, the Iraq, Syria and Afghanistan was wouldn't have happened. There are a lot of unknowns and it's very difficult to guess the dynamics of world politics. But I believe one strongest country is not good for the world. There has to be someone similarly strong to maintain a balance. Nah surest way to continue a managed endless war is the recipe above.Most likely earth will do just that and we will be in ruins in under 50 years. Since I am 65 I will be dead and will not likely see it happen. I figure 2050 to 2065 and major fuckups abound. Death and waste on worst scale in known history.To bad but it looks like that is the road we are all on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 23, 2022, 10:16:34 PM",
      "body": "Quote from: bustabitsboy on June 23, 2022, 06:04:30 PMRussia and China are powerful countries. Russia is developing its economy thanks to sanctions, China supports it in this. India joined this alliance and I think these powerful powers have every chance to bypass the USA. Negotiations are currently underway to switch trade completely from dollars to rupees. This is a big breakthrough and support for the economies of these countries. Now new centers of power are emerging and this must be taken into account. These countries have large territories, a large population, a powerful army, and high technology. There is something to think about...I have an assumption that you have not heard an entertaining and instructive story, how did Russia decide to \"punish the whole world\" and switch with China to settlements in yuan and rubles? I'm sure you haven't heard. The result - China refused to pay in rubles, but began to sell everything to Russia for yuan. In yuan, a couple of years ago, \"unparalleled Russian economists\" began to form foreign exchange reserves. Half a year later, the yuan collapsed, and all attempts to \"play on the course\" led to the fact that Russia lost billions of foreign exchange reserves in dollars! In a word, if you want to understand what it means to \"shoot yourself in the foot\" - follow the actions of Russia, they show it there almost every day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 24, 2022, 04:28:16 AM",
      "body": "Politics can not be separated from the economy, there is a strong relationship between them, so Russia seeks to be a great power in the face of the West and the United States, and therefore it launched a war on Ukraine, and the main reason is mainly related to the economy, China is also trying to be a great power, but in a different way through economic invasion, the United States It is trying to be the only power in the world, so it is trying to obstruct Russia and China while maintaining its dominance over Europe. The problem is much more complex than that, and almost all the wars we are witnessing are driven by the control of wealth and natural resources or transportation, and this is all directly related to the economy. The world is changing. I believe that the era of unipolarity in the world has ended or will soon end, and the United States will soon lose its military and economic hegemony over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "June 24, 2022, 06:43:37 AM",
      "body": "\"As of March 31, 2022, there were 261 Chinese companies listed on these U.S. exchanges with a total market capitalization of $1.3 trillion. Eight of these companies are national-level state-owned enterprises (SOEs).\" - Source : https://www.uscc.gov/research/chinese-companies-listed-major-us-stock-exchangesHere is a list of them ==> https://www.uscc.gov/sites/default/files/2022-03/Chinese_Companies_on_US_Stock_Exchanges.pdfGeneral MotorsSpotifySnapchatHilton HotelsGeneral Electric Appliance Division.You will be very surprised when you dig a little deeper into the Chinese ownership of \"things\" in the USA .... so Wallstreet is not \"owned\" by the USA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ozero",
      "created_time": "June 24, 2022, 06:52:05 AM",
      "body": "Quote from: Pomogator on June 22, 2022, 05:22:42 PMI think it is not very correct to take as a basis only the stock market of the country, even though it is the world market. Don't forget that Russia is a very strong and independent country because of its natural resources. China is also a global manufacturer of various things. It is very strange to talk only about the stock market, especially since this bubble will burst soon.Russia was a strong state until Putin made the mistake of attacking Ukraine. After that, the power of Russia began to break on Ukraine, including with the help of international sanctions. After that, Russia will no longer be a superstate and will not seriously influence international politics. It will be a relatively technologically backward state with a very low standard of living. Unless, of course, such a state continues to exist in a few more years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}