{
  "id": "topic_5398176",
  "title": "CryptD38",
  "author": "CryptD38",
  "created_time": "May 11, 2022, 12:33:59 PM",
  "content": "SalutAprès avoir fait différents achats de btc, je dois les mélanger rapidementDans mon électrum, J'ai 3 chaines btc  et je dois avoir 3 chaines de paiement de prestataires + 1 retour chaine btc nettoyé du solde sur electrumJe pense avoir compris, mais comme c'est la 1ère fois je dis ce que je vais faire pour être sûr de ne pas avoir fait d'erreurSi je pars par exemple sur anonymixerJe remplis les chaines de sorties du montant correspondant à un prestataire + une chaine du solde d'un montant btc  nettoyé.Je remplis les x chaines btc provenant de mes achats via différents moyens, qui sont stockés dans mon electrum=> questions :1/ est-ce que je dois me préoccuper des frais pris par le mélangeur ? ou autrement comment dis, est-ce que je dois l'ajouter sur la chaine btc nettoyé de retour vers electrum?2/ est-ce que je mets le montant exact ? ou dois-je rajouter 1mBtc pour assurer que la transaction (via le prestataire) ne se fait pas assez rapidement ?3/ que se passe-t-il s'il y a des différences ; trop donné? car j'imagine que s'il n'y a pas assez de fonds la transaction ne démarre pas!Question subsidiaire si je ne peux pas avoir une chaine de retour nettoyé sur mon electrum. JIl y a  cette possibilité de mélanger en interne. Je sais que cela n'est pas sécurisé, mais cela permet-il de mélanger en interne avec moins de frais qu'en passant par un mélangeur ?\"1/ Si 100€ en btc: Tu les renvois sur par exemple 4 adresses de ton wallet(change inclus), vierges de preference, en t'assurant qu'une contiendra au moins le montant de la transaction que tu veux effectuer, grace à la fonction Pay to many(dans Tools).2/ Ensuite tu prends en input l'adresse qui contient au moins le montant de la transaction à passer en faisant un \"Spend from\" dessus(click droit) et tu envois le montant désiré à l'adresse ton fournisseur (les 55€). Tu peux aussi rajouter une ou deux adresses supplémentaires de ton wallet avec Pay to many dans ta transaction pour brouiller un peu plus les pistes.\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398176",
  "comments": [
    {
      "author": "CryptD38",
      "created_time": "May 12, 2022, 08:10:06 AM",
      "body": "BonjourJe m'aperçois que je suis un peu seul à poser plusieurs questions (qui sont restées sans réponse). C'est essentiellement leGaulois qui répond et qui m'a beaucoup apporté de réponses. Du coup je me pose des questions sur ce forum en français. Il me semblait bien actif il y a 2 ans, est-ce que c'était ponctuel ? un effet pandémie ? d'autres outils communautaires ont maintenant pris la place du forum ?Vu que cette question est plutôt urgente, est-ce qu'il faut que je la reformule ailleurs ? en anglais (mais moins à l'aise et pas le contexte) ?@+",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Halab",
      "created_time": "May 12, 2022, 08:32:54 AM",
      "body": "Quote from: CryptD38 on May 12, 2022, 08:10:06 AMIl me semblait bien actif il y a 2 ans, est-ce que c'était ponctuel ? un effet pandémie ? d'autres outils communautaires ont maintenant pris la place du forum ?Oui le forum est beaucoup moins peuplé qu'avant et d'autres medias ont pris la place (Twitter en autre, même si maintenant je me pose la question sur la pertinence de ce RS (à part des dramas, de l'auto-satisfaction et des NFT éclatés, y'a plus grand chose).Après, tes questions sont assez précises, et je sais que sur la question des mixers LeGaulois est plus calé que moi, donc je ne cherche pas trop à creuser .A tes questions, j'ai souvent envie de te répondre : \"bin fais l'essai avec un petit montant et regarde si ça te satisfait\" (en ayant bien pris soin de ne pas tomber sur un scam), mais ça ne va pas vraiment t'aider .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "May 12, 2022, 09:05:16 AM",
      "body": "+1 pour la réponse d'Halab. On n'est pas énormément, et vu qu'on est pas en période de bull run il n'y a pas forcément de nouveaux arrivants pour remplacer ceux qui disparaissent.Et dans ceux qui restent, on n'a pas forcément tous les compétences nécessaires pour fournir une réponse suffisamment fiable.Et en ce qui me concerne je n'ai jamais utilisé de mixer, donc mon expérience se résume à... rien, en fait (ok j'ai déjà fait un coinjoin, mais c'est pas pareil).Quote from: CryptD38 on May 11, 2022, 12:33:59 PM1/ est-ce que je dois me préoccuper des frais pris par le mélangeur ? ou autrement comment dis, est-ce que je dois l'ajouter sur la chaine btc nettoyé de retour vers electrum?2/ est-ce que je mets le montant exact ? ou dois-je rajouter 1mBtc pour assurer que la transaction (via le prestataire) ne se fait pas assez rapidement ?3/ que se passe-t-il s'il y a des différences ; trop donné? car j'imagine que s'il n'y a pas assez de fonds la transaction ne démarre pas!D'après /help/trade/confirm]la doc d'Anonymixer, le montant que tu rentres pour ce qui sort du mixer est exactement celui que ton correspondant reçoit, les frais s'ajoutent après. Dans l'exemple de la doc, 0.006 BTC sont envoyés depuis le mixer, mais en ajoutant les frais ils demandent 0.00611212 BTC.La procédure ne me semble pas spécialement ambigüe, et tu m'as l'air d'avoir un minimum de bon sens (crois-moi, c'est pas le cas de tous ici) donc normalement ça devrait bien se passer. Après encore une fois je ne peux pas aider plus (mais je suis vos conversations avec un certain intérêt).Quote from: CryptD38 on May 11, 2022, 12:33:59 PMQuestion subsidiaire si je ne peux pas avoir une chaine de retour nettoyé sur mon electrum.Pourquoi ça ne serait pas possible ? Pour moi il ne devrait pas y avoir de problème...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "May 12, 2022, 09:43:08 AMLast edit: May 12, 2022, 10:01:25 AM by Saint-loup",
      "body": "Quote from: CryptD38 on May 11, 2022, 12:33:59 PMSalutAprès avoir fait différents achats de btc, je dois les mélanger rapidementDans mon électrum, J'ai 3 chaines btc  et je dois avoir 3 chaines de paiement de prestataires + 1 retour chaine btc nettoyé du solde sur electrumComment peux-tu avoir une \"chaine btc nettoyé\" si tu n'as pas encore utilisé de blender? Comment l'as-tu nettoyée précisément?Quote from: CryptD38 on May 11, 2022, 12:33:59 PMQuestion subsidiaire si je ne peux pas avoir une chaine de retour nettoyé sur mon electrum. JIl y a  cette possibilité de mélanger en interne. Je sais que cela n'est pas sécurisé, mais cela permet-il de mélanger en interne avec moins de frais qu'en passant par un mélangeur ?\"1/ Si 100€ en btc: Tu les renvois sur par exemple 4 adresses de ton wallet(change inclus), vierges de preference, en t'assurant qu'une contiendra au moins le montant de la transaction que tu veux effectuer, grace à la fonction Pay to many(dans Tools).2/ Ensuite tu prends en input l'adresse qui contient au moins le montant de la transaction à passer en faisant un \"Spend from\" dessus(click droit) et tu envois le montant désiré à l'adresse ton fournisseur (les 55€). Tu peux aussi rajouter une ou deux adresses supplémentaires de ton wallet avec Pay to many dans ta transaction pour brouiller un peu plus les pistes.\"Tu parles de chaines, mais où vois-tu une rupture de la chaine des transactions dans ton exemple?   Si tu veux \"nettoyer\" une chaine de transaction il faut qu'elle soit rompue d'une manière ou d'une autre. Autrement on pourra toujours remonter jusqu'à ton adresse initiale à partir de ton paiement final.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptD38",
      "created_time": "May 12, 2022, 03:11:30 PM",
      "body": "BonjourMerci pour votre intérêt. Moi je préfère un bon forum aux réseaux gafam.Je progresse, mais je suis loin d'avoir tout compris et notamment d'utiliser les bons termesQuand je parlais d'une chaine de transaction, c'est peut-être une erreur.Si je comprends bienLes adresses d'entrée sont liées au prestataire ou j'ai fait les achats en btc (donc avec un email et pour le vendeur mon compte bancaire)Après le mélangeur, je génère autant d'adresses que j'ai en payer. Ces adresses étant décorrélés du compte bancaire !En fait je souhaitais faire d'une pierre 2 coups en rajoutant une adresse de sortie du mélangeur qui me revient (et qui n'est pas lié à un achat). Je souhaite aller au plus simple et me passer de cet aspect si cela complique les choses.Voir mes questions !Après je suis dans la m. car j'ai des transactions non finalisées sur mes achats de btc, depuis hier. J'ai l'impression qu'il y a un rush https://www.blockchain.com/fr/charts/mempool-count?timespan=all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "May 12, 2022, 04:29:39 PM",
      "body": "Quote from: CryptD38 on May 12, 2022, 03:11:30 PMBonjourMerci pour votre intérêt. Moi je préfère un bon forum aux réseaux gafam.Je progresse, mais je suis loin d'avoir tout compris et notamment d'utiliser les bons termesQuand je parlais d'une chaine de transaction, c'est peut-être une erreur.Si je comprends bienLes adresses d'entrée sont liées au prestataire ou j'ai fait les achats en btc (donc avec un email et pour le vendeur mon compte bancaire)Après le mélangeur, je génère autant d'adresses que j'ai en payer. Ces adresses étant décorrélés du compte bancaire !En fait je souhaitais faire d'une pierre 2 coups en rajoutant une adresse de sortie du mélangeur qui me revient (et qui n'est pas lié à un achat). Je souhaite aller au plus simple et me passer de cet aspect si cela complique les choses.Voir mes questions !Après je suis dans la m. car j'ai des transactions non finalisées sur mes achats de btc, depuis hier. J'ai l'impression qu'il y a un rush https://www.blockchain.com/fr/charts/mempool-count?timespan=allTu veux faire un paiement directement à partir d'un mixeur si je comprends bien.Pour quelle raison veux-tu faire cela exactement?Ce n'est pas tellement conseillé car en cas de problème le commerçant peut renvoyer les fonds vers l'adresse utilisée. Il peut aussi te demander de prouver que l'adresse t'appartient bien pour de l'AML ou autre. Ca pourrait également être le cas pour le mixeur (à vérifier dans les CGU).Le plus simple est d'envoyer les fonds mixés vers une ou plusieurs adresses vierges de ton wallet. Tu pourras ensuite faire les paiements que tu veux depuis ces adresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptD38",
      "created_time": "May 13, 2022, 08:31:01 AM",
      "body": "Bonjour[/quote]Le plus simple est d'envoyer les fonds mixés vers une ou plusieurs adresses vierges de ton wallet. Tu pourras ensuite faire les paiements que tu veux depuis ces adresses.[/quote]Peut-être mal exprimés, mais c'est ce qui me semble avoir comprisSortie du mixeur vers mon compte electrumadresse s1adresse s2adresse s3adresse s4 nettoyé ?les adresses s1, s2 & s3 ont un montant qui correspond à ce que je dois payer aux prestataires p1,p2,p3En partant de https://[banned mixer]/help/trade/confirm mentionné par F2b, je comprends que les montants des adresses  s1,s2,s3,s4 ne varieront pas.Il faut si j'ai bien compris et en ayant une adresse s4 (nettoyé car sortant du mélangeur), je dois \"juste\" bien calculé pour avoir le montant exact demandé par les frais de service dans le grand total qui intègre les frais des mineurs & du mélangeur. ce montant sera la somme de mes différentes adresses d'entrée a1, a2 & a3 (provenant de mes achats de bitcoin par différents moyens).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}