{
  "id": "topic_5438209",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "February 05, 2023, 01:52:44 PM",
  "content": "Hi guys, I am sure there are other posts on how to post images on the forum using imgur but what I don't know or sure of is if there's any for posting image using imgBB. So for purpose of multi choice to users on means of posting images, here is some steps through which you can post images using imgBB, that's if you choose not to use the regular imgur.Steps to follow:(mind you, from Jr members upwards are allowed to post images).1. Open your browser and type in imgbb.com an interface will open showing \"upload and share your images\".2. Under upload and share your images click on \"start upload\", and choose the image you want to upload from your device,( depending on your browser you may have \"select the image to upload\").3. After choosing the image you can decide to resize the image by clicking on the spot where I have a green arrow pointed at, but if no, then just click upload. 4. When upload complete, click on the drop down-like arrow facing down at the bottom right of your screen under embedded codes showing many options and choose BBcode full link and then click copy.5. After acquiring the link by copying it, you come back to the forum and paste the copied link in your post. The image link comes with URL, so you clear the URL stop at the point you have [ img], you do this at both ends and then you can post it.  N/B: When you're done with the whole process you can preview to see how your image looks. The difference between the link with URL and the one without after clearing the URL link is that, if you should load the image without clearing the URL link the image will not appear as image when posted but just as a link address.With these few steps above, you can be able to make your post with image as simple as that.Thank you!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438209",
  "comments": [
    {
      "author": "Davidvictorson",
      "created_time": "February 05, 2023, 02:16:24 PM",
      "body": "Hey OP, while this is great, I think you should next time use the search bar before making a post to confirm if it has already be created on the forum. For example have are duplicates of the topic you just createdhttps://bitcointalk.org/index.php?topic=5034682.0https://bitcointalk.org/index.php?topic=4938495.0https://bitcointalk.org/index.php?topic=3974517https://bitcointalk.org/index.php?topic=3307229.0https://bitcointalk.org/index.php?topic=5395576.0 - This last one specifically is about using imgBB[/list] [/list]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 05, 2023, 02:26:11 PM",
      "body": "Before locking your topic, you need to re-edit the images size to be clear to everyone, and therefore better in conveying the information, although I do not think that there is anything new to add, as it is easy for anyone to host an image using any hosting site, and then insert the link here. There is even UseraScript that makes you upload the image automatically without opening other sites.For BBlink code is easy:Code:[img][/img]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "February 05, 2023, 02:50:47 PM",
      "body": "Quote from: Davidvictorson on February 05, 2023, 02:16:24 PMHey OP, while this is great, I think you should next time use the search bar before making a post to confirm if it has already be created on the forum. For example have are duplicates of the topic you just createdhttps://bitcointalk.org/index.php?topic=5034682.0https://bitcointalk.org/index.php?topic=4938495.0https://bitcointalk.org/index.php?topic=3974517https://bitcointalk.org/index.php?topic=3307229.0https://bitcointalk.org/index.php?topic=5395576.0 - This last one specifically is about using imgBB[/list] [/list]Alright mate, thanks for bringing these to my notice. In that case I just have to lock up the post immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}