{
  "id": "topic_5430973",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "December 22, 2022, 10:55:06 AMLast edit: December 27, 2022, 01:52:48 PM by ImThour",
  "content": "Bitcoin Death Cross on Weekly for First Time in HistoryA death cross is a bearish technical chart pattern that occurs when a shorter-term moving average, such as the 50-day moving average, crosses below a longer-term moving average, such as the 200-day moving average. This pattern is called a death cross because it is thought to signal the death of the current uptrend and the potential start of a downtrend.My Prediction: This might lead to a leg down and that will mark the bottom of this cycle.  This is what happened to Bitcoin when Death Cross happened on 3 Day Timeframe.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430973",
  "comments": [
    {
      "author": "dezoel",
      "created_time": "December 24, 2022, 10:24:20 PM",
      "body": "Are we entirely sure that this means death? I mean it is clear that we haven't gone up, meaning that it is already as low as it is, and not every chart is right at all times. I know that some people have a religious belief to go with whatever their chart tells them, but looking at this chart all I see is it's a lot more like it assumes we did alright so far, and that we should be going down.The reality is that we haven't done well for a very very long time, it shouldn't be a shock to anyone that it would be quite difficult to find the amount of bitcoins required to sell even more to drop the price even further, I highly doubt that would be easy to handle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 24, 2022, 11:16:58 PM",
      "body": "I really do hope that fears of a recession are overblown and we don’t see the collapse of the crypto industry as a result of the Fed going too far with interest rates. A death cross is usually a very bad sign, but it can occasionally be a false alarm. With any luck we’re seeing the worst of prices right now and while the death cross may get uglier, it is possible the actual price rises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "December 25, 2022, 03:15:27 AM",
      "body": "Quote from: OgNasty on December 24, 2022, 11:16:58 PMA death cross is usually a very bad sign, but it can occasionally be a false alarm. Death cross many times marks the bottom for the prices, I've witnessed it quite a lot of times on 4h candles. This is weekly chart so cant say but yeah the bots will try to counter.Also, we have a bullish divergence on weekly if you observe carefully, and it suggests a massive pump. Imo, divergences carry more importance (since they signal exhaustion) than ma crosses (a lagging indicator).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 27, 2022, 05:13:28 AM",
      "body": "I don’t think there are enough data points to suggest whether this is a reliable indicator or not. I honestly never look at even the death crosses on the daily because they are completely random. Half the time they work and other half they don’t. So no point in looking at them.Better indicators are Fibonacci on the daily or basic support and resistance. Moving averages are never a reliable indicator since everybody uses a different input and hence never clear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "December 27, 2022, 05:43:57 AM",
      "body": "I wonder how many death crosses have analysts detected in their charting, except from weekly, that have proven to be just a dreaded pattern but didn't really reflect on the price. I think I have encountered a few instances in which analysts or some guys in trading are saying there might be an upcoming downtrend in the prices because a death cross is formed. If the downtrend also occurs as predicted, how much of it is self-prophecy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "December 27, 2022, 01:49:14 PM",
      "body": "Guys, it's happening for the first time in the history of Bitcoin. Never happened earlier. Let's see how price reacts to that. Cheers!This is what happened to Bitcoin when Death Cross happened on 3 Day Timeframe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 27, 2022, 02:19:11 PM",
      "body": "^ It always happens in the shorter time frame and I think it's really happening.  I would however wait for that 3day whether it pushes down that it manifests in the weekly chart. We're doomed.I am also focusing on how bad things can be because of the geopolitics sanctions and war that is happening. They are not really making it easy for us to make money in crypto. If this Death cross occurs, we're fucked below $10K, you think?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "December 27, 2022, 11:38:24 PM",
      "body": "Quote from: dezoel on December 24, 2022, 10:24:20 PMAre we entirely sure that this means death? I mean it is clear that we haven't gone up, meaning that it is already as low as it is, and not every chart is right at all times. I know that some people have a religious belief to go with whatever their chart tells them, but looking at this chart all I see is it's a lot more like it assumes we did alright so far, and that we should be going down.Death cross is just a name, it doesn't mean that the asset will actually die or will have a disastrous crash. Death cross signal happened in Bitcoin many times before, and not just Bitcoin but other assets too. There's nothing to worry about, unless you have a highly leveraged position or otherwise can't afford to lose in short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "December 27, 2022, 11:57:10 PM",
      "body": "Quote from: cabron on December 27, 2022, 02:19:11 PM(....)I am also focusing on how bad things can be because of the geopolitics sanctions and war that is happening. They are not really making it easy for us to make money in crypto. If this Death cross occurs, we're fucked below $10K, you think?$10,000 or below is always possible but for me, even if we fall below $10,000 I am looking forward that it will be just a short period of time before it will be back from above $10,00.Right now, we are building strong support around the $15,000 level and for me, this sideways is much better than hoping for a huge pump. The natural and organic pump is better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "December 28, 2022, 03:08:02 AM",
      "body": "Damn its gonna take a long time to get golden cross and above 200 MA, as far that I know 200 MA is flexible major support and it look the price is below it.the next major support is at the 10.5K level but i do hope its not touch that level, and I think we can back to 200 MA if this considering as fake breakout",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "December 28, 2022, 04:10:13 AMLast edit: December 28, 2022, 11:19:21 AM by Popkon6",
      "body": "If we look at the BTC market, we will understand why the market is so low.  And the investors who were there are disappointed because what they invested in the past is now squeezed.1 year dumping (-67.92%)180 Days dumping (-12.79%)90 Days dumping (-13.98%)30 Days pumping (-0.71%)7 Days dumping (1.04%)Today dumping (-0.20%)I think these three coins Luna, Celsius, and FTX have been enough to destroy the market.  And in this case Luna has done the most damage which has scared people and all individuals including investors.  Because of which almost all people were investing in Luna Coin Lula Coin, Celsius, and FTX.That's why all investors are now in a tight spot which is apathetic in terms of investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 28, 2022, 05:12:31 AM",
      "body": "Quote from: ImThour on December 22, 2022, 10:55:06 AMMy Prediction: This might lead to a leg down and that will mark the bottom of this cycle.  Without getting into technical analysis, I have been following the Bitcoin price for a few years now, and I have the feeling that we have either already hit the bottom or we are very close. I think it's a good time to accumulate more. Most of the leverage and junk has disappeared, and if we look at the hashrate, for example, it is doing very well. Without being fortune tellers, we can be sure that the current levels are very good purchase prices if you are going to keep the investment for a minimum of 4 years, even if we are going to have volatility and downturns along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "December 28, 2022, 05:33:14 AM",
      "body": "Quote from: Popkon6 on December 28, 2022, 04:10:13 AMBecause of which almost all people were investing in Lula Coin,~Haha, nice one \"lula coin\" 😆Quote from: Popkon6 on December 28, 2022, 04:10:13 AMAnd in this case Luna has done the most damageIt was double damage for btc: \"luna from one side and spx(america) from the other side\", although when ftx collapsed, american markets were holding well, otherwise btc would've stopped at 10-12kQuote from: Poker Player on December 28, 2022, 05:12:31 AMWithout getting into technical analysis, I have been following the Bitcoin price for a few years now,Fundamentals are very good pumpamentals. 😁",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "December 28, 2022, 11:22:29 AM",
      "body": "Quote from: Edwardard on December 28, 2022, 05:33:14 AMQuote from: Popkon6 on December 28, 2022, 04:10:13 AMBecause of which almost all people were investing in Lula Coin,~Haha, nice one \"lula coin\" 😆Quote from: Popkon6 on December 28, 2022, 04:10:13 AMAnd in this case Luna has done the most damageIt was double damage for btc: \"luna from one side and spx(america) from the other side\", although when ftx collapsed, american markets were holding well, otherwise btc would've stopped at 10-12kQuote from: Poker Player on December 28, 2022, 05:12:31 AMWithout getting into technical analysis, I have been following the Bitcoin price for a few years now,Fundamentals are very good pumpamentals. 😁Thank you Sir...Thank you very much for pointing out my mistake.  And that was my type...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 28, 2022, 02:43:24 PM",
      "body": "Quote from: Poker Player on December 28, 2022, 05:12:31 AMWithout being fortune tellers, we can be sure that the current levels are very good purchase prices if you are going to keep the investment for a minimum of 4 years, even if we are going to have volatility and downturns along the way. Why 4 years if we know that BTC price usually reaches its ATH 6 months to 1 year after halving? If history repeats itself, then in 4 years we will be in the middle of a bear market, which means that for those who are only there for profit, the magical times are not as far away as they seem.If people would focus more on Bitcoin in terms of what it was designed for, rather than just for profit, maybe the price would be much higher than today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "December 28, 2022, 03:30:55 PM",
      "body": "Quote from: ImThour on December 22, 2022, 10:55:06 AMMy Prediction: This might lead to a leg down and that will mark the bottom of this cycle.  If there's another leg down, then the more important question is how low will it be and how long will the trend be?  Based on my gut feelz, I don't think BTC is gonna drop lower by a lot as sellers are exhausted me thinks...    And as for how long, I'm thinking not too long.  Check your chart at 2015 and 2019.  We could already be at the lowest point or near it that going another leg lower won't even matter anymore because it won't be that huge.  Dunno...  As I said, it's all based on my gut feelz.  Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 29, 2022, 09:32:25 PM",
      "body": "Quote from: tokeweed on December 28, 2022, 03:30:55 PMIf there's another leg down, then the more important question is how low will it be and how long will the trend be?  Based on my gut feelz, I don't think BTC is gonna drop lower by a lot as sellers are exhausted me thinks...    And as for how long, I'm thinking not too long.  Check your chart at 2015 and 2019.  We could already be at the lowest point or near it that going another leg lower won't even matter anymore because it won't be that huge.  Dunno...  As I said, it's all based on my gut feelz.  Lol.I believe in the past there's always been a leg down after a period of accumulation.  This time might not be any different.  However, I wouldn't risk sitting on the sidelines.  If it does take another step down and consolidates, that would be the absolute last chance to grab the bottom.  With all the calamity going on with exchanges rushing to get BTC to back their client funds after years of fractional reserve banking, it is possible that we don't see another leg down.  Either way, I'll be a buyer of the dip, or the flatline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 29, 2022, 11:36:41 PM",
      "body": "Quote from: OgNasty on December 29, 2022, 09:32:25 PMQuote from: tokeweed on December 28, 2022, 03:30:55 PMIf there's another leg down, then the more important question is how low will it be and how long will the trend be?  Based on my gut feelz, I don't think BTC is gonna drop lower by a lot as sellers are exhausted me thinks...    And as for how long, I'm thinking not too long.  Check your chart at 2015 and 2019.  We could already be at the lowest point or near it that going another leg lower won't even matter anymore because it won't be that huge.  Dunno...  As I said, it's all based on my gut feelz.  Lol.I believe in the past there's always been a leg down after a period of accumulation.  This time might not be any different.  However, I wouldn't risk sitting on the sidelines.  If it does take another step down and consolidates, that would be the absolute last chance to grab the bottom.  With all the calamity going on with exchanges rushing to get BTC to back their client funds after years of fractional reserve banking, it is possible that we don't see another leg down.  Either way, I'll be a buyer of the dip, or the flatline.Yeah, probably there will be another leg down, similar to maybe 2020's covid meltdown to $3k and as we can see, it's the final capitulation that time. Because after that we recover, trade sideways and then probably will have to sit another year till the next block halving.In 2023, maybe another black swan even, $10k-$13k'ish, take advantage of it as this could be the last leg down leading up to the bull run in 2024.This is the scenario that is playing in my mind though, whether we have this death cross or it become validated or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "December 31, 2022, 07:45:34 AM",
      "body": "Quote from: OgNasty on December 29, 2022, 09:32:25 PMQuote from: tokeweed on December 28, 2022, 03:30:55 PMIf there's another leg down, then the more important question is how low will it be and how long will the trend be?  Based on my gut feelz, I don't think BTC is gonna drop lower by a lot as sellers are exhausted me thinks...    And as for how long, I'm thinking not too long.  Check your chart at 2015 and 2019.  We could already be at the lowest point or near it that going another leg lower won't even matter anymore because it won't be that huge.  Dunno...  As I said, it's all based on my gut feelz.  Lol.I believe in the past there's always been a leg down after a period of accumulation.  This time might not be any different.  However, I wouldn't risk sitting on the sidelines.  If it does take another step down and consolidates, that would be the absolute last chance to grab the bottom.  With all the calamity going on with exchanges rushing to get BTC to back their client funds after years of fractional reserve banking, it is possible that we don't see another leg down.  Either way, I'll be a buyer of the dip, or the flatline.Dunno, for some reason some of the guys around here look for some sort of steep drop then a quick recovery.  I'm not sure if it still could work that way in the middle of all the bad stuff that has been going on recently.  A steep drop now could make BTC stay where it lands for quite some time.I've also seen a couple of guys saying that we could be seeing a new cycle for BTC and crypto.  Didn't believe them at first but it looks like they could be right...  Check out the rainbow chart.  There's a V2 now.  Lololol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}