{
  "id": "topic_5401406",
  "title": "bittalk7",
  "author": "bittalk7",
  "created_time": "June 05, 2022, 01:13:20 AM",
  "content": "I just tried changing firmware and created a nice problem. I can’t find my IP to the ant miner s9j now and I have a solid red light.   Possibly bad board?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401406",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "June 05, 2022, 12:49:53 PM",
      "body": "Quote from: bittalk7 on June 05, 2022, 01:13:20 AMI just tried changing firmware and created a nice problem. I can’t find my IP to the ant miner s9j now and I have a solid red light.   Possibly bad board?You did not tell us what firmware you loaded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittalk7",
      "created_time": "June 05, 2022, 03:09:54 PM",
      "body": "I don’t believe any firmware loaded. I was attempting to load brainsos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "June 05, 2022, 03:49:13 PM",
      "body": "Quote from: bittalk7 on June 05, 2022, 03:09:54 PMI don’t believe any firmware loaded. I was attempting to load brainsos.did you burn it to a micro sd card?and then load the card in the slot?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittalk7",
      "created_time": "June 05, 2022, 06:10:38 PM",
      "body": "Yes I believe I did burn it to the card correctly, I did definitely place it in the slot and move the pin on p4. It might not have read because it was a 128gb card? That’s one thing I’ve read so far…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "June 05, 2022, 10:14:54 PM",
      "body": "Quote from: bittalk7 on June 05, 2022, 06:10:38 PMYes I believe I did burn it to the card correctly, I did definitely place it in the slot and move the pin on p4. It might not have read because it was a 128gb card? That’s one thing I’ve read so far…I never used a 128 gb card.It is possible that the reader has a 64gb limit.I Just don’t know.Try pulling the card and setting the pin back to the original spot.you should boot with bitmain firmware.let us know if that gets you back to mining",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 05, 2022, 11:07:51 PM",
      "body": "You might have a defective SD card if you bought this SD card cheap then there is a big possibility the size of that card is fake so if you imported and burned a firmware with this SD card it reaches the fake size the firmware become corrupted and your unit will end up having a broken firmware. Why not try another SD card if you have extra make sure to use a better card and make sure you formatted the SD card in Fat32(NTFS and exFat do not work).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "June 06, 2022, 01:51:46 AM",
      "body": "Quote from: BitMaxz on June 05, 2022, 11:07:51 PMYou might have a defective SD card if you bought this SD card cheap then there is a big possibility the size of that card is fake so if you imported and burned a firmware with this SD card it reaches the fake size the firmware become corrupted and your unit will end up having a broken firmware. Why not try another SD card if you have extra make sure to use a better card and make sure you formatted the SD card in Fat32(NTFS and exFat do not work).https://www.amazon.com/gp/product/B07YXJM282/ref=ox_sc_act_title_1?these are decent and amazon is the seller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "June 06, 2022, 01:53:23 PM",
      "body": "Errors reading the SD (or nand) leaves BOTH leds solid.In Braiins OS a solid red is usually just a miner waiting for the pool configuration...Bitmain states in their documentation that you must not use SD cards bigger than 16g, The real reason is lack of SDXC support so \"some\" 32g should work, but never more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "June 06, 2022, 02:59:21 PM",
      "body": "Quote from: Artemis3 on June 06, 2022, 01:53:23 PMErrors reading the SD (or nand) leaves BOTH leds solid.In Braiins OS a solid red is usually just a miner waiting for the pool configuration...Bitmain states in their documentation that you must not use SD cards bigger than 16g, The real reason is lack of SDXC support so \"some\" 32g should work, but never more.. i have never tried bigger than 64 which did not work wellmost 32 and 16 size are goodhttps://www.amazon.com/SanDisk-Ultra-SDSQUNS-016G-GN3MN-UHS-I-microSDHC/dp/B074B4P7KD/ref=sr_1_5?san disk are pretty good",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittalk7",
      "created_time": "June 06, 2022, 11:39:59 PMLast edit: June 07, 2022, 12:07:29 AM by bittalk7",
      "body": "i tried the 32gb, also no luck. I then reverted back to original p4 pin setup with removal of sd card. I am now experiencing a solid red light.    UPDATE : P1 wasnt all the way down , now im showing red and green light solid again. lolUPDATE 2 : After a few more restarts I am now showing a solid red light.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittalk7",
      "created_time": "June 20, 2022, 02:37:17 AM",
      "body": "Ok I’m saying it’s a bad board or a firmware issue, I’m thinking of selling it or sending it to someone to be diagnosed and possibly fixed. Is there anyone that could diagnose these for a reasonable cost?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 20, 2022, 11:04:30 PM",
      "body": "It could be a control board if the SD card flashing. But how about the firmware you downloaded? What exact source where you downloaded the SD card image?Quote from: bittalk7 on June 20, 2022, 02:37:17 AMOk I’m saying it’s a bad board or a firmware issue, I’m thinking of selling it or sending it to someone to be diagnosed and possibly fixed. Is there anyone that could diagnose these for a reasonable cost?If you are looking for a repair center near in your area you can check this https://www.zeusbtc.com/ASIC-Miner-Repair/You can also try some troubleshooting guides and solutions under that page just scroll down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "June 21, 2022, 10:08:09 PM",
      "body": "Quote from: bittalk7 on June 20, 2022, 02:37:17 AMOk I’m saying it’s a bad board or a firmware issue, I’m thinking of selling it or sending it to someone to be diagnosed and possibly fixed. Is there anyone that could diagnose these for a reasonable cost?S9j worth anywhere between 120-140$ nowadays, it's won't make sense to send it for diagnoses as that will cost you anywhere from 50$ to 100$ in most places, with no guarantee that it will work again without having to buy a new control board at least.But let me tell you something, it's extremely difficult to brick a control board just by using an sdcard, I flashed hundreds of S9s and never managed to brick one, it either works, works halfway or doesn't work at all, if the power didn't cut in the flashing process the control board is probably still ok.Try a smaller Sdcard and flash the original bitmain firmware, make sure you get the jumpers correct, you might also try a hard reset, power off, keep holding the IP report button, power on while keeping your finger on the IP report button for 10 seconds.You need to be patient when using Sdcards to flash any miner, I tried a few till I found one that works great, I don't know why but those miners are very picky about what Sdcard they like, also make sure you are copying the files in the main directory of the Sdcard, follow the steps by Bitmain very closely it should work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 21, 2022, 10:55:51 PM",
      "body": "Quote from: mikeywith on June 21, 2022, 10:08:09 PMYou need to be patient when using Sdcards to flash any miner, I tried a few till I found one that works great, I don't know why but those miners are very picky about what Sdcard they like, also make sure you are copying the files in the main directory of the Sdcard, follow the steps by Bitmain very closely it should work.Actually, it's not very picky most of the SD cards right now on the market are fake with fake volumes I have experienced this before when saving photos and videos and half of my files are corrupted that is why I end up using a tester/scanner SD card tool to know the problem and half of the total volume is fake.I search about this issue on how to fake that volume and end up registering on a hackforum with a guide on how to make a 1GB SD card into a 2GB SD card this method is spreading and I think this is the reason why we have a fake SD card. So only use authentic SD cards like Sandisk or Authentic Samsung SD cards. Don't buy those very cheap SD cards on the market almost all of them are fake with fake volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GFDhd",
      "created_time": "July 29, 2022, 01:43:05 AM",
      "body": "When changing the firmware, you'd be better off using a 16GB SD card. Couldn't find the IP after you changed the firmware, have you tried a factory reset or reset the IP? Or does your network device have DHCP turned on?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinerMEDIC",
      "created_time": "July 30, 2022, 06:37:20 PM",
      "body": "If you have a TTL to USB adapter cable bitmain’s firmware displays the IP during start up via the terminal window.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "August 02, 2022, 09:33:33 PM",
      "body": "Quote from: GFDhd on July 29, 2022, 01:43:05 AMWhen changing the firmware, you'd be better off using a 16GB SD card. According to Bitmain's own recommendation, the SD card size should be LESS than 16GB, Also I personally had a few issues with a few SD cards, maybe because the ones I can buy locally at the Computer/Mobile shop are not original, but it took me a few SD cards to actually get one that works well on flashing those gears, I didn't have the time to investigate the technical differences and why one SD card would work while another won't, but I know for certain that some of them just won't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 02, 2022, 10:59:36 PM",
      "body": "Quote from: mikeywith on August 02, 2022, 09:33:33 PMAccording to Bitmain's own recommendation, the SD card size should be LESS than 16GB, Also I personally had a few issues with a few SD cards, maybe because the ones I can buy locally at the Computer/Mobile shop are not original, but it took me a few SD cards to actually get one that works well on flashing those gears, I didn't have the time to investigate the technical differences and why one SD card would work while another won't, but I know for certain that some of them just won't work.I'm sure those cards that do not work are fake these days there are lots of fake SD cards on the market even the design of the SD card looks authentic but after using it there are some parts of the SD card are dead end and all files will become corrupted if the fake space is reached. Only SanDisk cards have easy to identify online which one is fake or not. For other cards like Samsung SD cards, you need a tool that can write and read to check dead/fake space usually all SD Card with fake capacity is around 16GB or 8GB below As the original size of the card but the label is above the 8/16GB.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinerMEDIC",
      "created_time": "August 03, 2022, 12:14:51 AM",
      "body": "Okay…OK!       I can tell you guys really wanna know the definitive answer, follow me down the rabbit hole for a moment if you will. It’s actually laid out very succinctly in this Avnet document, I’ll link below. Let me begin by saying how all Bitmain ZYNQ-based controller cards are clones of the Avnet microZED, Not unlike the way they cloned the beagle bone black and left out a bunch of shi*(like the SD boot button). This post speaks nothing of bb or Amlogic boards. Fun factoid: The S9 ZYNQ (XC7Z010) is the only control board physically capable of booting from an SD card, All others (XC7Z007S)boot from SD only by the request of the bootloader resident in the NAND. This is the reason you cannot get braiins off of a control board via SD recovery method, They modify that code(but they’re cool you can use their tool to make it just like new).     In conclusion the ZYNQ can only utilize old slow flash media(max 32GB), this is summarized in section 4 of the document below if you don’t feel inclined to feast on the whole thing. If you do read the whole thing take note, the S9 control board uses a CLG 400 CPU and the document was probably written before the 007 was released so it’s not mentioned but I have read the data sheets newer than this product brief. All standards usually have some form of backwards compatibility built into them and leave the implementation up to the manufacturer, for this reason you may find brand new 32GB cards that work but I guarantee it will be a bit of a lottery. https://www.avnet.com/wps/wcm/connect/onesite/ee8474d5-0ee5-4990-8e99-0a74a987650c/SDCard_Advice_v2+%281%29.pdf?MOD=AJPERES&CVID=nEMPbNk&CVID=nEMANT9&CVID=nEMANT9I hope you all enjoyed this episode of “say that again in English“ and don’t forget to smash that merit button!Your favorite tech,MinerMedic Jay",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}