{
  "id": "topic_5458014",
  "title": "tread93",
  "author": "tread93",
  "created_time": "June 29, 2023, 03:07:27 PM",
  "content": "Does anyone else's heart sink a bit when you see this message thinking somehow your profile got deleted in the latest update or something? Lol. When you leave your browser up on your desk or even just a tab open and it exits out from the forum automatically or just the browser stopped working because of inactivity and then you try to go back on and see that message and have to log back in. I know it can't just be me lmao",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458014",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "June 29, 2023, 03:09:10 PMLast edit: June 29, 2023, 04:03:16 PM by LoyceV",
      "body": "That doesn't happen on your profile, only on profiles that, wait for it, don't exist (anymore).Update: the posts below made me realize there's another possibility: profile doesn't work when your login timed out. I never let that happen so I didn't notice it before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 29, 2023, 03:10:55 PM",
      "body": "The profile don't exist usually happen when one make mistake with profile number, where the typed profile number does not match any profile",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 29, 2023, 03:14:48 PM",
      "body": "The 2 statement above is correct. Also, never experienced this one coz that's a kind of a user i am — letting a bitcointalk page or sometimes my profile page open in a one of the tabs in my browser without shutting or restarting the browser/computer for several days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 29, 2023, 03:19:57 PM",
      "body": "It is very long time since admins accepted to delete accounts, change accounts to Anonymous.Very first accounts like testing accounts from a forum founder Satoshi Nakamoto were deleted too.Quote from: theymos on August 28, 2011, 11:16:31 PMDone. Now only moderators, Donators, and VIP members can change their names automatically. Other members should contact me. I'll probably ignore your request if you have less than 50 posts (unless your posts are very good).Quote from: BadBear on March 06, 2012, 05:50:15 PMDeleting accounts doesn't mess up any threads, like this thread. It just changes to anonymous, with no profile information. Post stays intact.LoyceV has this list of forum username.Some early members are \"does not exist\"Quote1: admin2: does not exist3: satoshi4: sirius5: does not exist6: nandnor7: does not exist8: does not exist9: does not exist10: Xunie11: madhatter12: nanaimogold13: SmokeTooMuch14: The Madhatter15: does not exist16: xuO4k04c6Ng17: The Doctor18: does not exist19: does not exist20: does not exist21: AgoraMutual22: RogerRabbit23: 1 currency now24: dwdollar25: does not exist26: NewLibertyStandard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "June 29, 2023, 03:39:33 PM",
      "body": "Quote from: tread93 on June 29, 2023, 03:07:27 PM . When you leave your browser up on your desk or even just a tab open and it exits out from the forum automatically or just the browser stopped working because of inactivity and then you try to go back on and see that message and have to log back in. I know it can't just be me lmaoI haven't really experienced such before, the only message I get sometime is when I log into a new browser and forget to hit the stay logged in button. So I get to view the forum as a guest until I login again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "June 29, 2023, 03:52:38 PM",
      "body": "I think the few times I have experienced something like this was when I left my tab opened for a long time and after returning back to it, instead of me to refresh the page to see if it was still logged in or not I immediately clicked on my profile and then I saw that prompt. It was as you described it because I knew that something was off (that was the time) after which I proceeded to logging in to my account. I suspect that the reason behind this is that, when you click on \"profile\" you're supposed to go to url without any ID (which Normally takes you to your profile) but when you're logged out it becomes an invalid profile link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "June 29, 2023, 04:05:09 PM",
      "body": "Quote from: Hatchy on June 29, 2023, 03:39:33 PMQuote from: tread93 on June 29, 2023, 03:07:27 PM . When you leave your browser up on your desk or even just a tab open and it exits out from the forum automatically or just the browser stopped working because of inactivity and then you try to go back on and see that message and have to log back in. I know it can't just be me lmaoI haven't really experienced such before, the only message I get sometime is when I log into a new browser and forget to hit the stay logged in button. So I get to view the forum as a guest until I login again. My Bitcointalk account keeps logout even if I click that remember me box when I close the Bitcointalk tab and turn off WiFi. But user doesn’t exist error is due to wrong profile UID on the link since you can still view the page that you left before your account is logout since forum allowed anonymous browsing.@OP, I think the error message that you get is when you are on the middle of creating a thread while your account get logout due to inactivity. This happened to me many times because I’m very slow to create a thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "indah rezqi",
      "created_time": "June 29, 2023, 04:12:44 PM",
      "body": "Quote from: Hatchy on June 29, 2023, 03:39:33 PMQuote from: tread93 on June 29, 2023, 03:07:27 PM>I haven't really experienced such before, the only message I get sometime is when I log into a new browser and forget to hit the stay logged in button. So I get to view the forum as a guest until I login again. Apart from that, you can also find similar messages when you enter from two different devices in same time and then you log out one of them. Automatically, your account will be logged out of all devices. You can try.Quote from: Wapfika on June 29, 2023, 04:05:09 PM@OP, I think the error message that you get is when you are on the middle of creating a thread while your account get logout due to inactivity. This happened to me many times because I’m very slow to create a thread.I think your point is about running out of active sessions, temporarily you won't be automatically logged out unless you uncheck always log in and log out from one of two different devices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 29, 2023, 07:02:04 PM",
      "body": "Quote from: tread93 on June 29, 2023, 03:07:27 PMDoes anyone else's heart sink a bit when you see this message thinking somehow your profile got deleted in the latest update or something? Lol. When you leave your browser up on your desk or even just a tab open and it exits out from the forum automatically or just the browser stopped working because of inactivity and then you try to go back on and see that message and have to log back in. I know it can't just be me lmaoI always see that when I am entering bitcointalk on my mobile browser after few hours of inactivity, I just have to click the profile tab or if it's logged out I just have to log in. It never game me any feel that my account is in any kind of trouble cause I knew this can happen when we don't have active sessions.But it never happened to me on desktops only on the mobile browser even when I checked always logged in mark.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "June 29, 2023, 08:27:07 PM",
      "body": "Quote from: Wapfika on June 29, 2023, 04:05:09 PMMy Bitcointalk account keeps logout even if I click that remember me box when I close the Bitcointalk tab and turn off WiFi.So far I haven't run into the same issue, but if it were, I'd never feel it would be a risk. Your account will be at risk if you see a different IP, it could be that your account was recently compromised but they didn't change the password and email. This is just an assumption, but you can monitor your IP here:https://bitcointalk.org/myips.phpAnother thing that I think is, you may not have the password auto-saved in your browser for the bitcointalk account. But for security reasons, you don't need to save it. It's better if your account logs out automatically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 29, 2023, 09:20:33 PM",
      "body": "Quote from: Wapfika on June 29, 2023, 04:05:09 PMMy Bitcointalk account keeps logout even if I click that remember me box when I close the Bitcointalk tab and turn off WiFi. This happens because you logged into your account using another device or browser during that time when you closed your first bitcointalk tab. That's why they always ask you to login again when you open the browser and Visit the Bitcointalk link.The bad news could be that someone else using another device is accessing your account without your knowledge. Try to check your account's IP address historyQuote from: Wapfika on June 29, 2023, 04:05:09 PM@OP, I think the error message that you get is when you are on the middle of creating a thread while your account get logout due to inactivity. This happened to me many times because I’m very slow to create a thread. That error is usually different from the one stated by the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 29, 2023, 10:05:14 PM",
      "body": "Quote from: JeromeTash on June 29, 2023, 09:20:33 PMThis happens because you logged into your account using another device or browser during that time when you closed your first bitcointalk tab.Logging in to your account using another device doesn't affect your other sessions. I have done that many times and I am sure about that. That's logging out which affects your other sessions. If you log out in one device, you are automatically logged out in all other devices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "June 30, 2023, 12:43:17 AM",
      "body": "Quote from: hosseinimr93 on June 29, 2023, 10:05:14 PMQuote from: JeromeTash on June 29, 2023, 09:20:33 PMThis happens because you logged into your account using another device or browser during that time when you closed your first bitcointalk tab.Logging in to your account using another device doesn't affect your other sessions. I have done that many times and I am sure about that. That's logging out which affects your other sessions. If you log out in one device, you are automatically logged out in all other devices. Hmm, Strange. It happens every time with me. Note that I always use the stay-logged-in feature. Whenever I log in using my desktop, I notice my account gets logged out from my smartphone browser. I didn't know if that was only me. I guess Jerometash faced this as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "June 30, 2023, 12:58:14 AM",
      "body": "Quote from: tread93 on June 29, 2023, 03:07:27 PMDoes anyone else's heart sink a bit when you see this message thinking somehow your profile got deleted in the latest update or something? Lol. When you leave your browser up on your desk or even just a tab open and it exits out from the forum automatically or just the browser stopped working because of inactivity and then you try to go back on and see that message and have to log back in. I know it can't just be me lmaoBeen here long enough that I don't that accounts are simply going to be deleted.However, when my sessions expired because I forget to click, \"Always stay logged in:\" and I suddenly typing a reply and suddenly when I push Post suddenly I was log out. The first thing that comes to my mind that maybe my account was hacked.Nevertheless, I try to log back to see that everything is fine and that my account was ok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "June 30, 2023, 07:10:52 AM",
      "body": "The most I have gotten is a session timed out message when I take too long reading a thread before making a reply on it. I cannot remember the exact error message but it is something like the \"The thread you are looking for does not exist\".It would not come as a surprise that there is a similar warning for logged out accounts or when the session expires.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 30, 2023, 08:23:01 AM",
      "body": "Quote from: tranthidung on June 29, 2023, 03:19:57 PMIt is very long time since admins accepted to delete accounts, change accounts to Anonymous.AFAIK, they did according to requests from users, and if my memory does not fail me, there is an account that was deleted by admins sometime between 2019 to 2021.Quote from: John Abraham on June 30, 2023, 12:43:17 AMHmm, Strange. It happens every time with me. Note that I always use the stay-logged-in feature. Whenever I log in using my desktop, I notice my account gets logged out from my smartphone browser. I didn't know if that was only me. I guess Jerometash faced this as well. If you log out from any device, all devices will be automatically logged out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 30, 2023, 09:05:43 AM",
      "body": "I have never witnessed this before even during the update and I don't exit my browser rather I do minimized it then whenever I feels making use of the forum I just click to start where I stop, though sometimes when clicking on a profile that is incorrect it would take you to your direct profile instead of the owners profile or maybe such person's profile might be deleted admin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "June 30, 2023, 12:25:40 PM",
      "body": "Quote from: John Abraham on June 30, 2023, 12:43:17 AMQuote from: hosseinimr93 on June 29, 2023, 10:05:14 PMQuote from: JeromeTash on June 29, 2023, 09:20:33 PMThis happens because you logged into your account using another device or browser during that time when you closed your first bitcointalk tab.Logging in to your account using another device doesn't affect your other sessions. I have done that many times and I am sure about that. That's logging out which affects your other sessions. If you log out in one device, you are automatically logged out in all other devices. Hmm, Strange. It happens every time with me. Note that I always use the stay-logged-in feature. Whenever I log in using my desktop, I notice my account gets logged out from my smartphone browser. I didn't know if that was only me. I guess Jerometash faced this as well. This is exactly what happened to me few minutes ago.I have a thread I update weekly, and I only do the update with a desktop. First, I logged into my account with my mobile phone and when I realized I needed to use the desktop, I switched to desktop. Logged in my account, without checking the always stay logged in button. I proceeded with the updates, after the tedious task, not knowing that I already logged out of the mobile, I wanted to update the thread from my desktop, I was automatically logged out and session expired. Edited post not seen in the draft. I had to started afresh. I wasn't actually happy but I learnt something from the incident.If you do not check the Always stay logged in check box, you will be logged out of your account if it is logged out in another device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 30, 2023, 12:43:31 PM",
      "body": "Quote from: John Abraham on June 30, 2023, 12:43:17 AMWhenever I log in using my desktop, I notice my account gets logged out from my smartphone browser.If that's the case, you will never be able to have multiple active sessions. It's logging out which should affect your other devices, not logging in to your account. Quote from: rby on June 30, 2023, 12:25:40 PMIf you do not check the Always stay logged in check box, you will be logged out of your account if it is logged out in another device.You are logged out in all of your devices, once you log out in one of your devices, even if you have checked \"Always stay logged in\" option when logging in to your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}