{
  "id": "topic_5520499",
  "title": "bigmanik",
  "author": "bigmanik",
  "created_time": "November 24, 2024, 02:12:26 PM",
  "content": "I came across this on X and I found it amusing how even if he had not sold it off he still won't have held on to BTC Don't be like Greg Keep HOLDING",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5520499",
  "comments": [
    {
      "author": "Eternad",
      "created_time": "November 24, 2024, 02:17:31 PM",
      "body": "He has a lot of time to buy back again since he started during 2011. Even buying during 2012 onwards can still give him a massive profit if he will just hold until now.There’s nothing wrong with his decision that time since he made a good profit despite he missed to sell at 8$. A profit is profit which is better than selling at loss. That time he doesn’t have any idea that price will skyrocket.Anyone here can do a research if he buy back and still a Bitcoin holder now or forever a loser on Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "November 24, 2024, 02:59:13 PM",
      "body": "Quote from: Eternad on November 24, 2024, 02:17:31 PMAnyone here can do a research if he buy back and still a Bitcoin holder now or forever a loser on Bitcoin? He wouldn't be a holder You can tell from his post that, even if he had bought again he wouldn't hold for long since he has a mindset of a trader. There's nothing wrong with taking profit but I'd advice not to ever be a nocoiner. It's quite going to be similar to people that would sell now or @ $100K.Years later they would realised that they sold too quick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 24, 2024, 03:03:25 PM",
      "body": "He has been posted in the forum before. So this is another thread dedicated to Greg. Thread purpose is probably something to encourage holders to keep holding.Greg more than likely bought some even at the price of $8. Once a Bitcoin holder, will always be a Bitcoiner he may even find it funny seeing posts like this about him. He'd still be laughing his ass for being an early investor, unlike the rest who just came in 2020 or 24.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 24, 2024, 03:11:04 PM",
      "body": "https://bitcointalk.org/index.php?topic=5517788.msg64726672#msg64726672Just like the guy in the thread above there are many stories of people's initial experience with Bitcoin, we can't say we just fully trust Bitcoin from the first time we heard of it, lots of people has made mistakes about the future of Bitcoin and I think it's fine. We can't all be early birds at the same time. But there are chances some of them had realised their mistake Early enough to join back in and by now they are also good. Also if some bitcoiners decides to sell off their Bitcoin now with the current price they will be making good profit but in ten years from now we may be looking at them as failures and comparing them with the 10 years from now price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "November 24, 2024, 03:45:54 PM",
      "body": "I'm really tired of seeing stories like this and whenever I see stories like this it's usually follows with hundreds of comments with similar stories. There is nothing happy in those stories just filled with regrets. And these regrets are accompanied with pain and depression. People couldn't believe that bitcoin would be almost $100k now and they think about all that they should have done that they didn't do. But that time is passed and you cannot go back to change the past but you can start from today and make better decision about the future in terms of Bitcoin investments. There are even more ways to stack up Bitcoins than there were in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "November 24, 2024, 03:51:50 PM",
      "body": "Buy and hold anything for 10+ years and you'll be wealthier. Stocks, crypto, real estate, art, etc.Everyone regrets, but nobody has the patience to HODL, even now. Hindsight is 20/20Would he have held the BTC when it was $1500? $5000? $20000? etc...What about the dips? It takes real discipline to hodl through all the ups and downs without selling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "November 24, 2024, 03:54:24 PM",
      "body": "Quote from: bigmanik on November 24, 2024, 02:12:26 PMI came across this on X and I found it amusing how even if he had not sold it off he still won't have held on to BTC Don't be like Greg Keep HOLDING I guess, I just saw the same screenshot few days back and having a discussion over it on this forum, not really sure though.It's just a matter of time here because at that time he chose what he wanted to. He could have never predicted what would happen a decade down the line.The situation is same right now and may be some person would take this post as a screenshot a decade later, laughing over us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BABY SHOES",
      "created_time": "November 24, 2024, 05:30:01 PM",
      "body": "Maybe at that time there were still faucets that were 5 BTC free.It's not easy to hold for a long time, especially at that time bitcoin was not in the interest of many investors so they took the slightest advantage... maybe if I were in Greg's position I would do the same thing.Don't be surprised that bitcoin was considered worthless at all, only now everyone knows how important this asset is.Even now they know, even if they buy at $100K they can still hold it for the next 10 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "November 24, 2024, 06:34:10 PM",
      "body": "Things always look better in hind sight, but at the time no one can predict what will happen, for this reason 99% of holders in the first 4 years of Bitcoin will not hold long term cause there is no guarantee of the price action and no price history to use as a reference.Those who bought from 2015 up are more likely to hold for longer as at that time bitcoin was getting lots of attention, people were doing more actual research into the product and there was a price history to use as a reference.There's no point regretting selling early or not buying early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 24, 2024, 07:00:31 PM",
      "body": "This is a perfect example to show why we need to focus on long term profits over short term profits.Anyway not just Greg, most people who mined Bitcoin in the early days sold it for pennies and at that time they spend little to nothing to mine and sold to get some snack money which might have looked a steal but no one expected Bitcoin to reach 100K after a decade.Just HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 24, 2024, 09:20:44 PM",
      "body": "Posts like this are just history and memory, but deep down, if most of us found ourselves in a sure show, we could have done worse; no one was that sure of what bitcoin could have become as of now, which is why when you hold something, you are uncertain of the value, and you just regard it as a joke. The moment you see any little value attached to it, you rush to sell it to get the other side of the fun that thing brings.  That post was made in 2011, which means he regretted not holding to make $8 from the 1700 BTC; he had enough time to buy back, but if he didn't, that means even after that tweet he really doesn't realise exactly why he should have held Bitcoin. If not for the eye opening now, all new ATH always appears to be the best price one can see back then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "November 24, 2024, 09:40:45 PM",
      "body": "Quote from: bigmanik on November 24, 2024, 02:12:26 PM~Eh who knows, Greg might be holding more after buying at $10. Pretty sure we can only so much of these things in hindsight lol, given the chance I'd also probably profit as well with a 5x. But that doesn' t stop me from buying more and holding it though, hope Greg did just that. And Greg probably sure as hell didn't know that that $8 would be $100k now lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "November 24, 2024, 10:00:53 PM",
      "body": "Quote from: bigmanik on November 24, 2024, 02:12:26 PMI came across this on X and I found it amusing how even if he had not sold it off he still won't have held on to BTC He bought about $100 at $0.06 and sold it at $0.30 for a total of $510 which means he made a profit and although there were regrets at the end but he had already decided to sell so it can't be a regret because it was too late and indeed at that time for more than $400 it could have been a very big thing.In addition, everyone has their own views because after all, even though in the end we always say “hold” but indeed when you are profitable and want to let go then everything still comes back to yourself in the end.  What distinguishes then from now is that at the beginning of bitcoin there may not be many people who believe bitcoin will have enormous progress and prospects so that they will release even though the benefits achieved will not be as great as those who hold until now but for now saying “hold” it is clear that we have seen and felt the process and progress of bitcoin is very good so it is clear that we will do our best to maintain it so that we do not lose momentum because when you release your asset then it is no longer yours and you may not be able to get it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "November 24, 2024, 10:34:55 PM",
      "body": "Quote from: bigmanik on November 24, 2024, 02:12:26 PMI came across this on X and I found it amusing how even if he had not sold it off he still won't have held on to BTC Don't be like Greg Keep HOLDING People will always have regrets of selling their Bitcoin at a low price after it skyrocket, and this scenario will definitely not be the last regret we will see as the price of Bitcoin keeps skyrocketing high after every 4yrs interval when halving takes place. Because just as some people are happy selling their Bitcoin at $98,000 now, so will this same people regret in the next 10yrs after the price of Bitcoin may have skyrocketed to $1million per BTC. Hence, my sincere advice to newbies will be to invest an amount of money they probably can comfortably not be in need over long time. While they HODL their Bitcoin for designated time frame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 25, 2024, 10:09:05 AM",
      "body": "Being able to hold unto or have faith in what you don't even have an idea about its vision is something that was very difficult for most  old Bitcoiners who had a large sum of Bitcoin in the past. I believe it was not only Greg that sold his Bitcoin quite easily.  So many other did. From what Greg said, he sold at $0.3 and regret why he could not hold until the price got to $8. That's to say, he would not still hold any coin till not that price is near the $100k zone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "November 25, 2024, 10:21:06 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on November 25, 2024, 10:09:05 AMBeing able to hold unto or have faith in what you don't even have an idea about its vision is something that was very difficult for most  old Bitcoiners who had a large sum of Bitcoin in the past. I believe it was not only Greg that sold his Bitcoin quite easily.  So many other did. From what Greg said, he sold at $0.3 and regret why he could not hold until the price got to $8. That's to say, he would not still hold any coin till not that price is near the $100k zone. Let's face it - most of us would sell even at 1k, 10k, now we are at 100k - and we won't do it. Too much time and effort passed to not know what BTC is and what it stands for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "November 25, 2024, 11:48:46 AM",
      "body": "During that time he really don't know that Bitcoin will grow big and so he sold, he could have missed Lambo though. But in any case, he said that he doesn't have any Bitcoin already as he sold it at $15,000 to pay his student loan.As and far as the legendary tweet,https://x.com/GregSchoen/status/1489677327235788805",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Swordsoffreedom",
      "created_time": "November 25, 2024, 12:02:17 PM",
      "body": "Quote from: john_egbert on November 25, 2024, 10:21:06 AMQuote from: Dr.Bitcoin_Strange on November 25, 2024, 10:09:05 AMBeing able to hold unto or have faith in what you don't even have an idea about its vision is something that was very difficult for most  old Bitcoiners who had a large sum of Bitcoin in the past. I believe it was not only Greg that sold his Bitcoin quite easily.  So many other did. From what Greg said, he sold at $0.3 and regret why he could not hold until the price got to $8. That's to say, he would not still hold any coin till not that price is near the $100k zone. Let's face it - most of us would sell even at 1k, 10k, now we are at 100k - and we won't do it. Too much time and effort passed to not know what BTC is and what it stands for. Like now, everyone is confidently claiming that bitcoin will hit $1 million in the future but how many of us can hold on until then? Or will we sell when the price hits $100k or $200k? And we will also be the ones who will regret in the future and be laughed at by investors at that time for not being able to hold out until then. I bet no one can hold bitcoin until it hits $1 million because like you said it takes too much time and effort. Easier said than done, holding bitcoin for 10 or 20 years is an impossible task if we talk about bitcoin and check its price every day like we are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 25, 2024, 12:22:08 PM",
      "body": "Depending on how people have been trading with a little luck and some skill he could have been way ahead of sitting on 1700BTC worth close to $99000 now.Playing the market is not without risks, but still is sitting on money. There is an opportunity cost and not selling at price X to get in a good deal that could be better then investing / holding BTCThink about it, you could have sold your BTC holdings in July 2020 lets call it $10000 per coin so holding selling it today would get you $100000 per coin. That's 10XBUT if you sold and bought nvida stock back in July 2020 it was at $10 a share now it's at $140 that is a 14X increase. AND nvidia has paid out some dividends between then and now.Just saying.....-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}