{
  "id": "topic_5430631",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "December 20, 2022, 08:37:48 PM",
  "content": "Surpreendendo tudo e todos, o Banco do Japão anunciou que não iria alterar as suas taxas de juros.QuoteO Banco do Japão (BoJ) decidiu, esta terça-feira, manter inalteradas as taxas de juros de referência, mas alargou ligeiramente o intervalo de negociação dos rendimentos dos títulos a dez anos, reduzindo a sua estratégia de flexibilidade.Esta atitude baralho o mercado, que de certo modo reagiu negativamente, com a desvalorização do iene.Será que esta outra visão para esta onda de inflação é assim tão má? Ou será que ela só se torna má, porque os outros países não gostam?EDITFonte: https://expresso.pt/economia/2022-12-20-Banco-do-Japao-contraria-tendencia-e-mantem-taxas-de-juro-inalteradas-2a3a1dad",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430631",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "December 21, 2022, 04:22:38 PM",
      "body": "O Japão é diferente.Eles historicamente lutam contra a deflação. As pessoas poupam que nem malucas lá e gastam pouco o dinheiro.É uma situação diferente do resto do mundo. Eu estava vendo, a inflacao de 12 meses do japão foi bem menor do que o do resto do mundo.achei esse grafico de setembro:Embora eu veja que ela esteja subindo, é de se esperar que eles sejam mais cautelosos pra subir os juros pq precisam menos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 21, 2022, 05:27:14 PM",
      "body": "Quote from: bitmover on December 21, 2022, 04:22:38 PMEmbora eu veja que ela esteja subindo, é de se esperar que eles sejam mais cautelosos pra subir os juros pq precisam menos.Na sua opinião, essa diferença em relação aos outros países do mundo, será algo positivo? Para eles será de certeza... mas para nós?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 21, 2022, 08:18:08 PM",
      "body": "O Ulrich tem alguns vídeos sobre essa questão. Quote from: joker_josue on December 21, 2022, 05:27:14 PMQuote from: bitmover on December 21, 2022, 04:22:38 PMEmbora eu veja que ela esteja subindo, é de se esperar que eles sejam mais cautelosos pra subir os juros pq precisam menos.Na sua opinião, essa diferença em relação aos outros países do mundo, será algo positivo? Para eles será de certeza... mas para nós?Eu acho que não é positivo pra eles, é só um problema diferente.  A economia do Japão começou a desacelerar no início dos anos 90 e desde então não recuperou. Enquanto isso, o Banco do Japão fica injetando dinheiro na economia pra tentar fazer a economia desenvolver, mas não tem tido muito sucesso nos últimos anos. Talvez em um cenário de inflação de TODO MUNDO de forma persistente eles possam se beneficiar de algo em termos de comercio internacional (?) não sei. Mas acho que em termos de politica interna é algo ruim, só ruim diferente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 22, 2022, 12:29:18 AM",
      "body": "Quote from: joker_josue on December 20, 2022, 08:37:48 PMcom a desvalorização do iene.Pelo contrário, valorizou..Quote from: Disruptivas on December 21, 2022, 08:18:08 PMO Ulrich tem alguns vídeos sobre essa questão.Tem um de hoje falando sobre este tema: https://youtu.be/0TW8WPuGvc8Nessa semana ele postou alguns diretamente do Japão.. ótimo conteúdo para quem é apaixonado pela cultura deles..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 22, 2022, 01:01:04 AM",
      "body": "Quote from: sabotag3x on December 22, 2022, 12:29:18 AMQuote from: joker_josue on December 20, 2022, 08:37:48 PMcom a desvalorização do iene.Pelo contrário, valorizou..Obrigado pela nota, fui induzido em erro com base na informação contida no artigo.Realmente houve uma pequena valorização, apesar de não ser significativa foi positivo.Será sinais que os investidores, até estão agradados como o Japão esta a reagir aos momentos de instabilidade na economia no mundo inteiro!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 22, 2022, 05:17:06 PM",
      "body": "Quote from: sabotag3x on December 22, 2022, 12:29:18 AMTem um de hoje falando sobre este tema: https://youtu.be/0TW8WPuGvc8Nessa semana ele postou alguns diretamente do Japão.. ótimo conteúdo para quem é apaixonado pela cultura deles..Sim, ta sendo bem interessante os vídeos dele analisando desde questões mais macro até as pequenas, mas que dizem muito sobre as diferenças culturais. Engraçado ele comentando que estava praticamente comentando atentados financeiros ao dobras as notas de dinheiro, já que lá ninguém nunca dobra e elas são ''perfeitas''e ninguem gosta de receber notas dobradas. E aqui no brasil tem até as notas que chamam de bebado, quando chega em estagio avançado de tanto amassar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 22, 2022, 06:26:38 PM",
      "body": "Hoje comentei com uma colega, que tem familiares no Japão, como estava a situação por lá.Ao que parece internamente as coisas estão minimamente bem, o mercado esta a circular normalmente e as pessoas não tem tido dificuldades no dia a dia, de modo geral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 23, 2022, 01:21:40 AM",
      "body": "Quote from: joker_josue on December 22, 2022, 06:26:38 PMHoje comentei com uma colega, que tem familiares no Japão, como estava a situação por lá.Ao que parece internamente as coisas estão minimamente bem, o mercado esta a circular normalmente e as pessoas não tem tido dificuldades no dia a dia, de modo geral.\"Nem só de inflação vive os problemas financeiros\" Pra maioria das pessoas que vive o pesadelo dos preços aumentando mês após mês, parece um sonho morar em um país onde os preços e salários podem ficar \"congelados\" por anos.Mas, a inflação serve como combustível para a economia de um país. Se os preços não sobem, as margem de lucros das indústrias, serviços e comércios também nunca aumentam.O Japão não tem a praga do consumismo do resto do mundo, e esse é um dos motivos deles terem uma economia de crescimento lento.Não sei qual seria uma saída para o Japão, exportar mais? Diminuir mais ainda a rentabilidade de aplicações (até aumentar taxas para quantidade maiores de dinheiro guardado)? Não sei.Mas eu mesmo, acho que gostaria de experimentar como é viver em um país sem inflação.Só não posso levar minha esposa junto, porque aí os preços iriam começar a subir rapidinho",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 23, 2022, 08:03:36 AM",
      "body": "Quote from: alegotardo on December 23, 2022, 01:21:40 AMO Japão não tem a praga do consumismo do resto do mundo, e esse é um dos motivos deles terem uma economia de crescimento lento.Talvez não seja bem assim.Na conversa com essa colega, ela diz que eles também são bem consumistas internamente. A tendência deles é no inicio do mês colocar de parte todo o dinheiro que precisam para pagar as contas, e o que sobra é para gastar. Fazem isso de um modo bem rigorosa.E deu o exemplo do familiar. Ele tem um negocio de restauração, tem uma banca de salgados e afins. Normalmente quando existe pouca tendência ao consumo, são esses pequenos negócios os primeiros a sentir. Mas, ele já conseguiu juntar dinheiro para conseguir comprar um terreno.O que ela explicou é que eles importam pouco, porque produzem tudo o que consome, o que é bom. Em relação a exportação vai depender dos mercados internacionais, mas visto que hoje em dia existe maior concorrência internacional, principalmente por causa da China, eles acabam por exportar menos do que exportavam a 20 anos atras. Dai a economia acabar por ficar estagnada. Basicamente entra pouco dinheiro de fora, mas internamente esta tudo a circular normalmente.Apenas estou a passar a informação que recebi...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 23, 2022, 10:22:44 AM",
      "body": "Quote from: sabotag3x on December 22, 2022, 12:29:18 AMTem um de hoje falando sobre este tema: https://youtu.be/0TW8WPuGvc8Nessa semana ele postou alguns diretamente do Japão.. ótimo conteúdo para quem é apaixonado pela cultura deles..Que legal, valeu por postar, já fazia um tempo que não via nenhum vídeo do Ulrich, e pelo menos esses do Japão vou dar uma olhada.Sobre o tópico, o Japão é diferente mesmo em quase tudo, é difícil imaginar um país sem inflação como temos aqui e como tem sido nos últimos meses.A economia deles parece também tão diferente do resto do mundo, eles trabalham demais por lá, tem um padrão de vida acima do normal até de países de primeiro mundo, porém é extremamente fechado para estrangeiros.Acredito que a idade da população também afeta a economia, a população de idosos por lá é bem alta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 23, 2022, 11:16:17 AMLast edit: December 23, 2022, 01:04:11 PM by bitmover",
      "body": "Quote from: alegotardo on December 23, 2022, 01:21:40 AMMas, a inflação serve como combustível para a economia de um país. Se os preços não sobem, as margem de lucros das indústrias, serviços e comércios também nunca aumentam.O Japão não tem a praga do consumismo do resto do mundo, e esse é um dos motivos deles terem uma economia de crescimento lento.Essa opinião é a mainstream, mas é controversa. Já existem estudados mostrando o oposto também.Os governos financiam estudos com esse viés,  principalmente por conta do imposto inflacionário.Você pode pesquisar sobre o termo , mas de forma geral o governo lucra 2 vezes com a inflação e nos perdemos 2 x também.O governo vai lá e cria moeda (ou coloca mais em circulação). Isso gera receita pro governo e voce perde poder de conpra do dinheiro q vc tem com a inflação .Daí o imposto inflacionário é como se fosse o valor que você perde da sua grana com a inflação. Essa é a sua primeira perda.A segunda vez que vc perde é quando os seus bens tributaveis são reajustados pelo ipca ou qq outro índice.Suponhamos que você comprou um imóvel por 100 mil. Após 10 anos, houve 10x de inflação.Quando vc vende seu imóvel por 1000 k, vc paga 15% de imposto pro governo. Ou seja, pagou imposto sobre a inflação O mesmo pra renda fixa, ações, etc. Vc sempre paga impost pela inflação que o governo criou .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}