{
  "id": "topic_5450923",
  "title": "Grayman101",
  "author": "Grayman101",
  "created_time": "May 02, 2023, 07:19:43 AM",
  "content": "I am having an issue concerning something in the coding and I am unable to fix the error on my end. I've sent an email and dozens of bug reports and I am wondering how long something like this usually takes to be fixed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450923",
  "comments": [
    {
      "author": "nc50lc",
      "created_time": "May 02, 2023, 08:50:00 AM",
      "body": "Based on my small number of reported issues (about 2 or 3..),developers usually reply within a day and proceed to commit a \"fix\" depending on the severity of the issue and if it falls under their priority list.To be clear, you're talking about an issue you've posted in Electrum's GitHub Repository, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 02, 2023, 09:09:34 AM",
      "body": "Quote from: Grayman101 on May 02, 2023, 07:19:43 AMI've sent an email and dozens of bug reports and I am wondering how long something like this usually takes to be fixed? Email? Who did you send the email to? As far as I know, there is no email address for contacting electrum developers at all and you should report the bugs on their github page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Grayman101",
      "created_time": "May 02, 2023, 09:20:58 AM",
      "body": "Yes I am talking about the issues I have posted to github. Or at least that's what the error message ends with is that it was sent there. And for the email, it's electrumdev@gmail.com and I found it on the electrum wallet app info in the play store",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 02, 2023, 02:55:29 PMLast edit: July 19, 2023, 08:16:31 PM by logfiles",
      "body": "I think it depends on what issue you have reported. The time they take to respond varies, though, if you explore the issues opened and closed on GitHub. Just be a little patient bro. As for email address provided on Google play. I won't lie to you about how long they take to respond.By the way OP, I don't know what kind of issue that is but in case it is security sensitivehere is another way of contacting themhttps://github.com/spesmilo/electrum/securityand alsoIRC - https://web.libera.chat/#electrum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Grayman101",
      "created_time": "May 02, 2023, 03:14:03 PM",
      "body": "I've sent plenty of bug reports via my wallet to github although I do not know how to find any of the reports I have sent. The error type at the bottom of the report contents says: Bool object is not callable. The issues I've had before this are fixed my restarting the app, and this is the first time Ive experienced this issue to this extent. I've tried everything I can possibly do from my end.Do you think using a desktop or laptop to access my wallet will fix the issue?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 02, 2023, 09:06:48 PM",
      "body": "Quote from: Grayman101 on May 02, 2023, 03:14:03 PMDo you think using a desktop or laptop to access my wallet will fix the issue? It could likely be just a problem with just the mobile app and not PC. Try using the desktop wallet and see if everything is OKI see some closed issue, thou I am not sure which one you opened. One was opened about 4 days ago and the other about 6 hours ago. But all are closed, which means the devs have seen it and have worked on the issue, which will be resolved in the next updateThese are the recent issues about the error you are talking about1. https://github.com/spesmilo/electrum/issues/83682. https://github.com/spesmilo/electrum/issues/8375This is what the dev said in the second issue.Quoteduplicate of #8368.Fixed in 4.4.2, which we are planning to release this week.Sorry for the inconvenience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Grayman101",
      "created_time": "May 02, 2023, 11:28:30 PM",
      "body": "The second one is definitely what I am experiencing. Thank you for all of the help everyone! Id be lost without you!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}