{
  "id": "topic_5400144",
  "title": "abia",
  "author": "abia",
  "created_time": "May 25, 2022, 11:42:59 AM",
  "content": "Kabar baik lagi tentang cryptocurency di Indonesia, karena perkembangan mata uang digital (cryptocurency) di Indonesia semakin mendapat tempat dimata pemerintah Indonesia.Saat ini Pemerintah Indonesia telah memberikan izin untuk beberapa asset digital  (cryptocurency) dalam perdagangan mata uang digital. Mengutip dari sumber :https://www.cnbcindonesia.com/tech/20220524071039-37-341302/resmi-ini-daftar-kripto-yang-diakui-di-indonesia“Izin tersebut dikeluarkan melalui Badan Pengawas Perdagangan Berjangka Komoditi (Bappebti) seiring dengan terbitnya peraturan Bappebti (Perba).”Dengan beberapa nama asset crypto yang telah terdaftar secara resmi mendapatkan ijin dalam perdagangan mata uang digital, diharapkan masyarakat Indonesia lebih merasa aman dalam melakukan perdagangan mata uang digital (cryptocurency) di Indonesia.Dan untuk kita semua yang sudah bergerak di bidang cryptocurency, saya rasa hal ini menjadi informasi yang bagus karena kita dapat lebih selektif dalam melakukan investasi terhadap mata uang digital, terutama yang sudah mendapatkan ijin resmi di Indonesia.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400144",
  "comments": [
    {
      "author": "Oneandpure",
      "created_time": "May 25, 2022, 12:36:01 PM",
      "body": "Dari sumber yang anda informasikan terlihat update terbaru atau berita CNBC diterbitkan tanggal 24 May 2022, namun saya tidak menemukan salah satu token fenomenal saat ini yaitu token Asix++, seharusnya token yang sudah listing di Indodax secara resmi sudah mengantongi izin dari Bappeti sebelum mereka listing. Namun tidak ada jaminan dengan adanya izin dari Bappeti bisa membuat koin atau token tersebut potensial, bahkan beberapa token atau koin dari list sumber CNBC Indonesia malah harganya semakin drop, semisal koin TEN, saya masih ingat saat harga pre sale 3,000 IDR waktu itu namun sampai saat ini menjadi stable koin dengan harga cukup murah dibawah harga pre sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antonas1",
      "created_time": "May 25, 2022, 03:25:19 PMLast edit: May 25, 2022, 06:02:47 PM by Antonas1",
      "body": "Kok cuma 219 ya? Padahal kalo kita cek SK Bappebti tanggal 17 Desember 2020 disini, halaman 16 sampai halaman 23 itu ada 229 aset yang dimasukkan.Mungkin sebaiknya OP juga mencantumkan daftar resmi yang dirilis oleh Bappebti tersebut untuk menjadi referensi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abia",
      "created_time": "May 26, 2022, 12:59:42 AM",
      "body": "Quote from: Antonas1 on May 25, 2022, 03:25:19 PMKok cuma 219 ya? Padahal kalo kita cek SK Bappebti tanggal 17 Desember 2020 disini, halaman 16 sampai halaman 23 itu ada 229 aset yang dimasukkan.Mungkin sebaiknya OP juga mencantumkan daftar resmi yang dirilis oleh Bappebti tersebut untuk menjadi referensi.Betul sekali bro memang ada 229 asset crypto yang \"boleh diperdagangkan\", namun baru 219 asset yang sudah mendapatkan ijin resmi. hal ini dilakukan dengan meninjau dua aspek pendekatan ; 1. Pendekatan secara yuridis (melihat peringkat 500 coin market cap/CMC) sesuai ketentuan Pasal 3 ayat (2) huruf c Perba Nomor 5 Tahun 2019. 2. Pendekatan pendekatan penilaian analisis hierarki proses (AHP) Bappebti dengan tetap memperhatikan aspek keamanan, profil tim, dan anggota tim yang mengembangkan, tata kelola sistem blockchain, skalabilitas sistem blockchain, roadmap yang menjelaskan rencana pengembangan sistem blockchain yang dapat diverifikasi pencapaiannya, dan nilai standar 6,5Kemungkinan 10 asset yang lainnya masih melalui proses peninjauan melalui pendekatan oleh BAPPEPTI dan belum resmi mendapatkan ijin serta jaminan keamanan dari BAPPETI, namun boleh diperdagangkan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "May 26, 2022, 01:41:59 AM",
      "body": "Quote from: abia on May 25, 2022, 11:42:59 AMKabar baik lagi tentang cryptocurency di Indonesia, karena perkembangan mata uang digital (cryptocurency) di Indonesia semakin mendapat tempat dimata pemerintah Indonesia.Ini kan sudah ada threadnya di sini: Perkembangan Perdagangan Bitcoin/Cryptocurrency sebagai aset komoditasJadi buat apa bikin thread baru kalau isinya balik lagi ke referensinya ke threadnya mas abhi, di sana itu sudah paling lengkap dari awal-awal sampai pada peraturan terbaru dan tentunya dimoderasi.*gunakan fitur search atau Ninjastic.space sebelum membuat thread biar gak numpuk sana sini dskusinya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abia",
      "created_time": "May 26, 2022, 12:44:56 PM",
      "body": "Quote from: Oneandpure on May 25, 2022, 12:36:01 PMDari sumber yang anda informasikan terlihat update terbaru atau berita CNBC diterbitkan tanggal 24 May 2022, namun saya tidak menemukan salah satu token fenomenal saat ini yaitu token Asix++, seharusnya token yang sudah listing di Indodax secara resmi sudah mengantongi izin dari Bappeti sebelum mereka listing. Namun tidak ada jaminan dengan adanya izin dari Bappeti bisa membuat koin atau token tersebut potensial, bahkan beberapa token atau koin dari list sumber CNBC Indonesia malah harganya semakin drop, semisal koin TEN, saya masih ingat saat harga pre sale 3,000 IDR waktu itu namun sampai saat ini menjadi stable koin dengan harga cukup murah dibawah harga pre sale.Untuk token Asix++ menurut informasi yang saya baca memang sudah listing di indodax, tetapi belum mendapatkan ijin di Indonesia atau belum terdaftar di Indonesia (di dalam negeri), untuk diperdagangkan di luar negeri tidak ada masalah.Jadi dalam hal ini token asix masih harus mengurus perijinan terlebih dahulu agar bisa diperdagangkan di dalam negeri (di Indonesia).Sumber :https://www.kompas.com/tren/read/2022/02/11/110000665/asix-dilarang-bappebti-ini-daftar-229-aset-kripto-yang-resmi-terdaftar?page=all#:~:text=Daftar%20229%20aset%20kripto%20berizin%20Bappebti&text=Bitcoin%2C%20Ethereum%2C%20Tether%2C%20Xrp,%2C%20Stellar%2C%20Neo%2C%20Nem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abia",
      "created_time": "May 26, 2022, 12:49:03 PMLast edit: May 26, 2022, 01:25:43 PM by abia",
      "body": "Quote from: DroomieChikito on May 26, 2022, 01:41:59 AMQuote from: abia on May 25, 2022, 11:42:59 AMKabar baik lagi tentang cryptocurency di Indonesia, karena perkembangan mata uang digital (cryptocurency) di Indonesia semakin mendapat tempat dimata pemerintah Indonesia.Ini kan sudah ada threadnya di sini: Perkembangan Perdagangan Bitcoin/Cryptocurrency sebagai aset komoditasJadi buat apa bikin thread baru kalau isinya balik lagi ke referensinya ke threadnya mas abhi, di sana itu sudah paling lengkap dari awal-awal sampai pada peraturan terbaru dan tentunya dimoderasi.*gunakan fitur search atau Ninjastic.space sebelum membuat thread biar gak numpuk sana sini dskusinya.Mohon maaf mas kalau memang sudah ada threadnya, karena memang dari thread yang sudah ada masih membagikan informasi terkait hanya peraturan-peraturan BAPPEPTI dan belum menyebutkan asset-asset digital ( crypto ) yang mendapatkan ijin diperdagangkan di Indonesia dan dijamin keamanannya oleh BAPPEPTI. Jadi saya share link dari list asset-asset digitalnya.Baik nya bagaimana mas ? thread ini saya hapus dan saya teruskan dari thread yang sudah ada saja kah ? (supaya ga banyak thread sejenis)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "May 26, 2022, 01:33:45 PM",
      "body": "Quote from: abia on May 26, 2022, 12:49:03 PMBaik nya bagaimana mas ? thread ini saya hapus dan saya teruskan dari thread yang sudah ada saja kah ?Jika isi topik atau pembahasannya hampir sama ataupun arahnya bisa sama, maka lebih baik diteruskan pada topik yang sudah ada saja biar tidak banyak topik baru dengan diskusi yang sama. Saya rasa saran dari bro @DroomieChikito itu sangatlah baik karena topik yang dia maksudkan itu juga masih sangat layak untuk dihidupkan dengan diskusi yang lebih baru dan bro @abia juga bisa mengupdatenya disana jika ada informasi terbaru mengenai hal-hal yang berkenaan dengan topik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abia",
      "created_time": "May 27, 2022, 12:21:47 AM",
      "body": "Baik kalau begitu terima kasih untuk masukannya bro @DroomieChikito dan bro @bestcoins1.Demi mendukung keteraturan forum ini saya akan meneruskan pembahasan tentang informasi perkembangan cryptocurency di Indonesia dan peraturan-peraturan pemerintah Indonesia melalui BAPPEPTI di thread yang sudah ada. Karena ada beberapa pertanyaan yang sudah saya jawab dan kemungkinan belum terbaca, maka saya memberikan waktu untuk teman-teman yang bertanya untuk bisa membaca jawaban dari saya , sementara thread ini saya kunci agar diskusi kita tidak berkembang disini.Selanjutnya saya serahkan kepada saudara moderator untuk menghapusnya setelah beberapa waktu kemudian.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}