{
  "id": "topic_5436380",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "January 22, 2023, 06:26:05 PM",
  "content": "I managed to safe a friend ( not very close ) from a scammer today.This friend lost some money to a crypto scam in 2021 and he still feels bad about it because the money is over 10k dollars but someone claimed they can help him to recover the fund, he got so happy and rushed down to my place this afternoon but unfortunately, I broke the news that this person is a scammer..1. The person DM him first.2. Mysteriously he knew he lost some crypto in 2021. 3. He wants 10% of the missing or lost funds deposited first to his wallet. I knew this is a old tactics but with the way this my friend felt after hearing about the possible refund I felt bad telling him that it's all a scam, I am still confused how this person knew he lost some funds in 2021 though, since this person is not ready to tell more about himself there is no way to find out. What do you guys think? I am getting this vibe that maybe the first hack was done by the same person or the same organization? I don't want to start asking questions about his friends and stuff, he is way older than me and we aren't very close, I called him a friend because he live nearby and he is into Bitcoin mining. I guess he has a lot to learn and understand.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436380",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "January 22, 2023, 06:47:15 PM",
      "body": "Quote from: KiaKia on January 22, 2023, 06:26:05 PMbut unfortunately, I broke the news that this person is a scammer..You did the right thing. Quote from: KiaKia on January 22, 2023, 06:26:05 PMWhat do you guys think? I am getting this vibe that maybe the first hack was done by the same person or the same organization? That's possible. It's also possible that the scammers sell the list of their victims to other scammers. That's one of the reasons people should avoid KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "January 22, 2023, 07:44:49 PM",
      "body": "Yeah, very possible that it is them that has did the trick before and saved his records to attempt for another scam. Good thing that you're there and you've helped your friend and saved him from another potential scam. Another possibility is that he probably know that person and just trying to trick him.If you don't want to ask him if there are other people who knows what has happened to him before then it's on that guy to trace back if he told it to someone he knew personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 22, 2023, 07:48:42 PM",
      "body": "First I would ask on what platform were the scammers chatting your friend from? A high percentage of this scams are either from telegram, YouTube or twitter. And the more your friend is on many groups and can even be on a scammer group that claims to provide him trades or help him invest.It’s not necessarily the scammers that made way with you friends initial money it’s probably another Scammer who already understands everything and his/her specialty is picking up the victim.I would advice you to tell you friend to be careful on social media and cut out from suspicious groups and also arrange his privacy and security settings so no one can add your friend into any group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "January 22, 2023, 08:00:54 PM",
      "body": "The story is somewhat vague, so we cannot really guess as to how the scammer was privy to such information; well we do not know how your friend lost his funds initially (in 2021), yes, you said he was scammed, but there are various ways one can be scammed, maybe the initial scam involved your friend revealing his private data, of which the scammers still have a list of some of their victims and their personal data.Having said that, we also don't know how the discussion between this scammer and your friend went, the scammer might be very smart and indirectly get those info from your friend without it seeming like they asked. Well all of that isn't really important, do well to educate your friend that any funds lost in crypto, is lost for good; and if they want to continue in the crypto network, they should garner knowledge on how to secure their funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 22, 2023, 09:27:37 PM",
      "body": "This is a common way of scamming people. That scammer has the data of people who got scammed before and now he is using that data to scam more of them. Maybe the guy is related to your friend's previous scam, or maybe he collected data from that organization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "January 22, 2023, 09:39:21 PM",
      "body": "Unfortunately, there have been many instances where personal information from databases has been leaked. In some cases, the data is even sold by company employees themselves on the black markets. For example, the Ledger customer database was leaked last year, and many people received suspicious offers and extortion attempts at their contact email addresses. It is possible that something similar has happened to your friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "January 22, 2023, 09:50:13 PM",
      "body": "Quote from: KiaKia on January 22, 2023, 06:26:05 PMThis friend lost some money to a crypto scam in 2021 and he still feels bad about it because the money is over 10k dollars but someone claimed they can help him to recover the fund, he got so happy and rushed down to my place this afternoon but unfortunately, I broke the news that this person is a scammer..1. The person DM him first.2. Mysteriously he knew he lost some crypto in 2021. 3. He wants 10% of the missing or lost funds deposited first to his wallet. I knew this is a old tactics but with the way this my friend felt after hearing about the possible refund I felt bad telling him that it's all a scam, I am still confused how this person knew he lost some funds in 2021 though, since this person is not ready to tell more about himself there is no way to find out. The point it all went wrong is when we started allowing students that graduate from institutions to come in to society without having equal opportunity to get jobs like there fathers did. That doesn't in anyway justify crime and scamming hood minded citizens who are facing the same struggle as the rest of humanity. Also, there are other opportunities to entrepreneurship than they were from years ago and a population to match that if one can just look or sort out for insights.For crypto scams, most times you stand a better cjnace to just be at peace with what you've lost. If one can give himself time to learn how the crypto space works as, being more of a one way street, a single pathway in which, one's its sent, there isn't any cjnace of a reversal without the recipient authorising the transaction, then people could escape this recovery tactics.I'll say, it's just the scammer trying a different trick on the same victim knowing that, he would jump at it. Especially with the amount that was lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "January 22, 2023, 09:51:11 PM",
      "body": "Quote from: KiaKia on January 22, 2023, 06:26:05 PMI managed to safe a friend ( not very close ) from a scammer today.This friend lost some money to a crypto scam in 2021 and he still feels bad about it because the money is over 10k dollars but someone claimed they can help him to recover the fund, he got so happy and rushed down to my place this afternoon but unfortunately, I broke the news that this person is a scammer..That you friend has a lot to learn and maybe you should introduce him to the forum so he can ask questions when he encounters similar situation just incase you aren't available to help him out. He should have known by now not to trust anybody he meets online especially those that message first. I believe his first scam was one that has to do with investment in whatever the scammers advertise to him and promise a good return on investment.He must have been carried away when the new scammer promised to help him recover the old funds and most have given him enough reason to believe him. OP hope you won't mind giving more details as this might be helpful to someone else here. What's the previous scam that this user is still trying to recover from. Always give name as it's create more awareness to novice reading threads here to avoid similar scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 22, 2023, 09:59:01 PM",
      "body": "If you've been exposed to scammers at any point in time or have had your details and personal information shared with untrusted third parties, it is safe to consider that you have been compromised and can be accessed by random scammers who could get your information over the dark web. You friend should have taken some precautions after their previous scam and should consider doing it now, if they failed to do it then.Your friend is likely going to get more scam attempts with increasingly more clever techniques. They should consider doing more research on how stuffs work and how best to protect their online identity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "January 22, 2023, 10:42:50 PM",
      "body": "Your friend is very lucky he talked to you about his situation, I’m sure he would have caught the bait and scammed for the second time. Bitcoin investment scam usually involve the victims registering their contact information into the investment website and some go as far as asking for KYC. $10k is not a small amount, the scammers might have kept his details since he is a big fish and were hoping on getting more money from him through this means. Your friend needs to be arm himself with knowledge about bitcoin, this trick wouldn’t work on anyone who understands how bitcoin works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Keyreysek",
      "created_time": "January 22, 2023, 10:49:53 PM",
      "body": "surely it's the same person or the same organization, the victim also hasn't replaced his electronic equipment, also still uses the same account, it's definitely very easy to hack the device, and because it's been hacked originally.maybe the person who got hacked had to replace the electronic device he was using, and replace all the accounts he had.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "January 23, 2023, 06:44:22 AM",
      "body": "It can look like it is real that there is a recovery service that found out that someone has been scammed 2 years ago and want to help him out, but they will ask for money, if he give them money, that is another scam. It will not be good if he is scammed again, making two times of scam. He is into mining, we have mining board he can be posting on this forum and he can see other boards good too. If he is on this forum, he will know more about life and how he can avoid scam. Tell him to join this forum and learn more about crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "January 23, 2023, 07:05:47 AM",
      "body": "It is very possible the same persons who scammed him in 2021 came up with a new strategy to make him believe he can reclaim his lost funds. There is no way a random person who doesn't know about the lost coin will get the information. To know about informations like this it is either they are responsible or they were told. Your friend better run else he/she will lose the 10% if deposited first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "January 23, 2023, 08:36:29 AM",
      "body": "You have done the right thing by telling him it is a Scammer. Logically how can someone know your friend has lost some money in 2021, here I'm starting to think a bunch of Scammers are starting to act as saviors in return for 10% of the lost funds. They also want a draw to be paid first, tactics like this are unbelievable.Tell your friend not to fall in the same mud a second time. The first awkwardness, he knows the case that happened to your friend, and the second is asking for 10% in return to be paid in advance. It's a scammer tactic that is very easy to read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "January 23, 2023, 10:42:01 AM",
      "body": "Quote from: KiaKia on January 22, 2023, 06:26:05 PMI managed to safe a friend ( not very close ) from a scammer today.This friend lost some money to a crypto scam in 2021 and he still feels bad about it because the money is over 10k dollars but someone claimed they can help him to recover the fund, he got so happy and rushed down to my place this afternoon but unfortunately, I broke the news that this person is a scammer..1. The person DM him first.2. Mysteriously he knew he lost some crypto in 2021. 3. He wants 10% of the missing or lost funds deposited first to his wallet. I knew this is a old tactics but with the way this my friend felt after hearing about the possible refund I felt bad telling him that it's all a scam, I am still confused how this person knew he lost some funds in 2021 though, since this person is not ready to tell more about himself there is no way to find out. What do you guys think? I am getting this vibe that maybe the first hack was done by the same person or the same organization? I don't want to start asking questions about his friends and stuff, he is way older than me and we aren't very close, I called him a friend because he live nearby and he is into Bitcoin mining. I guess he has a lot to learn and understand. I can see this scammer strategy is an old tactic, and it may likely to be Same person that scammed  him at first place or the scammer share the information with others scammers because that is what many of them are doing. I know it will be very hard for someone to know you were scammed in so so year if not who get the information. From my views your friend need to learn a lot about cryptocurrency especially in term of scams aspect.so it will be good if you can introduce him to this forum so he can be asking for one of two questions that he don't know and I believe it going to good opportunity of learning to him,and again it can easily get in touch with information here base on new tactics scammers will be trying to use at that particular time. Let your friends know that knowledge is the way forward in cryptocurrency industry, and that is what he need most to keep his coins safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 23, 2023, 10:54:27 AM",
      "body": "You did the right thing, OP, by informing your friend that the person is a scammer. He couldn't help but fall for the scammer when someone offered to help him recover such large sums of money he had previously lost. I used to believe that lost bitcoin could be recovered until I came across a website where people were given testimony of how their funds were recovered by a vendor that offers bitcoin services. Only later did I realize that it was all a scam and they were doing it to lure more people into falling into their hands as their prey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "January 23, 2023, 11:06:10 AM",
      "body": "Quote from: KiaKia on January 22, 2023, 06:26:05 PM1. The person DM him first.2. Mysteriously he knew he lost some crypto in 2021. 3. He wants 10% of the missing or lost funds deposited first to his wallet. These are some of the tricks used by scammers, particularly Telegram scammers; the trick is old, but people continue to fall victim due to a lack of knowledge and exposure to Bitcoin and cryptocurrency.QuoteWhat do you guys think? I am getting this vibe that maybe the first hack was done by the same person or the same organization? I don't want to start asking questions about his friends and stuff, he is way older than me and we aren't very close, I called him a friend because he live nearby and he is into Bitcoin mining. I guess he has a lot to learn and understand. The entire story is perplexing, but who knows if it is the same group of scammers trying their luck again?To avoid future scams, this friend needs to learn the fundamentals of Bitcoin and cryptocurrency in general.If possible, recommend some Bitcoin-related books to him/her or introduce him/her to this forum so that he/she can learn more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "January 23, 2023, 11:32:30 AM",
      "body": "judging from what they asked, it is definitely a scammer. as you have said, it is an old tactic that scammers use to entice desperate people that lost a sizable amount of money. you mentioned that there was hacking involved, just curious, what crypto scam was it? anyway, I think you should also inform your friend about the different crypto scams that are rampant in the crypto industry because judging from his reaction he can be easily convinced by scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "January 23, 2023, 11:55:40 AM",
      "body": "This is definitely one of those crypto scam that occurs through telegram. Although I have never fallen victim of this scam but I have received several messages from some people offering same help. Most times this occurs when you lay a complain in an exchange official telegram group chat, they'll start messaging you claiming that they are part of the exchange team and can help you resolve your issue and at the end they'll start demanding that you give them your login details or send a certain amount to an address for them to completely resolve your issue. Op that was a nice job spotting them quickly and saving your friend from the hands of those lazy ass scammers waiting to ripoff the sweat of others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}