{
  "id": "topic_5420969",
  "title": "2double0",
  "author": "2double0",
  "created_time": "November 14, 2022, 02:37:39 PM",
  "content": "how will it affect anyone's decision to invest in crypto?Proof of ReservesAlso known as Proof of Funds, Proof-of-reserves is a way to allow customers to monitor the balances of an exchange.1This is an important step for the exchanges in order to keep their customers ' and investors' faith alive in crypto. This will make lots of things transparent about many crypto exchanges and will also weed out various bad actors who had been hiding their deeds since long time.What is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?1. Source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420969",
  "comments": [
    {
      "author": "Yatsan",
      "created_time": "November 21, 2022, 12:08:39 PM",
      "body": "This is due to what happened right? I think there's no need for exchangers to show their proof of reserve to their users. What I'm thinking is agreement between exchangers and users that one's negligence has a counterpart;if it is the fault of exchanger, it should pay the losses of the user but if it is user's negligence with regards to his profit loss, exchangers has nothing to do with it. Quite one sided on impression right? but users doesn't need to pay the exchangers unless they would complain of something and if it is proven user negligence, that would be the time they should pay the exchangers. In this case there would be more sense of responsibility with each assets. In terms of land based banks, there's an agreement that no matter what, they should pay atleast half of the users' asset if they'd be on bankruptcy; this is the idea I am trying to point out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 21, 2022, 12:27:12 PM",
      "body": "I think that some (see the so called mistakenly sent money to gate.io) are already trying to fake those \"proofs\".Then, let's say certain service is showing a correct proof for its reserves; do you know how much is the actual worth of user funds deposited there so you can match?Even more, what stops a centralized service use those reserves as collateral for other fund they'll get and use somewhere else, showing proof of reserves that aren't actually their funds any longer?So this proof of reserves is a nice advertising some exchanges want to pull... and not much more.Always think and get the public information with a pinch of salt. All they want is to keep you confident in their system. It doesn't mean that whoever wants cannot trick that. Learn that not your keys is indeed not your coins and be more careful, with or without that proof of reserves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 21, 2022, 12:40:40 PM",
      "body": "I think Vitalik and CZ is working on something right now that focuses on having this protocol, the proof of reserve.News: Binance CEO CZ begins working on Vitalik Buterin’s ‘safe CEX’ ideas          Vitalik Buterin Will Help Binance Prove Its Reserves, CZ SaysIt's a matter of being transparent to their customers. What I like with this is that, the game for exchanges are stepping up and this gives the advantage more with the users to have that push for these exchanges to have that sense of being transparent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "November 21, 2022, 02:21:33 PM",
      "body": "I believe this will slightly impact user trust. and Proof of reserve should have been implemented long ago. But it seems that the FTX tragedy has turned the exchange in a more positive direction. more open and transparent will certainly make users feel a little more secure. and I will also choose an exchange that already uses Proof of reserve on their exchange. But still, an exchange is not a safe place to store assets. we should only use exchange only for exchange and nothing more. after completion, save the assets back in your personal wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "November 21, 2022, 03:34:03 PM",
      "body": "Proof of reserve will make things more transparent but there is also no guarantee that your funds will be safer on those centralized exchanges. POR will tell us the status of the exchange's asset reserves, but it cannot prevent our account from being closed or block withdrawals. This means if an exchange doesn't want to do business anymore but they don't want to pay us, they will also have full right to suspend all withdrawals and then declare bankruptcy. There's nothing we can do about it either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 21, 2022, 04:26:17 PM",
      "body": "Quote from: 2double0 on November 14, 2022, 02:37:39 PMWhat is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?While Proof of Reserve is probably a step forward, I personally don't care about it and won't make me feel trust centralized exchanges and platforms any more than I (dis)trust them now. Big problem with it is that it can be manipulated with, and since it can, it will. Since I am already in crypto and not using centralized exchanges to buy bitcoin, whether it gets introduced or not won't have any impact at me at all, but I do expect that newbies will look at it as a sign that platform is 100% secure, which of course is a huge mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "November 21, 2022, 11:29:39 PM",
      "body": "This is a very old discussion which has its roots in something called fractional reserve banking. For crypto this stems back to the 2017 topic of bitfinex and tether. There was an investigation launched in 2017 to see whether tether had the liquidity to buyback every token they issued at a price of $1 in order to maintain pegging to the dollar. This is essentially identical to a gold standard where a government guarantees every dollar it issues can be redeemed for its value in gold. As financial standards go, there are very high ratings.Modern finance has drifted in the direction of greater risk and greater profits. Which is generally associated with higher credit and liquidity. Low(er) fractional reserves correlates with all of these trends, as does modern inventions such as trickle down economics and modern monetary theory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "November 21, 2022, 11:39:00 PM",
      "body": "Quote from: Yatsan on November 21, 2022, 12:08:39 PMThis is due to what happened right? I think there's no need for exchangers to show their proof of reserve to their users. What I'm thinking is agreement between exchangers and users that one's negligence has a counterpart;if it is the fault of exchanger, it should pay the losses of the user but if it is user's negligence with regards to his profit loss, exchangers has nothing to do with it. Quite one sided on impression right? but users doesn't need to pay the exchangers unless they would complain of something and if it is proven user negligence, that would be the time they should pay the exchangers. In this case there would be more sense of responsibility with each assets. In terms of land based banks, there's an agreement that no matter what, they should pay atleast half of the users' asset if they'd be on bankruptcy; this is the idea I am trying to point out.For sure it is really pertaining on the current issues or situations that we are in when it comes to exchange platform issues and disasters where people been asking out about proof of reserves.Actually we cant really be able to determine even if they do tend to do so.Why? monitoring transactions with those wallet addresses cant really assure about incoming or outgoingbig transactions which it is really hard to point out if its just a simple whale withdrawal or someone whose been part of the team is doing such thing.There's no way on tracing it out.Somewhat having this kind of proof does really give out that kind of transparency which would give out some confidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "November 22, 2022, 08:26:03 AM",
      "body": "Quote from: 2double0 on November 14, 2022, 02:37:39 PMhow will it affect anyone's decision to invest in crypto?Proof of ReservesAlso known as Proof of Funds, Proof-of-reserves is a way to allow customers to monitor the balances of an exchange.1This is an important step for the exchanges in order to keep their customers ' and investors' faith alive in crypto. This will make lots of things transparent about many crypto exchanges and will also weed out various bad actors who had been hiding their deeds since long time.What is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?... Who determines the method for proving that a centralized exchange for example really has reserve?  What is the trustworthiness of the method? There has to be verifications by users/participants to the  smallest details like you have in certain decentralized and transparent systems. It's not right to just trust whatever they tell you without verifications. Only decentralized system like Bitcoin allows transparent and thorough verification hence its a far better system to prove things.Don't tell me \"Trust Me\" while you are not transparent enough for probing nor allow people to question your method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 22, 2022, 09:38:42 AM",
      "body": "Quote from: 2double0 on November 14, 2022, 02:37:39 PMWhat is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?I like bitcoin and crypto in general before their so called proof of reserve, and I will like them after. Before FTX, we have seen many disappointments in the past, but we do not just experienced it. Why? Because it is not good to leave fund on an exchange. People should know that they do not have the private key, they do not have the control, it is not their coins on blockchain. With proof of reserve, you still do not have full control over your coins on exchanges, it can be seized, your account can be blocked, you may need money when withdraw option is disabled. What can perfectly solve this is not to trust your coins with anyone, use a noncustodial wallet.Do not believe that proof of reserve can not be manipulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 22, 2022, 10:32:02 AM",
      "body": "Quote from: 2double0 on November 14, 2022, 02:37:39 PMhow will it affect anyone's decision to invest in crypto?Proof of ReservesAlso known as Proof of Funds, Proof-of-reserves is a way to allow customers to monitor the balances of an exchange.1This is an important step for the exchanges in order to keep their customers ' and investors' faith alive in crypto. This will make lots of things transparent about many crypto exchanges and will also weed out various bad actors who had been hiding their deeds since long time.What is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?1. SourceI like to enjoy the complete transparency as well but look these things from the Exchange's point of view, don't you think this will make them more vulnerable to hack attacks?So I tend to disagree with the idea, and if you feel that exchange is not trusted then just move to new one ar atleast we need to use the decentralized exchanges now because we don't need to trust anyone out there, just our money and our responsibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 22, 2022, 11:54:04 AM",
      "body": "Having a proof of reserve means nothing, because at the end of the day, the crypto exchange owner could still run away with all the \"reserves\" held by the crypto exchange and claim that the crypto exchange platform was \"hacked\" (which is the classical exit scam).The concept of \"proof of reserve\" would mean anything, if the crypto exchanges hold their reserves in a trusted third party, which is accountable for keeping those reserves safe. Just like all the banks have reserves in the central bank. This concept also isn't 100% safe, but there's no 100% safety in real life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "November 22, 2022, 04:43:31 PM",
      "body": "Quote from: Wapfika on November 22, 2022, 10:38:37 AMProof of Reserves is still bullshit if the company who will do the audit is a private company that can be paid. People can only trust this audit if they will prove ownership on chain such as signed message on the address containing the tokens. The whole idea is that it doesn't rely on a private company.  But what people need to understand is that reserves are only half of the picture.  I don't trust this at all.  It feels like a deflection.  NeuroticFish's post raises the most salient points.  It's not enough to know a service has funds, it's about what they're doing with those funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "November 22, 2022, 06:48:46 PM",
      "body": "Quote from: 2double0 on November 14, 2022, 02:37:39 PMhow will it affect anyone's decision to invest in crypto?Proof of ReservesAlso known as Proof of Funds, Proof-of-reserves is a way to allow customers to monitor the balances of an exchange.1This is an important step for the exchanges in order to keep their customers ' and investors' faith alive in crypto. This will make lots of things transparent about many crypto exchanges and will also weed out various bad actors who had been hiding their deeds since long time.What is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?1. SourceI think the exchanges are desperate to keep their clients during such turbulent time during which people are becoming less and less trusting of centralized exchanges. So obviously, nobody will really trust in this new \"proof of reserves\" marketing PR coming from the exchanges. If they want to screw people over, they will. And it does not matter how much good-will PR they post on their social medias. Its time to step away from CEXes and just let them die. They undermine everything crypto (and especially Bitcoin) stands for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 22, 2022, 07:53:54 PM",
      "body": "Quote from: 2double0 on November 14, 2022, 02:37:39 PMProof of ReservesAlso known as Proof of Funds, Proof-of-reserves is a way to allow customers to monitor the balances of an exchange.1Why do i need to monitor a crypto exchange proof of funds, am i their rented auditor? Do you think they cannot falsify it in your mind? I can only advise someone to engage a thorough research or rather avoid any exchange or centralized institutions from having dealings with them.Quote from: 2double0 on November 14, 2022, 02:37:39 PMWhat is your take on this as an investor in crypto?Will it add any impact on your decision to get into crypto or stay away from it?I cannot rely on the level of the research I've conducted to engage my entire trust on crypto exchanges knowing how they have been a source of bankruptcy to many investors and how insecure they are in security and privacy, they will always hype thier data to entice you to invest it you're greedy enough, but if you can't risk yourself with them better option is to avoid deals with them, considering the numbers of shitcoins out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 23, 2022, 02:38:31 PM",
      "body": "https://coinmarketcap.com/rankings/exchanges/coinmarketcap has already added the ability to view exchange reserves. Near the name of the exchange there is an icon, after clicking on which you will see full information about the reserves of the exchange.I don't have full statistics yet, but most of the losses I think will be from exchange and fund bankruptcy and not hacking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 23, 2022, 02:57:32 PM",
      "body": "Quote from: NeuroticFish on November 21, 2022, 12:27:12 PMSo this proof of reserves is a nice advertising some exchanges want to pull... and not much more.Quote from: Rikafip on November 21, 2022, 04:26:17 PMWhile Proof of Reserve is probably a step forward, I personally don't care about it and won't make me feel trust centralized exchanges and platforms any more than I (dis)trust them now. Big problem with it is that it can be manipulated with, and since it can, it will. I have nothing much more to add to your statements, because it would be rather naive to believe that such things can change something, at least not to such an extent that it would prevent some new genius from doing the same thing that Bankman or Cotten did. Every hole they patch opens a new one through which some manipulation can be carried out again, and the only measure that would be effective is for people to understand that crypto exchanges are not banks and not to use them in that way. If you are not in sole possession of your private keys, you have nothing but empty promises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "November 23, 2022, 04:52:52 PM",
      "body": "Quote from: Lucius on November 23, 2022, 02:57:32 PMthe only measure that would be effective is for people to understand that crypto exchanges are not banks and not to use them in that way. If you are not in sole possession of your private keys, you have nothing but empty promises.Indeed.  Not worth the paper it isn't even written on.  It's as though they're trying to appropriate and pervert the mantra \"Don't Trust, Verify\", by claiming that you'll be able to verify they have funds.  But it's just an obfuscation.  If an exchange were to sign a message or provide some other cryptographic proof that they hold 1000 BTC, someone might interpret that as \"proof of reserves\" and imagine it's safe.  But then imagine that particular exchange happens to be in debt to the tune of 4000 BTC.  All of a sudden, people might realise only possessing 1000 BTC still means it would be incredibly dangerous to deposit funds with them.  They clearly aren't solvent.But the thing is, you'll never get to know if these so-called companies are solvent or not because they'll never get customers to deposit funds if they were up-front and honest about that.  You won't find out until it's too late and you've lost your BTC forever.  Maybe the new mantra should be \"Don't trust, because you can't verify anything when it comes to strangers on the internet\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "November 23, 2022, 05:05:29 PM",
      "body": "Let me get this right, so Satoshi came in with great vision of making decentralised model of financial system. He invented blockchain, implemented all the bitcoin protocols and started proof of work as its working model. Everyone was happy, as everyone could see the transactions over block explorer and get public confirmations. Then most stupidest peeps jump into the market they create extra layer of exchangers to expose the whole meaning of PoW and anonymous nature by exposing us to the KYC processes. This too without any proof of their funds!So then again the most stupidest peeps come together and form another layer to be implemented so that they can make the centralised working “decentralised” by showing their funds to us. Wow, you got me. Why don’t we just follow Satoshi in the first place?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}