{
  "id": "topic_5466345",
  "title": "BABY SHOES",
  "author": "BABY SHOES",
  "created_time": "September 10, 2023, 08:22:27 PM",
  "content": "A few days ago I did a little research with Bounty SpotPlus which is managed by BountyDetective.It offers trading features with AI or something similar. But what concerns me is the testimony with three members who are already common on the internet, maybe that person is a model, I made a little search effort on Google images and Yandex, the photo is already on several other sites.Can this be said to be that they will deceive investors with the testimony they display?Code:https://spotplus.com/Bounty link here: https://bitcointalk.org/index.php?topic=5465973.0Testimonial name of Mr.Rupan Oberoi SpotplusThe person has different names on the InternetThe source I found on Yandex with image search: hereAva Getty - I don't know his real name on the Internet can't find itBut there are quite a lot of these photos on the InternetYandex with image search: HereRanu Mondal - Fake nameYandex with image search: HereWhat caught my attention was that the three SpotPlus testimonial photos were on another website with a different name and also provided convincing reviews.  I'm convinced that it's a fake review too: source on this site https://nuryazilim.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466345",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "September 10, 2023, 09:15:22 PM",
      "body": "Quote from: BABY SHOES on September 10, 2023, 08:22:27 PMBut what concerns me is the testimony with three members who are already common on the internet, maybe that person is a model, I made a little search effort on Google images and Yandex, the photo is already on several other sites.Can this be said to be that they will deceive investors with the testimony they display?\"AI\" based trading platform with no doxxed team members and with fake testimonials using stock photos conducting a sale, while giving large amount of tokens to bounty hunters. What could possibly go wrong here?   Regarding Bounty Detective team, they already have history of dodgy bounty campaigns so this one fits perfectly in their M.O.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 10, 2023, 10:20:16 PM",
      "body": "Unfortunately thousands of similar projects like this one are being created every day, everything is easy all they need is some money to invest creating the up front template of their website, a fake roadmap to attract people, creating a token with large amount of supply in BSC or Ethereum, applying the smart contracts for presale. They start their own ICO and do some marketing for it and a lot of people still falling into their trap and buy their tokens that has no value at all or do anything good to them.What’s more concerning here is the awareness since people still fall for the same scam every day and thousands of people get scammed due to similar project that’s a problem and someone should do something about it, why we still seeing such scam here in Bitcointalk and people lose their money and hope in crypto which is a very hurtful thing for the market.More the less",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 10, 2023, 10:32:19 PMLast edit: September 10, 2023, 10:59:31 PM by Bitcoin_Arena",
      "body": "This AI trading bot madness has to stop. It's now getting too obvious and boring  The app was released on 29th May 2022, it has just slightly over 100 downloads, but one of the reviewers claims that it has more than 1 million traders. Speaking of fake reviews, check out their 31 reviews on Google play. Fake is an understatement!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 10, 2023, 10:46:05 PM",
      "body": "BountyDetective failed to investigate the legitimacy of this project he doesn't deserve the name bounty detective.It's obvious based on his trust rating that he just accepts campaigns and doesn't care if it is a fake project or not, bounty hunters should avoid this bounty manager if they want to promote a good project that will reward them better check the reputation of the bounty manager that they are working with by checking its trust page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "September 11, 2023, 12:07:39 AM",
      "body": "Nice find there!I guess it has become a norm for these projects that has a hidden team behind to use photos grabbed from the internet. But the good thing with the technology today, any type of photo that's been used can now be detected by Google or any service as long as it's been uploaded to the web.Let us just call these people scammers as that's the intention they're about to do for having these projects being made by them. Despite this feature is there and the world seems to becoming smaller to them, they'll never stop.And with all of these reviews, I think that whenever you read one and the same testimonials as those. You already have an idea that they're fake, paid and unreal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "September 11, 2023, 03:09:19 AM",
      "body": "Nice catch OP, I wonder that this fake android app is available in Playstore. I reported it to Playstore team. Thw project is just to raising the fund through bounty promotion and I don't think they have any Idea for working long term. They uses currently AI trend for attraction of investors. If we checkout their website then they have Token Sales event active. by clicking on sales, telegram bot open and all their sales are going through this way. Bounty detective should stop the bounty otherwise it can leads to some serious lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "September 11, 2023, 10:23:35 AM",
      "body": "The irony of having the username \"BountyDetective\", looking at his trust profile I guess his \"detective skills\" are probably only limited to bounty cheaters. nice find by the way, I've seen a lot of scam projects being posted on this board where the scammers use stock images on the internet. Quote from: Gladitorcomeback on September 11, 2023, 03:09:19 AMBounty detective should stop the bounty otherwise it can leads to some serious lost.-snipI'm afraid he won't do it, reading through his trust profile, it looks like this is not the first time he has managed a bounty campaign for a shady project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 11, 2023, 10:37:03 AM",
      "body": "Quote from: acroman08 on September 11, 2023, 10:23:35 AMI'm afraid he won't do it, reading through his trust profile, it looks like this is not the first time he has managed a bounty campaign for a shady project.It will add more negative feedback if he fails to stop the campaign If only all bounty managers do research and stop when the project is exposed we would limit dubious projects and no investors would lose money, Bouny manager @Bounty detective has been on this for many years he is an experienced bounty manager.He should know how to investigate what to look at and how to look at a project.We have a lot of scams already in the altcoin section even projects that look legit are having a hard time raising funds because investors are losing trust in projects that launch crowdfunding, We'll see in the coming days if he takes heed and stops the campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 11, 2023, 01:09:57 PM",
      "body": "People will not stop submitting applications, even if the Bounty is fraudulent, as long as there is a chance to make one dollar. Therefore, such fraudsters do not make an effort to fake their lies, but rather move directly to creating more projects in the hope that one of them succeeds. Therefore, any negative indicator is enough to consider the project fraudulent. Whether it is plagiarism, falsifying pictures of the campaign team, or false promises of quick profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "September 11, 2023, 01:14:07 PM",
      "body": "Quote from: Bitcoin_Arena on September 10, 2023, 10:32:19 PMThis AI trading bot madness has to stop. It's now getting too obvious and boring  The app was released on 29th May 2022, it has just slightly over 100 downloads, but one of the reviewers claims that it has more than 1 million traders. Speaking of fake reviews, check out their 31 reviews on Google play. Fake is an understatement!It's probably a test run for something bigger, I don't know if any people do it but some young or script kiddies are probably practicing their programming skills, although given how this websites up for a long time now, I think it's more than just that although looking at it that way makes me think that it's a pathetic scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "September 11, 2023, 03:09:09 PM",
      "body": "Quote from: Yamane_Keto on September 11, 2023, 01:09:57 PMPeople will not stop submitting applications, even if the Bounty is fraudulent, as long as there is a chance to make one dollar. Therefore, such fraudsters do not make an effort to fake their lies, but rather move directly to creating more projects in the hope that one of them succeeds. Therefore, any negative indicator is enough to consider the project fraudulent. Whether it is plagiarism, falsifying pictures of the campaign team, or false promises of quick profits.That's true Bounty campaigns now is a number game, these bounty hunters do not check or research the projects that they are going to join, They don't care if it's an obvious scam they are just hoping that the project will reward them and get in the market and trade them even if its worth pennies, just look at these bounty hunters some of them are still newbies for many years with hundreds or thousands of posts without a single merit.They work like a bot and they automate their posts for them it's just a waste of time doing research if the project they are promoting has potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "September 11, 2023, 07:34:09 PM",
      "body": "Now that review is no longer there, just checked it maybe they realized how worried they were about this arrest. LOLThey won't bother, of course relying on AI intelligence with the features they display, this is clearly boring to look at because it involves too much AI for the sake of the project they are running and getting money from. By the reviews from one of them, it's clear this is a fake. Ah, it's all fake",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 11, 2023, 08:12:12 PM",
      "body": "It's funny that @BountyDetective continues to advertise or run a bounty program for this fake project. I have been trying to give him a chance to redeem himself just like a responsible campaign manager would do like apologizing, pausing the bounty and locking the thread, but it looks like the greed for money has overpowered his reasoning. Maybe he doesn't care about the negative feedback. I may not have tagged him right now, but I can't promise the same may remain in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "September 11, 2023, 09:12:53 PM",
      "body": "Quote from: ajiz138 on September 11, 2023, 07:34:09 PMNow that review is no longer there, just checked it maybe they realized how worried they were about this arrest. LOLThey won't bother, of course relying on AI intelligence with the features they display, this is clearly boring to look at because it involves too much AI for the sake of the project they are running and getting money from. By the reviews from one of them, it's clear this is a fake. Ah, it's all fakeThey deleted these fake reviews in order to erase the evidence of this accusation. Still, they forgot that their platform was archived here > ARCHIVED , This is a red flag that now indicates that this project team is dishonest. Their project currency has no use cases, and there is no point in buying or receiving it through the currently active bounty campaign, so I hope bounty hunters can see this topic and stop promoting this nonsense.Quote from: ajiz138 on September 11, 2023, 07:34:09 PMThey won't bother, of course relying on AI intelligence with the features they display, this is clearly boring to look at because it involves too much AI for the sake of the project they are running and getting money from. By the reviews from one of them, it's clear this is a fake. Ah, it's all fakeIt's really funny; they know the power of artificial intelligence and provide its services in trading, but they do not have the experience and ability to use it for other things, and instead, they put fake reviews.Source: https://docs.spotplus.com/useful-links/privacy-policyThey do not sell, rent, or trade their customers' personal information, blah blah, but they do use & share personal information and photos of well-known people on search engines and post fake positive feedbacks for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternal Truth",
      "created_time": "September 16, 2023, 06:33:49 AM",
      "body": "As BountyDetective is a good quality manager, they should have handled this campaign with special review.They should not have run such a fake and scam project. They did bounty running with only themselves in mind, they may never have thought of bounty hunters while launching this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 16, 2023, 07:14:35 AM",
      "body": "Quote from: Bitcoin_Arena on September 10, 2023, 10:32:19 PMThe app was released on 29th May 2022, it has just slightly over 100 downloads, but one of the reviewers claims that it has more than 1 million traders. Speaking of fake reviews, check out their 31 reviews on Google play. Fake is an understatement!And nobody has tried this?Seems....interesting:QuoteStep 3: Account ActivationSign in to your Spotplus account using your registered email and password.Go to your profile section and navigate to the \"Assets\" tab.Deposit $80 as a 1-year subscription fee to activate your trading account.Additionally, deposit an amount of USDT to cover the trading fee, which is 10% of your total profit per trade.So, a double scam with both the app and the token?Quote from: Eternal Truth on September 16, 2023, 06:33:49 AMAs BountyDetective is a good quality manager, And how do you know that, my dear newbie who just signed up on Bitcointalk?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}