{
  "id": "topic_5431599",
  "title": "wilkine",
  "author": "wilkine",
  "created_time": "December 26, 2022, 04:02:03 AM",
  "content": "What is Gearbox?Gearbox defines itself as a Generalized Leverage Protocol, which means that users can use Gearbox to take leverage and use it in other DeFi protocols. Protocols supported by Gearbox include Uniswap, Curve, Convex, Lido Finance, Yearn, etc.For easier understanding, let's put it another way. We can also think of Gearbox as a lending protocol like AAVE. While the difference is that the funds lent by the user on AAVE go straight to the user's wallet, whereas on Gearbox the funds lent by the user go to a specific credit account, where they can only be traded or used but not withdrawable. The funds that the user can lend are generally several times more than the user's initial fund, thus leveraging is achieved.When DeFi was hot last year, there were similar projects in the market, such as Alpha Finance (now renamed Alpha Venture DAO). At that time, Alpha Finance's main feature was leverage mining and it integrated all the supported pools in advance. Protocols that integrated into Alpha Finance were chosen by Alpha's team instead of the community.For users who wanted to go liquidity mining or yield farming, they only needed to choose a leverage multiplier or how much money they wanted to borrow. Gearbox, on the other hand, separated out the leverage feature and did not specify what users could do after leverage, but secures the borrowed fund in a credit account. Users are free to manage their credit accounts and the risk is limited to the credit accounts only.What is TokenInsight's Rating For Gearbox?TokenInsight has rated Gearbox's current performance with a B and a positive outlook. In addition, the distributions of TokenInsight's ratings are shown in the chart below. Similar projects with a B rating to Gearbox include Olympus, Synapse, ApolloX, and others.The breakdown of the rating results is scored as follows.Underlying Technology & Security 66.75%Roadmap & Progress 68.67%Token Economics 66.6%Ecosystem Development 47.8%Token Performance 12.87%Team, Partners & Investors 31.33%Underlying Technology & Security (66.75%)The first version of Gearbox was launched in August 2021, followed by a v2 release in October 2022. As of December 2022, Gearbox Protocol has not suffered from any crisis such as malicious attacks. As Gearbox has deployed over 200 smart contracts, Gearbox has conducted code audits for each new version of code added. According to official disclosures, as of December 2022, Gearbox has conducted 8 rounds of code audits with third-party audit reports. Most of the problems which were found have been resolved.Source: Gearbox DocAt the same time, Gearbox opened a bug bounty program in February 2022 to help development teams identify and fix possible security vulnerabilities in smart contracts in a more timely manner. The Gearbox team also makes its developed smart contract codebase publicly available on GitHub, but overall code updates and access activity are infrequent. The main codebase has a single-digit collection and fork count.Roadmap & Progress (68.67%)Gearbox launched its v2 version followed by a secondary market launch of its native token, $GEAR, in December. According to the publicly available roadmap, Gearbox is currently working on a DAO, with no plans for 2023 disclosed at this time.Token Economics (66.6%)$GEAR is the native token of Gearbox and is currently used primarily for decentralized governance, with other features reportedly planned but not publicly available at this time.The total supply of $GEAR is $10 billion, with the following distribution plan.Distribution Plan of $GEAR. Source: Gearbox token detail page on TokenInsightAccording to the $GEAR distribution plan, over 40% of the total supply will be allocated to initial developers and the founding company, which is relatively centralized. These tokens will also be locked for 1 year after the TGE and then vesting linearly for the next 18 months. Considering the TGE of $GEAR is on December 15, 2021, the share allocated to initial developers and the founding company has already started vesting and the full unlocking period is relatively short. Funding History of Gearbox Protocol. Source: Gearbox token detail page on TokenInsightThe share of investors is relatively small, totaling less than 4% of the total supply.Gearbox has raised a total of 3 rounds of funding.Summer 2021, raised $2.3M from Variant Fund, 1kx, Lido Finance and othersAugust 2022, raised $4.15 million at a $150 million FDV with Placeholder, Zee Prime, LedgerPrime, Polymorphic, and GCRRaised $1.585 million in September 2022 at an FDV of $150 millionShares allocated to investors will be locked until July 2023 and unlocked linearly over the next 1 year.Ecosystem Development (47.8%)After Gearbox v2 went live (October 2022), its TVL exploded. TVL of Gearbox peaked on November 5 at approximately $130 million. Although its TVL decreased in mid-November due to the impact of FTX bankruptcy, it recovered to the same level in mid-December as in early November.Source: Gearbox Dune Analytics DashboardAs of December 22, 1,193 credits have been created and 199 credits are active.Gearbox has official accounts and communities on Twitter, Discord, and Medium, with more than 46,000 Twitter followers.Token Performance (12.87%)$GEAR conducted a public sale on Curve Finance from December 13 to 23 and opened for trading afterward. As of December 23rd, $GEAR was live on OKX, Uniswap, MEXC, XT.COM, Huobi, and Bilaxy. Trading volume exceeded $3 million within 4 hours of going live on the secondary market, representing approximately 20% of the circulating market value.Historical Price Chart of $GEAR. Source: TokenInsightIn terms of price, the price fluctuated a lot after going live on Uniswap and some centralized exchanges. The price fluctuated between $0.021 and $0.027 within 4h of going live, reflecting an FDV market cap of around $210-270 million.Closing ThoughtsGearbox, the first on-chain generalized leverage protocol, has built up a certain user base with its first-mover advantage. With the launch of its v2, more supported protocols have brought more users to Gearbox, making Gearbox's TVL exceed $100 million in a short period of time and becoming the 26th-ranked protocol in terms of TVL on Ethereum. To protect users' funds, Gearbox also makes all code audited as much as possible and has set up a bug bounty program. However, according to its public information, $GEAR is currently only used for decentralized governance, and the distribution plan is relatively centralized and has a relatively shorter period for full vesting. In addition, since its tokens have just been traded on the secondary market, liquidity and price performance are unstable, and it will take some time to reflect its true performance. Based on the above information, TokenInsight gives a rating of B to Gearbox Protocol with a positive outlook.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431599",
  "comments": []
}