{
  "id": "topic_5407581",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "July 25, 2022, 01:34:54 PM",
  "content": "O casi todo, dado que llenar el depósito inicial con gasolina se hizo utilizando fiat…El caso trata de un costarricense que decidió irse de vacaciones a una de las partes más turísticas del país, con la intención de sólo utilizar bitcoin/ln, visitando diversas localidades (Uvita, Dominical y Ojochal), y pagando por los productos y servicios que precisase de esta manera (Pizza, helados, queso, lociones, Kombucha, etc.).Estamos hablando de un fin de semana tan solo, pero uno se pregunta si lo podría hacer en alguna parte de su propio país, entendiendo que no tendría la libertad de elegir, sino de adaptarse a los productos y servicios que acepasen bitcoin.  Ver: https://www.diariobitcoin.com/la-vida-bitcoin/bitcoiner-se-va-de-vacaciones-a-costa-rica-y-todo-lo-paga-con-btc/https://twitter.com/E_moonwatcher/status/1548845371396349953",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407581",
  "comments": [
    {
      "author": "Porfirii",
      "created_time": "July 25, 2022, 03:57:30 PM",
      "body": "Y yo que pensaba que te nos habías ido de vacaciones...  Estas noticias espero que cada vez sean más comunes. Podíamos ir posteando aquí las que nos vayamos encontrando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 25, 2022, 07:27:41 PM",
      "body": "Sí (pero no a lo primero), mi idea era que poco a poco, pudiésemos ver si es factible hacer algo así en distintas latitudes, aunque sea durante un fin de semana, pagando todo con bitcoin (y sin KYC). Entiedo que en todo esto, probablemente el punto más complicado podría ser el de encontrar un alojamiento en la ruta que aceptase BTC y no pida KYC. Es España creo que no es factible que se cumplan ambas condiciones simultáneamente, dado que es obligatorio pedir el DNI/pasaporte. En este caso, habría que aprovechar el anuncio de algún particular que alquilase la vivienda de manera opaca, y que aceptase BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LUCKMCFLY",
      "created_time": "July 25, 2022, 09:32:03 PM",
      "body": "Bueno sería ideal que todos los países tuvieran la opción de agar todo en BTC, Costa Rica no sabía que tenían como procesador de pago BTC, y con LN, aquí en el foro no hay nadie de Costa Rica? es impresionante, por lo que veo Costa Rica su gobierno invierte todo el dinero en sus recursos naturales en su protección y manutención, si tienen una guerra no tienen como defenderse porque nunca han comprado armas o algo similar para la defensa, la política de ese país me gusta mucho y según una vecina que fué para allá me dioce que las cosas no son nada baratas, tal vez por eso el que tenga Bitcoin es como un rey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 26, 2022, 12:41:02 AM",
      "body": "Qué desilusión, por un momento pensé que esto se trataba de nada más ni nada menos que el inicio de tu diario de viaje por Centro América (posiblemente luego de un jackpot). Pero de todas formas, como siempre se agradecen los artículos. Ahora bien, quisiera aprovechar este hilo para lanzar una de mis preguntas al aire.Todos estamos conscientes de lo difícil que puede ser para una persona el encontrar un proveedor o comerciante que ofrezca sus productos o servicios por Bitcoin u otras criptomonedas, pero cuando se consigue y la transacción se lleva a cabo, uno está en derecho de decir que pago con Bitcoin.Mi pregunta es, ¿ustedes creen que también cuente como \"pagar con Bitcoin\" usar servicios como Bitrefill o Coinsbee?Estos venden saldo o tarjetas de regalo por Bitcoin para servicios como Uber Eats, Starbucks, Dominos pizza, Steam, etc.¿Qué creen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 26, 2022, 02:18:18 AM",
      "body": "Quote from: Porfirii on July 25, 2022, 03:57:30 PMY yo que pensaba que te nos habías ido de vacaciones...  ...//...:::No se diga màs en esa misma idea. Clic bait puro Sr. Ddmrx2  Quote from: Porfirii on July 25, 2022, 03:57:30 PM...//....:,,Estas noticias espero que cada vez sean más comunes. Podíamos ir posteando aquí las que nos vayamos encontrando.Por la regiòn estamos en varias lugares en lo que se denomina segùn las agencias cuando uno pide descuento, y te dicen; mmhh!, nada \"temporada alta\"......asì que en esa linea de; fin de semana de, en lo que se pueda mencionar algo pagado con bitcoin la historia cae aquì, digo espero que estas noticias sean màs comunes entre los usuarios de LE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "July 26, 2022, 05:32:11 AM",
      "body": "Quote from: DdmrDdmr on July 25, 2022, 07:27:41 PMEs España creo que no es factible que se cumplan ambas condiciones simultáneamente, dado que es obligatorio pedir el DNI/pasaporte.Pero una cosa es que te pidan documentación porque es obligatorio para darte las llaves de una habitación, y otra cosa es que te la pidan para hacer el pago.Si yo voy a un hotel y pago en efectivo, el hotel sabrá que dormí allí.Si yo voy a un hotel y pago con mastercard, el hotel, el banco emisor de la tarjeta y mastercard sabrán que dormí allí. Bola extra si ese lugar no es donde vivo, porque además el banco sabrá que no dormí en mi ciudad de residencia.No es lo mismo Quote from: Hispo on July 26, 2022, 12:41:02 AMMi pregunta es, ¿ustedes creen que también cuente como \"pagar con Bitcoin\" usar servicios como Bitrefill o Coinsbee?No.Del mismo modo que no decimos \"pagué con euros\" sino que decimos \"pagué en efectivo\" o \"pagué con tarjeta\", creo que tampoco deberíamos decir \"pagué con bitcoin\" sino \"pagué on chain\", \"con lightning network\" o \"con bitrefill\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 26, 2022, 12:43:57 PM",
      "body": "Quote from: Hispo on July 26, 2022, 12:41:02 AM<…>Bajo el punto de vista de lo que he usado para realizar el pago, si todo elemento directo o indirecto lo he pagado con bitcoin, a pesar de no ser una experiencia purista, mentalmente lo consideraría pagado con bitcoin. Otra cosa es si el proveedor del producto/servicio ha recibido el pago en BTCs de manera directa o no, y siendo más puristas, buscaríamos que ambos extremos de la transacción comercial fuesen en BTC. Le doy más peso a la parte del emisor del pago, y si este sólo ha usado bitcoins, me conformo. Aquí lógicamente vamos a discrepar unos cuantos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 26, 2022, 06:17:16 PM",
      "body": "Quote from: womanderful on July 26, 2022, 05:32:11 AMNo.Del mismo modo que no decimos \"pagué con euros\" sino que decimos \"pagué en efectivo\" o \"pagué con tarjeta\", creo que tampoco deberíamos decir \"pagué con bitcoin\" sino \"pagué on chain\", \"con lightning network\" o \"con bitrefill\".Teniendo esa consideración en mente entonces se podría decir que nunca he comprado nada on-chain...  Quote from: DdmrDdmr on July 26, 2022, 12:43:57 PMQuote from: Hispo on July 26, 2022, 12:41:02 AM<…>...Aquí lógicamente vamos a discrepar unos cuantos.No lo dudo, de todas formas se agradecen los puntos de vista compartidos. Solo nos queda esperar a que Satoshi se tome unas vacaciones de sus vacaciones para que no resuelva esta duda de una vez por todas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 02, 2022, 03:38:02 PM",
      "body": "Si alguien se anima, la próxima parada está en el llamado bitcoin valley de Honduras donde 60 comercios de la población de Santa Lucia aceptarán bitcoin en breve, con el apoyo del Exchange Coincaex, Blockchain Honduras y la Universidad Tecnológica de Honduras, los cuales proporcionan formación y la infraestructura necesaria.Realmente es una iniciativa un tanto artificial, donde el negocio utilizará unos puntos de venta que les facultará cobrar en BTC pero recibir el pago en Lempiras. Lo interesante será revisitar el proyecto dentro de un año y ver qué ha sucedido y si subsiste la iniciativa. Mientras tanto, quien esté por la zona, podrá hacer una escapadita a la población de 15k habitantes.Por si acaso, el Banco Central de Honduras ya ha dicho la suya en este comunicado:https://twitter.com/BancoCentral_HN/status/1553173055207251970",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "August 12, 2022, 08:48:38 AM",
      "body": "Bueno, mientras solo diga eso... en línea con otros comunicados históricos de distintos bancos centrales. Creo que a nadie se le escapa lo volátiles que son los mercados de criptomonedas, y que su compra tiene casi más naturaleza de apuesta que de inversión (así concibo holdear, a medio camino precisamente entre un ahorro, inversión y apuesta).Mientras adviertan de los peligros (nunca dicen nada de las oportunidades) pero le dejen a la gente hacer lo que considere oportuno, por mí parte fenomenal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}