{
  "id": "topic_5520616",
  "title": "fatcat1986",
  "author": "fatcat1986",
  "created_time": "November 25, 2024, 05:47:21 PM",
  "content": "Hi,I friend of mine bought recently some BTC from ATMs in Switzerland.Because Switzerland has a limit of 1000 CHF per month without KYC on ATMs,he bought 10 times 1000 each, with fake phone number.He wasn't money laundering, just using his own legal money for HODL, while he didn't want to do KYC.Now he is wondering whether he might get problems cashing out in the future.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5520616",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "November 25, 2024, 05:51:38 PM",
      "body": "Cashing out from where? those same ATMs? an exchange? I can't imagine an exchange blocking his addresses because of this if that's what you're asking. Now I don't know how strict are the laws in Switzerland but I cannot imagine that this is something he could keep on doing especially when the ATMs are equipped with cameras.If he wants to avoid KYC, there are other ways to do it: BISQ is one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 25, 2024, 05:52:02 PM",
      "body": "I don't know the rules in Switzerland for how it is on bitcoin, but one disadvantage of buying from a bitcoin ATM is that the buying price is always higher than what bitcoin is being sold on the open market; he might have spent about 1-10% more compared to what he could have spent buying from an exchange.For selling, he can always use an exchange if he has passed their KYC or sell to a secured party, so he won't have to worry about regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fatcat1986",
      "created_time": "November 25, 2024, 05:57:01 PMLast edit: November 26, 2024, 01:04:05 PM by hilariousandco",
      "body": "Can he get suspected of money laundering if he is cashing out multiply small amounts,or encounter any other problems, that's the question.If he has hold the coins for a certain time, won't he be suspicious? By the way, are anonymous coins without KYC of any advantage,worth paying 10% ATM fee?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 25, 2024, 06:37:03 PM",
      "body": "There are a couple of few questions he'll need to answer for himself to be sure about it. Firstly I don't know much about crypto regulations in Switzerland however from my speculation, since they have legit bitcoin ATMs there then obviously crypto shouldn't be illegal over there. Some of the things he should consider is if he's spending illegal funds or if his address was white listed for any crime or something. However based on your explanations so far I don't think so. The only things I suggest is that he makes sure his seed is safe and if he intends hodling, keep his coins off exchanges and make use of a cold storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "November 25, 2024, 06:43:15 PM",
      "body": "On a side note, your friend needs to discover PeachBitcoin app: PeachBitcoin.com | P2P Bitcoin Exchange 🍑 #kycfreeSame regulation (Switzerland) as the ATM he's using, so no KYC up to 1000CHF per day, less fees, P2P and with an integrated escrow system. Or he could use Bisq. Both are great solutions when it comes to buy/sell BTC without headache.When there's no KYC, there's no problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "November 25, 2024, 07:27:05 PM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 06:04:20 PMBy the way, are anonymous coins without KYC of any advantage,You mean privacy coins? most of them gets delisted when government pressures the exchanges that have it.Quote from: fatcat1986 on November 25, 2024, 06:04:20 PMworth paying 10% ATM fee?Nah. But for experience, yes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "November 25, 2024, 07:36:53 PM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 05:47:21 PMHe wasn't money laundering, just using his own legal money for HODL, while he didn't want to do KYC.I'm no sure if you're asking why he would want to not submit kyc. The major reason why it's not advisable is that you would the have copies of your personal document out there that can be leaked or hacked, putting your identity at risk. Privacy is something anyone would desire, especially when dealing with a cryptocurrency.Quote from: fatcat1986 on November 25, 2024, 05:47:21 PMNow he is wondering whether he might get problems cashing out in the future. He should not expect any problems based on the fact that the coins where purchased without kyc. He also has options to cash out without kyc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "November 25, 2024, 07:42:10 PM",
      "body": "The question regarding being flagged by his bank is complicated to answer since the mechanisms that are put into place to classify the bank movements as suspicious are not well known. I do reckon, however, that if he continues to make daily withdraws of 10 000 CHF, this will escalate pretty quickly. As OmegaStarScream mentioned, most ATM's have cameras directly pointed at them  (and some even have cameras inbuilt) so he'll always leave a loose end that may come back to bite him.I would highly recommend both applications/service mentioned already : Either Peach Bitcoin[1] or Bisq[2] would suit your friends purpose. Peach Bitcoin has the advantage of having a really simple interface and allows a variety of payments that can be used in Sweden[3]. [1]https://peachbitcoin.com/[2]https://bisq.network/[3]https://peachbitcoin.com/faq/Buy-&-Sell-Bitcoin-using-chf-in-2024/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptohygenic",
      "created_time": "November 25, 2024, 10:11:51 PM",
      "body": "I am not in Switzerland but could understand your expression.See let me tell you, there is no going to be an expert to guarantee you on this fact because what your friend has done is cheating and if being caught, he will face the consequences for violating the regulation of bitcoin in your place.The governments would have an intense of monitoring peoples holding in there and could possibly have users on track through the bitcoin blockchain since you buys bitcoin at the regulatory sector as the ATM.So the technicality is that they would analysis your total holding values in reference to the expected 1000 CHF as maximum monthly purchase and then determines what value you could be holding through bitcoin historical prices and also your transaction histories.For your friend to had likely been safe from this was if he holds the 10000CHF in 10 different wallets if holding on self custodial wallets.Mind you using phone numbers to purchase those is bitcoins is partially to KYC because during the purchase of the phone numbers, you are required to register it with your personal details.I will only advice not trying to cheat the law and stay lawful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 26, 2024, 01:44:09 AM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 05:47:21 PMI friend of mine bought recently some BTC from ATMs in Switzerland.Because Switzerland has a limit of 1000 CHF per month without KYC on ATMs,he bought 10 times 1000 each, with fake phone number.Find Bitcoin ATMs in Switzerland.https://coinatmradar.com/bitcoin-atm-near-me/QuoteHe wasn't money laundering, just using his own legal money for HODL, while he didn't want to do KYC.Now he is wondering whether he might get problems cashing out in the future. If he could do it for purchases, he can do it similarly for selling in future.The bottom line, and also a biggest disadavantage with Bitcoin ATMs, is fee. You will have to pay very expensive fee for purchase and sale. If he does purchase and sales carelessly, he can experience shock like this.Bitcoin ATM Deposit Exchange Rate shocks.If Bitcoin ATM is not your friend's last choice, let tell him to find another method.https://kycnot.me/?t=&q=&cash=onBitcoin ATM: Definition, Fees, and locations.QuoteBitcoin ATM FeesCustomers are charged a service fee for using a Bitcoin ATM. This fee is typically charged as a percentage of the transaction rather than a fixed dollar value. Bitcoin ATMs can be very high, and the exchange rates offered may not be as competitive as could be found elsewhere. For example, Bitcoin ATM operator CoinFlip charges between 4.99% and 21.90% of your total transaction amount, compared to paying between $0.49 for a Bitcoin purchase of $1 to $4.99 and 1.5% on a purchase of $1,000 or more using Paypal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "COBRAS",
      "created_time": "November 26, 2024, 01:46:11 AM",
      "body": "In Mexico btc atm without KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "November 26, 2024, 04:56:57 AM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 05:57:01 PMCan he get suspected of money laundering if he is cashing out multiply small amounts,or encounter any other problems, that's the question.If he has hold the coins for a certain time, won't he be suspicious? I would say that buying small amounts, multiple times using different phone numbers to later sell them afterward (days or few weeks) is definitely a red flag. But if you're saying it's for HODling, then I can't imagine this being a problem and again, as mentioned above, there are probably better ways to do this, especially if you want to avoid the fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "November 26, 2024, 05:13:29 AM",
      "body": "The only reason why somebody would get a problem cashing out is if they do so on a third party platform which is known for demanding KYC and freezing accounts due to suspicion or whatever they come up with and pretend it is an issue.Stay away from centralized, controlling, personal-data-collecting elements (like crypto exchanges and other custodial wallets) and you will be fine.As people have already posted, there are better ways to cash out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "November 26, 2024, 07:06:32 AM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 06:04:20 PMBy the way, are anonymous coins without KYC of any advantage,worth paying 10% ATM fee?A 10% fee is too much. I wouldn't pay more than a 2% fee anywhere no matter how small or big the trade is. There are a lot of ways to buy Bitcoin without doing the KYC. It actually varies how advanced a user is and how well they know about existing services. They may not trust some online services and have a fear of getting scammed. In such cases, they prefer to pay 10% extra. It is up to them if they are okay with that. Since you have other options to buy Bitcoin without KYC and without paying that much fee, it is obvious that a 10% ATM fee is just a waste of money. But I am not in Switzerland. Their situation could be something else than what I am thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 26, 2024, 07:16:42 AM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 05:47:21 PMBecause Switzerland has a limit of 1000 CHF per month without KYC on ATMs,he bought 10 times 1000 each, with fake phone number.If he was successful buying within the limit and no KYC, I think the issue I see maybe the use of fake phone number because perhaps he might need code for access if need be, apart from that he tried to run from fees. But what do you mean by fake phone number? Or you mean third party phone number?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "November 26, 2024, 07:23:04 AM",
      "body": "Quote from: Gozie51 on November 26, 2024, 07:16:42 AMQuote from: fatcat1986 on November 25, 2024, 05:47:21 PMBecause Switzerland has a limit of 1000 CHF per month without KYC on ATMs,he bought 10 times 1000 each, with fake phone number.If he was successful buying within the limit and no KYC, I think the issue I see maybe the use of fake phone number because perhaps he might need code for access if need be, apart from that he tried to run from fees. But what do you mean by fake phone number? Or you mean third party phone number?I think OP means the number that he probably bought for that exact reason - to use the ATM, probably.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 26, 2024, 07:23:48 AM",
      "body": "Quote from: fatcat1986 on November 25, 2024, 05:57:01 PMCan he get suspected of money laundering if he is cashing out multiply small amounts,or encounter any other problems, that's the question.If he has hold the coins for a certain time, won't he be suspicious? It is better not to take legal advice from this forum but in general the money laundering charge needs more evidence, all he needs is to keep proof that he got this money from that bitcoin ATM (withdrawal slip) and proof of the source of the money (payment using his bank account.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "November 26, 2024, 07:28:41 AM",
      "body": "I think he would be okay if he got something to prove he did it from that ATM.But that's how I see it - your friend or you should do your own research on that legal matter and only then draw conclusions about it. I also have maybe only one ATM nearby me, but I have never used it. Thus, I can't be sure what it spews out once it's done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "November 26, 2024, 07:30:44 AM",
      "body": "Quote from: Upgrade00 on November 25, 2024, 07:36:53 PMQuote from: fatcat1986 on November 25, 2024, 05:47:21 PMHe wasn't money laundering, just using his own legal money for HODL, while he didn't want to do KYC.I'm no sure if you're asking why he would want to not submit kyc. The major reason why it's not advisable is that you would the have copies of your personal document out there that can be leaked or hacked, putting your identity at risk. Privacy is something anyone would desire, especially when dealing with a cryptocurrency.Quote from: fatcat1986 on November 25, 2024, 05:47:21 PMNow he is wondering whether he might get problems cashing out in the future. He should not expect any problems based on the fact that the coins where purchased without kyc. He also has options to cash out without kyc.I think the main question was in the legal field of this whole debacle, however, you are right - it's good that OP's friend at least used the fake number for such an action. Even though, I think nothing bad will happen to him afterward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}