{
  "id": "topic_5453353",
  "title": "Ulven",
  "author": "Ulven",
  "created_time": "May 19, 2023, 09:55:04 PM",
  "content": "لقد لا حظت أن أغلب المنصات لا تدعم عناوين taproot كما أن العديد من المواقع التي تدعم التشفير لا تدعم هذه العناوين هل هذا يعني أن المنصات لا تحاول مواكبة تطوير البتكوين أم أن هذه العناوين ستسبب المتاعب كما شهدناه في بداية هذا الشهر أي تفادي إزدخام الشبكة أم هناك أشياء لا نعلم عنها شيئاً",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453353",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "May 19, 2023, 10:13:16 PMLast edit: May 21, 2023, 07:34:25 PM by Kavelj22",
      "body": "تقريبا هو العكس تماما في ما ذهبت تليه في تحليلك. تحديث taproot ليس مهما جدا بالنسبة للمنصات لانهم ببساطة لا يهتمون لمصلحة المستخدمين اكثر ما يهتمون بمصلحتهم المنفعية الخاصة. هذا طبيعي بما انها شركات ربحية لكن لا يجب ان يكون هذا على حساب مصلحة المستخدمين.هناك فعلا منصات قامت بالتحديث و لكن لنأهذ بعين الاعتبار كل المجهودات لتحديث خوادمها و هو ما قد لا تجده بقية المنصات بنفس الاهمية. مثل تحديث سيغويت تماما حين انقسم مجتمع البيتكوين بين مؤيد و معارض الى ان اضطر الجميع الى تفعيل التحديث بعد الوصول الى نسبة 51 بالمائة من المعدنون لاحقهم البقية لكي لا يحصل انقسام في الشبكة.هناك شبكة البرق كتطور تحديثي للشبكة و بالرغم من قدم التكنولوجيا الا انه اغلب المنصات لم تتبناها بعد. و قد وجدت العديد من المنصات نفسها ملزمة بتبني هذا التحديث بعد ان مرت بالازمة الاخيرة من ارتفاع في الرسوم نتيجة تراكم المعاملات الغير مؤكدة و جشع المعدنين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "May 19, 2023, 10:15:56 PM",
      "body": "اولا للاعضاء الذين لم يفهموا ما هي عنوانين Taproot بالمختصر القليل هي تحديث افضل من العنوانين السابقة segwit ولديها العديد من الخصائص افضل من سابقها اين يمكن معالجة العديد من التوقيعات والتعاملات في ان واحد وتعتبر اسرع ايضا كما انها عناوين يمكن الحصول عليها من خلال محفظة electrum المعروفة مثلالكن ربما هي خطوة فقط لتقليل الازدحام كما قلت لانها فعلا تسبب بطئ في البلوك شين وبما اننا نشهد ازدحاما وبطءا رهيبا منذ الاسبوع الفارط في تعاملات البيتكوين فهي خطوة مؤقتة فقط وتعود الامور لنصابها. لم انتبه لاي منصة اوقفت دعم العامل مع عناوين taproot فهل يمكنك تسميتها من فضلك",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 20, 2023, 01:22:10 AM",
      "body": "بصراحة أنا كان لدي تساؤل شبيه بهذا السؤال من قبل، يعني أنا ذكرت في موضوع سابق أنني أبحث عن منصة تعطيني عنوان بيتكوين يبدأ ب bc1 . والآن أصبح هناك تحديث آخر هو taproot.إذا لماذا أغلب المنصات (التي أعرفها على الأقل) تستخدم عناوين بيتكوين القديمة التي تبدأ ب 1 أو 3 بدل عناوين segwit الأحدث التي تبدأ ب bc1 والتي تملك ميزات أكبر وأفضل بكثير وخاصة تخفيض الرسوم وهذا الأمر يهم المنصات كثيرا. هل هذا التغيير صعب تقنيا أم أنه يكلف الكثير من المال؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 20, 2023, 11:39:30 PM",
      "body": "Quote from: yhiaali3 on May 20, 2023, 01:22:10 AMبصراحة أنا كان لدي تساؤل شبيه بهذا السؤال من قبل، يعني أنا ذكرت في موضوع سابق أنني أبحث عن منصة تعطيني عنوان بيتكوين يبدأ ب bc1 . والآن أصبح هناك تحديث آخر هو taproot.إذا لماذا أغلب المنصات (التي أعرفها على الأقل) تستخدم عناوين بيتكوين القديمة التي تبدأ ب 1 أو 3 بدل عناوين segwit الأحدث التي تبدأ ب bc1 والتي تملك ميزات أكبر وأفضل بكثير وخاصة تخفيض الرسوم وهذا الأمر يهم المنصات كثيرا. هل هذا التغيير صعب تقنيا أم أنه يكلف الكثير من المال؟ ليس صعب تقنيا و لا يكلف اموالا بالشكل الذي قد يستحيل معه القيام بالأمر. كل ما في الامر ان تلك المنصات لا تهتم بتحديث انظمتها (خوادمها) خصوصا ان كان التحديث لا يوفر منفعة خاصة لها. لا اقول انها لن تقوم بذلك ابدا و لكن من المفيد لها كل يوم تأخير الى حين يحصل اجماع للتبني فتجد نفسها مظطرة الى ذلك.مثال جيد على ذلك انه ان حصل اتفاق بين 51 بالمائة من المعدنين فان البقية مضطرين الى تحديث عقدهم مرغمين كما حصل اثناء تحديث سيغويت.مقترحات المطويرن و ان كانت مفيدة جدا لمصلحة الشبكة و بالتاالي مصلحة المستخدمين فانها تبقى دوما خاضعة لسلطة شركات التعدين بكل الاشكال.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "May 21, 2023, 09:18:11 PM",
      "body": "Quote from: Kavelj22 on May 20, 2023, 11:39:30 PMQuote from: yhiaali3 on May 20, 2023, 01:22:10 AMبصراحة أنا كان لدي تساؤل شبيه بهذا السؤال من قبل، يعني أنا ذكرت في موضوع سابق أنني أبحث عن منصة تعطيني عنوان بيتكوين يبدأ ب bc1 . والآن أصبح هناك تحديث آخر هو taproot.إذا لماذا أغلب المنصات (التي أعرفها على الأقل) تستخدم عناوين بيتكوين القديمة التي تبدأ ب 1 أو 3 بدل عناوين segwit الأحدث التي تبدأ ب bc1 والتي تملك ميزات أكبر وأفضل بكثير وخاصة تخفيض الرسوم وهذا الأمر يهم المنصات كثيرا. هل هذا التغيير صعب تقنيا أم أنه يكلف الكثير من المال؟ ليس صعب تقنيا و لا يكلف اموالا بالشكل الذي قد يستحيل معه القيام بالأمر. كل ما في الامر ان تلك المنصات لا تهتم بتحديث انظمتها (خوادمها) خصوصا ان كان التحديث لا يوفر منفعة خاصة لها. لا اقول انها لن تقوم بذلك ابدا و لكن من المفيد لها كل يوم تأخير الى حين يحصل اجماع للتبني فتجد نفسها مظطرة الى ذلك.مثال جيد على ذلك انه ان حصل اتفاق بين 51 بالمائة من المعدنين فان البقية مضطرين الى تحديث عقدهم مرغمين كما حصل اثناء تحديث سيغويت.مقترحات المطويرن و ان كانت مفيدة جدا لمصلحة الشبكة و بالتاالي مصلحة المستخدمين فانها تبقى دوما خاضعة لسلطة شركات التعدين بكل الاشكال.صحيح  يعتبر تحديث الشبكة أمرًا ضروريًا لتطوير التقنية وتحسين أدائها وتوافقها. وبمجرد أن يتم الحصول على توافق الأعضاء الرئيسيين في شبكة البلوكتشين، يمكن تنفيذ التحديثات وتحقيق التغييرات اللازمة في النهاية.كما أشارت أيضاً تجربة شبكة البرق خير إجابة للإشكال المطروح لهذا الموضوع دائما المنصات المركزية تخدم مصالحها فقط",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 23, 2023, 10:50:22 PM",
      "body": "لم انتبه للموضوع الا الان و أردت تصحيح هذه النقطة بعد اذنك:Quote from: GxSTxV on May 19, 2023, 10:15:56 PMاولا للاعضاء الذين لم يفهموا ما هي عنوانين Taproot بالمختصر القليل هي تحديث افضل من العنوانين السابقة segwit ولديها العديد من الخصائص افضل من سابقها اين يمكن معالجة العديد من التوقيعات والتعاملات في ان واحد وتعتبر اسرع ايضا كما انها عناوين يمكن الحصول عليها من خلال محفظة electrum المعروفة مثلاعلى حد علمي محفظة الكتروم لازالت لا تدعم تحديث taproot و يمكن فقط استيراد العناوين من هذا النوع للمحافظة و بذلك تكون للمشاهدة فقط. حسب مطوري المحفظة هناك نية لدعم التحديث و قد اعلنوا عن ذلك منذ فترة طويلة لكن لم يقوموا بذلك إلى الآن.راجعت قائمة التحديثات على حسابهم على جيتهاب للتأكد من المعلومة لكن ان كنت مخطئا ارجو تصحيح.في هذا الموضوع قائمة بأغلب المحافظ التي تدعم taproot:Wallets supporting Taproot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "May 23, 2023, 11:39:11 PM",
      "body": "Quote from: khaled0111 on May 23, 2023, 10:50:22 PMلم انتبه للموضوع الا الان و أردت تصحيح هذه النقطة بعد اذنك:على حد علمي محفظة الكتروم لازالت لا تدعم تحديث taproot و يمكن فقط استيراد العناوين من هذا النوع للمحافظة و بذلك تكون للمشاهدة فقط. حسب مطوري المحفظة هناك نية لدعم التحديث و قد اعلنوا عن ذلك منذ فترة طويلة لكن لم يقوموا بذلك إلى الآن.راجعت قائمة التحديثات على حسابهم على جيتهاب للتأكد من المعلومة لكن ان كنت مخطئا ارجو تصحيح.في هذا الموضوع قائمة بأغلب المحافظ التي تدعم taproot:Wallets supporting Taprootاسف على المعلومة الخاطئة وشكرا على التصحيح اخي الفاضل، محفظة electrum فعلا لا تدعم تقنية taproot بعد رغم التحدث على تحديث قادم لدعمها لكن لا يوجد اي شيء رسمي حتى الان وبحثت على موضوع مفيد واريد اقتباس كل المحافط التي تدعم التقنية للافادة  محافظ على شكل برنامج تدعم Taproot:Bitcoin CoreSparrow walletSpecter walletFully NodedNunchuk*Muun wallet*Zeus wallet*MyCitadelBlixt wallet*Exodus walletUnstoppable wallet** محافظ على شكل تطبيق للهاتفمحافظ باردة (جهاز) تدعم  Taproot:LedgerTrezorBitBox02OneKeyColdCard (limited)مصدر الموضوع الاصلي : https://bitcointalk.org/index.php?topic=5371499.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}