{
  "id": "topic_5417853",
  "title": "Saisher",
  "author": "Saisher",
  "created_time": "October 21, 2022, 05:39:36 AM",
  "content": "The Crawford - Spence will not push through this year ESPN.com’s Mike Coppinger is reporting that Crawford and David Avanesyan have “signed contracts” for a fight on Dec. 10.Terence Crawford vs David Avanesyan reportedly signed for Dec. 10 on streaming PPVAvanesyan (29-3-1, 17 KO) is 34 years old and the reigning European welterweight champion, but I don't think he can match up the skill and power of Crawford its a cherry-picked fight but Crawford needs to fight this year because he has been inactive for a long timeThis is a fight we least expect coming from Crawford but it takes two to tango and Spence or Crawford really don't like the fight to push.But according to CrawfordQuote“I was really looking forward to the Errol Spence fight. I started communicating with Al Haymon and PBC back in June. And unfortunately, they represent a fighter in Errol Spence who didn’t want the fight as bad as I did.”",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417853",
  "comments": [
    {
      "author": "Dave1",
      "created_time": "October 21, 2022, 11:13:07 AM",
      "body": "When we thought that Crawford has already move out of the shadow of Top Rank because his critics felt that he is cherry picking opponents for him, now he decided to go and fight a unknown?Nothing against Avanesyan, but Crawford, his last fight is against Porter, and it seems that this is a big let down for his fans as if instead of levelling up, he chooses to go down one level down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "October 21, 2022, 11:27:21 AM",
      "body": "This  David Avanesyan has a power  I checked Youtube for any information about this guy and this video is very interesting The BRUTAL POWER of David Avanesyan although impressive but against a fighter like Crawford who is fast with a good technical skills I doubt if he can hit Crawford with his so-called power, there's no big name on his list but he is the European welterweight Champion, but his power is not enough to beat Crawford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "October 21, 2022, 12:23:42 PM",
      "body": "Quote from: aioc on October 21, 2022, 11:27:21 AMThis  David Avanesyan has a power  I checked Youtube for any information about this guy and this video is very interesting The BRUTAL POWER of David Avanesyan although impressive but against a fighter like Crawford who is fast with a good technical skills I doubt if he can hit Crawford with his so-called power, there's no big name on his list but he is the European welterweight Champion, but his power is not enough to beat Crawford.Yes, Crawford has boxing IQ, face a lot of tough opponents that have power, but so far no one has broken his chin. And with that, I think he will overwhelm the European champion and maybe this is just a big test for Crawford, not a step up but obviously a good choice of opponent.And if I'm not mistaken, the rest of 147 lbs is with PBC and with the fight with Spence not pushing through, I doubt that Crawford with sit down with Al Haymon again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 21, 2022, 12:44:05 PM",
      "body": "Quote from: btc_angela on October 21, 2022, 12:23:42 PMQuote from: aioc on October 21, 2022, 11:27:21 AMThis  David Avanesyan has a power  I checked Youtube for any information about this guy and this video is very interesting The BRUTAL POWER of David Avanesyan although impressive but against a fighter like Crawford who is fast with a good technical skills I doubt if he can hit Crawford with his so-called power, there's no big name on his list but he is the European welterweight Champion, but his power is not enough to beat Crawford.Yes, Crawford has boxing IQ, face a lot of tough opponents that have power, but so far no one has broken his chin. And with that, I think he will overwhelm the European champion and maybe this is just a big test for Crawford, not a step up but obviously a good choice of opponent.And if I'm not mistaken, the rest of 147 lbs is with PBC and with the fight with Spence not pushing through, I doubt that Crawford with sit down with Al Haymon again.This Avanesyan is impressive but this is not something new to Crawford he has fought fighters that are power punchers and just move like a bull, for a fighter like Crawford, you have to match his skill if you just rely on power, he will just break you down until you can't use your power anymore, then he will impose his power to you, Crawford is a very intelligent fighter one of his arsenals is to deceive his opponent, he is good in shifting his stance and strategy, we do not need a poll here as Crawford will be the overwhelming favorite here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "October 21, 2022, 12:48:05 PM",
      "body": "This fight is better than we continue to expect a Crawford vs Spence fight that is not gonna happen, they keep hyping it but in the end, they will just disappoint us. I'm not familiar with David Avanesyan, but according to his record and some highlights, this guy is a legit challenger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "October 21, 2022, 12:59:52 PM",
      "body": "Quote from: aioc on October 21, 2022, 11:27:21 AMThis  David Avanesyan has a power  I checked Youtube for any information about this guy and this video is very interesting The BRUTAL POWER of David Avanesyan although impressive but against a fighter like Crawford who is fast with a good technical skills I doubt if he can hit Crawford with his so-called power, there's no big name on his list but he is the European welterweight Champion, but his power is not enough to beat Crawford.If this fight with Avanesyan pushes through then they will have a common opponent which is Kavaliauskas who defeated Avanesyan via TKO so i think this is an easy fight for Terrence Crawford because he KOed Kavaliauskas who KOed Avanesyan  .Bottomline, no matter how powerful Avenesyan is, he is not on the level of Crawford and for me this is just \"to keep busy\" fight for Crawford while ironing things out for the Spence fight next year but nevertheless it is a cherry-picked opponent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "October 21, 2022, 01:29:09 PM",
      "body": "Quote from: bisdak40 on October 21, 2022, 12:59:52 PMQuote from: aioc on October 21, 2022, 11:27:21 AMThis  David Avanesyan has a power  I checked Youtube for any information about this guy and this video is very interesting The BRUTAL POWER of David Avanesyan although impressive but against a fighter like Crawford who is fast with a good technical skills I doubt if he can hit Crawford with his so-called power, there's no big name on his list but he is the European welterweight Champion, but his power is not enough to beat Crawford.If this fight with Avanesyan pushes through then they will have a common opponent which is Kavaliauskas who defeated Avanesyan via TKO so i think this is an easy fight for Terrence Crawford because he KOed Kavaliauskas who KOed Avanesyan  .Bottomline, no matter how powerful Avenesyan is, he is not on the level of Crawford and for me this is just \"to keep busy\" fight for Crawford while ironing things out for the Spence fight next year but nevertheless it is a cherry-picked opponent.Maybe not as powerful as Crawford, but I'm hoping here that we will be able to see an entertaining fight. I believe David Avanesyan is an aggressive boxer, if he would pressure Crawford, then most likely we will see a KO again and that's going to be a win by Crawford. I'm wondering what's the betting odds on this fight, hopefully we can still find some value to bet on Crawford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 21, 2022, 01:57:48 PM",
      "body": "Quote from: bisdak40 on October 21, 2022, 12:59:52 PMBottomline, no matter how powerful Avenesyan is, he is not on the level of Crawford and for me this is just \"to keep busy\" fight for Crawford while ironing things out for the Spence fight next year but nevertheless it is a cherry-picked opponent.I believe its also a cherry-picked fight for an eventual meeting with Spence next year, Crawford has been out of the ring for a long time he needs some challenge to avoid ring rust, but I read that Spence is moving up because he's been in this weight for so many years, both fighters loss on this missed opportunity, there's been a lot of great fights this year against bitter rivals but unfortunately, both camps cannot agree to agree, it seems they don't want to fight maybe not this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "October 21, 2022, 02:48:14 PM",
      "body": "Quote from: robelneo on October 21, 2022, 01:57:48 PMQuote from: bisdak40 on October 21, 2022, 12:59:52 PMBottomline, no matter how powerful Avenesyan is, he is not on the level of Crawford and for me this is just \"to keep busy\" fight for Crawford while ironing things out for the Spence fight next year but nevertheless it is a cherry-picked opponent.I believe its also a cherry-picked fight for an eventual meeting with Spence next year, Crawford has been out of the ring for a long time he needs some challenge to avoid ring rust, but I read that Spence is moving up because he's been in this weight for so many years, both fighters loss on this missed opportunity, there's been a lot of great fights this year against bitter rivals but unfortunately, both camps cannot agree to agree, it seems they don't want to fight maybe not this year.Obviously, it's just a cherry-pick fight because it's not what people are expecting, we want to see him fight Spence, however, despite of the hype, it still did not push through and there's no official attachment as to when the fight will really happen. Fans are tired of waiting, it's not gonna happen this year but it's still nice to see Crawford fight this opponent than not fighting at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "October 21, 2022, 03:34:30 PM",
      "body": "I'm seeing Terence to cut a deal for a big win this time around as he has, apparently, claimed a trophy for that surpasses his competition (that's just an incentivised assumption though cus in real life, anything could happen) who knows?!Terence has got a couple of hard tibia / fibular muscles -- also, he's got some resistance that avenesyan hasn't. I know for sure that people get really sentimental when it comes to determining who wins a fight ; some won't consider their physique, with a simple logical Sense that anyone could win, matterless of how muscular they look -- that's a hard determinant sometimes as it turns out the route- wise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 21, 2022, 08:31:22 PM",
      "body": "Quote from: bisdak40 on October 21, 2022, 12:59:52 PMQuote from: aioc on October 21, 2022, 11:27:21 AMThis  David Avanesyan has a power  I checked Youtube for any information about this guy and this video is very interesting The BRUTAL POWER of David Avanesyan although impressive but against a fighter like Crawford who is fast with a good technical skills I doubt if he can hit Crawford with his so-called power, there's no big name on his list but he is the European welterweight Champion, but his power is not enough to beat Crawford.Bottomline, no matter how powerful Avenesyan is, he is not on the level of Crawford and for me this is just \"to keep busy\" fight for Crawford while ironing things out for the Spence fight next year but nevertheless it is a cherry-picked opponent.Yes, this is the bottomline, Crawford wanted to stay busy that's why he is willing to fight Spence this November. However, the fight didn't materialized so he moved with his plans to keep busy fighting with the Armenian Avanesyan. For sure we are caught off guard with this news but we all know that Crawford vs Spence is not going to happen this year.Anyhow, as Crawford is going forward with his career, Spence is reported to be moving up to 154 lbs maybe in his next fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 21, 2022, 08:35:46 PM",
      "body": "So the question is who is stalling their biggest fight in 147 lbs? Spence or Crawford. Of course we wanted to see this boxers in the ring together, but not for this year, Crawford decided to go and fight a boxer with pure power.The money is not that great, and I haven't check who is David Avanesyan manager that prompted Crawford to pick him up as a tune up fight. I still believed that both champions will fight next year either in 147 lbs or 154 lbs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "October 22, 2022, 01:37:23 AM",
      "body": "Quote from: cryptomaniac_xxx on October 21, 2022, 08:35:46 PMSo the question is who is stalling their biggest fight in 147 lbs? Spence or Crawford. Of course we wanted to see this boxers in the ring together, but not for this year, Crawford decided to go and fight a boxer with pure power.Both fighters have alibis and want to show to the public that they want the big to push, but small details kept them from moving on with the fight, but eventually, we'll see who really has the intention for this fight not to happenQuoteThe money is not that great, and I haven't check who is David Avanesyan manager that prompted Crawford to pick him up as a tune up fight. I still believed that both champions will fight next year either in 147 lbs or 154 lbs.Avanesyan is a hard puncher but not a skilled fighter he lost a match against Egidijus Kavaliauskas and to think that Egidijus Kavaliauskas was knocked out by Crawford, it's easy to calculate that this is going to be an easy fight for CrawfordCheck out this highlight and see if he has enough power and skill to beat CrawfordEgidijus Kavaliauskas vs. David Avanesyan | Highlights",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 22, 2022, 04:51:07 AM",
      "body": "This is very disappointing and not only because Spence vs. Crawford will not happen. It is very disappointing that Crawford is not fighting someone who is ranked higher than Avanesyan like Boots Ennis or Vergil Ortiz. This is only another boxing event that is promoted very much similar to ICO scamcoins. Paying to watch this fight will certainly be a waste of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "October 22, 2022, 09:50:18 AM",
      "body": "Quote from: cryptomaniac_xxx on October 21, 2022, 08:35:46 PMSo the question is who is stalling their biggest fight in 147 lbs? Spence or Crawford. Of course we wanted to see this boxers in the ring together, but not for this year, Crawford decided to go and fight a boxer with pure power.It is hard to tell who speak the truth because when Team Crawford was asked about that, they say that it was the team of Spence who avoid the fight while if we asked Team Spence, they say it was Crawford who avoided them lol.I have recently read an article and it seems to me that Errol Spence might be the one delaying/avoiding this biggest fight in the 147lbs to happen because he might be having some problems in this weight category for now.QuoteI got to talk to my manager but I already told them I'm at this weight too long. I might be moving up I don't know. I might be moving up,” said Spence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "October 22, 2022, 12:39:18 PM",
      "body": "Quote from: bbc.reporter on October 22, 2022, 04:51:07 AMThis is very disappointing and not only because Spence vs. Crawford will not happen. It is very disappointing that Crawford is not fighting someone who is ranked higher than Avanesyan like Boots Ennis or Vergil Ortiz. This is only another boxing event that is promoted very much similar to ICO scamcoins. Haha, you really compared this to scamcoins? Well, I understand the disappointment mate, but we have no choice, at least we have one that no fight at all this year. I'm expecting an easy win by Crawford here, hopefully another KO so it will be entertaining to watch. QuotePaying to watch this fight will certainly be a waste of money.We can always find a way to watch this fight without paying, so don't bother.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judeafante",
      "created_time": "October 22, 2022, 01:21:28 PM",
      "body": "Quote from: bbc.reporter on October 22, 2022, 04:51:07 AMThis is very disappointing and not only because Spence vs. Crawford will not happen. It is very disappointing that Crawford is not fighting someone who is ranked higher than Avanesyan like Boots Ennis or Vergil Ortiz. This is only another boxing event that is promoted very much similar to ICO scamcoins. Paying to watch this fight will certainly be a waste of money.This is a very huge opportunity for Avanesyan but a cherry-picked fight for Crawford, this fight is chosen for Crawford because of the urgency, he has been off the ring for a very long time, and he needs a fighter like Avanesyan who has a good record but beatable, I don't Avanesyan has a chance against Crawford, but whenever know, Crawford has ben out o the ring for a long time, but I still bet that Crawford is going to beat Avanesyan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "October 22, 2022, 11:41:29 PM",
      "body": "Quote from: Sanitough on October 22, 2022, 12:39:18 PMWe can always find a way to watch this fight without paying, so don't bother.  There's a lack of interest in this fight compared to the Spence match up, it's understandable he should fight Ennis if he wants more money and legacy but he choose the safest route only Crawford's die-hard fans and those who can afford will buy tickets for a live fight, I prefer to see the highlights because we all know who's gonna win in this fight, Avanesyan is good but he is not on Crawford's level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "October 22, 2022, 11:45:55 PM",
      "body": "At least Terence Crawford won't be vacant this year regardless of who's the opponent.Since the fight against Spence is not gonna happen this year, how about some warm-ups before it might happen next year.Just enjoy the fight guys without being bitter if it's a cherry-pick or not. It's just clear that before moving up, he is really eager to fight Spence no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}