{
  "id": "topic_5420850",
  "title": "Ben Barubal",
  "author": "Ben Barubal",
  "created_time": "November 13, 2022, 02:13:37 PM",
  "content": "Do you want to know how you can avoid being scammed or fooled by people who offer you business opportunities and investments? But before I start I just want to share that like others I was once lured by online opportunities back in the day maybe 8 years ago. Because at that time I was just a beginner, not a lot, but I lost thousands, which was a huge amount for me.So on this oppotunity, I would like to help others here so that you will not end up being a victim of exploitative people, and I hope that the tips that I will give will help us here on this forum platform.1. Get Rich Quick Mentality        This is one of the reasons why most people fall victim to scams or scammers because they have this mentality. Maybe some of us here have experienced or encountered someone who offers online to tell you that you can earn 500$ per day or others that if you take out this amount of money after one month you will be a millionaire, or if you have 10k$ now after 5 days it will be 100k$. Then as a person blinded by promises, when you invest it turns out not to be true in the end, you just lost your hard-earned money.That's why we should get rid of this mentality that you will get rich immediately with no effort or that you will just sit and wait for your earnings. Or you'll just lie in bed and wait for your money, of course when you hear and say something like this, it's a sign that the person offering you or the company is a scammer or scam.Because it is not possible to become rich without doing anything to be successful. Especially if you were not born rich, you should know that there are steps or processes you must take to become rich.It is not true that you will suddenly become rich in just one week, there is no such thing. We need to work for that to happen to what you want. Don't be lazy or invest in yourself.It's even better if you delete the word \"Quick\" from it\"Get Rich Quick Mentality\" and do it \"Get Rich Mentality\" When you do it you have a mindset, So all you need is action.2. You are impulsive    This is also one of the reasons why we fall prey to scammers is that we become hasty in making decisions in our lives, that when we get a sales talk from someone like this or that, we decide to buy it immediately. which was not well thought out. Instead of what we should be, we use our minds well so that we are not immediately fooled.Then these scammers can easily attack their victims because they use psychological techniques because sometimes the target of these scammers is to trigger the emotions of their victims, so sometimes we avoid being emotional or as long as we can put it in the right place and opportunity. Because these people will use your imagination that it is nice to have your own house, car, and so on, and there is nothing wrong with it but we should use the brain we have in these situations. Or sometimes they tell you to join while there are still a few members, or we use the word \"MANY\" many people have earned here, or we have already earned 2000 here, or many famous artists are earning here. We, humans, are carried away by such words.3. Avoid \"Too Good to be True\"   This is another reason why many people are scammed, it seems that everything they will mention is very good, the kind that you will never lose money, you will never be tired, and you can quit the job you have, you will not be trafficked, you can travel, the income or commission is high, it's easy to earn or easy money, you have a free ride, free cellphone, you have a house and land, etc. That you can get all the pleasures in life if you invest. When they say all the good things in the world, it's probably a scam.Because the reality of life is really hard. It's really hard to study, it's hard to work, and it's hard to do business. It seems that in everything we do in life we ​​will experience some hardship, and we should expect it and not avoid it. Because we will make mistakes, fail and lose, and this is part of our life, a test, and we need to overcome it to become better and good people.When you are afraid of problems and hardships in life you will fall victim to these scams more. Because there is no shortcut to getting rich immediately just because of a business or product when we invest, there is no such thing in real life. They say the hero is always beaten at first, this is true because we are the hero of our lives. And it's up to us how we end the movie of our life whether it's a happy or bad ending.4. Do Research   It needs to be done, and I think most people even in today's age don't do it or apply it. Many people often go into an investment without first knowing what they are getting into, and get carried away by words they don't understand. Are we the type who will just nod and answer Yes to pretend we get what was said? We should not be like that, because the scammer might use more technical terms and in the end say join and give your money.So learn to ask others, be skeptical and ask questions.Use the internet, youtube, and google search and study it carefully before we join.Okay, before I end this topic, I just want you to know that we should do everything to succeed, whether we lost, failed, or were cheated, that's okay, as long as the important thing is that we get up and continue on we have started.Because each one of us has the potential and ability to achieve whatever we want in life, we can achieve it.All this that I have done is based on my experience regarding the subject we are talking about here, we can see many sources or references on avoiding scammers using google search, I just didn't put it here. Because of my perception and assessment, these 4 tips are enough to prevent us from becoming victims of scams or scammers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420850",
  "comments": []
}