{
  "id": "topic_5473889",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "November 13, 2023, 10:13:47 AM",
  "content": "Esto es por ahora una historia rápida de contar, en tanto en cuando no hay demasiados detalles, y es una situación viva. Según comenta el autor de la historia, junto con su padre, lleva años con BTC en su posesión. Concretamente, disponía de 25 BTCs desde el 2012, almacenados en alguna wallet caliente, sin que especifique por ahora la topología que tenía de cartera. Sí indica que las semillas las almacenaba en Keepass, con una contraseña de 30 bits, lo cual es una protección débil (lo he probado, y con 5 o 6 caracteres ya llego a los 30 bits). En todo caso, no tiene ni idea cómo accedieron los hackers a su entorno. Especula con el uso de keyloggers y demás, pero si tenía los fondos en hodl, parece poco probable que hubiese entrado para ver su semilla recientemente.De lo que se arrepiente es de estar años hablando de la bondad de las hardware wallets, para ser él el primero en no usarla …Por lo que he visto, parece que hay gente que ha traceado las TXs de salida, algunas de las cuales habrían ido a para a algún tipo de mezclador, y otras a un Exchange (citan a Binance).Ver:https://twitter.com/RMessitt/status/1723141037856596175https://twitter.com/RMessitt/status/1723468245716369428 (video)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473889",
  "comments": [
    {
      "author": "LauremNoa",
      "created_time": "November 13, 2023, 01:00:30 PM",
      "body": "Quote from: DdmrDdmr on November 13, 2023, 10:13:47 AMEsto es por ahora una historia rápida de contar, en tanto en cuando no hay demasiados detalles, y es una situación viva. Según comenta el autor de la historia, junto con su padre, lleva años con BTC en su posesión. Concretamente, disponía de 25 BTCs desde el 2012, almacenados en alguna wallet caliente, sin que especifique por ahora la topología que tenía de cartera. Sí indica que las semillas las almacenaba en Keepass, con una contraseña de 30 bits, lo cual es una protección débil (lo he probado, y con 5 o 6 caracteres ya llego a los 30 bits). En todo caso, no tiene ni idea cómo accedieron los hackers a su entorno. Especula con el uso de keyloggers y demás, pero si tenía los fondos en hodl, parece poco probable que hubiese entrado para ver su semilla recientemente.De lo que se arrepiente es de estar años hablando de la bondad de las hardware wallets, para ser él el primero en no usarla …Por lo que he visto, parece que hay gente que ha traceado las TXs de salida, algunas de las cuales habrían ido a para a algún tipo de mezclador, y otras a un Exchange (citan a Binance).Ver:https://twitter.com/RMessitt/status/1723141037856596175https://twitter.com/RMessitt/status/1723468245716369428 (video)Y eso puede ocurrir? que detecten tu wallets de entre millones y que te roben tus criptos? cómo? si son tannnntas!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 13, 2023, 02:07:15 PM",
      "body": "Quote from: LauremNoa on November 13, 2023, 01:00:30 PM<…>A uno le pueden llegar a robas sus claves de muchas maneras si no tiene sumo cuidado. Algunas veces los hackers van a granel, realizando intentos de phishing masivos por correo/sms/redes sociales, y al final algunos caen siempre. Otros son más sofisticados y logran que sea un malware su punta de lanza para introducirse en los ordenadores de los demás, mediante alguna descarga de software en general que lleva un \"regalo\" asociado. Y así podríamos seguir.En el caso concreto citado, aún no tiene claro cómo le pasó, pero al ser una persona que parece que hablaba de bitcoin, podría ser más fácilmente objetivo de algún ataque dirigido como por ejemplo de los antes citados, pero ya con un conocimiento más concreto del objetivo, pudiendo customizar un tanto el mensaje gancho.En todo caso, la causa última del robo, según nos indica, es que los hackers lograrían hacerse con las semilla/s de sus wallet/s. Este es el factor fundamental a proteger, y aunque lo tenía almacenado en un gestor de contraseñas reconocido y no centralizado, esto no quita que, a la postre, tuviese las claves en un ordenador online, haciéndole vulnerable potencialmente a malware que va desde los keyloggers para atrapar lo que uno teclea, hasta software RAT para acceder remotamente a tu ordenador sin que lo sepas.Las semillas se deberían guardar offline, y luego se puede entrar a ver si se encriptan o no, si se usa el Secreto de Shamir o no, o el método que uno considere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 13, 2023, 02:49:26 PM",
      "body": "Es un gran error tener todas las manzanas en la misma canasta, cuando hablamos de cantidades así de grandes es importante tomárselo con seriedad y acudir a todas las medidas necesarias de seguridad. Y una de estas medidas es tener los BTC en diferentes direcciones ya que la cantidad que perdieron las víctimas fue $917,285 dolares. Si en vez de tenerlos todos en la misma cartera hubiera dividido en lotes de $100k  y nada más hubiera dejado $100k en el hot wallet, su perdida se hubiera reducido en un 90%.Al final es una lástima para la víctima.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 13, 2023, 05:38:59 PM",
      "body": "Quote from: DdmrDdmr on November 13, 2023, 02:07:15 PM<...>Este caso me ha recordado, salvando las distancias, el de uno de forocoches que abrió un hilo diciendo que no sabía cómo le habían robado los bitcoins porque los tenía en un HW. Al final resulta que había hecho una foto a las semillas escritas en papel y las había subido a la nube... en fin.Quote from: seoincorporation on November 13, 2023, 02:49:26 PMEs un gran error tener todas las manzanas en la misma canasta, cuando hablamos de cantidades así de grandes es importante tomárselo con seriedad y acudir a todas las medidas necesarias de seguridad. Y una de estas medidas es tener los BTC en diferentes direcciones ya que la cantidad que perdieron las víctimas fue $917,285 dolares.Es un grandísimo error. Más cuando dice que han perdido todo su bitcoin. Yo si algún día llegara a tener un millón de dólares en un wallet de bitcoin sería porque tengo lo menos un par más en otros dos wallets distintos, y otro par de millones entre patrimonio inmobiliario y acciones, fondos de inversión, cosas así. Hay que diversificar el riesgo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "November 13, 2023, 06:15:53 PM",
      "body": "Quote from: DdmrDdmr on November 13, 2023, 10:13:47 AMEsto es por ahora una historia rápida de contar, en tanto en cuando no hay demasiados detalles, y es una situación viva. Según comenta el autor de la historia, junto con su padre, lleva años con BTC en su posesión. Concretamente, disponía de 25 BTCs desde el 2012, almacenados en alguna wallet caliente, sin que especifique por ahora la topología que tenía de cartera. Sí indica que las semillas las almacenaba en Keepass, con una contraseña de 30 bits, lo cual es una protección débil (lo he probado, y con 5 o 6 caracteres ya llego a los 30 bits). En todo caso, no tiene ni idea cómo accedieron los hackers a su entorno. Especula con el uso de keyloggers y demás, pero si tenía los fondos en hodl, parece poco probable que hubiese entrado para ver su semilla recientemente.De lo que se arrepiente es de estar años hablando de la bondad de las hardware wallets, para ser él el primero en no usarla …Por lo que he visto, parece que hay gente que ha traceado las TXs de salida, algunas de las cuales habrían ido a para a algún tipo de mezclador, y otras a un Exchange (citan a Binance).Pues ya se dio su propia respuesta, una contraseña débil para acceder al gestor de contraseñas donde puso la semilla. Si le entraron al sistema operativo (por ejemplo Windows) también le pueden capturar la contraseña al momento de escribirla para abrir el gestor de contraseñas.Básicamente por el eslabón mas débil. La hardware wallet no es garantía de nada porque igual se supone que guardas las frases en algún lado, pero fue su decisión guardarlas en el gestor de claves, no tendría diferencia. No es comprando eso que se hacen las cosas mas seguras, a veces sirve, a veces les da mas vectores de ataque, como los fallos reportados hace no mucho en varias.¿Y tu, aun usando Windows? ¿Android? ¿MacOS? ¿iOS? ¿y las semillas están anotadas en físico a buen resguardo, donde no las vea dispositivo electrónico alguno y que si se pierde el sitio a, en el sitio b están a salvo?Esto es viejo, la flojera es lo que los atacantes siempre explotan.Si es rápido el de Binance le congela las transacciones, ya se lo a ofrecido a otros en numerosas ocasiones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "November 15, 2023, 07:23:48 PM",
      "body": "Hay muchos que saben usar esto de las wallets offline,yo lo que sé que pueden guardarse offline es las altcoins que aprendi a usarlo con la etherwallet y sé que eso es wallet fría,pero para los BTC si hay  ¿una wallet electrum igual está la manera que puede ser hackeado verdad? con esa wallet yo tengo mi llave privda en un papel y esa es la manera que veo más segura, porque correos, archivos dentro de una computadora no es nada seguro,si le robaron esos BTC ya no hay nada que se pueda hacer porque es culpa de ellos mismos,yo ese dinero lo hubiese dejado en un exchange como binance que tambien es inseguro dejarlo ahi,pero tiene una custodia que si lo intentan quitar pues se pelea porque se sabe que esa plata es de uno,yo no se mucho de las wallets,yo se que el mejor sitio para guardar un BTC es el ledger o esa billetera que parece como si estuviera en un pendrive,es la más segura,pero eso tambien los han hackeado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 16, 2023, 07:51:46 AM",
      "body": "Quote from: danadc on November 15, 2023, 07:23:48 PM<…>  ¿una wallet electrum igual está la manera que puede ser hackeado verdad? <…>Precisamente, el protagonista de esta historia tenía sus BTCs protegidos por una wallet Electrum. En todo caso, él supone que no le hackearon la wallet en sí (*), sino que probablemente la semilla, dado que esta estaba guardada en un gestor de contraseñas (keepass) en su ordenador local, pero conectado a internet y con una contraseña débil. Además, también indicó tener una copia de la BD keepass en Google Drive, aumentando el vector de ataque.(*) La wallet sería técnicamente \"hackeable\" si alguien se hiciese con una copia del fichero y éste tuviese una contraseña débil de acceso, atacable por fuerza bruta. No es descartable tampoco que hubiese un malware instalado que hubiese permitido a un hacker tener un acceso remoto para bajar ficheros, y un keylogger para obtener la clave de acceso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 16, 2023, 10:09:38 AM",
      "body": "Quizá es porque siempre las noticias de perdidas grandes cómo estás son las que ustilizan los editores de las páginas de Bitcoin y tecnología para darlas a conocer de forma masiva, pero con la frecuencia que está cosas pasan me hacen pensar a veces que la protección o seguridad de una billetera es inversamente proporcional al valor de la misma. Aunque se que en la realidad no es una ley real, he visto personas en internet haciendo uso práctico de protecciones de sus satoshis que se les haría muy difícil a los atacantes el acceder, pero solo para resguardar unos cuantos cientos de dólares. Y por otro lado están las noticias como está que nos has compartido que un caso complemantente opuesto, una seguridad de dos euros para resguardar casi un millón. Espero la persona pueda sobrellevar esta perdida..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 16, 2023, 02:36:46 PM",
      "body": "Quote from: DdmrDdmr on November 16, 2023, 07:51:46 AM...(*) La wallet sería técnicamente \"hackeable\" si alguien se hiciese con una copia del fichero y éste tuviese una contraseña débil de acceso, atacable por fuerza bruta. No es descartable tampoco que hubiese un malware instalado que hubiese permitido a un hacker tener un acceso remoto para bajar ficheros, y un keylogger para obtener la clave de acceso.Ambos vectores de ataque son válidos, pero el error de tener una clave débil para proteger sus contraseñas es algo brutal. Creo que el exceso de confianza y el mal almacenamiento fueron clave en este caso.Personalmente alguna vés pensé en usar un gestor de contraseñas pero el echo de que si este gestor es vulnerado entonces se pierde todo es algo que no me dio confianza. Es lo mismo que comentaba anteriormente, el tener todas las manzanas en la misma canasta. Y como ya hemos aprendido, aunque nuestros sistemas sean super seguros, siempre el factor humano será una vulnerabilidad. En este caso vemos una mala manipulación y almacenamiento de información sensible por parte del usuario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 16, 2023, 06:34:10 PM",
      "body": "Por ahora, en su hilo de Twitter se deja entrever que está persiguiendo el tema con Binance para ver no sólo si identifica al autor del hackeo, sino si logra poder congelar los fondos que aún pudiesen quedar en la cuenta del hacker (especulo- puede que la cuenta tuviese restricciones en función del nivel de KYC).Por otro lado, indica que los BTCs los tenía realmente desde el 2014 y no desde el 2012 como había indicado en un primer momento, algo que ha podido precisar ahora que ha revisado mejor la situación.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 17, 2023, 02:33:32 AM",
      "body": "Es intenresante leer esta historia pero actualmente no estoy seguro si sea real... El usuario puede firmar un mensaje desde su direccion?El punto es que esta semana no es la primera historia que leo sobre el tema, leer WHERE DID MY BITCOIN GO?!?!?!?!?! El usuario dice que perdio bitcoins, mas de 13 bitcoins curiosamente tambien de la fecha del 2014.Segun esto apunta a un error de RNG utilizado por Javascript que depende enteramente de Math.randLeer: https://www.unciphered.com/blog/randstorm-you-cant-patch-a-house-of-cardsSinceramente no se que pensar, si la vulnerabilidad es real entonces veremos mas historias similares estos proximos dias.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 17, 2023, 05:54:59 AM",
      "body": "Espero que lo que comenta albert0bsd no sea real, o por lo menos se trate de un caso excepcional, porque como sea algo más generalizado, además de la desgracia que va a suponer para muchos hodlers (literalmente la ruina), puede crear pánico en un momento clave en el ciclo de mercado.Al leer el título del hilo pensé que se trataría de un caso español o latinoamericano. Reconforta (no mucho, pero algo), ver que se trata de otro caso. Al fin y al cabo el mundo es grande y los casos extraordinarios, de ser ciertos, deberían tomarse como lo que son: una rareza.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 17, 2023, 06:10:45 AM",
      "body": "Siendo la cartera que empleaba Electrum, pues sí, ya podría firmar desde una de las direcciones drenadas para demostrar la veracidad de este punto de partida, pero visto algunos comentarios que hace en su hilo de Twitter, parece netamente menos técnico de lo que uno esperaría (recalca que el verdaderamente técnico es su progenitor), y aún tendría que aprender a firmar primero, algo que no creo que esté ahora mismo en su mente. En todo caso, por lo que comenta, Binance parece haberle dado crédito a la historia y está colaborando con él en intentar hacer algo al respecto de los fondos.Ya vimos un caso reciente  donde la historia tomaba tintes de ser inventada conforme más datos aportaba. Veremos cómo resulta este caso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 17, 2023, 12:29:48 PM",
      "body": "Quote from: Porfirii on November 17, 2023, 05:54:59 AMEspero que lo que comenta albert0bsd no sea realYo tambiem espero lo mismo, por que si suena a alguien tratando de Meter FUD.Quote from: DdmrDdmr on November 17, 2023, 06:10:45 AMYa vimos un caso reciente  donde la historia tomaba tintes de ser inventada conforme más datos aportaba. Veremos cómo resulta este caso.Si ese caso pararece mas falso, sin embargo esta por verse. Aun que son casos distintos ya que aqui si tienen acceso a sus llaves y en aquel otro no.En 2012 bitcoin no valia nada comparado con su precio el dia de hoy asi que si en este caso se estan lamentando por 25 bitcoin realmente no perdieron mucho (Hablando de la inversion inicial)Pero venga si te estas volviendo rico con 25 o otra cantidad de bitcoin que tienes desde 2012 uno esperaria que se aprenda un poco lo que se tiene entre manos, se que no todas las personas les gusta entrar en la parte tecnica de esto. Sin embargo cosas de sentido comun pueden aplicar, no poner todos los huevos en la misma canasta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "November 22, 2023, 12:25:26 PM",
      "body": "Esto es como la \"desaparición\" de los +2500 moneros de los fondos CCS.Este caso fue mucho más sangrante, pues eran fondos de la comunidad, que se guardo en un ordenador con Windows que corría un nodo publico de monero, por unos supuestos especialistas en ciberseguridad.Evidentemente si usas un ordenador sin UEFI que nunca fue conectado a internet para firmar las transacciones, tendrás algo más de seguridad que si tienes un txt con las claves privadas subida a la nube.El problema, creo, es que, inicialmente, buscamos la comodidad sobre la seguridad.Cuando este buen señor, guardo los 25 BTC su valor era escaso, y se despreocupo de ir aumentando la seguridad en consonancia con el precio.Hacerlo hubiera supuesto, crear una cartera fría, en un ordenador sin acceso a internet, salvaguardar las claves o cartera en lugar seguro y realizar la transacción a la misma.Seguramente no lo hizo, no por falta de información, conocimientos técnicos... sino por el típico, hoy no, mañana.Y es que realmente es fácil caer en eso, más cuando se tiene esa falsa seguridad que te da el olvido. Pero claro, el BTC, no es un lingote de oro guardado en el fondo de tu cajón recóndito de tu casa, sino más bien lo tienes en el fondo del buzón, o bajo el felpudo de entrada.Posiblemente quien los robo, simplemente tendría un método, más o menos sofisticado, que en este caso funciono.El tema es que creo que todos, o al menos un altísimo porcentaje de usuarios, están expuestos a estos robos, y a poco que las herramientas de los hackers empiecen a centrarse en escanear en busca de estos datos... la cosa puede ponerse peliaguda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}