{
  "id": "topic_5462155",
  "title": "BenCodie",
  "author": "BenCodie",
  "created_time": "August 05, 2023, 09:27:22 AMLast edit: December 06, 2023, 09:31:15 AM by BenCodie",
  "content": "UpdatesQuote from: BenCodie on December 06, 2023, 09:30:44 AMDays passed: 123 | Votes: 27YES votes (26, 96.2%):  | NO votes (1, 3.8%):I have just created a letter to theymos asking to give us a decision by the mixer ban cutoff date of January 1, 2024. The reason is because no mixers means less privacy, and a board to discuss security and privacy will provide a fair medium in the face of this ban.We have been waiting almost a full year for the decision on this suggestion and nothing has been said to date. It is obvious that the board is possible, or else it would have been denied by the community and potentially even by theymos too. After the mixer ban, I am starting to suspect that theymos has his hands tied by entities that are seeking to disrupt privacy. Otherwise, why would this board not be added? It is clearly in line with Bitcoin's purpose, we are clearly in an age where it takes strategy just to be safe, and bitcoin security methods are important. I hope that the community can support this letter and I hope even more than all of our voice will result in the mark of BitcoinTalk history that helped to create the board come true. Quote from: BenCodie on October 12, 2023, 11:05:26 AMDays passed: 68 | Votes: 26YES votes (25, 96%):  | NO votes (1, 4%):Recently the community has been lightly discussing some guidelines in the discussion thread. There has also been some interesting conversation about PytagoraZ's vote. I won't add any personal commentary to that one, but I do encourage those who have voted to go ahead and add their input to these two ongoing topics! It's great to see that the discussion is still ongoing there  Thank you to the recent votes who added some valuable input! I've reshuffled the quote list slightly. I have not considered it greatly, but some of the recent responses have been worth moving closer to the top. Quote from: BenCodie on October 03, 2023, 07:10:54 AMDays passed: 59 | Votes: 23YES votes (22, 95.6%):  | NO votes (1, 4.4%):We have our first no vote!Now that there is a no vote, some may look to object or discuss opposing opinions. For those looking to object or discuss votes, I enthuse you to quote the post and instead reply in the Cybersecurity & Privacy Board Request Discussion, this way this thread can remain clean and contains votes primarily.Quote from: BenCodie on August 19, 2023, 09:35:50 AMDays passed: 14 | Votes: 20YES votes (20, 100%):  | NO votes (0, 0%):The first 20 voters, thank you for sharing your vote for the Cybersecurity & Privacy board. I hope to see us all discussing this vital topic in the board soon!Since we now have 20 unique reasons/opinions from these humble members, I have made an necessary adjustment & improvement to the voting form:beforeCode:[b]What is your opinion on adding the board to BitcoinTalk?:[/b] (Answer: Please provide some insight into your reasoning/opinionafter:Code:[b]What is your opinion on adding the board to BitcoinTalk?:[/b] (Answer: Quote a member that you agree with OR share your opinion)This way, people do not have to feel pressure to leave a unique opinion when voting.-This thread is not for discussion. If you want to discuss, please visit the discussion thread.Posts which do not adhere to the rule above will be reported for deletion, though this rule excludes staff members who are commenting on the status of the request to add the board.On January 12, 2023, a request was made to add a \"Cybersecurity and Privacy\" board to the forum. After roughly 7 months, 49 votes (90.7%) voted YES to adding the board, while 5 votes (9.3%) voted NO. None of the \"NO\" votes were reasoned as far as I've read. So, I've decided to make a community vote to strengthen the basis of the vote even further.What is being requested?A board which allows community members to discuss cybersecurity and privacy practices to be able to protect themselves and their Bitcoin holdings from vulnerabilities such as hacking, tracking and theft.Cybersecurity & Privacy: Main board for discussion and questions relating to cybersecurity and/or privacyCybersecurity & Privacy > Guides: Sub-board which only includes guides relating to increasing cybersecurity and/or privacy Has this been suggested before?Yes, though it turned into a discussion thread which helped to increase the concept strength of what was being requested. So, that thread has been renamed to:Discussion of the \"Cybersecurity and Privacy\" board + Polland this community vote will act as a formal voting process based on this discussion. Why is this being requested again?The original request explored the idea within the community, gaining opinions and improving basis to form reason and structure - to-date this discussion counted:- 241 posts discussing the topic - 49 votes signaled YES to the request, 5 votes signaled NO. (throughout the discussion - votes may vary after all of the updates which is one reason for this thread)- 2,200+ viewing the discussion at some point.- 40 merits given to the original post, which details the request and supporting material.This was just a rough poll and discussion to flesh out and strengthen the idea. Over the last few months discussion and new ideas for the request have stagnated, signaling that a formal request is now ready to made (hence, this thread)Why is there no poll if this is a community vote?You need to fill in the following to make a vote:Code:[b]Your vote:[/b] (Answer: Yes / No)[b]Have you read the OP of [url=https://bitcointalk.org/index.php?topic=5434404.0]Discussion: \"Cybersecurity and Privacy\" board + Poll[/url] before posting?:[/b] (Answer: Yes / No)[b]What is your opinion on adding the board to BitcoinTalk?:[/b] (Answer: Please provide some insight into your reasoning/opinion OR quote a member whose reasoning you agree with)If you don't have a concrete opinion, it would be preferred that you refrain from voting until you do. How are votes counted?Votes will be counted in the second post of this thread. I will update that post multiple times per week. Quotes of each vote will be added to support the vote count, and quotes will be ordered by the detail given in the last question required to make the vote.What is the goal to achieve a win on this vote?The goal is to achieve 80% consensus on a reasonable amount of votes. Based on the vote results of the Discussion of the \"Cybersecurity and Privacy\" board + Poll, this shouldn't be a problem (90.7% voted YES during the 7 month period that discussion was ongoing). Please note that even if consensus is achieved, there is currently no mention by any staff member that the board will be added even if YES is the obvious consensus. An update will be posted if staff make a comment at any stage.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462155",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "August 05, 2023, 09:28:41 AMLast edit: October 12, 2023, 11:01:35 AM by BenCodie",
      "body": "Vote recordingAll votes and vote posts will be recorded here. NO votes (1, 4%):Quote from: PytagoraZ on October 03, 2023, 12:52:02 AMYour vote: NoHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: I see that if there is a board about cyberscurity then there will be discussions about hacking and it will likely analyze hacking so that people will know how to hack and how dangerous it is. I don't know about cyberscurity but if there is a chance that I will know how to hack or phish, at least maybe I will know what to learn to hackYES votes (25, 96%): Quote from: NotATether on August 08, 2023, 06:28:40 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: It will allow all online safety and privacy threads to be consolidated into one board, instead of scattered between Beginners and Help, Wallet Software and Bitcoin Discussion.Quote from: n0nce on October 03, 2023, 12:07:36 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: As I've expressed in the discussion thread since all the way back in January, we should really have a Cybersecurity board on Bitcointalk with a sub-board for Privacy. These topics only get more important as time goes on and new people enter this space with extremely limited knowledge about computers and especially about computer security.I'd love to write some newbie guides / introductions for basic concepts, as well as having discussions about latest cryptography advancements, theorize about software & hardware attacks and share privacy measures amongst each others.Quote from: BenCodie on August 05, 2023, 09:32:19 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: We are all vulnerable to losing Bitcoin's from cybersecurity or privacy related circumstances. We could be targeted indirectly by hackers who are grabbing any opportunity they can (which could be prevented by cybersecurity), or by targeted operations (which could be prevented by privacy) - and sometimes a mix of both.Quote from: lovesmayfamilis on August 05, 2023, 10:30:30 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?:  I constantly monitor topics related to Internet security. To say that you need to know a few rules that will help you stay safe is wrong. Hackers are successfully developing their hacking schemes, and it is very difficult to keep track of everything alone. It would be the right decision to discuss all similar topics on one board; this is not only convenient but also useful.Quote from: Maus0728 on October 11, 2023, 11:54:01 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: As someone starting a career in cybersecurity, it's a no-brainer to support the request for creating a security and privacy-related board in this forum. I just don't understand why others would disagree, even though security and privacy go hand in hand in terms of protecting not only our hard-earned money but also our safety.Also, this could be for selfish reasons, but having a dedicated board for this topic would benefit my career path.Quote from: MusaPk on October 03, 2023, 10:46:41 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Security is no more an after thought in todays cyberspace, everyone of us must be updated about what's happening in cyber security. For Bitcoin adopters cyber security awareness is an essential thing since there is no way you can recover your coins in case they are hacked or stolen. Right now there is lots of info regarding Bitcoin security here on forum but there is no specific place where general cyber security is discussed. A dedicated place for Cybersecurity and Privacy will be helpful specially those that are not much technology proficient.       Quote from: CryptoHeadlineNews on October 11, 2023, 02:51:57 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Just as defined by Kaspersky that \"Cyber Security is the practice of defending computers, servers, mobile devices, electronic systems, networks, and data from malicious attacks\", and yet the Bitcoin which we use today as a currency are all either stored/hodl on a computer, mobile devices and servers (i.e hardware wallets), so providing an avenue where people could learn basic cyber security measures on how to remain safe from hack will really be of great/best advantage to the entire bitcointalk community.Quote from: robelneo on August 05, 2023, 12:27:09 PMYour vote:  Yes Have you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?:It will become one of the most important sections of this forum, we all should be concerned about security in everything we do and we hold online, you cannot be a holder or part of the Cryptocurrency community without ample knowledge of Cybersecurity and privacy, hackers and scammers are good at what they do and knowing how they work and implement these things will give us good defense and protection.Quote from: Oshosondy on August 05, 2023, 12:47:52 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: If you have bitcoin, you need to have experience about cybersecurity. If you do not have the knowledge and experience about cybersecurity, your wallet can easily be compromised. I can see many threads that are created by OP or moved by a moderator to scam accusation, those topics belongs to cybersecurity not scam accusation because hack and scam are not the same.Quote from: Faisal2202 on August 05, 2023, 05:26:47 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: No Edit --> I read it nowWhat is your opinion on adding the board to BitcoinTalk?: It would be easy and helpful plus interesting too for existing and new users of BTT. I read about Data security and Encryption last year and learned how important it is for a person to know what types of attacks are there from which we would easily be saved if we knew about them. The addition of this board will make all members to do research on cybersecurity. Quote from: un_rank on August 05, 2023, 07:39:09 PMYour vote: YesHave you read the OP of Discussion: \"Cyber... before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Having a dedicated board for Security and Privacy related discussions will bring more emphasis to those subjects that are very important to Bitcoin going forward. It might not exactly prevent all victims from making costly mistakes but it is the best shot we have at making more users of the internet here (which is everyone) more security conscious.N.B: Can I suggest that the hyperlink to the discussion thread be taking out from the format. It id already linked in the OP and does not have to be in every preceding reply on the thread.- Jay -Quote from: Beparanf on August 05, 2023, 07:44:18 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?: This is essential to forum users due to multiple incidents of hacking here that involves even higher account that is very active here in the forum. It only means that despite our cryptocurrency knowledge is growing, our knowledge on how to protect our assets is still just on the basic level because there’s no board here that specifically for this kind of discussion. I fully support this request.Quote from: virasog on August 06, 2023, 02:45:28 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Cybersecurity & Privacy is a very important subject and it becomes even more important for us when we are dealing with bitcoin and cryptocurrencies as hackers are always looking for ways to exploit any loopholes in the security and hack our data/money. A new board Cybersecurity will help to create awareness among the people as how important it is to secure your system and save yourself from any financial loss.Quote from: joker_josue on August 06, 2023, 07:48:32 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Although there is more and more information about computer and online security, this must be the area in which most people apply the least in their daily lives. In a forum dedicated to Bitcoin, where privacy and security is a constant theme, it makes sense to have a space where these issues can be further analyzed.Quote from: aoluain on August 06, 2023, 07:52:30 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesYesWhat is your opinion on adding the board to BitcoinTalk?: Firstly I agree that this could actually become one of the most important boards on the forum.One of and arguably the weakest links in securing our Privacy and Bitcoin is ourselves. Obtaining all the information needed to stay safe in one central location will be extremely beneficial everyone and everyone can discuss and learn from one another.Quote from: Cricktor on August 06, 2023, 12:26:00 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: I find it preferable to have topics on cybersecurity in one place in this huge forum than having it scattered over various subforums. Having it in one place makes searching and getting updates on current trends of cybersecurity much easier. Self-custody is highly encouraged and with \"be your own bank/custodian\" makes cybersecurity a top priority for everyone who embraces self-custody. Even if you're a no-crypto-coiner, cybersecurity of your personal data still should be something of high if not top priority. Cybercrime is and will be a growing issue for everyone, every company, every state.Quote from: onecall123 on August 06, 2023, 02:42:04 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Cybersecurity and Privacy discussions in this forum will be a vital to build awareness and knowledge. Sharing insights helps individuals understand threats like phishing, data breaches, and malware. Collaborating on solutions empowers users can identify risks and strengthen their online defenses.Quote from: Dunamisx on August 06, 2023, 03:30:32 PMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk? I see this as a topic on it own which could be conveyed in any of the already existing boards which i will be listing, bitcoin discussion board, legal board, scam accusation board, reputation board and also beginners and help section, which equally means any subject matter of discussion related to cyber security could best be discussed in any of the boards mentioned depending on the other informations and matters arising om how cyber security is involved on the subject matter, this makes me feels like it's not necessary to make an additional board in that since there are more enough boards such could be well discussed, this is my opinion anyways.Quote from: Die_empty on August 06, 2023, 05:23:17 PMYour vote: (Answer: Yes / No) YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: (Answer: Yes / No) YesWhat is your opinion on adding the board to BitcoinTalk?: (Answer: Please provide some insight into your reasoning/opinion): Fraudsters and hackers are becoming innovative every day, hence there is a need to have a board that deals with cybersecurity and privacy for current discoveries and discussion. This board will specifically deal with advancement in these criminal activities, how to identify them, and protect oneself from these attacks. Most threads that deal with privacy are always buried in different topics which makes access to them difficult. A new board will make it easy for members to access this information on privacy and get the needed knowledge they are seeking for. This board will be attractive to cybersecurity experts and students of privacy and cybersecurity. Quote from: SamReomo on August 07, 2023, 04:19:06 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: NoWhat is your opinion on adding the board to BitcoinTalk?: I believe that adding such board to Bitcoin Talk can be very useful for the ones who are new into the world of crypto currencies. Understanding of cybersecurity & privacy is a must thing for everyone who is interested into Bitcoin and wants to be secure from online scammers and malicious people who can steal their coins due to their lack of knowledge in the field. Such board can be used to educate the members of the forum regarding cybersecurity and issues that can arise if someone ignores cybersecurity & privacy while delving into the world of Bitcoin. These days we can see many hackers a frauds who are successfully looting the money out of the wallets of less knowledgeable investors, and for such investors this board can be a very valuable asset.  Quote from: yhiaali3 on August 15, 2023, 10:39:51 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?:  Of course I agree. Frankly, I not only agree, but I find it urgent to add a section on cybersecurity and privacy to the forum. If you check the sections of the forum, you will find many problems related to security and privacy. This alone indicates the need for a specialized section in which all these topics are collected and become a reference. It provides an opportunity for members to discuss more important topics in this very important field.Quote from: klarki on August 15, 2023, 12:30:03 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: ..... (will be added later).Quote from: yhiaali3 on August 15, 2023, 10:39:51 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?:  Of course I agree. Frankly, I not only agree, but I find it urgent to add a section on cybersecurity and privacy to the forum. If you check the sections of the forum, you will find many problems related to security and privacy. This alone indicates the need for a specialized section in which all these topics are collected and become a reference. It provides an opportunity for members to discuss more important topics in this very important field.Quote from: cryptoaddictchie on August 16, 2023, 05:45:07 AMYour vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?: No harm I think and adding it will be served as added discussion board especially caters the need of newbies bound to protect their security. No matter how careful we are, can still be attack by harmful and threats online. Now if we have a board focuses on several topics that could enhance and improve the security aspect pertaining to blockchain then it will increase everyone's knowledge to defend and be aware of the situation on this case. Quote from: digaran on October 03, 2023, 12:37:37 AMWhat is your opinion on adding the board to BitcoinTalk?: Yes, the reason : because we are asking nicely, and because we want it? Shouldn't this be enough of a reason?We need a place to discuss in details and there are enough people with knowledge to help out bitcoiners. Most importantly because we say please.😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "August 05, 2023, 09:32:19 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: We are all vulnerable to losing Bitcoin's from cybersecurity or privacy related circumstances. We could be targeted indirectly by hackers who are grabbing any opportunity they can (which could be prevented by cybersecurity), or by targeted operations (which could be prevented by privacy) - and sometimes a mix of both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 05, 2023, 10:30:30 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?:  I constantly monitor topics related to Internet security. To say that you need to know a few rules that will help you stay safe is wrong. Hackers are successfully developing their hacking schemes, and it is very difficult to keep track of everything alone. It would be the right decision to discuss all similar topics on one board; this is not only convenient but also useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 05, 2023, 12:27:09 PM",
      "body": "Your vote:  Yes Have you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?:It will become one of the most important sections of this forum, we all should be concerned about security in everything we do and we hold online, you cannot be a holder or part of the Cryptocurrency community without ample knowledge of Cybersecurity and privacy, hackers and scammers are good at what they do and knowing how they work and implement these things will give us good defense and protection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 05, 2023, 12:47:52 PM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: If you have bitcoin, you need to have experience about cybersecurity. If you do not have the knowledge and experience about cybersecurity, your wallet can easily be compromised. I can see many threads that are created by OP or moved by a moderator to scam accusation, those topics belongs to cybersecurity not scam accusation because hack and scam are not the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 05, 2023, 05:26:47 PM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: No Edit --> I read it nowWhat is your opinion on adding the board to BitcoinTalk?: It would be easy and helpful plus interesting too for existing and new users of BTT. I read about Data security and Encryption last year and learned how important it is for a person to know what types of attacks are there from which we would easily be saved if we knew about them. The addition of this board will make all members to do research on cybersecurity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "August 05, 2023, 07:39:09 PM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cyber... before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Having a dedicated board for Security and Privacy related discussions will bring more emphasis to those subjects that are very important to Bitcoin going forward. It might not exactly prevent all victims from making costly mistakes but it is the best shot we have at making more users of the internet here (which is everyone) more security conscious.N.B: Can I suggest that the hyperlink to the discussion thread be taking out from the format. It id already linked in the OP and does not have to be in every preceding reply on the thread.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "August 05, 2023, 07:44:18 PM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: Yes What is your opinion on adding the board to BitcoinTalk?: This is essential to forum users due to multiple incidents of hacking here that involves even higher account that is very active here in the forum. It only means that despite our cryptocurrency knowledge is growing, our knowledge on how to protect our assets is still just on the basic level because there’s no board here that specifically for this kind of discussion. I fully support this request.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "August 06, 2023, 02:45:28 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Cybersecurity & Privacy is a very important subject and it becomes even more important for us when we are dealing with bitcoin and cryptocurrencies as hackers are always looking for ways to exploit any loopholes in the security and hack our data/money. A new board Cybersecurity will help to create awareness among the people as how important it is to secure your system and save yourself from any financial loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 06, 2023, 07:48:32 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Although there is more and more information about computer and online security, this must be the area in which most people apply the least in their daily lives. In a forum dedicated to Bitcoin, where privacy and security is a constant theme, it makes sense to have a space where these issues can be further analyzed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "August 06, 2023, 07:52:30 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Firstly I agree that this could actually become one of the most important boards on the forum.One of and arguably the weakest links in securing our Privacy and Bitcoin is ourselves. Obtaining all the information needed to stay safe in one central location will be extremely beneficial everyone and everyone can discuss and learn from one another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "August 06, 2023, 12:26:00 PM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: I find it preferable to have topics on cybersecurity in one place in this huge forum than having it scattered over various subforums. Having it in one place makes searching and getting updates on current trends of cybersecurity much easier. Self-custody is highly encouraged and with \"be your own bank/custodian\" makes cybersecurity a top priority for everyone who embraces self-custody. Even if you're a no-crypto-coiner, cybersecurity of your personal data still should be something of high if not top priority. Cybercrime is and will be a growing issue for everyone, every company, every state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onecall123",
      "created_time": "August 06, 2023, 02:42:04 PM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: Cybersecurity and Privacy discussions in this forum will be a vital to build awareness and knowledge. Sharing insights helps individuals understand threats like phishing, data breaches, and malware. Collaborating on solutions empowers users can identify risks and strengthen their online defenses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 06, 2023, 03:30:32 PMLast edit: August 06, 2023, 03:53:13 PM by Dunamisx",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk? I see this as a topic on it own which should not be conveyed only in any of the already existing boards which i will be listing, bitcoin discussion board, legal board, scam accusation board, reputation board and also beginners and help section, which equally means any subject matter of discussion related to cyber security could best be discussed on it boards depending on the other informations and matters arising on how cyber security is involved on the subject matter, this makes me feels like it's necessary to make an additional board in that regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "August 06, 2023, 05:23:17 PM",
      "body": "Your vote: (Answer: Yes / No) YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: (Answer: Yes / No) YesWhat is your opinion on adding the board to BitcoinTalk?: (Answer: Please provide some insight into your reasoning/opinion): Fraudsters and hackers are becoming innovative every day, hence there is a need to have a board that deals with cybersecurity and privacy for current discoveries and discussion. This board will specifically deal with advancement in these criminal activities, how to identify them, and protect oneself from these attacks. Most threads that deal with privacy are always buried in different topics which makes access to them difficult. A new board will make it easy for members to access this information on privacy and get the needed knowledge they are seeking for. This board will be attractive to cybersecurity experts and students of privacy and cybersecurity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "August 07, 2023, 04:19:06 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: NoWhat is your opinion on adding the board to BitcoinTalk?: I believe that adding such board to Bitcoin Talk can be very useful for the ones who are new into the world of crypto currencies. Understanding of cybersecurity & privacy is a must thing for everyone who is interested into Bitcoin and wants to be secure from online scammers and malicious people who can steal their coins due to their lack of knowledge in the field. Such board can be used to educate the members of the forum regarding cybersecurity and issues that can arise if someone ignores cybersecurity & privacy while delving into the world of Bitcoin. These days we can see many hackers a frauds who are successfully looting the money out of the wallets of less knowledgeable investors, and for such investors this board can be a very valuable asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 08, 2023, 06:28:40 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: It will allow all online safety and privacy threads to be consolidated into one board, instead of scattered between Beginners and Help, Wallet Software and Bitcoin Discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "August 15, 2023, 12:30:03 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?: ..... (will be added later).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 15, 2023, 10:39:51 AM",
      "body": "Your vote: YesHave you read the OP of Discussion: \"Cybersecurity and Privacy\" board + Poll before posting?: YesWhat is your opinion on adding the board to BitcoinTalk?:  Of course I agree. Frankly, I not only agree, but I find it urgent to add a section on cybersecurity and privacy to the forum. If you check the sections of the forum, you will find many problems related to security and privacy. This alone indicates the need for a specialized section in which all these topics are collected and become a reference. It provides an opportunity for members to discuss more important topics in this very important field.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}