{
  "id": "topic_5467066",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "September 17, 2023, 07:19:57 AM",
  "content": "Is Bitcoin hodling more important? well I have read a couple of post which always talk about owning Bitcoins which is definitely a good idea especially as someone in the crypto space however will hodling Bitcoin be important without proper understanding of Bitcoin and the crypto space? Of course not. Now before I got to know about Bitcoin talk I had heard a lot about Bitcoin and due to the vague information I had gotten without research I joined the group of person who thought Bitcoin was a get rich quick scheme or scam therefore I was limited by that idea. However joining this forum brought me a good sense of understanding of what the crypto space is about. Now my point is Bitcoin can always be owned as well the knowledge can also be gotten how ever it is of optimum importance to first understand Bitcoin  because; 1. Understanding Bitcoin first gives you a more solid knowledge of security. and this is very important to avoid loss of funds.2. It gives you a stronger sense of marketing especially for those who hold for sales during bull. it will give you the strategy of knowing when to sell and hodl.3. It helps you understand the power of decentralization and it's benefits to you as an investor amongst many others.Generally it takes someone with good knowledge of Bitcoin to scam or hack someone with hodlings so how can one counter Bitcoin fraud or asset loss without proper understanding of Bitcoin?lastly you can always earn Bitcoins once you have a solid knowledge of it .you can even earn Bitcoins indirectly by teaching others or even running a local exchange and lots more. so newbies out there do not rush into buying Bitcoin without first understanding  Bitcoin which can even be done by engaging in important discussions on the forum expecially those of experts and experienced investors. remember knowledge is power.Good luck mate don't forget to keep your keys safe 😁",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467066",
  "comments": [
    {
      "author": "Turn it off",
      "created_time": "September 17, 2023, 07:33:06 AM",
      "body": "Quote from: Mia Chloe on September 17, 2023, 07:19:57 AMso newbies out there do not rush into buying Bitcoin without first understanding  Bitcoin which can even be done by engaging in important discussions on the forum expecially those of experts and experienced investors. remember knowledge is power.You’re also a newbie just like me and you said something about joining discussions and yet you hardly ever reply any of your threads it looks like all you do here is to drop a topic and then move on to the next on you don’t reply to comments on your thread neither do you reply to other people threads all I see you doing here is to drop a thread behaving as if you really want newbies like myself to learn not knowing that you only just want to earn merits. Why don’t you take your one advise and join discussions yourself, remember knowledge is power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 17, 2023, 07:35:28 AM",
      "body": "Don't make it complicated, just try to understand fiat and compare it with Bitcoin, you will know the reason why you must holding Bitcoin.Quote from: Mia Chloe on September 17, 2023, 07:19:57 AMlastly you can always earn Bitcoins once you have a solid knowledge of it .you can even earn Bitcoins indirectly by teaching others or even running a local exchange and lots more.Having knowledge about Bitcoin doesn't make you able to earn, it's just a currency. What you're need to learn is a hard skill that you can work and get paid from someone e.g. design, programmer etc. No one want to use unknown local exchange that charge high fees, they prefer to use centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 17, 2023, 07:49:11 AM",
      "body": "The most basic and helpful advice I have read here for newbies that just got into bitcoin and is looking for where to start from is you don’t need to know everything about bitcoin before you can start investing, just learn how to buy and how to not lose your coins” I have forgotten who wrote this text but I feel that newbies that want to just hold bitcoin don’t need to start learning the technical part of bitcoin, just start with security and keep your coins safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 17, 2023, 07:56:12 AM",
      "body": "I couldn't understand some parts of your thread op, but in summary I guess knowledge is the best advice to anyone out there who want to go into Bitcoin investment. Without knowledge, you are exposed to potential risk which might make you regret ever using Bitcoin. A lot of people has this thinking that Bitcoin is a get rich quick scheme, but of course it isn't. You make profit from how much you invested into Bitcoin. so I still don't know why some of them still have that wrong idea about Bitcoin investment. It's very important to learn from people who are genuine experts of Bitcoin technology and not people who has just a little idea of it and goes out there impacting the wrong information about Bitcoin to other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 17, 2023, 07:56:52 AM",
      "body": "It's a bit of a weird question to be honest. It's like asking is it better to have knowledge of how to be healthy or being healthy? What good does knowing the theory of how to live and stay healthy do to you if you are sick, unhealthy, and dying? Very little. If you are talking from a take-profit perspective, it's easy for you to see if your investment brought you profit without much underlying knowledge. For anything more serious, you are going to have to understand the theory and the reasons everything works and is set up the way they are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 17, 2023, 08:03:36 AM",
      "body": "Quote from: Solosanz on September 17, 2023, 07:35:28 AMDon't make it complicated, just try to understand fiat Having knowledge about Bitcoin doesn't make you able to earn, it's just a currency. What you're need to learn is a hard skill that you can work and get paid from someone e.g. design, programmer etc. Maybe having a little knowledge about bitcoin could give you an edge too. Take for example knowledge on cryptocurrency. You could make money by participating on some campaign, testnet or airdrops. So its not a total waste in my opinion. But you are right its just a currency amyway and to learn skills is what we must have prioritize to grow and make money out of it. But deepining your knowledge extensively aside from the skills will make your time worth more while in earning those money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "September 17, 2023, 08:12:15 AM",
      "body": "Quote from: Turn it off on September 17, 2023, 07:33:06 AMQuote from: Mia Chloe on September 17, 2023, 07:19:57 AMso newbies out there do not rush into buying Bitcoin without first understanding  Bitcoin which can even be done by engaging in important discussions on the forum expecially those of experts and experienced investors. remember knowledge is power.You’re also a newbie just like me and you said something about joining discussions and yet you hardly ever reply any of your threads it looks like all you do here is to drop a topic and then move on to the next on you don’t reply to comments on your thread neither do you reply to other people threads all I see you doing here is to drop a thread behaving as if you really want newbies like myself to learn not knowing that you only just want to earn merits. Why don’t you take your one advise and join discussions yourself, remember knowledge is power.  As a newbie you should have noticed you will understand better when you avoid unnecessary posts , read more  and ask questions why repeat something when more than 15 persons have said same thing and besides discussions are to improve understanding no to be abused as a group chat that you reply all messages For the record I do reply post but I only do so when I deem necessary",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 17, 2023, 08:29:43 AM",
      "body": "Quote from: Mia Chloe on September 17, 2023, 07:19:57 AMGenerally it takes someone with good knowledge of Bitcoin to scam or hack someone with hodlingsThat is not exactly true all the time, let's say you expose your seed phrase or private key, anybody with even the smallest knowledge of BTC would be able to import your wallet into their local device and spend your funds. But in a more difficult attack, take note that all the hacker needs is your keys or seed phrase, so they don't have to be BTC geniuses, they simply have to be skilled in hacking and social engineering to be able to compromise your device and steal that keys. Were BTC knowledge will come in for the attacker is in how and where they move the funds and if they are able to never connect the stolen funds to their identity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Turn it off",
      "created_time": "September 17, 2023, 08:31:07 AM",
      "body": "Quote from: Mia Chloe on September 17, 2023, 08:12:15 AMQuote from: Turn it off on September 17, 2023, 07:33:06 AMQuote from: Mia Chloe on September 17, 2023, 07:19:57 AMso newbies out there do not rush into buying Bitcoin without first understanding  Bitcoin which can even be done by engaging in important discussions on the forum expecially those of experts and experienced investors. remember knowledge is power.You’re also a newbie just like me and you said something about joining discussions and yet you hardly ever reply any of your threads it looks like all you do here is to drop a topic and then move on to the next on you don’t reply to comments on your thread neither do you reply to other people threads all I see you doing here is to drop a thread behaving as if you really want newbies like myself to learn not knowing that you only just want to earn merits. Why don’t you take your one advise and join discussions yourself, remember knowledge is power.  As a newbie you should have noticed you will understand better when you avoid unnecessary posts , read more  and ask questions why repeat something when more than 15 persons have said same thing and besides discussions are to improve understanding no to be abused as a group chat that you reply all messages For the record I do reply post but I only do so when I deem necessary Counting the post in the first page in your post history I discovered that out of 20 posts 14 are new threads, so how does that shows that you’re interacting with your threads? I think it’s now obvious what you’re trying to do here which is to fish merit by masking yourself as if you have newbies in mind, I am sure you’ll still come up with a different topic before the day runs out and let me guess the new title will be “never give up newbie” or “tips on how to survive and achieve legendary rank as a newbie” meanwhile you have just 11 merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "September 17, 2023, 08:50:35 AM",
      "body": "On the subject that you made an op, I think that Knowledge and Holdings are they against each other? or should they be resisted? This is what came to me in the title you made. As if the title you explained is not correct.Because I think knowledge is needed in holdings. If you don't have knowledge of a cryptocurrency asset that you want to hold, the coins that you choose will surely be a useless garbage. But if you have knowledge about Bitcoin or other crypto you can choose the right coins that you want to hold.It's easy to hold, the hard part is that you don't know if the asset you're holding is right because you have no knowledge of it. Did you get my point op?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "September 17, 2023, 08:59:32 AM",
      "body": "For me, knowledge is every thing in life. It's a fools way when you think that money is everything, let me explain.You can easily get your hand on some hefty money, and mismanage everything.You can have money and decide that you will invest in coin and go to any crypto exchange and get scammed.You can also visit a popular exchange and buy Bitcoin for a higher price than it is presently. You lack one thing in common, that's Knowledge.  Nothing beats knowledge in this life, it's like a horse that moves you around from one location to another, and if the horse is not feed well it will grow weaker and thinner. Nurture your knowledge from time to time, you will grow bigger than those who feel like they are already filled with enough Knowledge because Knowledge is unlimited. I will like to strongly advise readers to love learning more than anything else, because everything else should come after Knowledge, know this and nurture yourself in knowledge,  then see yourself grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "September 17, 2023, 09:16:05 AM",
      "body": "Quote from: Cantsay on September 17, 2023, 07:49:11 AMThe most basic and helpful advice I have read here for newbies that just got into bitcoin and is looking for where to start from is you don’t need to know everything about bitcoin before you can start investing, just learn how to buy and how to not lose your coins” I have forgotten who wrote this text but I feel that newbies that want to just hold bitcoin don’t need to start learning the technical part of bitcoin, just start with security and keep your coins safe. Totally agree, before dealing with the complexities of the matter getting into it first should be the one that they should worry about because they haven't even tried it yet, it's like cooking, you don't have to worry about the spices and how long you're going to mix it, ready your mise en plus and start the fire first. The thing that they should always remember as a newbie is that deal with it when you're finally encountering it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "September 17, 2023, 09:17:17 AM",
      "body": "If you have means to acquire bitcoin despite not having knowledge yet, you should do it because owning bitcoin will not limit you from acquiring the knowledge but having knowledge without owning a bitcoin is as good as nothing. It's actually important to seek for the knowledge of what you are about to invest in but you don't necessarily need to know everything before you begin to invest and own a bitcoin. You can not know it all no matter how you learn but you will begin to understand how it works gradually since you already invested and you won't like to be ignorant of what you're holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 17, 2023, 09:32:15 AM",
      "body": "Quote from: Mia Chloe on September 17, 2023, 08:12:15 AMAs a newbie you should have noticed you will understand better when you avoid unnecessary posts , read more  and ask questions why repeat something when more than 15 persons have said same thing and besides discussions are to improve understanding no to be abused as a group chat that you reply all messages For the record I do reply post but I only do so when I deem necessary They made a reasonable remark to you, but you snapped back and did not continue the discussion with other users. I also consider all your posts to be just ordinary fishing, but I in no way blame you. If on topic, then I disagree. So what if a person knows that Bitcoin is cool but, in reality, will not be able to practice with it? Practice is always important for me. A person can invest in Bitcoin with a minimum of knowledge, including the storage rule, and then use DCA, again learning how to avoid mistakes during transactions. And in the meantime, at your own discretion, study certain aspects of crypto, in particular Bitcoin. I liked the health comparison. What would you personally prefer: knowledge about health or having health?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 17, 2023, 09:38:40 AM",
      "body": "Never invest anywhere or in any asset without having a proper knowledge. At the end of the day it’s your hard earned money which is being invested. So if you don’t do proper research on the platform where you investing or in the asset in which you are investing , then definitely there is chances that you might lose the money. So yes in case of Bitcoins this also applies. So before buying any Bitcoins, it is a must to acquire knowledge about it. How Bitcoins works, how to buy, how to store them safely, where to buy, these are the basic things that you need to know at least in order to start investing in Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "September 17, 2023, 09:38:49 AM",
      "body": "Knowledge and holding (wealth) complete each other. A person may have lots of wealth but if he doesn't have any knowledge, he will soon spend his wealth on the stupid stuff which he don't really need about and then he will end up poor. A wise guy on the other hand, knows how to manage risk and he is definitely not going to buy the stuff he won't really need. So when it comes to bitcoin, a person that is well informed about bitcoin will definitely hold is for a long time because he really understands what bitcoin is all about. Power without knowledge is never a good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "September 17, 2023, 10:22:05 AM",
      "body": "Quote from: mindrust on September 17, 2023, 09:38:49 AMKnowledge and holding (wealth) complete each other. A person may have lots of wealth but if he doesn't have any knowledge, he will soon spend his wealth on the stupid stuff which he don't really need about and then he will end up poor. A wise guy on the other hand, knows how to manage risk and he is definitely not going to buy the stuff he won't really need. So when it comes to bitcoin, a person that is well informed about bitcoin will definitely hold is for a long time because he really understands what bitcoin is all about. Power without knowledge is never a good thing.This is the thought of a person who understands how he has a future. Because his life is not only one or two days. But it turns out that many people who choose it to become king in one day and have a hard time when everything is up. Overwhelming temptation makes people who lack lustful resistance prone to this mistake. So I totally agree with your opinion that knowledge becomes a major factor in making decisions.  But there are indeed some knowledge that will be outweighed by important needs, even I always think about withholding. But I always give up when an important need related to life comes along and I don't have any more money, I will take it off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "September 17, 2023, 10:47:43 AM",
      "body": "Quote from: Mia Chloe on September 17, 2023, 08:12:15 AMAs a newbie you should have noticed you will understand better when you avoid unnecessary posts , read more  and ask questions why repeat something when more than 15 persons have said same thing and besides discussions are to improve understanding no to be abused as a group chat that you reply all messages For the record I do reply post but I only do so when I deem necessary There is nothing wrong with every comment that has been given by several users before you reply like this.I appreciate anyone's posts, including yours, as long as the message written can invite active discussion that is in harmony with the situation and is in accordance with the subject that does not deviate.Honestly, before creating a topic, first make sure what the content will be written so that readers can understand it well.Not too much knowledge about bitcoin is also not a problem. The knowledge in question is about the advantages of bitcoin (functions and uses) which can make it easier for someone when there is FUD directed at bitcoin by people who hate bitcoin. The rest is about the technicalities of securing bitcoins in the wallet used.For me personally, such knowledge about bitcoin is sufficient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "September 17, 2023, 11:10:20 AM",
      "body": "Quote from: Mia Chloe on September 17, 2023, 07:19:57 AM1. Understanding Bitcoin first gives you a more solid knowledge of security. and this is very important to avoid loss of funds.For my case, this is not the first thing that I learned, but eventually, I understand the difference between custodial and non-custodial wallet. And from then on, I study about security and safety hygiene on how to protect your wallet and your bitcoin.Quote from: Mia Chloe on September 17, 2023, 07:19:57 AM3. It helps you understand the power of decentralization and it's benefits to you as an investor amongst many others.Decentralization though might be an overstatement, we have heard it a lot in the beginning and we thought that this might be the reason why people are into Bitcoin and crypto in general. But once Bitcoin become a investment scheme, a store of value, money, then it changes the complexion of decentralization. The priority now is how to make more money since it's already a class asset, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}