{
  "id": "topic_5411190",
  "title": "Cubus",
  "author": "Cubus",
  "created_time": "August 25, 2022, 03:12:30 PM",
  "content": "Dear Bitcointalk Community!ZenPulsar is here offering an outstanding offer for the real Crypto-enthusiasts.ZenPulsar is a groundbreaking AI training platform with an increadible potential. But without a community like you, we are unable to develop further. ZenPulsar hires crypto experts to train our AI recognition of Crypto Tweets. Those who speak following languages are urgently needed:- Japanese- Italian- Spanish- French- Arabic- Portuguese- Polish- Tagalog- Turkish- KoreanThe task contains these activities: • To look through the database of tweets on our platform • To mark them as relevant or irrelevant Those who apply for this task will have an access to our community trainings and will be generously rewarded!If you are interested and have a fluent/native command of one of these languages, please fill this form below:https://forms.gle/xNhEGhUBCahf4idi6Please reply in comments after you have completed the form so we could contact you quicker",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411190",
  "comments": [
    {
      "author": "inthelongrun",
      "created_time": "August 25, 2022, 03:18:31 PM",
      "body": "Hi! Since I am not busy nowadays I can handle the Tagalog language. I already completed the form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 25, 2022, 03:32:01 PM",
      "body": "Hello ZenPulsarI already completed the form.Username: Kavelj22Language: Arabic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "r_victory",
      "created_time": "August 25, 2022, 03:32:56 PM",
      "body": "I can help you with Portuguese, it's my native language. I also do translations from English to Portuguese or vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamich124D",
      "created_time": "August 25, 2022, 03:48:54 PM",
      "body": "Hey i have already filled the form.can do the french language.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "August 25, 2022, 03:53:03 PM",
      "body": "Looks like an interesting project to work withI can fill a spot, my native language is PortugueseAlready filled the form",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zalima Zohair",
      "created_time": "August 25, 2022, 03:58:02 PM",
      "body": "Quote from: Cubus on August 25, 2022, 03:12:30 PM Those who apply for this task will have an access to our community trainings and will be generously rewarded!This space is not for making promises. You have to specify the payment method and the currency to be used. If you are going to use a currency other than Bitcoin, you are in the wrong section.Since you don't have a previous trade history, better to escrow the funds pool.The reputation of your project and the credibility of your offer are linked to these details.Last Note: There is no point in posting this offer to all local sections because they will all be deleted as soon as the moderators notice it.I think it would be a good idea for you to check the forum rules before continuing to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PaulBf1",
      "created_time": "August 25, 2022, 04:16:19 PM",
      "body": "Form filled. looking forward to hear from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "August 26, 2022, 10:02:25 PM",
      "body": "Looks promising! I already filled out the form! I hope to be able to contribute to the project!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 26, 2022, 10:30:06 PM",
      "body": "I’m very interested in your offer of hiring, i already filled your form to join.I can do both arabic and french if i get accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PaulBf1",
      "created_time": "August 27, 2022, 12:43:52 AM",
      "body": "Has anyone been contacted yet ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}