{
  "id": "topic_5425000",
  "title": "ChillyMatthew",
  "author": "ChillyMatthew",
  "created_time": "December 01, 2022, 12:16:32 PM",
  "content": "GM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.Since I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  Source: https://app.getresponse.com/view.html?x=a62b&m=BVGySe&mc=9I&s=BtgXWnG&u=QcLhh&z=EShzGUd&",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425000",
  "comments": [
    {
      "author": "Bitstar_coin",
      "created_time": "December 01, 2022, 02:09:22 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.Since I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  Source: https://app.getresponse.com/view.html?x=a62b&m=BVGySe&mc=9I&s=BtgXWnG&u=QcLhh&z=EShzGUd&As far as I know, only Binance has come out to announce their proof of reserve idea - in fact, I think they are the first to come up with this, so I don't know why you are saying 'several'.I don't think users have any choice but to deal with exchanges even if they can not trust them enough, but this is just my opinion because despite what happened some people will still not find it necessary to store their funds in their personal wallet, users are as guilty as the exchange.If people can use exchanges the way they should be used such an incident will not occur, exchanges are created to enable investors buy their desired crypto and store it in personal wallets not use the exchange as their personal wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "December 01, 2022, 02:12:11 PM",
      "body": "At least though it's better to see how big their wallet is, as far as supporting the trades 24x7.And I do agree that it is not the perfect solution, and only top tier exchanges can do this. As far as trust goes, it's subjective, so we shall see, still open for debate.Even coinmarketcap added something like \"confidence\" in exchanges in their rankings.https://coinmarketcap.com/rankings/exchanges/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "December 01, 2022, 03:06:08 PM",
      "body": "Announcing proof of reserve would be a plus to those who would but we just cannot demand for it. Best thing is to do our part of responsibility such as not storing huge amount in exchangers treating it like a wallet. Also, from being in this industry for years, this is the first time I've saw an actual negligence from exchanger's end so I think it would be wrong to generalize the situation for it would just complicate things. Risk is always involved in this industry and losing is a part of it. So if you cannot endure things (i'm not normalizing what happened), or even look with the possibility, then investments might probably not suit you. Quote from: Bitstar_coin on December 01, 2022, 02:09:22 PMQuote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.Since I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  Source: https://app.getresponse.com/view.html?x=a62b&m=BVGySe&mc=9I&s=BtgXWnG&u=QcLhh&z=EShzGUd&As far as I know, only Binance has come out to announce their proof of reserve idea - in fact, I think they are the first to come up with this, so I don't know why you are saying 'several'.I don't think users have any choice but to deal with exchanges even if they can not trust them enough, but this is just my opinion because despite what happened some people will still not find it necessary to store their funds in their personal wallet, users are as guilty as the exchange.If people can use exchanges the way they should be used such an incident will not occur, exchanges are created to enable investors buy their desired crypto and store it in personal wallets not use the exchange as their personal wallets. Im one with this side. I'd choose to make the adjustment as an investor because that's the right thing to do than to try seeking for changes from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "December 01, 2022, 04:03:58 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.The exchange site operational cost was a lot and relying from the fees will not be enough to keep the exchange site alive for long term. Doing diversification was a must but the exchange site wanna get instant return and that's why most of them were using client's fund for debt, re investing or etc. The problem is exchange site like ftx was using too much user's money. that was draining liquidity. Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMSince I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. You'r not missing something. The blockchain itself was transparent but the exchange site itself didn't wanna try to reveal the reserved funds owned by exchange site. Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMIs PoR actually enough after all that has happened so far?  It's enough as long as the exchange site wanna publish the place that being used to store the reserved funds. At least we can track it easily and know what has been happening with reserved funds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "December 01, 2022, 04:12:42 PM",
      "body": "Yes if they will submit the PROPER PoR that records all information including assets and liabilities of exchange. Most of the exchange only provides there balance on there hot wallet which is not enough basis that they are really holding enough funds to cover all users balance 1:1. Remember that FTX issue arise when there balance sheet is already not enough to cover user balance 1:1 after one of there biggest investors remove there investment.This information should be given too as subsequent documents to PoR to verify if the reserves is still sufficient or not. Current CEX PoR is useless and just a props to quench the doubt and curiosity of all there user. CZ introduced a fancy merkle tree for this but still not enough to explained the complete balance sheet of Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "December 01, 2022, 04:16:51 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.Since I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  Source: https://app.getresponse.com/view.html?x=a62b&m=BVGySe&mc=9I&s=BtgXWnG&u=QcLhh&z=EShzGUd&Since Proof of Reserve is a new thing it would be too soon to say whether it is enough to regain user trust.It also depends on what is the proof of reserve and it's significance on the users.But I must say that Binance has played it really smart. They have gone to the safer side with the PoR.It is at least better than no audit at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 01, 2022, 04:35:55 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMIs PoR actually enough after all that has happened so far?  Of course we can't get enough, maybe for the meantime we see that it creates an assurance that it has transparency but if issue arise, people will doubt it. Overall the solution will be monopolized by the government by implementing a regulation to these centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 01, 2022, 07:00:12 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this. Proof of reserve is a good idea and Binance has already implemented this to show their liquidity to their users. That worked well for them! I am not sure if anyone else is doing that, but if other exchanges are planning to follow the same, that will be great! However, that's not the only indicator you should rely on. It doesn't show their debt in the market. It doesn't show where they have invested their money. It doesn't show how quickly they can liquidate their investment if needed. In order to achieve complete control of your funds, either move to a decentralized exchange that doesn't hold your fund, or stop keeping your funds in the exchange wallet. As simple as that!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "December 01, 2022, 07:20:00 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMIs PoR actually enough after all that has happened so far?  No, I think PoR alone is not enough to gain user trust, did you know that some time ago there was information that stated that various exchanges formed a coalition to lend and borrow funds for PoR purposes? Because of that, PoR alone is not enough, exchanges need to also make their PoL (Proof-of-Liability) reports, with the combination of PoR and PoL, I think it will be enough to gain users' trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "December 01, 2022, 08:53:54 PM",
      "body": "And who will say if they have PoR or not? CZ? doesn't make sense because he has his own exchange and the numbers he is putting on his controlled coinmarketcap as far as the ratings of exchanges are not to be trusted.So it's either we trust the exchange that we are using right now or not and move to others, simply as that.PoR wouldn't add anything to us, at least that's how I see this all PoR that exchanges are trying to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "December 01, 2022, 08:58:40 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMSince I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  This is not enough of course but knowing the PoR from CEX can at least give you peace of mind but again, it is still not advisable to hold too much money on any exchanges because the worst can still happen and that PoR might not be enough to cover all the losses. We have to learned from happened to FTX and other exchanges before, holding crypto on any exchanges for long term is not safe, so start using hard wallet now or other cold wallet where you have control, exchanges seems to be more risky in long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "December 01, 2022, 09:03:00 PM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.Since I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  I also noticed recently that coinmarketcap added the parameter \"exchange reserve funds data available\" on their list of exchanges after a few of the big exchanges like Binance, KuCoin and Bitfinex have published their reserve funds. So i can imagine that if a new person joins the crypto space and is looking for an exchange to buy it's tokens then it could definitely make the difference if a exchange has published their reserve funds. As you already said though i don't think that there is a way to make 100% sure though that those reserve funds are really owned completely by the exchagnes itself or if there are also some coins of their users contained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "December 01, 2022, 09:19:09 PM",
      "body": "Quote from: MAAManda on December 01, 2022, 07:20:00 PMQuote from: ChillyMatthew on December 01, 2022, 12:16:32 PMIs PoR actually enough after all that has happened so far?  No, I think PoR alone is not enough to gain user trust, did you know that some time ago there was information that stated that various exchanges formed a coalition to lend and borrow funds for PoR purposes? Because of that, PoR alone is not enough, exchanges need to also make their PoL (Proof-of-Liability) reports, with the combination of PoR and PoL, I think it will be enough to gain users' trust.Aside from this, they must also provide a high quality security on their platform and gives a guaranteed return if the platform got hacked, just like the other site who are paying the money they’ve loss from previous hacking incidents. Also, PoR should not be your basis on choosing the exchange you must still look for other details of the site because that PoR can be manipulated so to avoid any trust issue again, better to be more open and tell the public about your safety protocols and plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 01, 2022, 11:07:11 PM",
      "body": "I don't think we can call it trust with this Proof of Reserved concept.I mean even Tether has been accused in the past and up to now, that they are running on fractional reserves and yet they continue to stand up despite this huge accusations against them. So same with exchanges for me, if you have trust lets say Binance in the past and you don't have any bad experience with them, then definitely you are not affected by this whole PoR and you will continue to trade with them no matter what, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 01, 2022, 11:46:07 PM",
      "body": "PoR is a must and a very basic obligation of every exchanges and investment platform. It shouldn't be considered a game changer or additional favour platforms are having with their customers. Transparency and honesty are basic concepts of every kinds of businesses and human relationships.Only time is going to make users regain trust on such services. People need to see these exchanges working and delivering everything they promise, despite the negative situation of crypto market, so they can feel safe to trust their funds to these services once more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "December 01, 2022, 11:49:35 PM",
      "body": "After binance opened up the idea of Proof of reserves on a very intriguing timing which when FTX is doomed to fall because of mismanagement and the funds that are supposed to be in their exchange. People will obviously realize how important it is for a centralized exchange to be transparent to their customers by atleast showing their current assets. I believe that Binance revealed the idea at a very convenient timing given that people will lose trust to centralized exchange after the incident, CZ is ready to be the first who will reveal their current assets to gain the trust of those FTX users who got scammed by FTX. A very good business move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "December 01, 2022, 11:57:06 PM",
      "body": "Honestly, we can't really do something about it if exchanges won't show proof of their reserve following the crash of FTX.This is something that we can't demand on big exchanges.What to do now? Follow the basic rule of thumb where just use the exchange service and don't make it your personal wallet to store your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 02, 2022, 01:17:07 AM",
      "body": "Quote from: ChillyMatthew on December 01, 2022, 12:16:32 PMGM crypto fam. Happy December! I've seen that several exchanges are trying to increase client transparency after the FTX crash by disclosing their Proof of Reserves. Since there is no way to determine whether the exchange is not using client funds to cover hidden debt or anything, I personally don't buy any of this.Since I'm genuinely unsure of whether I'm missing something, I figured I might get some helpful insights from more experienced people here. Is PoR actually enough after all that has happened so far?  For people like myself and many others nothing they do is ever going to be enough, I have never trusted exchanges and the many problems I have witnessed over the years have convinced me that I have always been right about them, and I am sure many people now think the same way I do, however there are many other people which will let themselves be convinced once again to deposit their money long term with them, and eventually some of them will lose their coins once an exchange go through a similar experience again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wahyuihib",
      "created_time": "December 02, 2022, 01:32:49 AM",
      "body": "Indeed, when viewed from the point of view of Proof of Reserves, it is to give more confidence to investors and their customers so that they believe that this exchange still has reserve funds.  This seems to be a very effective way of letting clients know more about the exchanges they trade on",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}