{
  "id": "topic_5453061",
  "title": "xDeFixSolutionSx",
  "author": "xDeFixSolutionSx",
  "created_time": "May 17, 2023, 10:48:09 AMLast edit: December 28, 2024, 11:51:47 AM by xDeFixSolutionSx",
  "content": "OUR LATEST PROJECTWORLD LATEST UPDATES",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453061",
  "comments": [
    {
      "author": "robelneo",
      "created_time": "May 22, 2023, 01:46:44 PM",
      "body": "Very interesting I hardly see WordPress exclusively for blockchain products.I just want to ask what are the plugins associated with this theme Who will host it you or your client, some key points or information are missing like do you have documentation or a live preview and what is the price range?Giving more information will get more people to have an interest in what you're offering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xDeFixSolutionSx",
      "created_time": "May 24, 2023, 03:00:33 PM",
      "body": "Quote from: robelneo on May 22, 2023, 01:46:44 PMThanks for asking me for it. Very interesting I hardly see WordPress exclusively for blockchain products.I just want to ask what are the plugins associated with this theme Who will host it you or your client, some key points or information are missing like do you have documentation or a live preview and what is the price range?Giving more information will get more people to have an interest in what you're offering. >WordPress ---- it is not exactly WordPress. it is our token management system that does tokens the same that WordPress does to text. Analogy.>Plugins ---- There are no plugins there. We use material UI from Google that comes with light and dark themes and of course, we will apply customers' colors to it.>Are you going to host it yourself or will your client host it? ---- A client will have full control over the code>There are some key points or information that is lacking, such as documentationwe have some description of our system from the admin's, user's and developer's perspective. it is not full but we continue to work on it I can provide you Github Link in DM.> live preview---- sure we have live demo of market, we also can give a preview of admin part.>What is the price range?---- The system is modular so you can have only the parts you need, on our price calculator, I can also give you a discount for services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 24, 2023, 09:39:29 PM",
      "body": "Quote from: xDeFixSolutionSx on May 24, 2023, 03:00:33 PM>WordPress ---- it is not exactly WordPress. it is our token management system that does tokens the same that WordPress does to text. Analogy.>Plugins ---- There are no plugins there. We use material UI from Google that comes with light and dark themes and of course, we will apply customers' colors to it.I'm a WordPress user and I just assumed that it's a WordPress theme but since it's not you could change the title to a Wordpress-like script for Blockchain products because when you mentioned WordPress it's always a theme or a plugin.Maybe you could include a live product or documentation for your potential clients.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xDeFixSolutionSx",
      "created_time": "May 29, 2023, 11:57:17 AM",
      "body": "Quote from: robelneo on May 24, 2023, 09:39:29 PMI'm a WordPress user and I just assumed that it's a WordPress theme but since it's not you could change the title to a Wordpress-like script for Blockchain products because when you mentioned WordPress it's always a theme or a plugin.Maybe you could include a live product or documentation for your potential clients. We created a constructor of blockchain products and we can develop products of any complexity just for 50 days! Soon I will post here video explainer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "prolecge",
      "created_time": "August 11, 2023, 09:49:19 AM",
      "body": "Gather Necessary Information:Before initiating the account closure process, make sure you have all the essential information at hand. This includes your account number, customer ID, registered mobile number, and email address linked to your account. Having these details readily available will streamline the closure process.Log in to Net Banking:Access HDFC Bank's official website and log in to your net banking account using your customer ID and password. If you haven't registered for net banking, you'll need to do so before proceeding.Navigate to the Account Closure Section:Once you're logged in, navigate to the 'Requests' or 'Service Requests' section. Here, you should find an option related to account closure or account-related requests.Initiate Closure Request:Select the 'Close Account' option. The bank's system Bank of Baroda Zero Balance Account will likely prompt you to provide a reason for closing the account. Choose the appropriate reason from the provided options. This step is essential for the bank to gather feedback about their services.Verify Your Identity:To ensure the security of your account closure, the bank may ask you to verify your identity. This could involve answering security questions, providing OTPs (One-Time Passwords) sent to your registered mobile number, or using any other authentication method the bank has implemented.Fill Out Closure Form:You might be required to fill out an online account closure form. This form could include details such as your name, account number, reason for closure, and any other necessary information. Carefully fill out the form, double-checking all the information you provide.Confirm Closure Details:Before submitting the closure request, carefully review all the details you've entered. Ensure that your account number, contact details, and the reason for closure are accurate. Making errors at this stage could lead to delays in the closure process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xDeFixSolutionSx",
      "created_time": "December 28, 2024, 11:51:59 AM",
      "body": "daily up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}