{
  "id": "topic_5476226",
  "title": "Crypto Library",
  "author": "Crypto Library",
  "created_time": "December 01, 2023, 06:14:24 PM",
  "content": "The news has already arrived.  Moreover, as a result of using mixing services or making transactions with any wallets connected to mixing services, their wallets are going under the tracing i.e. blacklist. So my question is that those who are concerned about the privacy of the amount of funds in their wallet or the amount of the transaction from their wallet or the transaction in which wallet, what should they use so that they are not open to everyone? Because I think that anyone would like to make their personal funds visible to the people around them or third-party people. Since the use of mixers may face various problems, what can be used as an alternative? Looking for both your opinion and suggestion on this 0_0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476226",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 01, 2023, 06:22:05 PM",
      "body": "This thread is a little the similar to this thread: best coinjoin walletsBecause this forum wants to ban mixers does not mean mixers are not existing anymore.You can also be converting bitcoin to monero and back to bitcoin on decentralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "December 01, 2023, 06:34:48 PM",
      "body": "Quote from: Charles-Tim on December 01, 2023, 06:22:05 PMThis thread is a little the similar to this thread: best coinjoin walletsBecause this forum wants to ban mixers does not mean mixers are not existing anymore.You can also be converting bitcoin to monero and back to bitcoin on decentralized exchanges.I'm trying to wrap my head around this suggestion as it is something I never thought about could be possible. First what are the decentralized exchanges where this can be done? With this new developments, we have to seek alternatives to get things done will ensuring safety. At this point, it is becoming increasingly difficult knowing what the future of Bitcoin will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 01, 2023, 06:38:27 PM",
      "body": "The forum never questioned the legality of crypto-currency mixer nor did they say anyone should stop using crypto-currency mixer in it's entirety but rather the forum would no longer associate with crypto-currency mixer, this rule/restrictions only apply on the forum.If you had ever used mixers you can still continue to do so outside the forum in all honesty there is no alternative that can come very close to being similar to crypto-currency mixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "December 01, 2023, 07:05:13 PM",
      "body": "It's just about to ban mixers from the forum, not totally banned all over the Internet. It's a different question if a legal authority shuts down a mixer. But it seems theymos want to restrict any activities related to mixers, and he is going to take action against users who redirect with mixer links. This means you can still use the mixer outside of the forum. You have to find yourself on the internet if you really want to use it. However, since the forum implemented rules against us, we should follow those rules. You have to avoid posting mixer links to avoid a ban. The forum will not force you to leave it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 01, 2023, 07:18:04 PM",
      "body": "Quote from: adultcrypto on December 01, 2023, 06:34:48 PMI'm trying to wrap my head around this suggestion as it is something I never thought about could be possible. First what are the decentralized exchanges where this can be done? You can do this on any DEX that supports BTC/XMR conversion pairs. I believe you should be able to find at least one decentralized crypto exchange on your own.Quote from: adultcrypto on December 01, 2023, 06:34:48 PMWith this new developments, we have to seek alternatives to get things done will ensuring safety. At this point, it is becoming increasingly difficult knowing what the future of Bitcoin will be. I'm not sure I understand the connection between crypto mixers and personal safety.  Using tools to increase privacy doesn't inherently make someone a criminal. however, we can hardly consider mixers as the determining factor for Bitcoin's future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 01, 2023, 07:37:16 PM",
      "body": "They will still exist but if you don't want to use them anymore, what's another good alternative is just to convert it to any privacy coin. But here's the catch, the governments are also cracking them and exchanges that will hot on the eyes of the regulators that have its support will have to delist it before they get sanctioned based on the rules they set for listing it. While we're all fine with all of these stuff as if we're not affected at all, this is something that tackles and targets our privacy matters and concerns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "December 01, 2023, 08:20:14 PM",
      "body": "Quote from: Crypto Library on December 01, 2023, 06:14:24 PMSo my question is that those who are concerned about the privacy of the amount of funds in their wallet or the amount of the transaction from their wallet or the transaction in which wallet, what should they use so that they are not open to everyone? Because I think that anyone would like to make their personal funds visible to the people around them or third-party people.Wasabi Wallet, Trezor, and BTCPay Server all offer non custodial coinjoin transactions that completely protect your privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "December 01, 2023, 08:25:46 PM",
      "body": "I don't think many of you understand what is going on, the forum is banning mixers in its entirety, but it does not mean that mixers cease to exist, you just cannot send people links to mixers or tell them mixers to use in this forum, you have to look for mixers you want to use elsewhere other the forum. The OP sounds like mixers no longer exist and we now need another alternative. BTW mixers are not illegal:QuoteA cryptocurrency mixing service is not necessarily illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 01, 2023, 08:33:54 PM",
      "body": "Quote from: adultcrypto on December 01, 2023, 06:34:48 PMFirst what are the decentralized exchanges where this can be done? With this new developments, we have to seek alternatives to get things done will ensuring safety. At this point, it is becoming increasingly difficult knowing what the future of Bitcoin will be. You can check out the below list to see Dex exchanges, some exchange in the list are centralized but KYC is optional it’s better to avoid them though.Quote from: Wind_FURY on August 31, 2019, 09:26:46 AMQuoteBisq client [NO KYC]https://bisq.network/HodlHodl [NO KYC] Not available in the U.S.https://hodlhodl.com/LocalCoinSwap [OPTIONAL KYC (i.e., your listing, your terms)]https://localcoinswap.com/Local Lightning [NO KYC] (Launched, April 2019)https://www.locallightning.net/Moontrade [NO KYC]https://www.moontrade.org/buy.phpCounter.Network [OPTIONAL KYC]https://counter.network/Wall Of Coins [NO KYC]https://wallofcoins.com/Payfair [NO KYC]https://payfair.io/BuyCrypto.Today [NO KYC]https://buycrypto.today/BitQuick [NO KYC (when trx amount is under $400)]https://www.bitquick.co/buyTotalcoin mobile app [NO KYC (other than phone number verification)]https://totalcoin.io/buy-sell-bitcoinMycelium Local Trader mobile app [NO KYC]https://mycelium.com/lt/help.htmlCryptoMap.me [NO KYC]https://www.cryptomap.me/BitHalo software [NO KYC]https://bithalo.org/OpenBazaar [NO KYC]https://openbazaar.com/discover/results/?type=cryptocurrencyWhere can it be done? You can use any Dex that allows you to decide which coin you want to sell and which one you want to hold, create, and order, and you can place to sell BTC in place for menero (XMR). The next person doesn't know who you are, and you also don't know who the next person is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 01, 2023, 08:41:35 PM",
      "body": "Theymos clarifies the reason for his decision further in that thread he made; the forum is avoiding the whole drama and complications that will come with allowing mixers to be promoted here and the consequence is can have on the members who wear the signature as well as the manager who runs the campaign, all of these factors influenced the decision to draw the curtains on them.They are not illegal and you are still very much allowed to use them if you want to use that to maintain you privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "December 02, 2023, 07:57:47 AM",
      "body": "Quote from: Crypto Library on December 01, 2023, 06:14:24 PMLooking for both your opinion and suggestion on this 0_0 As an alternative you may consider the use of decentralized mixing technique, namely JoinMarket.,  that is based on  on the maker-taker principle. You may play simultaneously both roles - a maker (by providing liquidity to the takers) and  taker (consuming the liquidity). Such  approach may  give you the flexibility in earning money and  mixing itself.Quote from: https://crypto.news/advances-in-anonymity-joinmarket-releases-version-3-and-gui/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 02, 2023, 08:20:53 AM",
      "body": "Theymos created this topic in 2019: [Guide] Decent mixing methods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "December 02, 2023, 09:34:18 AM",
      "body": "Privacy is very important when it comes to personal money and transactions and it makes sense that people would not want their financial information to be seen by everyone or third party individuals.If your concern to the privacy first so I think DEXs (Decentralized Exchanges) are the second option. Basically mixers are using for fraudulent activities or for money laundering or for terrorism. So the securities are now going to against them.And I think this is a good decision by the theymos because in his mind first priority is to safe the forum or the safety of the users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 02, 2023, 06:50:05 PM",
      "body": "Quote from: Publictalk792 on December 02, 2023, 09:34:18 AMPrivacy is very important when it comes to personal money and transactions and it makes sense that people would not want their financial information to be seen by everyone or third party individuals.If your concern to the privacy first so I think DEXs (Decentralized Exchanges) are the second option. Basically mixers are using for fraudulent activities or for money laundering or for terrorism. So the securities are now going to against them.And I think this is a good decision by the theymos because in his mind first priority is to safe the forum or the safety of the users. You have a good idea about mixers but mixers are not going anywhere even if theymos disallowed the advertisers to stop advertising them, if there is a demand then the supply will be given by any means. It means, that if there are regular and legit, good actors, are demand mixer services then good mixers might find another way to provide their services to them. Overall, mixers are not the only source of money laundering, it's just the US wants things in their hands in a more manner way.They don't want privacy to become free and that easy, they are creating hurdles in it and theymos have to comply with them for the sake of this forum even though he doesn't want to make this step because he said if he would have the opportunity to give this forum to a nonprofit agency who can guarantee its functioning, I would gave this forum to them for free. That's not exactly what his words were but it is almost the same thing he said.And if DEXs can be used for anonymity then why do money launderers use them why they are using mixers, this whole case is so confusing and badly impacting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "December 02, 2023, 08:11:45 PM",
      "body": "Quote from: Coyster on December 01, 2023, 08:25:46 PMI don't think many of you understand what is going on, the forum is banning mixers in its entirety, but it does not mean that mixers cease to exist, you just cannot send people links to mixers or tell them mixers to use in this forum, you have to look for mixers you want to use elsewhere other the forum. The OP sounds like mixers no longer exist and we now need another alternative. BTW mixers are not illegal:QuoteA cryptocurrency mixing service is not necessarily illegal.Hmm, there's a point Mixers are not going anywhere but, yeah Forum is entirely eliminating mixers from the promotion, still, crypto mixing is not illegal but many people use it for some kind of evil.TBH, the Forum was proving some kind of authenticity about the mixer where the users who are not familiar with trusted services, here that user was able to identify the trusted services, based on the user's reviews, and discussions. Now this will be no longer available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "December 02, 2023, 09:30:40 PMLast edit: December 10, 2023, 08:10:34 PM by Saint-loup",
      "body": "Quote from: Crypto Library on December 01, 2023, 06:14:24 PMThe news has already arrived.  Moreover, as a result of using mixing services or making transactions with any wallets connected to mixing services, their wallets are going under the tracing i.e. blacklist. So my question is that those who are concerned about the privacy of the amount of funds in their wallet or the amount of the transaction from their wallet or the transaction in which wallet, what should they use so that they are not open to everyone? Because I think that anyone would like to make their personal funds visible to the people around them or third-party people. Since the use of mixers may face various problems, what can be used as an alternative? Looking for both your opinion and suggestion on this 0_0 It's not a perfect method but a simple way to get rather anonymized coins is to use 2 exchanges not requiring KYC. You can send your BTCs to the first exchange, converting your Bitcoins into another cryptocurrency there and then sending those coins from this exchange to the other one. On the second exchange you can convert the altcoins into Bitcoin and withdraw those funds to a fresh new BTC address. Those BTCs won't be connected anymore to your former BTCs on the blockchain. You can also use LN to send Bitcoins through the Lightning Network from your wallet and then withdrawing them from a platform or a submarine swap provider to an address on-chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "December 02, 2023, 10:23:40 PM",
      "body": "Quote from: Hamza2424 on December 02, 2023, 08:11:45 PMHmm, there's a point Mixers are not going anywhere but, yeah Forum is entirely eliminating mixers from the promotion, still, crypto mixing is not illegal but many people use it for some kind of evil.Yes, but the forum isn't banning mixers because criminals use it, i'm sure Theymos knows better, criminals use the internet and fiat, criminals use quite a lot of things that \"normal\" people use, but it is the purpose that is the difference and that is the same case with Bitcoin mixers. The thing is, there is an attack against Bitcoin through Bitcoin mixers and the administrator doesn't want the forum to be caught in the crossfire.Quote from: Hamza2424 on December 02, 2023, 08:11:45 PMTBH, the Forum was proving some kind of authenticity about the mixer where the users who are not familiar with trusted services, here that user was able to identify the trusted services, based on the user's reviews, and discussions. Now this will be no longer available.I 100% agree, i think scam mixers are going to have field days after the 31st of Dec, since directing people to mixers is banned, you can only expect users to do their own research about mixers to use, quite a lot of people would be scammed as a result of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "December 03, 2023, 07:42:56 PM",
      "body": "Quote from: Saint-loup on December 02, 2023, 09:30:40 PMIt's not a perfect method but a simple way to get rather anonymized coins is to use 2 exchanges not requiring KYC. You can send your BTCs to the first exchange, converting your Bitcoins into another cryptocurrency there and then sending those coins from this exchange to the other one. On the second exchange you can convert the altcoins into Bitcoin and withdraw those funds to a fresh new BTC address. Those BTCs won't be connected anymore to your former BTCs on the blockchain. You can also use LN to send Bitcoins through the Lightening Network from your wallet and then withdrawing them from a platform or a submarine swap provider to an address on-chain.This could work to cover up where your coins are actually coming from, and it does not cost too much (based on the transaction fees you pay), but there are some drawbacks you should know about.  Pretty much every exchange, even the anonymous kinds keeps logs of stuff like your IP address and the wallet addresses from where you put money in or take it out.  So if someone was really determined to track you down, they could get the logs from both exchanges and connect the dots right back to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2023, 08:33:01 AM",
      "body": "Quote from: Stalker22 on December 03, 2023, 07:42:56 PMQuote from: Saint-loup on December 02, 2023, 09:30:40 PMIt's not a perfect method but a simple way to get rather anonymized coins is to use 2 exchanges not requiring KYC. You can send your BTCs to the first exchange, converting your Bitcoins into another cryptocurrency there and then sending those coins from this exchange to the other one. On the second exchange you can convert the altcoins into Bitcoin and withdraw those funds to a fresh new BTC address. Those BTCs won't be connected anymore to your former BTCs on the blockchain. You can also use LN to send Bitcoins through the Lightening Network from your wallet and then withdrawing them from a platform or a submarine swap provider to an address on-chain.This could work to cover up where your coins are actually coming from, and it does not cost too much (based on the transaction fees you pay), but there are some drawbacks you should know about.  Pretty much every exchange, even the anonymous kinds keeps logs of stuff like your IP address and the wallet addresses from where you put money in or take it out.  So if someone was really determined to track you down, they could get the logs from both exchanges and connect the dots right back to you.Also that using coinjoin such much and more easier. You can access coinjoin directly on the wallet that is supporting it. Example of the wallet that is supporting coinjoin is the Whirlpool on Sparrow and Samourai. On such wallets, you do not need to send your coins to anywhere, just click on Whirlpool to access the coinjoin directly on such wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}