{
  "id": "topic_5470379",
  "title": "cryptoWODL",
  "author": "cryptoWODL",
  "created_time": "October 15, 2023, 02:21:29 AM",
  "content": "In the area where I live, everyone in this area is more or less educated. I have some friends including myself who have been involved with cryptocurrencies for a long time. Although we have been involved for a long time, we have never invested or traded on Bitcoin. So all of us, a few of us, have made up our minds to trade on Bitcoin and trade for a long time. We will each buy $500 worth of bitcoins and trade them for four years. $500 worth of bitcoins may not be much. We have taken such an initiative with the belief that maybe one day we can be successful. We all have many dreams, maybe with this small effort our dreams will come true one day. Looking forward to your opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470379",
  "comments": [
    {
      "author": "mk4",
      "created_time": "October 15, 2023, 03:09:44 AM",
      "body": "Not sure what opinion you're looking for?About the $500 number, increasing/decreasing that amount will totally depend on what your net worths are and/or how much you guys are earning monthly. On the top of my head, especially knowing that every single one of you are beginners, probably only trade with half a week's worth of wages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "October 15, 2023, 05:22:59 AM",
      "body": "Quote from: mk4 on October 15, 2023, 03:09:44 AMNot sure what opinion you're looking for?About the $500 number, increasing/decreasing that amount will totally depend on what your net worths are and/or how much you guys are earning monthly. On the top of my head, especially knowing that every single one of you are beginners, probably only trade with half a week's worth of wages.Is like they've heard about investing on bitcoin and it has a productive outcome and they decide to get into it. They collectively came out with the idea of getting $500 per person and they feel it will yield something big for them to start up a life of their own.But the question is, do they know the in and out of this investment they're about to embark on? Is really not about the money but how well informed they are about Bitcoin trading.They can get into it and also lose their money in the process and I feel is just the positive side of trading they know about and they're just excited to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 15, 2023, 09:31:08 AM",
      "body": "Quote from: cryptoWODL on October 15, 2023, 02:21:29 AMAlthough we have been involved for a long time, we have never invested or traded on Bitcoin. So all of us, a few of us, have made up our minds to trade on Bitcoin and trade for a long time.Do not mind me, what kind of involvement do you have with bitcoin when you have not hold it or traded it before? Quote from: cryptoWODL on October 15, 2023, 02:21:29 AMWe will each buy $500 worth of bitcoins and trade them for four years. $500 worth of bitcoins may not be much. We have taken such an initiative with the belief that maybe one day we can be successful. We all have many dreams, maybe with this small effort our dreams will come true one day.If you do not have any experience yet about trading, I will advise you not to trade because trading is very risky. Hold bitcoin because we are moving towards the bull run period gradually and closer than before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 15, 2023, 09:43:37 AM",
      "body": "Quote from: cryptoWODL on October 15, 2023, 02:21:29 AMWe will each buy $500 worth of bitcoins and trade them for four years. $500 worth of bitcoins may not be much.Want to just hold or trade? It seems your interpretation is wrong, trading is an activity with a shorter timeline e.g. daily/weekly and may require some technical analysis. If you are bad at trading, maybe you won't be able to keep your $500 bitcoin even for just 1 year.Quote from: Oshosondy on October 15, 2023, 09:31:08 AMDo not mind me, what kind of involvement do you have with bitcoin when you have not hold it or traded it before? He said \"cryptocurrencies\", maybe altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "October 15, 2023, 09:59:20 AM",
      "body": "So the starting capital is $500 and will trade for four years then why not invest much better than trading?Maybe you have planned with friends and who will earn more during the four years of trading, then you will determine from that capital whether day trading is weekly or monthly? Because there day trading of bitcoin will not earn so much unless you might take a higher risk with futures trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "October 15, 2023, 12:38:17 PM",
      "body": "Quote from: salad daging on October 15, 2023, 09:59:20 AMSo the starting capital is $500 and will trade for four years then why not invest much better than trading?Maybe you have planned with friends and who will earn more during the four years of trading, then you will determine from that capital whether day trading is weekly or monthly? Because there day trading of bitcoin will not earn so much unless you might take a higher risk with futures trading.At least if he/she want to do daily trading, especially in the futures market, he/she must be able to carry out technical and fundamental analysis and they must be confident and proficient in the analysis they carry out. If he/she can't do technical analysis and just buy and sell carelessly, I can't guarantee that $500 will increase, in the worst case it could even be lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 15, 2023, 01:11:46 PM",
      "body": "OP should add more details about his investment strategy and funding. You have said your group is going to invest 500$ worth of bitcoin for 4 years. You were referring to interday trade for the next 4 years with this same 500$ or you guys are going to invest 500$ in a regular interval? A small change in the scenario can change the whole strategy. But the initiative you guys have taken is good and helps you to improve your skills fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "October 15, 2023, 01:41:48 PM",
      "body": "Quote from: cryptoWODL on October 15, 2023, 02:21:29 AMIn the area where I live, everyone in this area is more or less educated. I have some friends including myself who have been involved with cryptocurrencies for a long time. Although we have been involved for a long time, we have never invested or traded on Bitcoin. So all of us, a few of us, have made up our minds to trade on Bitcoin and trade for a long time. We will each buy $500 worth of bitcoins and trade them for four years. $500 worth of bitcoins may not be much. We have taken such an initiative with the belief that maybe one day we can be successful. We all have many dreams, maybe with this small effort our dreams will come true one day. Looking forward to your opinion.For those who are new to trading like you, I would suggest that you only put $100 in capital for trading even though you already have a trading plan and back tested it because your execution in the market will change if you use a live account. If you are profitable within a month then you can increase your capital and your margin in trading, and if you can manage to be profitable in the next month then you can now be able to maximize your capital in trading.Quote from: Oshosondy on October 15, 2023, 09:31:08 AMQuote from: cryptoWODL on October 15, 2023, 02:21:29 AMAlthough we have been involved for a long time, we have never invested or traded on Bitcoin. So all of us, a few of us, have made up our minds to trade on Bitcoin and trade for a long time.Do not mind me, what kind of involvement do you have with bitcoin when you have not hold it or traded it before? Maybe what he means is that he already have a knowledge or idea in trading Bitcoin and other stuff for a long time that's why they are planning to trade Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 15, 2023, 01:57:26 PM",
      "body": "Quote from: DVlog on October 15, 2023, 01:11:46 PMOP should add more details about his investment strategy and funding. You have said your group is going to invest 500$ worth of bitcoin for 4 years. I would like him to specify if everyone is going to trade their $500 or somehow put them in the same account and make decisions together. I imagine it is the former but I don't see much sense, because at the end of the day it would be individual trading, even if they have agreed to deposit the same amount and start at the same time.The funny thing will be to see their faces when most or all of them lose that $500, which is the most likely statistically speaking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 15, 2023, 02:36:13 PM",
      "body": "$500 in one lump sum, every month, or every week? If the investment is only $500, then in the best case scenario, Bitcoin will rise ten times the current price, making it $5,000, which is an amount that will not change your life and may not happen within 4 years.If you can trade and learn how to invest a fixed amount, let's say $100 a month for 8 years, it may make a difference in your life if your country is middle-income or one of the countries where the cost of living is not high.In general, Bitcoin trading should have an indirect impact on your life, which is learning to save and that the value of paper money is declining. Therefore, no matter how good your job is, you will notice that the return on your salary decreases every year, even if it is increased.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "October 15, 2023, 03:33:31 PM",
      "body": "Quote from: cryptoWODL on October 15, 2023, 02:21:29 AMIn the area where I live, everyone in this area is more or less educated. I have some friends including myself who have been involved with cryptocurrencies for a long time. Although we have been involved for a long time, we have never invested or traded on Bitcoin. So all of us, a few of us, have made up our minds to trade on Bitcoin and trade for a long time. We will each buy $500 worth of bitcoins and trade them for four years. $500 worth of bitcoins may not be much. We have taken such an initiative with the belief that maybe one day we can be successful. We all have many dreams, maybe with this small effort our dreams will come true one day. Looking forward to your opinion.Trading is very risky. From what I read and understood you and your friends and not experienced traders. The idea of investing $500 worth of Bitcoin into training without proper research, risk management strategy, trading psychology, experience and other factors that would make for a successful trader is a terrible one.If you have the slightest idea of risk management you wouldn't think of investing $500 worth of bitcoins into trading. It is too much. To understand what I mean, try using a $500 on a mock trading software. This is my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "October 15, 2023, 05:57:43 PM",
      "body": "Quote from: cryptoWODL on October 15, 2023, 02:21:29 AM We will each buy $500 worth of bitcoins and trade them for four years.I don’t really understand you. Are you planning to invest in bitcoin for four years, or are you just planning to be trading? If you are planning to trade, then you shouldn’t start trading with $500. You can’t just jump into something you don’t really have much knowledge about. Trading is kind of risky, and it’s not something you can start with and expect profit instantly. Trading requires constant research, and you have to always put it into practice. So as a beginner, it’s just better to start with a small amount, but if you decide to start with all the $500, I won’t be surprised if you lose everything to trading. Quote from: cryptoWODL on October 15, 2023, 02:21:29 AM$500 worth of bitcoins may not be much. Why do you think $500 worth of bitcoin is not much? When investing, no amount is too small, you don’t have to invest which at the end you might end up being affected. If you know it's only $500 you can afford to lose, then it's better if you just invest the $500.I checked your profile, and I noticed that you have been given a positive trust with the reference that you have used @albon escrow on Telegram to complete ETNY token transactions. I hope you are not investing the $500 in altcoins, and you are here claiming you are planning to invest it in bitcoin? If you invest in altcoins, you might end up regretting it. The coin that you are investing in hasn't been listed on exchange yet, you are just taking a great risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}