{
  "id": "topic_5448675",
  "title": "Bookielink",
  "author": "Bookielink",
  "created_time": "April 13, 2023, 01:10:18 PM",
  "content": "Hello Everyone,Welcome aboard!!Take a look of our website :  www.bookielink.comWe have various betting platforms including Sportsbooks, Exchanges and Asian. We also have an exchange which offers lay betting options on horse racing. Please visit our website and send us message to provide you with all of our trial accounts. We will be happy to assist you in case you will need any clarifications. Our deposit methods that you can use are Crypto/ Bank transfer/ Skrill and Neteller. All our deposits are free of charge. We do accept all kind of bettors whether you are an arber, punter or trader. Our online chat support is open from 09:00 am to 01:00 am (GMT +2) everyday, just contact us via live chat and we will be happy toanswer you any questions and concerns you may have.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448675",
  "comments": [
    {
      "author": "decodx",
      "created_time": "April 15, 2023, 03:53:05 PM",
      "body": "Welcome to the forum, Bookielink! It's always exciting to see new businesses and platforms being promoted here. However, if you're open to suggestions, I would like to suggest creating a visually appealing ANN (announcement) thread like other platforms do. Having a well-designed thread can help you stand out from the competition and attract more potential customers. To create a thread that stands out, consider investing in a Copper Membership that allows you to post pictures and graphics - it'll give your thread that extra pop and make it more eye-catching!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "April 15, 2023, 03:55:33 PM",
      "body": "Hi there sir and welcome to bitcointalk.org !Please, in way to publish in better way your announcement, I strongly suggest you to buy a copper membership account; in this way you'll be able to add also image in your announcement, and you'll surely attract more attention from readers.Also, if you want to stay here and be part of community, another advice could be to advertise your site with a signature campaign, it is the much more used way to advertise here; let me know if you need help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "April 27, 2023, 02:22:26 PM",
      "body": "Thank you for your wonderful suggestions. We will check and discuss for consideration",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "April 27, 2023, 04:05:42 PM",
      "body": "welcome to the forum, from what I see your site works as an intermediary between a person and the casino. that is, the person creates an account on your website, makes a deposit and then makes a bet based on the good odd that he thinks is best and you, who already have an account at the casino that the person chose, bet based on that person's choice, right? and so how does your site work or am I wrong?my questions are as follows:1 - on your website you have this: https://bookielink.com/about-us/Quote from: https://bookielink.com/about-us/Head office in Curacao: Abraham Mendez Chumaceiro, Boulevard 50this means that it is a physical office address, but when I go to google to search for this address I see that there are many sites with the same address, can you show us photos of your physical officeQuote from: https://bookielink.com/about-us/+44(0)9502490335when I go to google to search for this number I see that there are many sites with the same numberhttps://bookielink.com/kyc-aml/why your site needs KYC?you can claim that you have a license and therefore need to ask for KYC, so I ask myself: so what's the point in using your site? Isn't it better for people to create an account directly at the casino and do KYC at the casino and play at the casino?another thing:https://bookielink.com/payment-and-fees/Quote from: https://bookielink.com/payment-and-fees/Deposit: min. 50€Three confirmationWithdrawals: min. 50€/under 24hrsat stake.com I can deposit 1 USDT and play and make withdrawals with 3 USDT, the question is why people would stop directly using casinos with low deposits and withdrawals and reliable casinos to go to use your new website, without any reputation, with high deposits and withdrawals and also with inflexible KYC, worse than the casinos?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "April 27, 2023, 04:43:44 PM",
      "body": "Quote from: Bookielink on April 13, 2023, 01:10:18 PMPlease visit our website and send us message to provide you with all of our trial accounts.That's for sure, we are very careful with platforms that offer sports betting, especially the website www.bookielink.com, it is relatively new to us and also very minimal visitor activity.Question for the OP.* Does the web www.bookielink.com have countries restricted or banned, I see high risk labels Singapore and Hong Kong and which other states, are high risk.Maybe for me personally I have to see developments and progress first before I go any further, the level of fairness needed for its users, considering that visitors on social media are very minimal than expected.I hope that www.bookielink.com is really fair and can be accepted by the community here, good luck for your first introduction in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "May 04, 2023, 03:32:34 PM",
      "body": "Quote from: Slow death on April 27, 2023, 04:05:42 PMwelcome to the forum, from what I see your site works as an intermediary between a person and the casino. that is, the person creates an account on your website, makes a deposit and then makes a bet based on the good odd that he thinks is best and you, who already have an account at the casino that the person chose, bet based on that person's choice, right? and so how does your site work or am I wrong?my questions are as follows:1 - on your website you have this: https://bookielink.com/about-us/Quote from: https://bookielink.com/about-us/Head office in Curacao: Abraham Mendez Chumaceiro, Boulevard 50this means that it is a physical office address, but when I go to google to search for this address I see that there are many sites with the same address, can you show us photos of your physical officeQuote from: https://bookielink.com/about-us/+44(0)9502490335when I go to google to search for this number I see that there are many sites with the same numberhttps://bookielink.com/kyc-aml/why your site needs KYC?you can claim that you have a license and therefore need to ask for KYC, so I ask myself: so what's the point in using your site? Isn't it better for people to create an account directly at the casino and do KYC at the casino and play at the casino?another thing:https://bookielink.com/payment-and-fees/Quote from: https://bookielink.com/payment-and-fees/Deposit: min. 50€Three confirmationWithdrawals: min. 50€/under 24hrsat stake.com I can deposit 1 USDT and play and make withdrawals with 3 USDT, the question is why people would stop directly using casinos with low deposits and withdrawals and reliable casinos to go to use your new website, without any reputation, with high deposits and withdrawals and also with inflexible KYC, worse than the casinos?Dear Sir,Please find below answers to your questions above :1. The registered office is in Curacao where it has to be in order to meet the criteria of owning a Curacao license. We have a number of offices worldwide.2. This is not applicable for us. Our telephone number is 00 44 7502 490325.3. Betting through a licensed company, you have the comfort that this betting platform is registered somewhere and meets certain criteria such as GDPR and your funds security. In case someone would like to visit a casino he can do it. Not all people would like to go and visit a casino. We offer the option of a casino at the comfort of your house. In addition, we have a variety of products and not only casino such as betting exchanges, asian bookies and sports books.4. As far as the min deposit is concerned note that our platforms are powered by Betfair and there are min bets in place such as 5 euro. As you can understand, is pointless to decrease our min deposit. As far as reputation is concerned, note that the Company operates for many years with agents (B2B) and now it started focusing in B2C too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "May 04, 2023, 03:38:38 PM",
      "body": "Quote from: YOSHIE on April 27, 2023, 04:43:44 PMQuote from: Bookielink on April 13, 2023, 01:10:18 PMPlease visit our website and send us message to provide you with all of our trial accounts.That's for sure, we are very careful with platforms that offer sports betting, especially the website www.bookielink.com, it is relatively new to us and also very minimal visitor activity.Question for the OP.* Does the web www.bookielink.com have countries restricted or banned, I see high risk labels Singapore and Hong Kong and which other states, are high risk.Maybe for me personally I have to see developments and progress first before I go any further, the level of fairness needed for its users, considering that visitors on social media are very minimal than expected.I hope that www.bookielink.com is really fair and can be accepted by the community here, good luck for your first introduction in this forum.Dear Sir,Here are the restricted countries our website  :Aruba Bonaire, Saint Eustatius and Saba Curacao France Hong Kong Netherlands Singapore United Kingdom United States, Minor Outlying Islands United States, Virgin IslandsThank you sir for the well wishes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "innova222",
      "created_time": "May 05, 2023, 02:45:43 PM",
      "body": "Looks interesting broker! What exchange do you have for lay betting options in horse racing and how much commission do you charge?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "May 08, 2023, 11:38:20 AM",
      "body": "Dear Sir,For exchange that has lay betting options, we have Oddslay powered by betdaq.Commission charge is 3%. We actually have a various exchange products that is Powered by Betfair. You can visit our website : https://bookielink.com/ and ask our live chat support for a trial accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "innova222",
      "created_time": "May 09, 2023, 03:22:18 PM",
      "body": "Quote from: Bookielink on May 08, 2023, 11:38:20 AMDear Sir,For exchange that has lay betting options, we have Oddslay powered by betdaq.Commission charge is 3%. We actually have a various exchange products that is Powered by Betfair. You can visit our website : https://bookielink.com/ and ask our live chat support for a trial accounts Thanks. I did what you say and I got a trial account of oddslay now. It offers lay betting for horse racing and that's good to know. Will try to check more and thinking of making a deposit next week",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "innova222",
      "created_time": "May 22, 2023, 02:43:21 PM",
      "body": "So I finally made a deposit to and get the oddslay account, everything are smooth and looks fine.Observing till I will be able to withdraw. I will keep updating this thread for my experience.Btw, do you guys offer any bonus promotion?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "May 23, 2023, 02:56:47 PM",
      "body": "Quote from: innova222 on May 22, 2023, 02:43:21 PMSo I finally made a deposit to and get the oddslay account, everything are smooth and looks fine.Observing till I will be able to withdraw. I will keep updating this thread for my experience.Btw, do you guys offer any bonus promotion?Dear Sir, Thank you for the update. We hope that you will continue updating this thread with your experienceor honest feedback whether it is good or bad. You can try to check our Bookielink Pro also, it is a powerful platform as we have a lot of bookies/exchanges available on this account withoutlogging-in the individual website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "May 26, 2023, 02:13:46 PM",
      "body": "Dear Sir,Aside from Oddslay, we also have several exchange accounts for your betting needsthat is Powered by Betfair.We have FairExchange, Orbitx Account and Laystars. All commission is 3%. We also have Asianbookies such as PS3838 and Pasa888.com with higher limit!Message our live chat found on our website now and ask for a TRIAL Account. TO SEE IS TO BELIEVE!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luka206",
      "created_time": "May 26, 2023, 02:22:31 PM",
      "body": "Is it hard to pass on your kyc?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "innova222",
      "created_time": "June 08, 2023, 11:51:20 AM",
      "body": "Quote from: innova222 on May 22, 2023, 02:43:21 PMSo I finally made a deposit to and get the oddslay account, everything are smooth and looks fine.Observing till I will be able to withdraw. I will keep updating this thread for my experience.Btw, do you guys offer any bonus promotion?Just to give an update, I was able to withdraw today around 1,XXX. I can say that documents asked from me was pretty reasonable and similar to other brokers I am using. I got verified in less than 12 hours which is good for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "June 08, 2023, 02:38:05 PM",
      "body": "The most important pages,  the TOS and Privacy policy is not visible it took me a whole 5 minutes to find them, it's a sub-page of the About Us.TOS, and Privacy should not be sub-pages of a page it should be visible in the header or menu, so players can read it before signing up.There are a lot of risks if a player signs up without reading the TOS and privacy policy and based on what I see it's intentionally hidden",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "June 09, 2023, 01:36:30 PM",
      "body": "Quote from: aioc on June 08, 2023, 02:38:05 PMThe most important pages,  the TOS and Privacy policy is not visible it took me a whole 5 minutes to find them, it's a sub-page of the About Us.TOS, and Privacy should not be sub-pages of a page it should be visible in the header or menu, so players can read it before signing up.There are a lot of risks if a player signs up without reading the TOS and privacy policy and based on what I see it's intentionally hidden Dear Sir,We do not have an intention to hide it as there's really nothing to hide. That was just the design and even if it's like that we are operating our business fairly. We believe that is most important. But your feedback is highly appreciatedwe will take it for consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 09, 2023, 01:44:22 PM",
      "body": "It's good that you are addressing all concerns and recommendations I saw that you create this thread on April 13, 2023, but why are you not doing things that you should be doing, it getting a copper account and designing your thread, we have recommended this to all admin and representative of casinos here and those serious in their presence here have done this, so it's your call to the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bookielink",
      "created_time": "June 15, 2023, 10:33:31 AM",
      "body": "Quote from: coin-investor on June 09, 2023, 01:44:22 PMIt's good that you are addressing all concerns and recommendations I saw that you create this thread on April 13, 2023, but why are you not doing things that you should be doing, it getting a copper account and designing your thread, we have recommended this to all admin and representative of casinos here and those serious in their presence here have done this, so it's your call to the same.Hello Sir, Thank you for all the recommendation. We will discuss further with the management.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}