{
  "id": "topic_5398631",
  "title": "Len Saldua",
  "author": "Len Saldua",
  "created_time": "May 14, 2022, 09:04:48 AM",
  "content": "I know it sounds crazy but hear me out. Crypto is mostly about speculation, lets be honest. Of the 30 or so predictions I heard on YouTube and Twitter about \"how high\" could Bitcoin go in this bull run ( the 2021 / 2022 bull run ) only ONE got it right ( I won't tell you which one, but I'm sure many of you can guess who ) Most others were way, waaaaaaay off !So regarding LUNA, and given its past history ( prior to the collapse ) and notoriety I think we're looking at the new Shiba Inu. Why so ? Well basically I don't see how the price can get much lower. One day ago in fact, the price was pretty close to the price of Shiba Inu. But forget the price. LUNA is now the most speculative play in crypto. Could it go to 10 cents ? how about a dollar ? Ten dollars ? Nobody knows. In the short term most likely will go to 0.0000010  but longer term anything could happen. And by the way, was there a single Influencer who saw this coming ? NOT ONE ! So if Shiba Inu made 100X or whatever, I think LUNA can match or even set a new record. It's no longer about the failure of UST or the lack of foresight of the founders, it's all about speculating that LUNA could one day become a good ( not great ) project again. Now let me go check my LUNA balance... Just bought 1 million tokens",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398631",
  "comments": [
    {
      "author": "StarKay",
      "created_time": "May 14, 2022, 10:44:25 AM",
      "body": "I think it is too early for this kind of conclusion because Luna as of now doesn't have clarity on its future so whoever is buying it now is more or less gambling.Shiba Inu has a known total supply and circulating supply, the comparison is uncalled for at this moment especially when a lot of people are still licking their wounds from the Luna crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "May 14, 2022, 10:53:31 AM",
      "body": "Quote from: Len Saldua on May 14, 2022, 09:04:48 AMI know it sounds crazy but hear me out. Crypto is mostly about speculation, lets be honest. Of the 30 or so predictions I heard on YouTube and Twitter about \"how high\" could Bitcoin go in this bull run ( the 2021 / 2022 bull run ) only ONE got it right ( I won't tell you which one, but I'm sure many of you can guess who ) Most others were way, waaaaaaay off !So regarding LUNA, and given its past history ( prior to the collapse ) and notoriety I think we're looking at the new Shiba Inu. Why so ? Well basically I don't see how the price can get much lower. One day ago in fact, the price was pretty close to the price of Shiba Inu. But forget the price. LUNA is now the most speculative play in crypto. Could it go to 10 cents ? how about a dollar ? Ten dollars ? Nobody knows. In the short term most likely will go to 0.0000010  but longer term anything could happen. And by the way, was there a single Influencer who saw this coming ? NOT ONE ! So if Shiba Inu made 100X or whatever, I think LUNA can match or even set a new record. It's no longer about the failure of UST or the lack of foresight of the founders, it's all about speculating that LUNA could one day become a good ( not great ) project again. Now let me go check my LUNA balance... Just bought 1 million tokens  It is definitely true that the whole crypto space is based around speculation and hype to a very large degree and sometimes very important factors of a project like use-case, the team, the roadmap and so on are not that important in terms of popularity as they should be in my opinion. I mean if use-cases and functionality would be the most important factor then meme-coins (or shit-coins) would not even exist or would be dead within a day or two again but with Dogecoin and Shiba-Inu we have two shit-coins that are even in the top 20 of all crypto projects.Regarding Terra (Luna): The investment into Terra is now very very speculative because no one knows if this project completely dies or recovers again. If it recovers i think a very high profit is possible. Maybe i will invest a few bucks into Terra too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "May 14, 2022, 10:59:45 AM",
      "body": "Beware on buying and holding $Luna tokens at this moment. There's a plan to reverse the blockchain before the attack occur and obviously this move will save only the Luna holders that holding there tokens before the tokens and the rest of the community that bought Luna during crash will be out of the picture since it will burned. This is how selfish the Luna devs and themajority of the token holders supports this to save there own asses. I suggest everyone to stop giving liquidity to this scam coin because the current Luna tokens is useless.Read and educate ypurself before buying coins in exchange especially like Luna. Read more updates on there twitter and browse the comment section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "May 14, 2022, 11:10:10 AM",
      "body": "It's not a scam token if it's making people money dude. The minute it went to zero, the old LUNA project perished... along with UST. This new token is an entirely different thing, no longer promising DeFi or 20% returns on Anchor... this token is all about survival. Things aren't looking good for Terra Luna right now, but there's always a chance it will go back up to something like 10 cents or something like that. If that happens... that means tremendous gains for many of us... hardly a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "May 14, 2022, 11:13:43 AM",
      "body": "By the way, I was one of those Hodlrs that got burned... I sold at $36 though, but still lost a lot. Do I expect to get my money back ? No, because that's the risk you take in crypto. Overall the entire crypto space has crashed, but I'm still in profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 14, 2022, 11:27:31 AM",
      "body": "Quote from: Len Saldua on May 14, 2022, 09:04:48 AMI know it sounds crazy but hear me out. Crypto is mostly about speculation, lets be honest.'(...)Exactly and people should not only focus on terms of the prices of cryptocurrency or they are just here because of money like an investment. They must first appreciate the real use of cryptocurrency, like how it works or the real use of it in our daily lives.Speaking of Luna and UST, I was really surprised about it, I didn't expect it will go that low, -100%, gross. It seems it is impossible for Luna to reach it even $1, the supply is extremely high, as time goes by it will be abandoned or forked, depending on the decision of the team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "May 14, 2022, 12:12:03 PM",
      "body": "Quote from: Len Saldua on May 14, 2022, 09:04:48 AMOf the 30 or so predictions I heard on YouTube and Twitter about \"how high\" could Bitcoin go in this bull run ( the 2021 / 2022 bull run ) only ONE got it right ( I won't tell you which one, but I'm sure many of you can guess who ) It's irrelevant who made the prediction, because all of those idiots are just guessing along with the rest of us.Quote from: Len Saldua on May 14, 2022, 09:04:48 AMCould it go to 10 cents ? how about a dollar ? Ten dollars ? Nobody knows. \"Nobody knows\" is true of any coin's future price, so there's no point to even writing that but do you or anyone else really think a coin that's supposed to be pegged to a fiat currency is ever, ever going to be worth 10x what it's supposed to be pegged at (i.e., $10)?  We can rule that out pretty quickly, especially given the fact that Luna has already been closer to $0.10 recently and thus has people fleeing as if there were a bomb strapped to Do Kwon's suicide vest as he's approaching and bragging about how everything is just fine and everybody else is stupid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "May 14, 2022, 12:31:18 PM",
      "body": "there is a college student who lost a lot because he bought LUNA...I joined a Facebook group and then the guy shared about his huge loss, he stupidly used his college money to buy LUNA. in the LUNA telegram community, many have suggested buying LUNA at the current price but I don't believe it's a wise call because the price of LUNA has been badly destroyed. investing in LUNA today is really a big risk, don't give your money to irresponsible developers like LUNA developers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "May 14, 2022, 12:36:05 PM",
      "body": "Quote from: Renampun on May 14, 2022, 12:31:18 PMthere is a college student who lost a lot because he bought LUNA...I joined a Facebook group and then the guy shared about his huge loss, he stupidly used his college money to buy LUNA. in the LUNA telegram community, many have suggested buying LUNA at the current price but I don't believe it's a wise call because the price of LUNA has been badly destroyed. investing in LUNA today is really a big risk, don't give your money to irresponsible developers like LUNA developers.That's why its never be a good choice to invest while the fear still happening on some project and guess there are many people who's continuously getting wreck for thinking that they are buying at the dip. Lets just hope that everyone can get over with this challenges they experiences and learn something huge lesson for believing on what they think a good project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "May 14, 2022, 01:16:55 PM",
      "body": "Quote from: Len Saldua on May 14, 2022, 11:13:43 AMBy the way, I was one of those Hodlrs that got burned... I sold at $36 though, but still lost a lot. Do I expect to get my money back ? No, because that's the risk you take in crypto. Overall the entire crypto space has crashed, but I'm still in profit.that's better rather than seeing your money gone to the zero. To be honest scalpers are making bunch of profit while the old holders of luna was crying so hard. this caused by when you are seeing the total circulation and talking about 10 cents just like when you are beliving this blockchain worth even more than ethereum or major companies in the world which did not even make sense for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 14, 2022, 01:25:05 PM",
      "body": "The supply has been stopped now. Possibly this will be a hugh pump and dump now. I believe this is due to some traders believing on some hype.Luna has been considered dead and got delisted by some exchange such as Binance. However Cz resume the trading, most likely they are done keeping bags now and waitimg for a huge come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ice18",
      "created_time": "May 14, 2022, 02:15:41 PM",
      "body": "Some said its the new Doge because of its huge supply, many speculating they can achieved $1 in no time but this will not happen until no burning of supply happens, this is the ultimate weapon for tera to recover stop minting, repeg ust and so that they can burn more luna coins on circulation, if this happens luna price have the possibility to recover at least a dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 14, 2022, 02:22:36 PM",
      "body": "Quote from: StarKay on May 14, 2022, 10:44:25 AMI think it is too early for this kind of conclusion because Luna as of now doesn't have clarity on its future so whoever is buying it now is more or less gambling.Shiba Inu has a known total supply and circulating supply, the comparison is uncalled for at this moment especially when a lot of people are still licking their wounds from the Luna crash.I can't see any gambling on here. I can only see money thrown away or a desperate attempt to speculate on an altcoin that has literally been stopped at the blockchain level. In practice its value and its use can only tend towards 0 to become more and more negligible.regaining the $ 1 PEG is just as science fiction, we have just witnessed the death of a \"stable coin\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masterrex",
      "created_time": "May 14, 2022, 03:35:34 PM",
      "body": "IMHO, I guess the Terra Luna is in a very tough and complicated situation now, because of the recent event that test the capacity of Terra Luna as a platform. Anyway the Terra Luna team is planning to fork Luna before the attack, but it has gotten mixed reactions in the crypto community even CZ of Binance has tweeted against it, so what was next for Terra Luna? thats a million-dollar question that needs to be answered so for now let us wait and see and it might be better to avoid LUNA until the situation is unstable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inanilujimi",
      "created_time": "May 14, 2022, 03:45:45 PM",
      "body": "https://bscscan.com/token/0x156ab3346823b651294766e23e6cf87254d68962?a=0xdd1e16e9b7dd8f047b982c771a30b526c35e1bf0see this transaction in just a day can get $ 60k busd with a capital of $ 100 .clearly this is not my wallet, i only got this from one of the groups i follow.I hope Luna can hit $1 in the near future considering how quickly they collapsed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "May 14, 2022, 04:35:30 PM",
      "body": "Hopefully this incident has thought some investors to be more caution with crypto investment and understand the importance of \"invest what you can loss\". i see so many people complaining about how they have invested all their life savings, i think that's a pretty irrational and careless behavior on the part of this investors. We should all learn a lesson from this. people should know how to manage risk.The luna circulation is too huge to expect a $1 price, i doubt this will happen except the team are willing to buy back and burn to reduce luna in circulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "May 14, 2022, 04:44:50 PM",
      "body": "Although it is very risky to buy LUNA as of this time, there are still a lot of crazy enthusiasts who are \"dreaming\" to become millionaires by just buying at low prices. Yes we see that LUNA did rebounded for a bit from $0.00009 to $0.0004, and some are very happy of their gains as the LUNA/BUSD pair was being enabled again on Binance. This might be the new hot \"memecoin\" in the making, but still I won't be buying even at least $10 worth of it. With an almost 7 billion worth of supply, I don't think it's possible anymore for us to see LUNA pumping even further to at least $0.01.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 14, 2022, 05:01:01 PM",
      "body": "Shiba is the basis of most misfortunes now because they have printed a trillion dollars of this currency and the main purpose is to raise the market capacity to the maximum extent possible in the least possible time.So we can see the similarity between what is happening with Sheba and with Luna team printing a lot of coins to increase them MarketCap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Metroid",
      "created_time": "May 14, 2022, 05:05:18 PM",
      "body": "Shiba inu is scam itself, every bull market new scamcoins are created, scammers create them to steal money from sheeps and then when bear market comes they kill by dumping it to 0, luna was the first, then next bull market they create new ones, it has been like this since 2010. Only scammers win here, suckers that believe in these scams are the ones that suffer the most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}