{
  "id": "topic_5484053",
  "title": "traincarswreck",
  "author": "traincarswreck",
  "created_time": "February 04, 2024, 06:52:12 AM",
  "content": "The most popular bitcoin characters are sybil attacking bitcoin https://github.com/jalToorey/IdealMoney/wiki/The-Bitcoin-Community-is-a-Sybil-Attack-On-Bitcoinplanb is saifedean + lyn alden + swansaifedeans arguments fly against archeological accounts and his method of argument goes against the core tenants of the Austrian school of economics he claims to represent: https://github.com/jalToorey/IdealMoney/wiki/Of-The-Fatal-Inconsistencies-In-Saifedean-Ammous'-Bitcoin-Standard We use Szabonian deconstruction to show that the community around bitcoin is a Sybil attack intent on corrupting the key components of its design that both Satoshi and Szabo expound on.  And then we show that Satoshi, Hal Finney, Szabo, and Nash all had the same arguments about what bitcoin's optimal use case is: https://github.com/jalToorey/IdealMoney/wiki/On-The-Satoshi-Complex",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5484053",
  "comments": [
    {
      "author": "franky1",
      "created_time": "February 04, 2024, 07:52:18 AM",
      "body": "for those that dont know traincarwreck. ill translatenashy nash, nash, Nash!...Nash?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "February 04, 2024, 09:31:24 AM",
      "body": "That's a strange title and misguiding one, if the Bitcoin community is a Sybil Attack on Bitcoin then why Bitcoin exist in first place? Bitcoin is Bitcoin because of the community and support it's getting from the community. Without the community and users Bitcoin can't really be a useful thing at all, so it's better to not use such misleading title. I know that Sybil attacks are of a concern but considering whole community as sybil attack is not right at all. I know that sybil attack is a concern and it was a concern back then also but it's not fair to consider the whole community as sybil attack on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "February 04, 2024, 12:29:40 PM",
      "body": "In essence, every wallet that holds bitcoin is a sybil attacking btc very existence? Who came up with this brilliant theory  Was btc optimal use case to be a digital coin that will be locked in a vault without being used?  Am sorry but this sounds very ridiculous. I don't think btc was created for the museum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 04, 2024, 01:37:16 PM",
      "body": "Quote from: franky1 on February 04, 2024, 07:52:18 AMfor those that dont know traincarwreck. ill translatenashy nash, nash, Nash!...Nash?Odd, I got blah, blah, blah, blah, blah when I ran it though my translator.What's funny is that it's posted on github so you can open issues on it, but I don't want to use my main git account and am too lazy to crate another one just to do it.Either way, does not matter, it's just junk.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 04, 2024, 02:02:44 PM",
      "body": "Quote from: DaveF on February 04, 2024, 01:37:16 PMQuote from: franky1 on February 04, 2024, 07:52:18 AMfor those that dont know traincarwreck. ill translatenashy nash, nash, Nash!...Nash?Odd, I got blah, blah, blah, blah, blah when I ran it though my translator.What's funny is that it's posted on github so you can open issues on it, but I don't want to use my main git account and am too lazy to crate another one just to do it.Either way, does not matter, it's just junk.-Davei just meant OP posts something about bitcoin and then starts making it about a guy named Nash he idolises",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traincarswreck",
      "created_time": "February 04, 2024, 04:34:44 PM",
      "body": "Quote from: franky1 on February 04, 2024, 02:02:44 PMQuote from: DaveF on February 04, 2024, 01:37:16 PMQuote from: franky1 on February 04, 2024, 07:52:18 AMfor those that dont know traincarwreck. ill translatenashy nash, nash, Nash!...Nash?Odd, I got blah, blah, blah, blah, blah when I ran it though my translator.What's funny is that it's posted on github so you can open issues on it, but I don't want to use my main git account and am too lazy to crate another one just to do it.Either way, does not matter, it's just junk.-Davei just meant OP posts something about bitcoin and then starts making it about a guy named Nash he idolisesdid you know saifedean's argument is invalid from an archeological stand point? did you know he misquote szabo?did you know all attempts to evolve bitcoin misrepresent szabo, finney, and satoshi?Did you know that islam banned saifedean's ? Did you know that him and lyn alden run the planB account? no you don't care about truth right.  you don't care about bitcoin frank. You are in mom's basement frank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traincarswreck",
      "created_time": "February 04, 2024, 04:36:23 PM",
      "body": "Quote from: SamReomo on February 04, 2024, 09:31:24 AMThat's a strange title and misguiding one, if the Bitcoin community is a Sybil Attack on Bitcoin then why Bitcoin exist in first place? Bitcoin is Bitcoin because of the community and support it's getting from the community. Without the community and users Bitcoin can't really be a useful thing at all, so it's better to not use such misleading title. I know that Sybil attacks are of a concern but considering whole community as sybil attack is not right at all. I know that sybil attack is a concern and it was a concern back then also but it's not fair to consider the whole community as sybil attack on Bitcoin.Its the nature of what a Sybil attack is.Bitcoin only has Sybil protection on a computer network level.  On a social level its completely hijacked. Look at frank for example, he can't even think past 2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 04, 2024, 04:59:20 PM",
      "body": "Quote from: traincarswreck on February 04, 2024, 04:36:23 PMQuote from: SamReomo on February 04, 2024, 09:31:24 AMThat's a strange title and misguiding one, if the Bitcoin community is a Sybil Attack on Bitcoin then why Bitcoin exist in first place? Bitcoin is Bitcoin because of the community and support it's getting from the community. Without the community and users Bitcoin can't really be a useful thing at all, so it's better to not use such misleading title. I know that Sybil attacks are of a concern but considering whole community as sybil attack is not right at all. I know that sybil attack is a concern and it was a concern back then also but it's not fair to consider the whole community as sybil attack on Bitcoin.Its the nature of what a Sybil attack is.Bitcoin only has Sybil protection on a computer network level.  On a social level its completely hijacked. Look at frank for example, he can't even think past 2ever since 2014 traincarswreck keeps popping back on the forum(along with his other alts) trying to start his own social sybil game with his Nash obsessionQuote from: traincarswreck on May 27, 2014, 10:29:08 AMand John Nash IS all these menSAtosHi Nakamoto, wei dai, nick szabo same person, same nash. Nash sees \"...there is some negative psychology about gold\"he thinks if he disappears for a bit and comes back he can start again.. issue is people remember the idiot and dont want him to start his games again so call him out quick before he starts againand thats how you stop a social sybil.. by recognising it happening quick and telling the idiot he is wasting his time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traincarswreck",
      "created_time": "February 04, 2024, 07:07:55 PM",
      "body": "Quote from: franky1 on February 04, 2024, 04:59:20 PMand thats how you stop a social sybil.. by recognising it happening quick and telling the idiot he is wasting his timeThe one account sybil attack hey franky? do you think this community doesn't understand the definition of sybil attack? thats weird.I'm in the middle of pulling out the inconsistencies in the prominent bitcoiners arguments and I mean to explain Cantillon's work properly... consider this wiki:https://en.wikipedia.org/wiki/Richard_Cantillon#cite_note-65QuoteCantillon suggested that inflation occurs gradually and that the new supply of money has a localised effect on inflation, effectively originating the concept of non-neutral money.[62] Furthermore, he posited that the original recipients of new money enjoy higher standards of living at the expense of later recipients.[63] The concept of relative inflation, or a disproportionate rise in prices among different goods in an economy, is now known as the Cantillon Effect.[64][65] Here's a question I ask you in front of the community franky.  Does citation 65 make sense to you that its a link to this: https://www.swanbitcoin.com/cantillon-effect/Would you like to learn your monetary theory from swan bitcoin money scammers?  Answer to the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 05, 2024, 11:18:30 AMLast edit: February 05, 2024, 11:29:40 AM by franky1",
      "body": "your citation has nothing to do with sybil attack nor bitcoin.. its about inflationbitcoin is deflationary. where a lesser supply per cycle makes elder owners of coin better offthe swan site, tries to sound economic nerdy.. but can simplify itself by just using the word deflation instead of \"reverse-cantillon-effect\"sounds like another silly attempt to mention a guys name(cantillon) rather than actually explain anythingand by the way, i have not lived with my parents for decades. im currently travelling around different countries and enjoying freedom. try it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traincarswreck",
      "created_time": "February 05, 2024, 05:17:22 PM",
      "body": "QuoteInsert Quoteyour citation has nothing to do with sybil attack nor bitcoinThats an absolute lieSwan Bitcoin has absolutely no business being used as a citation for the Cantillon effect. what are you talking about?  And you also explained the Cantillon effect wrong like they did?Whats going on franky!?https://github.com/jalToorey/IdealMoney/wiki/On-Cantillon-and-the-Szabonian-Deconstruction-of-the-Cantillon-Effect",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 05, 2024, 07:34:22 PM",
      "body": "Quote from: traincarswreck on February 05, 2024, 05:17:22 PMQuoteInsert Quoteyour citation has nothing to do with sybil attack nor bitcoinThats an absolute lieSwan Bitcoin has absolutely no business being used as a citation for the Cantillon effect. what are you talking about?  And you also explained the Cantillon effect wrong like they did?Whats going on franky!?https://github.com/jalToorey/IdealMoney/wiki/On-Cantillon-and-the-Szabonian-Deconstruction-of-the-Cantillon-Effecti saidthe YOUR citation in this topic(the wikipedia link and quote) has nothing to do with sybil or bitcoin (this topic)as for the swan website. it just reads as the same BS tricks you do of name spamming in swans case its cantillion.. in your case its nashboth of you miss the point of actually understanding the underlying economics of things you both quoteswans case is he could simply say fiat is inflation. bitcoin is deflation and not need to name spam X-effect or reverse-X-effectmuch like you misunderstand many bitcoin economic stuff but just want to throw in some Nashisms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}