{
  "id": "topic_5463178",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "August 14, 2023, 12:01:01 AMLast edit: August 14, 2023, 08:57:29 AM by Alik Bahshi",
  "content": "Алик БахшиАрмения – история и легенда  (полная версия с иллюстрациями: https://alikbahshi.livejournal.com/101164.html «Судьба и история пишутся одной рукой»Пауло Коэльо            Этой гениальной и лаконичной фразой Пауло Коэльо раскрывает связь между историей и судьбой каждого индивидуума. В статье «Народная судьба или каждому сверчку свой шесток» (1) я показал, что судьба каждого человека, также как и его внешность и характер, имеющие наследственные признаки, предопределена. То же можно перенести и на народ, как совокупность людей с общим для них визуальным видом и менталитетом. Именно благодаря этому не составляет большого труда отличить француза от англичанина или финна. Так как судьба народа зависит от народного менталитета, который передаётся по наследству, то и у каждого народа своя судьба, которая определяет с большой вероятностью и его будущее. В итоге можно сказать, что судьбу народа изменить не возможно.  Это хорошо продемонстрировано русским народом, который, начиная с Петра Первого, буквально за уши тянут в Европу, однако дистанция нисколько не сократилась. А затея внедрить демократию в России окончилась полным крахом. Народ кровью харкал пока не появился Путин, вернувший русский народ в его традиционное холопское состояние и пошатнувшееся было имперское и великодержавное мировоззрение. Менталитет русского народа не приемлет принципы демократии. Короче, русскому народу нужен диктатор, решающий за него проблемы, на которого впоследствии можно свалить все неудачи. Это прослеживается на протяжении всей истории России, и за всем этим стоит русский народ и никто другой. Другими словами, прошлое, настоящее и будущее каждого народа кроется в его менталитете, который имеет наследственный характер, что и объясняет различие одного народа от другого, сохраняющееся на протяжении всей его истории. Однако, от Пауло Коэльо вернёмся к теме.       Я буду опираться только на известные исторические факты, которые и составляют истинную историю.      Итак, согласно Геродоту, армяне массово переселились из Фракии – географическая область на Юге Балканского полуострова в Малую Азию, в существующее с 1200 года до н. э. Фригийское царство. Из Фригии армяне проникли в Урарту, где и расселились в области, находящейся вокруг озера Ван, которую впоследствии стали называть Армянским нагорьем.           Непрерывно соперничающие между собой государственные образования Ближнего Востока, Урарту, Шумерское царство, Вавилонское царство, Ассирия, Мидия, Персия, Финикия, Израиль с 600 года до н. э. были объединены царём Киром в обширную Персидскую империю, просуществовавшую до 330 года. до н. э. Интересный исторический факт, ираноязычные племена, известные как скифы, обитавшие в северном Причерноморье и Крыму не подчинялись персидским царям и Дарий I предпринял было против них поход, окончившийся неудачей. Скифы загадочно исчезли, оставив о себе память в скифских холмах и названиях восточноевропейских рек, Дон, Дунай, Днестр, Днепр, Двина, - дон в иранском языке означает движущаяся жидкость. Кстати, река Иордан в Израиле и Иордании также своим названием обязана персам. Персидская империя пала в результате успешных походов Александра Великого и на её обширной территории возникла Македонская империя, которая после смерти Александра в 323 году до н. э. преобразовалась в Селевкидскую империю.         В 240 году до н. э. под натиском Великой Римской империи и вновь возникшей Персидской империи (Парфянское царство, позднее Персидская империя Сасанидов) перестала существовать империя Селевкидов. После чего на Ближнем Востоке завязалась длительная и изнурительная война между Римской империей (позже Византией) и Парфой. Боевые действия велись на территории Месопотамии и Армянского нагорья в течение четырёх веков без какого-либо успеха ни для одной из воющих сторон. Время от времени в войну на стороне Персии ввязывался понтийский царь Митридат. Немало тяжких испытаний пришлось перенести курдам, армянам, ассирийцам, жившим в областях, переходящих из рук в руки. Кстати, армян, которые предавали то одну, то на другую сторону, римлянам пришлось выселить из Армянского нагорья в глубь империи, в Киликию (провинция Римской империи), что впоследствии дало повод армянским историкам считать Киликию территорией в составе химерической Великой Армении. Конец римско-персидской войне в середине 7 века положили арабы, покорив Персию. Важно отметить, что с тех пор иранцы как народ аж до 1925 года теряют власть в своей стране.                                   Арабы завоевали громадную территорию от Индии на Востоке до Пиренейских гор на Западе, распространив на ней новую религию Ислам. Держать в подчинении из одного центра столь обширное государство с неоднородным населением было невозможно. Халифат распался на Кордовский Халифат и Багдадский Халифат. В Багдатский Халифат проникают тюркские племена, начинается эпоха великих тюркских империй, окончательно положивших конец Багдатскому Халифату.    В период 1037-1194 гг. тюрки сельджуки в результате завоеваний в Малой и Средней Азии образуют Сельджукский султанат, который принимает  на себя всю тяжесть крестовых походов.   К 1307 году, не выдержав мощного монгольского нашествия, султанат распадается на тюркские княжества (бейлики), из одного из них впоследствии образовалась Османская империя, просуществовавшая до 1922 года.       В период 1370 – 1507 гг. от границ Османской империи до Индии в результате завоеваний Тимура образуется Империя Тимуридов или Туран.       Кстати, именно Тимур окончательно отправил в историю Багдатский Халифат. На Ближнем Востоке вместо Византийской империи и Багдатского Халифата образуются две мощные тюркские непрерывно враждующие между собой империи Османская империя и Империя Тимуридов. В одной из битв, при Анкаре в 1402 году османы терпят поражение, а сам султан Баязет попадает в плен и его якобы в клетке доставляют в палатку Тимура. Насчет «клетки» не известно, возможно это легенда, но то, что Баязет остаток своей жизни проводит в плену это факт. Надо отметить, что тюркские государства находились в постоянном соперничестве. Так хан Золотой Орды Тохтамыш, которому Тимур помог оказаться у власти, после очередного разорения Москвы в 1382 году (поход был совершен для утверждения пошатнувшейся власти Золотой Орды над русскими князьями в результате поражения в Куликовской битве 1380 года) решил нанести удар своему покровителю и в 1385 году с огромным войском в 90 тысяч пройдя через Дербент, разорил Тебриз. Следующий набег был совершен Тохтамышем в 1388 году в направлении Самарканда, столицы империи Тимура. Однако, золотоардынцам удалось только осадить Бухару, после чего были отброшены. В 1391 году Тимур, приняв решение покончить с коварным и неблагодарным Тохтамышем, двинул свою армию на Север в пределы Золотой Орды. У реки Итиль (Волга) состоялось сражение, в котором Тохтамыш был наголову разбит, но ему удалось бежать. Тимур не стал форсировать Итиль и повернул обратно.    В 1394 году Тохтамыш вновь вторгся со стороны Кавказа в империю Тимура, однако сражение навстречу посланной Тимуром армии не состоялось, золотоордынцы отступили и скрылись в степях. Набеги коварного Тохтамыша разъярили Тимура и он пришел к выводу раз и навсегда покончить с Золотой Ордой. Армия Тимура прошла вдоль Хазарского моря (Каспий) через Дербентский проход, и на реке Терек в 1395 году сошлись армии двух мощных империй. Не знающая поражений армия Тимура одержала победу. На этот раз Тимур не повернул обратно, а направился к столице Золотой Орды, взяв Сарай,  далее его армия направилась к Днепру, затем Тимур повернул на Север, и разорил Елец.         После второго похода Тимура Золотая Орда была полностью разорена. Северная ветка Великого Шелкового Пути перестала функционировать, товары из Китая в дальнейшем шли исключительно через империю Тимуридов. Казна Золотой Орды опустела, средств как на совершение новых набегов, так и на управление громадной империей у хана более не было, и в дальнейшем Золотая Орда распадается на мелкие враждующие между собой ханства (наиболее крупные из них Ногайское ханство, Казанское ханство), прекратив существование.        Что касается  империи Тимура, то в период 1501-1736 у  власти оказалась тюркская династия Сефевидов (Кызылбашское государство), а с 1736 года по 1925 год страной управляла тюркская династия Каджаров.     Вы спросите, а причем здесь армяне? Вот именно ни причем! В приведённом историческом экскурсе ни одной из известных Ближневосточных империй не довелось биться с империей под названием «Великая Армения» да ещё «от моря и до моря», какой она представлена на карте с недавних пор современными армянскими историками.                                                            Цари, императоры, халифы, ханы, султаны и не подозревали, что где-то между их империями затесалась громадная армянская империя. Хорошо, что они были в неведении, ибо их наверняка хватила кондрашка, если бы узнали, что находятся в подчинении армянского царя Тиграна Великого с его Великой Арменией, о существовании которой они не ведали и от которой потерпели поражение. Когда Армения напала на Ассирию, Вавилон, Персию, Византию? Когда же её вассалом успела стать Персидская империя, ибо судя по карте её столица Персеполис находилась в пределах Великой Армении. Увы нет ни одного исторического документа свидетельствующего о захватнических войнах Великой Армении, без которых не обходилась ни одна из известных империй.     Невероятно, но как могло случиться, что истории ничего неведомо о Великой Армении, если поверить карте представленной серьёзными армянскими учеными. Правда, те художники от истории, нарисовавшие эту карту, упустили один весьма существенный момент, а именно в какой исторический период армянам, обитавшим в небольшой области вокруг озера Ван, удалось завоевать столь громадную территорию, омываемую четырьмя морями и период этот должен быть достаточно большим. Странно и то, что история умалчивает об армянских мореходах. Надеюсь армянские историки восполнят этот пробел.     Ну хорошо, даже, если гипотетически предположить, что империя под названием Великая Армения когда-то и существовала, однако, это ни даёт армянам права на её возрождение, этак и македонцы могут предъявить свои права на империю Александра Великого или монголы на империю Чингизхана. Здесь поразительно другое, а именно то, что армянский народ, не взирая на известную всем историю, слепо верит придуманной дашнаками легенде и собрался воевать в глубь веков за империю под названием Великая Армения.     см. продолжение",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463178",
  "comments": [
    {
      "author": "Alik Bahshi",
      "created_time": "August 14, 2023, 08:56:01 AM",
      "body": "Продолжение:  Могу предположить, что идея нарисовать подобную карту исходила из того, что армяне проживали на всём пространстве Ближнего Востока, что вполне может быть. Здесь пора вспомнить о народном менталитете. Армяне хорошие ремесленники и строители, также как и у евреев не мало их представителей среди торговцев и финансистов. Для занятия в сфере этой деятельности, обслуживающей потребности людей, нет необходимости жить в одном месте. Например, в Баку все сапожники были армяне. Занимаясь в сфере предоставления услуг, армяне не испытывали потребности жить в одном государстве, ну не будут же они сами себе шить сапоги. Есть народы, которые не имеют своего государства, например цыгане. Трудно найти страну, где бы не жили цыгане. И, если им предоставить возможность для постоянного обитания в одном месте, то на следующий день вы их там не найдёте. У них другой способ существования, упорный повседневный труд им в тягость. Кстати, цыгане, по примеру армян тоже могут нарисовать карту Великой Цыгании, территория которой будет охватывать все континенты, за исключением разве что Антарктиды да нескольких островов в Полинезии.           В отличие от цыган армянам свойственно компактное проживание среди других народов. Очаги подобного компактного проживания армян обнаруживаются во многих странах. В этих местах обычно со временем появляются армянские церкви и армянские кладбища с традиционными хачкарами (крест). Эти хачкары армяне преподносят как артефакты, свидетельствующие о том, что земля, где они врыты, исторически является землёй Великой Армении. Были случаи, когда грузины заставали армян, перетаскивающих хачкары на территорию Грузии.      В Баку целый район компактного проживания армян назывался Арменикент. Примечательно, стоит появится в каком-то месте нескольким армянам, как очень быстро их количество увеличивается в геометрической прогрессии. Так много армян проживает в курортных городах Кавказа и Черноморского побережья, включая Крым. На Кубани за последнее время количество армян настолько выросло, что уже и не понятно, кого больше кубанских казаков или поселившихся там армян. Известно, что довольно значительное количество армян проживает в Грузии. Так, на момент завоевания Грузии Россией в Тбилиси, население состояло на 60% из армян. Казалось бы в этом нет ничего предосудительного, однако при некоторых условиях это приводит к трагедии.      Во-первых, армяне в некоторой критической массе, начинают преподносить себя качественно превосходящим народом по отношению к народу коренному. Во-вторых, начинают выдвигать социальные требования, которые вскорости перерастают в территориальные на том основании, что в этих местах, ещё до появления обезьян как вида обитали армяне. Конечно же, обезьяны не появились позже армян, эта шутка, но порой утверждения и требования армян настолько абсурдны, что невольно вызывают естественную усмешку, а в некоторых случаях, как я сказал, приводят к трагедии, как это случилось в Турции и Азербайджане.     Всё началось с того, что в 1890 году в Тбилиси зарождается первая в мире нацистская партия «Дашнакцутюн», нацистская идеология которой основана на превосходстве армян во всех областях человеческой деятельности. Нацистская идеология фашистской Германии тоже основывалась на превосходстве арийской расы над другими народами. Очень точно данное обстоятельство было подмечено Василием Гросманом:   «С коварной лёгкостью теряет национализм народа свою благородную основу, он не становится грозным, он становится, жалким, не вызывает, а унижает. Так стремясь доказать некую неполноценность, человек обнаруживает свою собственную. Кое кто из моих собеседников во всех областях человеческого творчества, прежде всего особо выделял армянский национальный приоритет в архитектуре, науке, поэзии. Они подчеркивали превосходство архитектурных достоинств храма в Гарни над казавшейся им примитивной архитектурой Акрополя: говоря о поэте Туманяне настойчиво убеждали меня, что гений Туманяна выше гения Пушкина. Суть конечно не в том, что не совершенней ли архитектура Гарни над архитектурой Акрополя, гениальней ли Туманян, чем Пушкин, суть, и суть конечно печальная, в том, что и поэзия, и архитектура, и наука, и история сама по себе, по существу своему в разговорах некоторых моих собеседников перестают значить. Они значат лишь для того, чтобы обнаружить превосходство армянского национального характера над национальным характером других народов. Не поэзия оказывается важна, а важно лишь доказать, что армянский национальный поэт выше скажем, русского или французского поэта. Мои собеседники, сами того не замечая, обедняли свои души и сердца тем, что переставали радоваться поэзии, совершенству архитектуры, величию науки, а видели в поэзии и науке лишь средство утверждать своё национальное превосходство. Это стремление бывает так фанатично, узко, что минутами кажется проявлением безумия.» (\"Знамя\", н.11, 1988)   Трудно заподозрить Гросмана в антиармянских настроениях, но сдаётся мне, что с его мнением согласятся многие. Возможно такое отношение к инородцам и их культуре, также является причиной исключительной мононациональности Армении. Так, в 1987 году армяне окончательно избавились от азербайджанского населения, насильственно изгнав последние 200 тысяч азербайджанцев из бывшего Эреванского ханства, в котором до захвата его Россией проживало всего 5% армян. Когда-то в центре Эревана стоял ханский дворец, представляющий собой шедевр восточной архитектуры:                Чтобы утвердится на чужой земле, армяне разрушили дворец до основания, не оставив и следа от этого великолепного сооружения, ибо сами армяне никакого исторического доказательства о том, что Ереван является древним армянским городом не имеют. В действительности на месте современного Еревана находился Еребуни – один из городов Урарту, которое с некоторых пор армянские историки представляют древним армянским государством. Надо отметить тот факт, что армянские нацисты не упускали возможности варварского уничтожения азербайджанской архитектуры. В 1918 году армяне под предводительством большевика Шаумяна подняли в Баку мятеж, истребляя азербайджанское население (2,3), которое вынуждено было бежать. Завладев городом они решили разрушить самое красивое здание «Исмаилия». Прикатив пушку они прямой наводкой стреляли, но здание оказалось настолько прочным, что им не удалось полностью разрушить его.      С целью спасения Азербайджана от армянских нацистов Турция, направила армию, выбив мятежников из Баку и других городов, предотвратив дальнейшее разорение страны. Позже здание было восстановлено:    Своё варварское отношение к Азербайджану армяне продолжили и в оккупированном Карабахе. За 30 лет они разрушили все мечети, а город Агдам сожгли полностью.     В противоположность вандализму армян азербайджанцы ни в 1918 году, ни в 1989 году не позволили себе разрушить армянскую церковь, которая до сих пор благополучно стоит в самом центре Баку. При этом армяне по всему Миру тиражируют ложь об азербайджанцах как варварах и вандалах, устроивших геноцид армян, не имея на то веских доказательств.         Позволю себе вернуться к известным сумгаитским событиям 1988 года, за которыми стоит заранее разработанный коварный план.  Как я писал, в 1987 году армяне начали изгнание азербайджанцев из Армении, точнее из Кафана, город в Зангезуре (азербайджанская область, переданная Москвой Армении в 1920 году) с наиболее многочисленным азербайджанским населением. В Советском Союзе появились тысячи беженцы и это в мирное время. Как обычно, центральная власть скрывала социальные явления, не свойственные для самого справедливого советского общества. Власти в Баку тоже не предпринимали никаких действий, ожидая распоряжения Москвы. Единственное, что они сделали, это не пустили бездомных беженцев, ищущих справедливости, в Баку, остановив их в Сумгаите, что оказалось, как выяснилось позже, правильным решением. Время шло, беженцы оставались без крыши, без пищи в ожидании помощи, которая запаздывала, ибо Москва упорно молчала, а трусливые партийные секретари, как это принято в системе, без распоряжения сверху не имели права на самостоятельные решения. Взрывоопасная обстановка назревала, и в конце концов случилось то, что не могло не случиться. Среди беженцев появились провокаторы, так некий Григорян призывал бездомных врываться в дома проживающих в Сумгаите армян. В результате беспорядков было убито 26 человек. Погромы были засняты на кинокамеру и буквально через несколько часов плёнка оказалась в Лондоне, что весьма необычно для Советского союза тех лет. В те годы даже кинокамер у населения не было. Всё это указывает на заранее спланированное армянскими нацистами действо. Страшно представить, но такое могло произойти в Баку, надо думать на это и рассчитывали армяне. Моментально в Армении и Карабахе началось массовое насильственное изгнание азербайджанского населения и затем война с оккупацией 20% азербайджанской территории. Кстати, на стороне армян принимала участие регулярная советская армия, - 366-ой гвардейский мотострелковый полк.       Изгнание армян из Азербайджана явилось естественным ответным шагом, подчеркиваю именно ответным, что тщательно скрывается армянами.    Позволю себе вновь обратиться к народному менталитету. Изгнанные из Армении и Карабаха азербайджанские беженцы нашли приют в Азербайджане, а вот  армяне оказались где угодно, но только не в Армении, разнося по всему Миру ложь о геноциде бедных несчастных армян в надежде вызвать жалость и настроить мировое сообщество против Азербайджана и его народа. Поведение армянских беженцев, предпочтивших другие страны вместо так называемой исторической родины, лишний раз указывает на искусственное государственное образование под названием Армения.               См. продолжение",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "August 14, 2023, 08:59:50 AM",
      "body": "Продолжение: Надо сказать, что Гросман не единственный из авторитетов, описавших менталитет армян. Известный грузинский поэт и публицист XIX Илья                                          Чавчавадзе писал, как армяне оскорбляли и унижали Грузию и грузинский народ («Армянские ученые и вопиющие камни»):     «Вряд ли найдется на земном шаре народность, которая была бы так оскорбительно унижена, обесславлена всеми, кому только не лень было это делать, как наша. Всякий старается или перешагнуть через нас, или затоптать и сравнять с землею. Чуть ли не хотят уничтожить и воспоминание о нас в Закавказье, стереть с лица земли имя грузина и отдать на волю ветра. Как будто нас никогда не существовало, как будто нет нас и ныне. Нищие духом, слабоумные, нравственно-падшие, глупые, необразованные, невоспитанные, разоренные в конец, ненадежные, трусы –вот картина нравственного и физического нашего багажа! Вот чем мы были, и что мы есть, по словам тех, интересы которых требуют такого нашего бесславия и унижения. Из кожи лезут вон они, чтобы уверить всех и вся, дома и на стороне, на словах и в печати, что мы были негодными и недостойными и остались таковыми же, если только не хуже. С таким клеймом на челе они пустили имя грузина по Европе, куда только голос и перо их могли иметь доступ. Такую же славу о нас, грузинах, они пустили по России, Правда, всякий кто только из русских или европейцев самолично успевал ознакомиться с хорошими и дурными нашими сторонами, сказал кое-что и в нашу пользу, – но, к несчастью, и среди их многие суждения свои обосновывали на вожделении других, плясали по чужой дудке и попадали в чужие сети. Бог с ними, с их старанием обесславить нас! Но дело в том, что они словом и пером клянутся всему миру, будто испокон века по сю сторону Кавказского хребта, до истоков Тигра и Евфрата,  почти от Черного и Каспийского морей, была так называемая Армения».         Главной целью, нацистской партии «Дашнакцутюн», было создание «Великой Армении» (2,3) путём этнической чистки и террора в основном тюркского и курдского населения Ближневосточного региона, что и было в последствии осуществлено в Турции и Азербайджане в годы Первой мировой войны, и вновь повторено в Карабахе.(4,5,6)     Расистский подход к грузинскому народу (враци, армянское обозначение грузин) со стороны армян описал Чавчавадзе:«Враци эти, как народ, не заслуживают де упоминания, так как они находятся на пути к уничтожению и вырождению, да если бы это было и не так, то у них нет настолько ума, чтобы вникнуть в свое положение. Бог не дал им способности к торговле: кроме-де извозничества и чалвадарства они ни на что не годны и не могут даже пользоваться теми немногими местами для хлевов, которые, смешно сказать, величают Грузиею. Да и как они ими могут пользоваться, когда на то у них нет ни умения, ни трудолюбия, ни образования, ни знания, ни желания, ни охоты знать и поучиться – ну, хотя бы у тех же армян, которые, мол, призваны Богом и историей со знаменем культуры в руках оживить и осчастливить не только ближний Восток, но и дальнюю, дикую и невежественную Азию.» « Не довольствуясь тем, что позорят наше имя, лишают нас национального достоинства они, чтобы окончательно сжить нас со света, упраздняют и всю историю нашу, и летописи, и исторические остатки и памятники, все, кровью обагренные, заслуги наши пред христианством и все, принадлежащее нам, наше историческое достояние, путем разных плутней, приписывают себе. Правда, «у лжи ноги коротки», и, отнимая или умаляя чужие достоинства, своих не приумножишь, но «раб своих вожделений туг на ухо и горазд на язык », как говорит грузинская пословица.»      Всё что Чавчавадзе писал об отношении армянских лжеисториков к грузинам, повторяется и в случае с Азербайджаном. Чавчавадзе невольно предсказал ситуацию, происшедшую через век в Азербайджане. Русские, поселившие армян с Ближнего Востока на землях Азербайджана, предварительно депортировав азербайджанцев, создали ситуацию, которая привела к Карабахской войне:  У Чавчавадзе: армяне «селятся там, где никогда не жили. Разве не ясно, что этой поверхностной ученостью они желают убедить мир, будто за ними историческое право занять эти места…»      Эта ситуация тождественна той, которая имеет место быть в Карабахе. Образовавшаяся в бывшем Карабахском ханстве армянская диаспора из переселённых царским правительством армян со временем предъявила права на эту территорию Азербайджана.         Из текста Чавчавадзе видно, что уже в его время в Европе армянская пропаганда распространяла такую же ложь о грузинском народе, как сегодня об азербайджанском. Сознание человека таково, что первые сведения воспринимаются за истину и этим пользуются армяне спеша первыми донести несведущему ложь и в этом они великолепно преуспели. Расселяясь по всему Миру, покидая Армению в поиске лучшей жизни, они обвиняют соседние народы в варварстве и геноциде, находя в этом оправдание как своей эмиграции, так и в призыве оказания помощи бедным, изгнанным армянам в создании Великой Армении за счет территории соседних народов. Интересно, что если азербайджанцы, изгнанные из Армении, нашли приют в Азербайджане, то в ответ изгнанные из Азербайджана армяне оказались где угодно, но только не в Армении, распространяя по всему Миру потоки лжи об азербайджанцах как варварах и злодеях, умалчивая об насильственном изгнании азербайджанцев из Армении, собственно с чего и начался Карабахский конфликт. Сегодня армян, проживающих в Америке, больше, чем в самой Армении, так что армянским историкам пора уже задуматься над рисованием карты Великой Армении от океана до океана. «Смелость, нахальство их день ото дня увеличиваются более и более, смелее и смелее начинают они восхвалять себя и все более и более бесцеремонно обращаться с нами. Нигде так ясно не обрисовывается раз навсегда принятая ими программа действий, усвоенная хитрость и пронырливость, как в одной европейской газете, в которой по порядку перечислено все, могущее служить к возвеличению и прославлению армян и к уничтожению грузин, внушенное, очевидно, этими учеными грамотеями. Здесь уже эти господчики ничем не стесняются, не брезгают, Они явно и откровенно пускают в ход такие проделки и средства, одна мысль о которых должна вызывать краску стыда на лице всякого человека, будь он армянин или кто другой.» - писал Чавчавадзе.    Ну, хорошо, пусть говорят, в конце концов у каждого народа есть свой национальный менталитет, отличающий его от других. Однако, данное обстоятельство не так безобидно, как представляется на первый взгляд. Дело в том, что подобное самомнение имело весьма трагические последствия. Нет сомнения, исторические изыскания армянских ученых, доказывающих превосходство армян над соседними народами, служат обоснованию территориальным претензиям. Википедия заполнена лживыми рассказами (именно рассказами, армянских лжеисториков об армянском народе как о самом древнем на земле, причем они обходят известный исторический факт о том, что армяне пришли в Малую Азия из Фракии, перебравшись во Фригию, а затем обосновались в Урарту, и сегодня преподносят, Урарту как древнее армянское государство.          Подобных исторических фейков об Армении великое множество, так в Википедии относительно Туркманчайского договора армянский лжеисторик пишет: «по Туркманчайскому договору к России отходили территории Восточной Армении – Эриванское и Нахичеванское ханства.» На самом же деле в истинном тексте Туркманчайского договора между Россией и Персией от 10 февраля 1828 года нет ни слова о Восточной Армении:Статья III   Его Величество Шах Персидский от своего имени, и от имени своих наследников, и преемников, уступает Российской Империи и совершенную собственность Ханство Эриванское по сию и по ту сторону Аракса, и Ханство Нахичеванское. В следствие сей уступки, Его Величество Шах обещает, не позже шести месяцев, считая от подписания настоящего договора, сдать Российским Начальствам все Архивы и публичные документы, относящиеся до управления обоими вышеозначенными Ханствами. ( Туркманчайский мирный договор (msu.ru) ) (7)        Да и как в договоре могло быть упоминание о том, чего никогда и не было. Ну разве, что у армянских лже-историков. Отсюда вывод, если хотите знать правду об Армении, не ищите её в изложении армянских историков и особенно в Википедии.       Российская империя, имея далеко идущие стратегические цели, создала для армянского народа искусственный анклав вдоль границ с Османской империей, являющейся противником российской экспансии на Кавказе. С этой целью территория бывшего Ереванского ханства была предоставлена армянам со всего Ближнего Востока на землях предварительно депортированных азербайджанцев. Депортация азербайджанцев была продолжена и при советской власти, когда Москва волевым решением передала в 1920 году часть азербайджанской территории Зангезур республике Армении из-за чего область Нахичевань, как я указывал выше, оказалась отделённой от Азербайджана.     Сегодня Армения отказывается выполнять взятые обязательства по итогам 44 дневной войне, более того, чиня провокации, она всячески затягивает процесс нормализации отношений. Протестуя против вполне законного создания на границе с Арменией КПП, армяне в тоже время препятствуют восстановлению бывшей дороги Баку-Нахичевань. Поведение руководства Армении подобно ситуации с Буридановым ослом (. Ереван предъявляет претензии России, требуя политической поддержки и военной помощи от России, которой армяне по гроб жизни должны быть благодарны за то, что именно России обеспечила их государством, которого у них никогда не было, и одновременно, предавая Россию, пытаются найти нового покровителя среди стран Запада, который бы осуществил бы их эфемерную мечту о Великой Армении от моря и до моря. Но самое удивительное, что вряд ли армяне, покинув диаспоры в благополучных странах, переместятся в Великую Армению. И пример тому факт, что вне Армении проживает около 10 миллионов армян, в самой же Армении не более 3 миллионов, да и это количество стремительно сокращается по причине коррупции и всесильной мафии, на которые указывал французский армянин Шарль Азнавур, рекомендуя армянам создавать мафии не в своей стране, а в других странах: «Хотите быть мафиози? — Формируйте вашу мафию в другой стране. Не делайте это в вашей стране, не делайте этого против вашего народа».(9)1.   Народная судьба, или каждому сверчку свой шесток. https://alikbahshi.livejournal.com/28564.html   2.   А была ли «Великая Армения». https://alikbahshi.livejournal.com/71952.html 3.   «Великая Армения» или Великая Ложь. https://alikbahshi.livejournal.com/91885.html 4.   К вопросу о геноциде, или почему Армения остерегается суда. https://alikbahshi.livejournal.com/44394.html 5.   Дырка в портрете, или от Великой Лжи к Великой Армении.   https://alikbahshi.livejournal.com/14877.html            6.   Азербайджан, Азербайджан. https://alikbahshi.livejournal.com/13967.html            7.   Врать прекратите! https://alikbahshi.livejournal.com/89276.html                8.   Армения в роли Буриданова осла. https://alikbahshi.livejournal.com/58251.html               9.  Азнавуровский «синдром геноцида». https://alikbahshi.livejournal.com/10643.html     13.08.2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}