{
  "id": "topic_5417338",
  "title": "Jossque",
  "author": "Jossque",
  "created_time": "October 16, 2022, 09:01:22 PM",
  "content": "Samsung Next tarafından fonlanan önümüzdeki sene tokenini çıkaracak metaverse projesi ücretsiz nft dağıtıyor.Referansla birlikte nft claim edebiliyorsunuz.https://helixmetaverse.com/#mainNft sahiplerine airdrop olarak kendi tokenlerini verebilirler.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417338",
  "comments": [
    {
      "author": "bobita",
      "created_time": "October 16, 2022, 10:17:13 PM",
      "body": "Sitede projeyle, ekiple ilgili gerçek anlamda bir bilgi yok, tokenomi kısmında da elle tutulur bir şey yok, bazı görseller, bolca hikaye ve epeydir son derece popüler olan oyna/kazan vaadi var. Ama buna karşılık airdrop kazanma butonu en görünür yerde ve tıklayınca tabii ki cüzdan bağlaman gerekiyor.Çok detaylı incelemedim, gerek de duymadım açıkçası, çünkü varsayalım ki (yukarıda yazdığım nedenlerden dolayı) kötü niyetli olmasa da, enine boyuna iyice kurgulanmış, öncesi, sonrası vb iyi düşünülmüş bir proje değil, bir yere varacağını zannetmiyorum. Cüzdan bağlamadan aksiyon alınabilseydi denerdim belki ama şu sayfaya cüzdan falan bağlamam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "October 17, 2022, 09:29:34 AM",
      "body": "Ben her zaman boş cüzdanımla yani riske girmeyeceğim cüzdanla deniyorum. Bunu da ara sıra söylüyorum. Tabiki herkesin kendi araştırmasını yapıp ona göre işlem yapması gerekiyor. Kimseye körü körüne inanmamak lazım. Dediklerinize katılıyorum. Ama samsung next gibi bir firma boşu boşuna yatırım yapmaz diye düşündüğüm için paylaşma gereği duydum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 17, 2022, 11:48:25 AM",
      "body": "Quote from: Jossque on October 17, 2022, 09:29:34 AMBen her zaman boş cüzdanımla yani riske girmeyeceğim cüzdanla deniyorum. Bunu da ara sıra söylüyorum. Tabiki herkesin kendi araştırmasını yapıp ona göre işlem yapması gerekiyor. Kimseye körü körüne inanmamak lazım. Dediklerinize katılıyorum. Ama samsung next gibi bir firma boşu boşuna yatırım yapmaz diye düşündüğüm için paylaşma gereği duydum.Boş cüzdanla denemenin bir zararı yok, fazla bir zamanda harcattırmayan bir eylem. Bobita'nın söylediği eleştirilerde haklılık payını olduğunu düşünüyorum. Sitede sadece görseller eklenmiş ve airdrop kutucuğu var bunun haricinde hiç bir ayrıntı verilmemiş. Sadece vitrin yapmışlar içi boş gibi yani. Samsung next gibi bir firma diyorsun da hocam kimleri kimlerle partner olarak gördük bir çoğu da şuanda yoklar piyasada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}