{
  "id": "topic_5415038",
  "title": "Kongxx",
  "author": "Kongxx",
  "created_time": "September 27, 2022, 05:30:08 AM",
  "content": "Binance has been banned in my country without my awareness. But i still have coins in Binance. I can no more access this site.Can you help me access Binance?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415038",
  "comments": [
    {
      "author": "Piesel",
      "created_time": "September 27, 2022, 05:36:35 AM",
      "body": "Quote from: Kongxx on September 27, 2022, 05:30:08 AMBinance has been banned in my country without my awareness. But i still have coins in Binance. I can no more access this site.Can you help me access Binance? You need to give us more details on this development e.g1: your country 2: when did the ban happens3: did you receive any email from binance before the closing of operations in your countryMy note: do not store large funds on a centralized exchange, to avoid this kind of incident of being denied access to your balance from a third party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2022, 05:41:10 AM",
      "body": "Probably contact customer support and describe your situation. Because as far as I know, you still should be able to take out your funds; it's just that you won't be able to use the trading functionality and their other products.Also, as far as I know Binance doesn't outright ban certain countries overnight. They usually announce it a month or weeks before. Seems like you just left your funds on a centralized exchange and then stopped paying attention, which is definitely not a recommended thing to do.Once you get your funds out, use non-custodial wallets: https://cryptosec.info/wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kongxx",
      "created_time": "September 27, 2022, 05:44:42 AM",
      "body": "Quote from: Piesel on September 27, 2022, 05:36:35 AMQuote from: Kongxx on September 27, 2022, 05:30:08 AMBinance has been banned in my country without my awareness. But i still have coins in Binance. I can no more access this site.Can you help me access Binance? You need to give us more details on this development e.g1: your country 2: when did the ban happens3: did you receive any email from binance before the closing of operations in your countryMy note: do not store large funds on a centralized exchange, to avoid this kind of incident of being denied access to your balance from a third party.1 Malaysia2. No idea3. NoEven the Binance app cannot be installed on hp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 27, 2022, 05:50:31 AM",
      "body": "Quote from: Kongxx on September 27, 2022, 05:30:08 AMBinance has been banned in my country without my awareness. But i still have coins in Binance. I can no more access this site.Can you help me access Binance? Contact Binance customer support.Quote from: Kongxx on September 27, 2022, 05:44:42 AM1 Malaysia2. No idea3. NoEven the Binance app cannot be installed on hp.This link would be of help:https://www.imoney.my/articles/binance-malaysia/ampQuote from: https://www.imoney.my/articles/binance-malaysia/ampCan you use Binance in Malaysia? Officially, no. Binance is listed on the Securities Commission Malaysia's (SC) Investor Alert List, which identifies unauthorised websites, products, companies or individuals. The SC advises investors not to invest with any companies or individuals that aren't licensed or approved.QuoteBinance to be disabled in MalaysiaThe SC has also made it harder for Malaysians to access Binance. On July 30, it announced that it would take enforcement actions against Binance for continuing to operate illegally in Malaysia. It has ordered Binance to:Disable the Binance website (www.binance.com) and mobile applications in Malaysia within 14 business days from July 26, 2021Immediately cease all media and marketing activities, including circulating, publishing or sending any advertisements and/or other marketing material, whether via emails or otherwise, to Malaysian investorsImmediately restrict Malaysian investors from accessing Binance’s Telegram group",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2022, 05:51:14 AM",
      "body": "Quote from: Kongxx on September 27, 2022, 05:44:42 AMEven the Binance app cannot be installed on hp.Here's Binance's customer support URL: https://www.binance.com/en/chatIf you can't even access the website, try using a VPN temporarily just so you can get in and talk to customer support.Alternatively, here's Binance's customer support Twitter account: https://twitter.com/BinanceHelpDesk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 27, 2022, 11:25:48 AM",
      "body": "after you check if anyone else from your country has the same problem, You need to talk with Binance support.once, my country was banned by Binance due to some financial disagreements. (it lasted about a month) during that time, I had access to the funds and my wallet there (withdraw only), but I was not able to trade. when the disputed problem is resolved, after talking with support, my account was unblocked almost immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 27, 2022, 01:22:38 PM",
      "body": "Try going to binance.com and logging in to your account. If you can't access that, Opera (the Browser) offer a free vpn service you can use to spoof where you are (hopefully - I remember they had a location spoofer but I'm not sure if it's still there). You should then be able to load up binance and login to withdraw funds.You might want to check news outlets and their support though in case they're only banned for a short time and you don't want to go to the hassle of moving funds around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 27, 2022, 02:41:38 PM",
      "body": "Quote from: examplens on September 27, 2022, 11:25:48 AMafter you check if anyone else from your country has the same problem, You need to talk with Binance support.No one from his country should be able to access Binance as its been banned by Malaysia itself. Well, at least not without VPN.Quote from: https://markets.businessinsider.com/news/currencies/binance-malaysia-operations-illegal-futures-derivatives-germany-italy-netherlands-2021-7Malaysia's securities commission on Friday ordered cryptocurrency exchange Binance to halt its operations in the next 14 days for illegally operating a digital asset exchange.The commission said Binance must disable both its website and mobile application 14 days from July 26, immediately cease all media and marketing activities, and immediately restrict Malaysian investors from accessing Binance's group in Telegram, a messaging app. @Kongxx did you go through KYC on Binance? I am asking because if you haven't (assuming that Binance blocked every user with Malaysian ID, as they should) maybe you are still capable of accessing your account via VPN and getting your funds out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 27, 2022, 02:49:43 PM",
      "body": "In the worst case, and if you have completed the identity verification, only the withdrawal option will be available, as Binance has banned many countries and allowed them to withdraw within 6 months.Therefore, by using VPN, it is assumed that you will be able to withdraw your money, but contacting the support team will be appropriate, since there may be other reasons for banning your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "September 27, 2022, 02:54:50 PM",
      "body": "Quote from: Kongxx on September 27, 2022, 05:30:08 AMBinance has been banned in my country without my awareness. But i still have coins in Binance. I can no more access this site.Can you help me access Binance? We can't help you to access your account. Contact the official Binance support and follow their instructions. If you still have your account details, it should be no problem to get your coins send to a wallet of your choice. The Binance support is quite good and I am sure you will be able to fix your issue in a few days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "September 27, 2022, 03:41:16 PM",
      "body": "Quote from: hugeblack on September 27, 2022, 02:49:43 PMIn the worst case, and if you have completed the identity verification, only the withdrawal option will be available, as Binance has banned many countries and allowed them to withdraw within 6 months.Wouldn't using a VPN only allow OP access to Binance's website and not necessarily allow him to withdraw funds?  What if Binance requires KYC and the only thing OP has is a Malaysian ID?  I'd think at that point Binance wouldn't allow him to do anything if indeed they've cut off service to the entire country.And if that's the case, why wasn't it made known that this was going to happen?  That doesn't seem right, at least not for a big, reputable exchange such as Binance.  They should have at least let Malaysian customers withdraw their funds prior to shutting them out, no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 27, 2022, 05:30:27 PM",
      "body": "Quote from: Kongxx on September 27, 2022, 05:30:08 AMCan you help me access Binance? You can try contacting Binance support with email, and I am sure they will answer you something, but I just can't believe they didn't send you any notification about this.If you passed kyc verification they will have to explain what happened, maybe they just banned your IP address or they made some country based restrictions.Try visiting Binance website from different device and other location in your country to see if you can access it.I think Binance also have customr support on Twitter @BinanceHelpDesk, so you can also try contacting them that way. PSNever use any centralized exchange for holding coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "September 27, 2022, 06:09:36 PM",
      "body": "Quote from: The Pharmacist on September 27, 2022, 03:41:16 PMI'd think at that point Binance wouldn't allow him to do anything if indeed they've cut off service to the entire country.They were forced by the Malaysian government to close down their services back in July 2021. Binance announced that pretty early and users had a certain period to withdraw their funds.QuoteThe crypto exchange had restricted its services in Malaysia back in July 2021 after an order from the SC over non-compliance with the regulatory laws.Source: https://cointelegraph.com/news/binance-back-in-malaysia-via-a-strategic-stake-in-regulated-digital-exchangeBy the way, in 2022 Binance bought a strategic stake in the country’s regulated exchange MX Global. Since we cannot accurately assess the case, Binance Support is probably the only help. Write an email and explain the issue. I am pretty sure, they will be able to help. OP can keep us updated if he has new information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 27, 2022, 06:58:04 PM",
      "body": "Quote from: The Pharmacist on September 27, 2022, 03:41:16 PMQuote from: hugeblack on September 27, 2022, 02:49:43 PMIn the worst case, and if you have completed the identity verification, only the withdrawal option will be available, as Binance has banned many countries and allowed them to withdraw within 6 months.Wouldn't using a VPN only allow OP access to Binance's website and not necessarily allow him to withdraw funds?  What if Binance requires KYC and the only thing OP has is a Malaysian ID?  I'd think at that point Binance wouldn't allow him to do anything if indeed they've cut off service to the entire country.And if that's the case, why wasn't it made known that this was going to happen?  That doesn't seem right, at least not for a big, reputable exchange such as Binance.  They should have at least let Malaysian customers withdraw their funds prior to shutting them out, no? The article shared by Rikafip is from July 2021, where is announcing that Binance will \"halt operations in Malaysia by mid-August\" so more than a year has passed since then. I am not sure that it will be possible to access the account for people from Malaysia, mandatory KYC was introduced even earlier on Binance, so using a VPN has no purpose, because the OP's account has already been marked as from a banned country.I believe that it is not too much of a burden for them Binance and that they kept their accounts and at least allowed them to withdraw, but for such cases, they can always refer to a long period that has passed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "September 28, 2022, 02:45:06 AM",
      "body": "Quote from: mk4 on September 27, 2022, 05:51:14 AMQuote from: Kongxx on September 27, 2022, 05:44:42 AMEven the Binance app cannot be installed on hp.Here's Binance's customer support URL: https://www.binance.com/en/chatIf you can't even access the website, try using a VPN temporarily just so you can get in and talk to customer support.Alternatively, here's Binance's customer support Twitter account: https://twitter.com/BinanceHelpDesk@Kongxx. This is the best advice in the thread and it might be your only choice. The will process a withdrawal manually to your wallet. However, Binance support might ask you for more information about your identity. You should be ready and prepare your government issued identification cards and a monthly bill not older than 3 months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 28, 2022, 05:16:59 AM",
      "body": "Idk if this still works, try using one of these alternatives (I make sure these are all verified):Code:binance.ccbinance.meI used to use .cc when my internet provider blocked binance.Or use this method: Cara Membuka situs Binance dan Reddit tanpa VPN di android, pc, linuk dan iosSince you're Malaysian, you shouldn't have too much trouble understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "September 29, 2022, 02:07:45 AM",
      "body": "@rat03gopoh. If those alternative domains or real, Kongxx should never use them. The Malaysian regulators has clearly said that Binance should be blocked already. The conditions are not coming from unclear regulations anymore. The regulators have become presently very clear that any Malaysian citizen should be blocked from Binance. If Kongxx has only a few dollars in his account, he can take the risk. However, if it is money that he cannot lose, mk4 has made the best suggeestion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "September 30, 2022, 11:27:19 AM",
      "body": "Quote from: Kongxx on September 27, 2022, 05:44:42 AMQuote from: Piesel on September 27, 2022, 05:36:35 AM3: did you receive any email from binance before the closing of operations in your country~Snipped~3. NoDoes this also apply to the \"spam folder\" in your email?- Why Can’t I Receive Emails from BinanceQuote from: The Pharmacist on September 27, 2022, 03:41:16 PMAnd if that's the case, why wasn't it made known that this was going to happen?  That doesn't seem right, at least not for a big, reputable exchange such as Binance.  They should have at least let Malaysian customers withdraw their funds prior to shutting them out, no? Judging by \"the content of this announcement\", it seems that they warned their Malaysian customers but the heads-up came a few days prior to its deadline [that's quite strange, especially if the same thing also applies to the ones they've sent by email].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 01, 2022, 12:51:40 AM",
      "body": "First of all, OP keep your queries about a particular situation in the thread itself don't create new for every query rises from the reply of forum members unless it is really necessary.And you forgot the thumb rule, not your keys not your cryptos.About the situation it is almost impossible to retrieve the funds back after the time period given by the exchange so even if you manage to contact the support in other media the chances are less for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}