{
  "id": "topic_5422095",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "November 18, 2022, 10:44:46 AM",
  "content": "Это дофига как много! И далеко не все из этих 8 миллиардов людей – счастливы. Увы, как мне кажется, реально счастливы только очень небольшая часть. Доли процента, ИМХО. А все остальные имеют те или иные проблемы. Но как им помочь? А – никак. В этом мире существует только примерно человек 10 (или меньше), которые реально могут повлиять на уровень счастья миллиардов остальных людей. И все. Остальные люди повлиять не могут никак, или почти никак.    Но! Выход есть! Ведь можно создать свой собственный мир. Мирок. Небольшой, но уютный. Чисто только для своих близких. И вот тут, практически каждый может повлиять на этот свой микромир. Сделать его лучше и чище. Сделать его комфортным и удобным. Сделать так, чтобы вашим близким было тепло и душевно. Чтобы все ваши близкие люди чувствовали теплоту и заботу. Это под силу почти каждому жителю  этой планеты. Тут уже нет ничего невозможного.    Так давайте делать добро близким. Да. Мы не можем изменить этот мир к лучшему. Но мы можем его  сделать лучше для своих друзей и родственников. Это реальные и возможные усилия. Нет ничего невозможного, нужно только приложить немного усилий. И все будет хорошо. Обещаю вам. Поверьте!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422095",
  "comments": [
    {
      "author": "xandry",
      "created_time": "November 18, 2022, 11:03:14 AM",
      "body": "Quote from: bonfire66 on November 18, 2022, 10:44:46 AM        Это дофига как много! И далеко не все из этих 8 миллиардов людей – счастливы. Увы, как мне кажется, реально счастливы только очень небольшая часть. Доли процента, ИМХО. А все остальные имеют те или иные проблемы. Но как им помочь?Как вы удержались от пропаганды чайлд-фри, ведь так всё складно начиналось?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "November 19, 2022, 11:42:50 AM",
      "body": "Quote from: bonfire66 on November 18, 2022, 10:44:46 AMТак давайте делать добро близким. Да. Мы не можем изменить этот мир к лучшему. Но мы можем его  сделать лучше для своих друзей и родственников. Это реальные и возможные усилия. Нет ничего невозможного, нужно только приложить немного усилий. И все будет хорошо. Обещаю вам. Поверьте!Ты уже сделал мир лучше для своего друга, теперь локти кусаешь и не знаешь как бабки вернуть назад  Если ты так топишь за добро и изменение мира к лучшему, то почему ты хочешь чтобы друг тебе отдал долг и падчерица слезла с твоей шеи? Просто долг и продолжать спонсировать падчерицу пока не умрешь. У тебя какие-то двойные стандарты.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 21, 2022, 09:08:22 AM",
      "body": "Похоже, вы так и не прочитали так называемую \"книгу мудрости\", которую я так рекламирую. Да, дети - это зло, особенно свои, особенно когда они отвлекают от продвижения карьеры. Но сейчас моя карьера уже давно сделана. Моя жизнь катится на закат и теперь, я могу спокойно тратить нажитое. Да, когда я работал и зарабатывал, то тратил много. Но даже сейчас, не смотря ни на что, я могу позволить себе нормальную жизнь, не работать, содержать семью. Просто с возрастом потребности уменьшаются (у всех по-разному, но у меня так). Я объездил уже 48 стран мира, повидал столько всего разного, включая морские глубины до 90 метров, прыжки с парашютом, парапланы, кухни народов мира... что теперь могу просто сидеть, попивать пиво и думать об том, куда бы пристроить чужого ребенка.А вот если бы я, когда-то, вместо того, чтобы заниматься саморазвитием занимался бы производством детей, то хрен бы сейчас бы я имел бы то, что имею. Так что я все, в общем-то, сделал правильно. Вовремя не завел детей, вовремя купил биткоинов.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VladisE",
      "created_time": "November 29, 2022, 05:55:20 PM",
      "body": "Quote from: bonfire66 on November 18, 2022, 10:44:46 AM        Это дофига как много! И далеко не все из этих 8 миллиардов людей – счастливы. Увы, как мне кажется, реально счастливы только очень небольшая часть. Доли процента, ИМХО. А все остальные имеют те или иные проблемы. Но как им помочь? А – никак. В этом мире существует только примерно человек 10 (или меньше), которые реально могут повлиять на уровень счастья миллиардов остальных людей. И все. Остальные люди повлиять не могут никак, или почти никак.    Но! Выход есть! Ведь можно создать свой собственный мир. Мирок. Небольшой, но уютный. Чисто только для своих близких. И вот тут, практически каждый может повлиять на этот свой микромир. Сделать его лучше и чище. Сделать его комфортным и удобным. Сделать так, чтобы вашим близким было тепло и душевно. Чтобы все ваши близкие люди чувствовали теплоту и заботу. Это под силу почти каждому жителю  этой планеты. Тут уже нет ничего невозможного.    Так давайте делать добро близким. Да. Мы не можем изменить этот мир к лучшему. Но мы можем его  сделать лучше для своих друзей и родственников. Это реальные и возможные усилия. Нет ничего невозможного, нужно только приложить немного усилий. И все будет хорошо. Обещаю вам. Поверьте!Если для роста численности населения мира с 7 до 8 миллиардов человек потребовалось 12 лет, то для достижения 9 миллиардов человек потребуется около 15 лет — до 2037 года, что свидетельствует о замедлении темпов роста численности населения мира в целом. Или я ошибаюсь?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "November 30, 2022, 09:32:19 AM",
      "body": "Это все просто прогнозы. Если начнется глобальная термоядерная война и очередная суперпандемия - то потребуется больше времени. Этому миру не нужно перенаселение, ибо излишек людишек губит природу и экологию.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dariona",
      "created_time": "November 30, 2022, 05:17:37 PM",
      "body": "Quote from: bonfire66 on November 30, 2022, 09:32:19 AMЭто все просто прогнозы. Если начнется глобальная термоядерная война и очередная суперпандемия - то потребуется больше времени. Этому миру не нужно перенаселение, ибо излишек людишек губит природу и экологию. Да и биткоина на всех не хватит)))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}