{
  "id": "topic_5399800",
  "title": "Sensetive03",
  "author": "Sensetive03",
  "created_time": "May 23, 2022, 09:46:16 AMLast edit: May 26, 2022, 02:51:28 PM by Sensetive03",
  "content": "They keep procrastinating by making excuses. I can't get money for 42 hour. they have no justifications. The amount I will withdraw is 200 dollars",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399800",
  "comments": [
    {
      "author": "Sensetive03",
      "created_time": "May 23, 2022, 11:29:43 AM",
      "body": "They don't give any explanation to my questions. There were even some cases where they turned the live chat off on my face .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "May 23, 2022, 11:54:36 AM",
      "body": "Almost same case with this one https://bitcointalk.org/index.php?topic=5399297.0But in the end he had earned his funds in a long time.So I thought just wait or if your chat is closed then you can email them for this complaint, but we already know that withdrawal from Trustdice is taking a long time.But are you okay with Trustdice meaning it doesn't break the rules?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sensetive03",
      "created_time": "May 23, 2022, 12:01:35 PM",
      "body": "yes i did read that, i did a detailed research on the forum. I see no complaints in the past, but quite a few complaints recently here and the trusty pilot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 23, 2022, 12:37:18 PM",
      "body": "Quote from: Sensetive03 on May 23, 2022, 09:46:16 AMThey keep procrastinating by making excuses. I can't get money for 42 hour. they have no justifications. The amount I will withdraw is 200 dollarsThis is the second time and hopes you are as lucky as the other one the guy got his, within 48 hours yours is also 48 hours it's getting longer now, you did not post how long have you been playing here and if this is the first time that it took them to grant your withdrawal, but if you are a new player and you're not comfortable with the duration of the withdrawal then look for another casino, update us if you've got yours, this a reference of those who will play for the first time here so they are aware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "May 23, 2022, 12:43:05 PM",
      "body": "Guys.... these are small timers...... they hope that their funds will be big enough to cover small wins, but the moment when you want to withdraw bigger amounts, they stall the withdrawals ....because they have to wait for people to lose money, so that they can payout the winnings to you. If they struggle to payout $200..... you should stay away as far as possible from them. There is basically one big hit between them and bankruptcy and the closure of the site.  #1 RatedCrypto Casino In The World",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "keyscore44",
      "created_time": "May 23, 2022, 01:43:40 PM",
      "body": "Quote from: Sensetive03 on May 23, 2022, 12:01:35 PMyes i did read that, i did a detailed research on the forum. I see no complaints in the past, but quite a few complaints recently here and the trusty pilot. I have the impression that often when a withdrawal is delayed in weekend, it takes much longer. I think that the weekends security team is simply not working and because of that are the long delays to push withdrawal manually.I understand the nervousness, but the delays aren't so long that they could be a scam. You just need a little more patience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "May 23, 2022, 02:02:13 PM",
      "body": "Quote from: Sensetive03 on May 23, 2022, 09:46:16 AMThey keep procrastinating by making excuses. I can't get money for 42 hour.they have no justifications. The amount I will withdraw is 200 dollarsI suggest you post a screenshot of the conversation you're having with the site's support and also send a PM to their account here on the forum:https://bitcointalk.org/index.php?action=pm;sa=send;u=2569866and I also suggest you post on their thread:https://bitcointalk.org/index.php?topic=5126117.0if your problem is not resolved after a week i suggest you create scam accusation against them and post all proof you have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "May 23, 2022, 02:19:57 PM",
      "body": "Quote from: Kakmakr on May 23, 2022, 12:43:05 PMGuys.... these are small timers...... they hope that their funds will be big enough to cover small wins, but the moment when you want to withdraw bigger amounts, they stall the withdrawals ....because they have to wait for people to lose money, so that they can payout the winnings to you. If they struggle to payout $200..... you should stay away as far as possible from them. There is basically one big hit between them and bankruptcy and the closure of the site.  #1 RatedCrypto Casino In The World           This is the reality from the Casino that slowly dying due to competiton. Duckdice is same case with this before they pull a scam trick. They are not paying the players win even though some of them is just small amount. They are hoping for the players to lose there patience and to continue playing until they lose. I don't know why there's still players that interested to play on this casino while there's a lot of trusted casino out there that offer much quality games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "May 23, 2022, 02:29:26 PM",
      "body": "Quote from: Slow death on May 23, 2022, 02:02:13 PMalso send a PM to their account here on the forum:I don't think it's will help the @OP since the last active of the representative was May 12, he didn't logged for 11 days.Quote from: Coin_trader on May 23, 2022, 02:19:57 PMI don't know why there's still players that interested to play on this casino while there's a lot of trusted casino out there that offer much quality games.Perhaps the latest promotion they launched about free $25 without any wager requirements that lead him to play in this casino, as we know the other trusted casino mostly doesn't have any welcome bonus promotions anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "May 23, 2022, 02:30:48 PM",
      "body": "I think this issue is not concentrated to just one casino there are many others who are struggling because of competition as well and I do think that at the end of the day you would be able to get your money back but it would take an awful long time. I do think that you should post it in scam accusations but it cannot be considered a scam to be honest it would simply be delaying the funds on purpose causing troubles for the people who are waiting for the funds and at the same time the price of Bitcoins might change and you might even loose from that side. The quality of the site have undeniably compromised, hopefully you will get your funds soon. Do post in Scam accusations and leave them a review hopefully they would follow up on you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 23, 2022, 02:31:03 PM",
      "body": "There are same complain already so it may be possible that they are in the brink. You better believe what others are saying because the pattern of casinos slowly becoming a scam starts with delaying/stalling users that wants to withdraw.Not the kind of casino that should lose trust whilentheir brandname they have includes the word TRUST. Hope to see them survive though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erdogan",
      "created_time": "May 23, 2022, 02:44:04 PM",
      "body": "Quote from: Sensetive03 on May 23, 2022, 12:01:35 PMyes i did read that, i did a detailed research on the forum. I see no complaints in the past, but quite a few complaints recently here and the trusty pilot. Since you did research and did not find a complaints, you should not panic and just write to their support. These types of delays happen also with cryptocurrency withdrawals. Probably your withdrawal has been blocked automatically due to some unnatural movement on your account and just needs manual intervention. I am sure you will receive your money soon. Let us know when your case will end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "May 23, 2022, 03:08:57 PM",
      "body": "Of the many casinos on this forum, why did you choose that casino. Maybe at a later date if your funds have entered then please consider financial problems at the casino. There are many casinos with fast withdrawals. So when one casino doesn't make you comfortable move on to another. Don't get hung up on one but you always complain about the obstacles you're having.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 23, 2022, 03:31:57 PM",
      "body": "Quote from: Kakmakr on May 23, 2022, 12:43:05 PMIf they struggle to payout $200..... you should stay away as far as possible from them. There is basically one big hit between them and bankruptcy and the closure of the site.  Seems like they're proving themself can pay 5x higher from $200 since they're launch signature campaign https://bitcointalk.org/index.php?topic=5399855.0I think it's a matter of time only, similar like the previous complaint. I also don't know what make them slowing their withdrawal, do you bet with their free $25 promotion? It must be a lot abusers and it's time consuming to take care about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "May 23, 2022, 04:06:57 PM",
      "body": "Quote from: Sensetive03 on May 23, 2022, 09:46:16 AMThey keep procrastinating by making excuses. I can't get money for 42 hour. they have no justifications. The amount I will withdraw is 200 dollarsI think in the future trustdice.win will be more effective and efficient. In fact, they have started a Signature Campaign which means going forward this site will be much better. Regarding your late withdrawal it's normal in every casino there is always a problem like this. no need to worry like the cases we have found in the end he too has got what he should have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "May 23, 2022, 04:28:27 PM",
      "body": "Quote from: Erdogan on May 23, 2022, 02:44:04 PMSince you did research and did not find a complaints, you should not panic and just write to their support. These types of delays happen also with cryptocurrency withdrawals. Probably your withdrawal has been blocked automatically due to some unnatural movement on your account and just needs manual intervention. I am sure you will receive your money soon. Let us know when your case will end.I read he's done it via chat, and support turned off live chat, on top of that he's already responded, 48 hours is a long time to wait, it's natural for him to panic. I don't know what happened to the chat, maybe he was too aggressive or impatient. @OP if have any complaints include proof of the chat too, By the way Hopefully your late payment can be received in full.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erdogan",
      "created_time": "May 23, 2022, 04:38:11 PM",
      "body": "Quote from: Doell on May 23, 2022, 04:28:27 PMQuote from: Erdogan on May 23, 2022, 02:44:04 PMSince you did research and did not find a complaints, you should not panic and just write to their support. These types of delays happen also with cryptocurrency withdrawals. Probably your withdrawal has been blocked automatically due to some unnatural movement on your account and just needs manual intervention. I am sure you will receive your money soon. Let us know when your case will end.I read he's done it via chat, and support turned off live chat, on top of that he's already responded, 48 hours is a long time to wait, it's natural for him to panic. I don't know what happened to the chat, maybe he was too aggressive or impatient. @OP if have any complaints include proof of the chat too, By the way Hopefully your late payment can be received in full.The chat has only basic information about what is happening on the platform. They can only forward the case to the security team. Chat staff are not (usually) hired directly by the casino, but an external service, the same is with most hotlines. If chat informed him that the case had been passed on and he had to wait, I am not surprised that after a few identical replies they realized that there was no point in informing him about the same thing over and over again. 42 hours is not a long time considering it was a weekend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "May 23, 2022, 05:35:42 PM",
      "body": "Quote from: Doell on May 23, 2022, 04:28:27 PMQuote from: Erdogan on May 23, 2022, 02:44:04 PMSince you did research and did not find a complaints, you should not panic and just write to their support. These types of delays happen also with cryptocurrency withdrawals. Probably your withdrawal has been blocked automatically due to some unnatural movement on your account and just needs manual intervention. I am sure you will receive your money soon. Let us know when your case will end.I read he's done it via chat, and support turned off live chat, on top of that he's already responded, 48 hours is a long time to wait, it's natural for him to panic. I don't know what happened to the chat, maybe he was too aggressive or impatient. @OP if have any complaints include proof of the chat too, By the way Hopefully your late payment can be received in full.now, that trustdice decided to hold their own sig campaign, i believe they won't like having existing issues from their players. if you can't reach out the team or support, now maybe, you can contact hhampuz as he is the current CM. maybe he can help you out with the situation. also, i don't think he would want to promote a casino with unresolved issue. and @OP, you may want to move it to the scam accusations board  and follow the report format. this board is dedicated for gambling sites/casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "May 23, 2022, 05:35:55 PM",
      "body": "Quote from: Sensetive03 on May 23, 2022, 12:01:35 PMyes i did read that, i did a detailed research on the forum. I see no complaints in the past, but quite a few complaints recently here and the trusty pilot. Don't let a late withdrawal make you decide to stay away from Trustdice. Because it's only about withdrawals and I'm not surprised the delay doesn't mean you've lost money. It's just a matter of confirmation time. I hope your problem will be answered soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}