{
  "id": "topic_5477150",
  "title": "MorganaX",
  "author": "MorganaX",
  "created_time": "December 09, 2023, 10:03:31 AM",
  "content": "Please I’ll like the forum members to enlighten me concerning bitcoins and make some links available for me to understand bitcoins and other cryptocurrencies",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477150",
  "comments": [
    {
      "author": "Nheer",
      "created_time": "December 09, 2023, 10:06:26 AM",
      "body": "Hi there,I would recommend these website/book as starting pointhttps://github.com/bitcoinbook/bitcoinbookhttps://learnmeabitcoin.com/In case you have specific question, you might find the answer either on https://bitcoin.stackexchange.com/ or this forum. You could use https://ninjastic.space/search to perform search on this forum, which is IMO better than default search function on this forum.Make your self busy if you really want to learn about bitcoin. disregard all stories you hear about people making money from bitcoin and Understand that bitcoin is not a get rich quick scheme so learning should be your focus as a newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "December 09, 2023, 02:00:17 PM",
      "body": "Quote from: MorganaX on December 09, 2023, 10:03:31 AMPlease I’ll like the forum members to enlighten me concerning bitcoins and make some links available for me to understand bitcoins and other cryptocurrencies I will suggest you start reading information from the forum. The forum has enough materials about Bitcoin that can enlighten any newbie. You should also consider reading the Bitcoin Whitepaper to enable you to get a foundation knowledge about Bitcoin. Andreas Antonopoulos is a good educator on Bitcoin, his educational books and videos will be helpful in your path to learn about Bitcoin. His book Mastering Bitcoin: Programming the Open Blockchain can be downloaded freely on some websites. Also, the internet is filled with information on the crypto space, do your research. But ensure you verify the information you get from reliable sources. If you have any relevant questions, you can ask them in the forum and you will quality answers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MorganaX",
      "created_time": "December 09, 2023, 05:14:23 PM",
      "body": "Quote from: Nheer on December 09, 2023, 10:06:26 AMHi there,I would recommend these website/book as starting pointhttps://github.com/bitcoinbook/bitcoinbookhttps://learnmeabitcoin.com/In case you have specific question, you might find the answer either on https://bitcoin.stackexchange.com/ or this forum. You could use https://ninjastic.space/search to perform search on this forum, which is IMO better than default search function on this forum.Make your self busy if you really want to learn about bitcoin. disregard all stories you hear about people making money from bitcoin and Understand that bitcoin is not a get rich quick scheme so learning should be your focus as a newbie. Thanks but I’ll like to ask if this platform is all about bitcoins and it’s advantages, uses to us and it’s help financially",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 09, 2023, 06:34:55 PM",
      "body": "Quote from: MorganaX on December 09, 2023, 05:14:23 PMThanks but I’ll like to ask if this platform is all about bitcoins and it’s advantages, uses to us and it’s help financially The platform is primarily made to discuss the different aspects of Bitcoin, as you can see from the name, but there are other sections of the forum such as discussing economic situations, politics, technological development, selling goods and services, and even a section for altcoins.You. An discuss preety much any topic which is available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 09, 2023, 07:51:11 PM",
      "body": "Quote from: MorganaX on December 09, 2023, 10:03:31 AMPlease I’ll like the forum members to enlighten me concerning bitcoins and make some links available for me to understand bitcoins and other cryptocurrencies This forum is purposely for bitcoin discussions, you will have the opportunity of learning more from here when you're active and mean business to learn, some vital links had already been given, additional ones also have been made available for you when you navigate through the forum to discover some or when you make use of the forum search button on related areas, you can also use here to ask questions that have not been raised before here on begginers and help section, here is an additional threads to help you have enough to discover as well about bitcoin.Bitcoin Historyhttps://bitcointalk.org/index.php?topic=5438353.0Mastering Bitcoinhttps://github.com/bitcoinbook/bitcoinbook",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 09, 2023, 07:54:20 PM",
      "body": "Do you like to read? So I will suggest you read Jameson Lopp Bitcoin ResourcesIf you also love to watch videos, then you can learn from Bitcoin for Beginners by Andreas AntonopoulosWelcome to the forum. Make yourself comfortable while learning about Bitcoin. It's also good to study the rules of the forum. If you obey the forum rules, then you will better enjoy your stay here, but there are some strict rules that could get you banned if you fail to observe them. Make use of ; Beginners & Help EncyclopediaUnofficial list of (official) Bitcointalk.org rules, guidelines, FAQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "December 09, 2023, 08:05:13 PM",
      "body": "Welcome to bitcointalk. There are lots of solid materials here to get you started on your crypto journey. May I suggest you start with the pinned threads on this board. If you get tired of reading and want to watch videos. I recommend you visit  Andreas Antonopoulos YouTube channel. He is one of the few people out there with useful content. His book “ Mastering Bitcoin” is also a good place to start. Quote from: MorganaX on December 09, 2023, 05:14:23 PMI’ll like to ask if this platform is all about bitcoins and it’s advantages, uses to us and it’s help financially This is a bitcoin forum. The primary reason this forum was created was/is for bitcoin enthusiasts and developers to share their ideas and opinions on the project. The forum has evolved from when it first started, there’s been several changes to the forum. Signature campaigns, art contests amongst others are ways members can earn here. If I were you, I wouldn’t think too much about the financial benefits of the forum for now, the currency you can earn on the forum is Bitcoin. You need to first learn how Bitcoin works before you can make a living off it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "December 09, 2023, 10:27:20 PM",
      "body": "Do we always have to make links available for these newbies for easy access on the forum? I mean I don't think they asked for such guidelines when trying to register on the forum which means they can as well find their way round these rules!. The problem is no matter how much help you proffer, some newbie will come up tomorrow and still repeat the process and I begin to wonder how they'd manage to survive here if they can't research or simply surf the boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 09, 2023, 11:52:03 PM",
      "body": "Quote from: Majestic-milf on December 09, 2023, 10:27:20 PM Do we always have to make links available for these newbies for easy access on the forum? I mean I don't think they asked for such guidelines when trying to register on the forum which means they can as well find their way round these rules!. The problem is no matter how much help you proffer, some newbie will come up tomorrow and still repeat the process and I begin to wonder how they'd manage to survive here if they can't research or simply surf the boards. Yes. It does seem silly that they expect so much hand-holding through every step though.  If taking a couple minutes to search and read is too much trouble for them, no wonder they keep repeating the same errors! We all started clueless once and  as long as they're willing to put in the effort to learn, I don't mind giving a few pointers.  But they gotta meet us halfway! We cant spoon feed everything or waste time reexplaining what's easily searchable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "merekamo",
      "created_time": "December 09, 2023, 11:54:27 PM",
      "body": "Quote from: MorganaX on December 09, 2023, 10:03:31 AMPlease I’ll like the forum members to enlighten me concerning bitcoins and make some links available for me to understand bitcoins and other cryptocurrencies bitcointalk ini forum gan, so it's not a place to make quick money. Just like other members I am also a newbie here. If you really want to find topic about crypto related, and use the \"search bar\" and when you find the thread you are looking for, please see date of posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "December 10, 2023, 01:38:07 AM",
      "body": "Quote from: Marvelman on December 09, 2023, 11:52:03 PMQuote from: Majestic-milf on December 09, 2023, 10:27:20 PM Do we always have to make links available for these newbies for easy access on the forum? I mean I don't think they asked for such guidelines when trying to register on the forum which means they can as well find their way round these rules!. The problem is no matter how much help you proffer, some newbie will come up tomorrow and still repeat the process and I begin to wonder how they'd manage to survive here if they can't research or simply surf the boards. Yes. It does seem silly that they expect so much hand-holding through every step though.  If taking a couple minutes to search and read is too much trouble for them, no wonder they keep repeating the same errors! We all started clueless once and  as long as they're willing to put in the effort to learn, I don't mind giving a few pointers.  But they gotta meet us halfway! We cant spoon feed everything or waste time reexplaining what's easily searchable. You get my drift, bruh. It's not like I'm against encouraging them to feel comfortable on the space but it seems most newbies are more interested in making their first post than anything else. I just wish we can have less \"I'm a newbie\" posts and get something more. For me that line is getting quite old.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 10, 2023, 04:30:07 AM",
      "body": "Lots of information on the web. But here's my copypasta:* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://chainsec.io* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "December 10, 2023, 04:57:02 AM",
      "body": "Quote from: MorganaX on December 09, 2023, 10:03:31 AMPlease I’ll like the forum members to enlighten me concerning bitcoins and make some links available for me to understand bitcoins and other cryptocurrencies You are in the right place to learn about bitcoin but learning can be easy for you if you are ready and can be focused and can be also consistent in learning. Bitcoin is not something that you can learn everything at a time , learning bitcoin is a gradual process,  take your time and learn so that you will be able to do things right. Learning is the first step in bitcoin which will really help your investment to be productive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "December 10, 2023, 06:06:17 AM",
      "body": "Quote from: MorganaX on December 09, 2023, 10:03:31 AMPlease I’ll like the forum members to enlighten me concerning bitcoins and make some links available for me to understand bitcoins and other cryptocurrencies Bitcoin is a complicated topic, so you need to make a thorough study and bitcointalk forum can be a perfect platform for that. Explore the forum and read as much as you can, that's the only way you will learn and understand the background of bitcoin and how it works and how it can be an asset for us. Learning takes time so you need to stretch your patience and become more motivated so that learning will be more easier and effective.I will not provide links anymore but do your own diligence to study. If your patient enough, then you will find the answers to your questions later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "December 10, 2023, 06:08:43 AM",
      "body": "Quote from: MorganaX on December 09, 2023, 05:14:23 PMQuote from: Nheer on December 09, 2023, 10:06:26 AMHi there,I would recommend these website/book as starting pointhttps://github.com/bitcoinbook/bitcoinbookhttps://learnmeabitcoin.com/In case you have specific question, you might find the answer either on https://bitcoin.stackexchange.com/ or this forum. You could use https://ninjastic.space/search to perform search on this forum, which is IMO better than default search function on this forum.Make your self busy if you really want to learn about bitcoin. disregard all stories you hear about people making money from bitcoin and Understand that bitcoin is not a get rich quick scheme so learning should be your focus as a newbie. Thanks but I’ll like to ask if this platform is all about bitcoins and it’s advantages, uses to us and it’s help financially Yes, the forum focuses on everything related to bitcoin, it’s technical aspects like wallets to use, new bitcoin improve proposals, political aspects and lots. But you can also discuss other cryptocurrencies too. If you have even services to render related to bitcoin or any other cryptocurrency, the forum is also here for That. The forum is also full of experts who have both the technical and fundamental knowledge of cryptocurrency and will help with troubles with you having to pay for anything. Scam projects or phishing wallets or scam sites are also been exposed.Just stick around and follow discussion topics here and you will learn a lot about bitcoin, it’s advantages and concepts. Make sure to read and make more research then ask questions about what you don’t understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OddJobsForBitcoin",
      "created_time": "December 10, 2023, 10:44:13 AM",
      "body": "Follow the discussions going on here and read up the definitions of terms you do not understand. Also pay attention to what some experts like those who understand blockchain technology have to say. You won't miss the experts when you read their posts. They're your greatest resource here. Also learn from the experience of other members, Bear in mind never to part with your bitcoins especially since there are projects and scammers working hard to steal them from you if you have some.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 10, 2023, 12:24:42 PM",
      "body": "Quote from: MorganaX on December 09, 2023, 05:14:23 PMThanks but I’ll like to ask if this platform is all about bitcoins and it’s advantages, uses to us and it’s help financially Welcome to the forum!This platform is indeed a great place to learn about Bitcoin and other cryptocurrencies. It’s not just about the financial aspect, but also about understanding the technology behind it, the blockchain. Bitcoin, as the first cryptocurrency, has paved the way for a new kind of financial system, one that operates independently of traditional banking structures. It offers a decentralized system, meaning no single entity has control over the entire network. It provides a level of transparency that isn’t typically found in traditional financial systems, and it can be a hedge against inflation in certain economies. The value of Bitcoin can be quite volatile, and it’s possible to lose your investment. That’s why it’s crucial to do your research and understand what you’re investing in. Happy learning!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}