{
  "id": "topic_5438844",
  "title": "Cashify",
  "author": "Cashify",
  "created_time": "February 08, 2023, 05:18:47 PM",
  "content": "Serdecznie zapraszamy na pierwsze wydarzenie z cyklu Budujemy przyszłość z Eduweb3, organizowane przez Fundację Eduweb3.Spotkanie skierowane jest do osób, które chcą poszerzyć swoją wiedzę w tym zakresie i zrozumieć, jak te technologie wpływają na nasze codzienne życie.Podczas wydarzenia, będzie można wysłuchać wystąpień ekspertów z branży i uzyskać odpowiedzi na pytania dotyczące różnych aspektów web3 i blockchain. Będzie również możliwość wymiany poglądów i doświadczeń z innymi uczestnikami.Niezależnie od tego, czy jesteś początkującym, czy też masz już doświadczenie w branży, to wydarzenie będzie idealne dla Ciebie. Naszym celem jest zapewnienie wszystkim uczestnikom przyjaznego i interaktywnego doświadczenia, w trakcie którego będą mogli uzyskać odpowiednie wsparcie i nauczyć się nowych rzeczy.Aby dodać jeszcze więcej przyjemności, zapewniamy smaczne poczęstunek w postaci pączków, pizzy i piwka!Rejestracja jest bezpłatna i otwarta dla wszystkich zainteresowanych. Nie zwlekaj, zarejestruj się już dziś i dołącz do nas, aby zdobyć wiedzę i zrozumienie technologii web3 i blockchain!ZAPISY TUTAJ - https://www.meetup.com/pl-PL/fundacja-edu-web3/events/291201986/AGENDA:16:45 - Przybycie zainteresowanych17:00 - Powitanie uczestników spotkania17:15 - Dorian Szafrański - Potencjalne trendy na przyszłą hossę17:50 - Oskar Lange - Higiena portfela, czyli jak być bezpiecznym w web318:25 - Przerwa18:40 - Mariusz Połeć - produkcja filmu z wykorzystanie AI - live!19:15 - Networking21:00 Zakończenie spotkaniaProwadzenie - Jan Paweł TomaszewskiZapewniamy:- świetną dawkę wiedzy- możliwość poznania ciekawych ludzi- darmowe piwko, pizza i pączkiRejestracja jest obowiązkowa, ale nic nie stoi na przeszkodzie, żeby zabrać ze sobą znajomych.ZAPISY TUTAJ - https://www.meetup.com/pl-PL/fundacja-edu-web3/events/291201986/Do zobaczenia na spotkaniu!Zespół Fundacji EduWeb3Partnerzy wydarzeniaCashifyCryptionyZetlyComparic",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438844",
  "comments": [
    {
      "author": "Cashify",
      "created_time": "March 01, 2023, 11:24:20 AM",
      "body": "Cześć! Faktycznie, data była w linku do zapisów ale w poście już nie  Wydarzenie się już odbyło, ale zapraszam do śledzenia naszego telegrama. Wkrótce kolejne wydarzenia w innych miastach. Do Poznania na pewno wrócimy za kilka tygodni.Link do telegrama - https://t.me/fundacjaeduweb3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}