{
  "id": "topic_5450373",
  "title": "Squaremile777",
  "author": "Squaremile777",
  "created_time": "April 27, 2023, 12:32:39 PM",
  "content": "We Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450373",
  "comments": [
    {
      "author": "Fivestar4everMVP",
      "created_time": "April 27, 2023, 12:43:08 PM",
      "body": "Though I don't really understand clearly your message, but based on the little I could grasp, I would say that,There can never be a time when the economy of the world will get relaxed, that is, a time when we can all honestly say, there are no more problems in the world, sorry to be the bearer of bad news, but such a time will never come..It's always gonna be from one problem to the other, and with each of this problems, the money required to solve them must be printed by the government, thereby causing even more problems for the masses through inflation - the sooner we all get an understanding of this, and get our body and mind prepared for it, the better and easier it will be for use to scale through each of this problems, be it economically or otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "April 27, 2023, 12:46:59 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 12:32:39 PMWe Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams. WTF are your blabbing about? I read this over and over and over again but can't relate or comprehend what you wrote mate, are your trying to pass an information or you just want to make use of your keyboards LOL   try to be specific.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Squaremile777",
      "created_time": "April 27, 2023, 12:51:42 PM",
      "body": "Quote from: Churchillvv on April 27, 2023, 12:46:59 PMQuote from: Squaremile777 on April 27, 2023, 12:32:39 PMWe Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams. WTF are your blabbing about? I read this over and over and over again but can't relate or comprehend what you wrote mate, are your trying to pass an information or you just want to make use of your keyboards LOL   try to be specific. I said we waiting for big Money printing brrr.And i said from today we gona have soon on few months BIG Crisis new Crisis.So money printing can start the latest 2024 so the next year.But main point is we Are on hold now all we waiting is new money printing brrrrr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "April 27, 2023, 01:06:53 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 12:32:39 PMWe Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams. Of the various monetary policies that have taken place today, all that I have noticed is that the average country makes a policy of increasing interest rates to suppress inflation that has exceeded the limit. So what are their reasons for printing money again? I honestly don't understand what you are saying as a whole, but from what I know printing money must be marked by several reasons, such as balancing the circulation of money with the circulation of goods, covering companies/banks that are about to go bankrupt, rescue due to the health crisis and others for things - important for the security of the economy and the country.I hope you provide the basic data for the thoughts you convey so that we understand it much better.Countries that overprint money are stupid governments, and they make their currency worthless by having an abnormal amount just like Zimbabwe.Today's economy is looking for a meeting point and balance between the money supply and the amount of goods in circulation, so don't be surprised if the average interest rate increases dramatically, that's the main goal to position inflation at a minimum year on year.Quote from: Squaremile777 on April 27, 2023, 12:51:42 PMBut main point is we Are on hold now all we waiting is new money printing brrrrr I still don't understand, does it mean that the new money is the money issued by the BRICS?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Squaremile777",
      "created_time": "April 27, 2023, 01:56:11 PM",
      "body": "Quote from: bangjoe on April 27, 2023, 01:06:53 PMQuote from: Squaremile777 on April 27, 2023, 12:32:39 PMWe Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams. Of the various monetary policies that have taken place today, all that I have noticed is that the average country makes a policy of increasing interest rates to suppress inflation that has exceeded the limit. So what are their reasons for printing money again? I honestly don't understand what you are saying as a whole, but from what I know printing money must be marked by several reasons, such as balancing the circulation of money with the circulation of goods, covering companies/banks that are about to go bankrupt, rescue due to the health crisis and others for things - important for the security of the economy and the country.I hope you provide the basic data for the thoughts you convey so that we understand it much better.Countries that overprint money are stupid governments, and they make their currency worthless by having an abnormal amount just like Zimbabwe.Today's economy is looking for a meeting point and balance between the money supply and the amount of goods in circulation, so don't be surprised if the average interest rate increases dramatically, that's the main goal to position inflation at a minimum year on year.Quote from: Squaremile777 on April 27, 2023, 12:51:42 PMBut main point is we Are on hold now all we waiting is new money printing brrrrr I still don't understand, does it mean that the new money is the money issued by the BRICS? Reason becouse we need new money in order to continue Same old life as we use to or atleast wealthy ones can keep their wealthy life.Bricks Nation is another story. Banking Crisis Also need again extra money.Until the Stablecoins are ready we continue Money printing brrrr. First one is the USDC the rich ones buying it before others before it gets approved as CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "April 27, 2023, 04:05:14 PM",
      "body": "And that's one major factor why we're having a huge rate for inflation and every time there will be crisis, the band aid solution is to get more money through printing again.It's a cycle and that's why it'll never end and these fiat will have its devaluation for the expense of everybody.But good thing is, we all knew what Bitcoin was and what it's intended for. So, it's best to save Bitcoin instead of these fiat that will have itself devaluated thanks to more printing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 27, 2023, 09:58:49 PM",
      "body": "I think Covid-19 pandemic has really taught us a good lesson on how to get prepared about our lives, most importantly learning to save and plan well with our money without the even looking at the government. There are some people in my country that has suffered enough due to government not paying adequate attention to everyone, i believe only those that saved money was able to scale through the pandemic even as that they were infected by one way or others; One thing you must know is that as life keeps boiling there are some certain problems which may arise in time to come but have not showcased them selves currently. All we need is to be vigilant and very mindful on our expenses because the previous turbulence caught us unaware and at some points we felt of giving up since all nation were captivated by pandemic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arimamib",
      "created_time": "April 27, 2023, 10:16:30 PM",
      "body": "Quote from: Fivestar4everMVP on April 27, 2023, 12:43:08 PMThough I don't really understand clearly your message, but based on the little I could grasp, I would say that,There can never be a time when the economy of the world will get relaxed, that is, a time when we can all honestly say, there are no more problems in the world, sorry to be the bearer of bad news, but such a time will never come..It's always gonna be from one problem to the other, and with each of this problems, the money required to solve them must be printed by the government, thereby causing even more problems for the masses through inflation - the sooner we all get an understanding of this, and get our body and mind prepared for it, the better and easier it will be for use to scale through each of this problems, be it economically or otherwise. The world is in a crisis that is quite chaotic, starting from the Covid 19 pandemic to the war that occurred. So no doubt if the banks continue to print a lot of money and it will have quite a bad impact in the future, there will even be massive inflation quickly. Just like you, I don't really understand what the op is explaining, but I think if a country prints too much money without a balance occurring, then it will be disastrous for the continuity of the economic cycle in a short period of time.In 2023 I have never heard of anything worse than Covid 19 and I hope that we will be fine this year because we need significant changes for our economic recovery after the big disaster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "April 28, 2023, 08:49:05 PM",
      "body": "Quote from: livingfree on April 27, 2023, 04:05:14 PMAnd that's one major factor why we're having a huge rate for inflation and every time there will be crisis, the band aid solution is to get more money through printing again.It's a cycle and that's why it'll never end and these fiat will have its devaluation for the expense of everybody.But good thing is, we all knew what Bitcoin was and what it's intended for. So, it's best to save Bitcoin instead of these fiat that will have itself devaluated thanks to more printing.Indeed the government always performed this money printing every time there is a recession because the  Government thought of printing more money to combat deflation.  As one of the nation's central bank stated:QuoteRecessionDuring a recession, in which there is a significant decrease in economic activity, printing more money may be necessary to avoid deflation. Deflation could create a negative impact on the economy as it reduces consumer spending and slows economic growth. Increasing the money supply would increase aggregate demand which could combat the recession.Quote from: arimamib on April 27, 2023, 10:16:30 PMQuote from: Fivestar4everMVP on April 27, 2023, 12:43:08 PMThough I don't really understand clearly your message, but based on the little I could grasp, I would say that,There can never be a time when the economy of the world will get relaxed, that is, a time when we can all honestly say, there are no more problems in the world, sorry to be the bearer of bad news, but such a time will never come..It's always gonna be from one problem to the other, and with each of this problems, the money required to solve them must be printed by the government, thereby causing even more problems for the masses through inflation - the sooner we all get an understanding of this, and get our body and mind prepared for it, the better and easier it will be for use to scale through each of this problems, be it economically or otherwise. The world is in a crisis that is quite chaotic, starting from the Covid 19 pandemic to the war that occurred. So no doubt if the banks continue to print a lot of money and it will have quite a bad impact in the future, there will even be massive inflation quickly. Just like you, I don't really understand what the op is explaining, but I think if a country prints too much money without a balance occurring, then it will be disastrous for the continuity of the economic cycle in a short period of time.In 2023 I have never heard of anything worse than Covid 19 and I hope that we will be fine this year because we need significant changes for our economic recovery after the big disaster.True uncontrolled inflation is a bad thing but most governments believe that controlled inflation is necessary in order for the economy to move and aid the growth of the economy.  So printing money if there is an actual need to support the growth of the country is very important to balance the economy of a country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 28, 2023, 09:05:36 PM",
      "body": "OP is right about that printing. The US government had one chance of taming inflation and that whole strategy relied on scaring people into hoarding money. They failed and all statistics are showing this. People are still spending and all the FED managed to do was bankrupt banks. People aren't dumb they saw 2 things in the last year.1. The FED is incompetent and doesn't control inflation.2. Since the banks are going down, it means the FED will have to help them and print, so it's a good idea to keep spending.Also, it's a bad idea to keep money in banks since they could go bust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 28, 2023, 10:50:51 PM",
      "body": "Quote from: darkangel11 on April 28, 2023, 09:05:36 PMOP is right about that printing. The US government had one chance of taming inflation and that whole strategy relied on scaring people into hoarding money. They failed and all statistics are showing this. People are still spending and all the FED managed to do was bankrupt banks. People aren't dumb they saw 2 things in the last year.1. The FED is incompetent and doesn't control inflation.2. Since the banks are going down, it means the FED will have to help them and print, so it's a good idea to keep spending.Also, it's a bad idea to keep money in banks since they could go bust. Exactly, if they will just to continue to print money just to pay their debts then it's all wrong. Printing money is not the solution, on the contrary, inflation is going to rise, just like what we are seeing in the US right now. And now people are withdrawing their money from banks because it will just lose it's value overtime. So what happens is that we will have a bank ran, and that is what we are seeing right now. Banks are falling one by one and governments are trying to salvage them.As for us? well we have a safe-haven, in BTC and perhaps other solid altcoins as a hedge. But what about individuals who don't know what to do right now in the worsening economic fall-out resulting in money printing? So that's where the problems lies, people are going to be affected negatively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "April 29, 2023, 04:38:22 AM",
      "body": "What he means is that there is going to be some big credit event such as these banks crashing and there will be a massive recession and fed will have to immediately cut rates and it’ll make crypto go up because they are going to be printing money again. Basically it’ll be an inflation wave where inflation goes down but after all that money printing it will go back up again. Kind of what happened in the 70s where we got double digit inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 29, 2023, 09:41:54 AMLast edit: April 29, 2023, 09:53:48 AM by franky1",
      "body": "ever since 2008 the main next crisis would be the state pension crisis and private pension crisisits beginning to happen now, raising the pension age because government and pension funds dont have enough money in their reserves to pay all current old peoplealso they are pushing to get the under 30 age demograph to start saving for pension because most under 30yo's are doing part time, zero hour contract, gig economy types of jobs which dont come with pension plans naturallyless people at the young age are depositing into pension reserves vs the more healthier longer surviving older people who are taking more out of the reserves....though they have already put trillions into the upper echelons of private banking but those phases of QE of 2020/2021 were more about bolstering the GDP numbers using debt as assets to keep certain countries at top GDP rankings to stop china from overtaking them in rankings (you can now see phase two of that where UK/US/EU are reducing imports from china to reduce chinas GDP growth competition, because the QE did not help much long term)however this money went into private bankers bonuses rather than refilling pension reservesso with inflation caused by the QE of 2020/21 exceeding the pension pots aim of 2%, those pension reserves are depleting in goods/service value meaning those retiring cant afford to retireso there will be a QE of pension funds if they cannot get more younger folk to invest in pensions and less older folk taking pensions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "April 29, 2023, 12:27:56 PM",
      "body": "Quote from: Squaremile777 on April 27, 2023, 12:32:39 PMWe Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams. stop thinking that printing money is the solution to every financial problem that occurs, printing money will only make things worse (see Venezuela for example)the predicted crisis is just a rumor, just imagine there are lots of rumors circulating that in Q1 2023 there will be a severe crisis, in fact, it didn't happen at all, so there's no need to be too afraid of crisis rumors, just enjoy your life and invest more in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "April 29, 2023, 12:45:12 PM",
      "body": "Quote from: macson on April 29, 2023, 12:27:56 PMQuote from: Squaremile777 on April 27, 2023, 12:32:39 PMWe Are waiting now money printing.First we wait for other Crisis then it Will be Money printimg brrrr.2023 economic planIn 1-2 months crisis (data shows that bigger crisis then covid 19 ) BIG ONE IS brweing In 6-8 months big Money printing.The plan is to print more money now. Off course this time the money printing Will exeed Even the wildest dreams. stop thinking that printing money is the solution to every financial problem that occurs, printing money will only make things worse (see Venezuela for example)the predicted crisis is just a rumor, just imagine there are lots of rumors circulating that in Q1 2023 there will be a severe crisis, in fact, it didn't happen at all, so there's no need to be too afraid of crisis rumors, just enjoy your life and invest more in bitcoin.Money printing definitely not the solution to solve economic crisis, if the economy is already battling inflation how does money printing provide a solution. I think the @op is just over imagining things, if you always listen to what is said in the media you will be overwhelmed by too many worries. Yeah so far Q1 2023 already ended without any major crisis except what already existing. Besides crisis does not help anyone so there is no need to keep anticipating there will be one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "April 29, 2023, 01:00:30 PM",
      "body": "Dumb amounts of money printing started over a year ago and it brought the crisis with it back then and the crisis only grows in size. Not much has changed though so if you want to start a new discussion about it, you should try to include more than some generic statements and mention what significant change is occurring in the \"money printing scene\".For example one news worth discussing is the rumors of US regime decision to print trillions to save the failing banking sector. That is a bailout much worse than 2008 while both inflation and recession rage on inside United States.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demonica",
      "created_time": "April 29, 2023, 01:27:13 PM",
      "body": "It's so hard to comprehend what op is trying to say. But what crisis are we expecting to happen for you to say that there will be a big money printing? I'm curious about the \"big one\" you're talking about... Things happens that results to printing money to aid a certain problem but excessive printing of money wont do good for a longer run but will only do harm to the economy. Quote from: Squaremile777 on April 27, 2023, 12:32:39 PMOff course this time the money printing Will exeed Even the wildest dreams. I can't and I don't even want to imagine this to happen. Why are you expecting for something like this to happen? With what happened when the pandemic started and the economy is still on the process of recovering from it, I don't think the government will do something like this sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 29, 2023, 02:02:38 PMLast edit: April 29, 2023, 02:12:43 PM by franky1",
      "body": "Quote from: demonica on April 29, 2023, 01:27:13 PMIt's so hard to comprehend what op is trying to say. But what crisis are we expecting to happen for you to say that there will be a big money printing? I'm curious about the \"big one\" you're talking about... think about it this way. $500billion money print is only $1500 per person of Us 330m population(covid cheques)but a basic below min wage pension would be about $15k+ a year.. for a decade thus over $5trillion. (basic math 10x last sentence numbers x 10 years)i know an average life expectancy is 80 years so out of 330m its about 41m pop per decade pension utilitymeaning that is more like $6trillion per decade just to supply basic minimum pension allowancemany peoples pensions are worth alot more then $15k a year($6trillion a decade)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "April 29, 2023, 02:56:30 PM",
      "body": "I think money printed by the federal reserves is not the issue, it is the amount that is the problem. Every nation needs to keep printing more money, but if you print more than you should that becomes a problem. Like for USA, after this point, if they keep on printing about 100 to 300 billion dollars every year for growth, that would be eaten by the inflation and won't be a problem, that s a normal amount.But they did like 4-5 trillion during pandemic, and as we all know that was a terrible idea, shouldn't have done it, tax the rich if you need more money, cutting taxes on yacths wasn't the solution. All in all we know now that money printing is not the deal, many saw that and thought money printing was the issue, but the reality is that it's more about how much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}