{
  "id": "topic_5471236",
  "title": "Chilwell",
  "author": "Chilwell",
  "created_time": "October 22, 2023, 04:46:46 PM",
  "content": "Original Topic: Important to know: Difference Coin / Token and shady marketing practicesAuthor:1miauBitcoin get obonge advantage pass shitcoin: you know say Bitcoin na quality coin e be. Bitcoin no need too much advertisment or marketing (Bitcoin no even need make you get money before you go fit Start to dey market am), Bitcoin na better quality coin e self. Bitcoin no need make you go dey ask say na token or coin. so e good and e de important make you know and Sabi d difference between coin and token. Because of new project wey dey release for the old platform people con dey start to dey confuse on how to take call cryptocurrency well. For these matter now we go expose how you go fit take dey breakdown all those big big grammar wey then dey use for their market to take make am big and to dey go well for these cryptocurrency for wan kind yahoo, yahoo way and tricky way.As e be ba plenty new project don dey make us \"rich\" from the shitcoin industry but e get one big wahala wey dey, na e be different terms like \"Coin\" or \"Token\" wey dey cause confusion for everybody. For this  matter now, e dey very very important make we torch light wetin a \"Coin\" and a \"Token\" really be and na why e de important say make we Sabi if cryptocurrency na token or coin. Coin A coin go be original cryptocurrency based on say the blockchain dey independent, wey the blockchain dey operated independently from other blockchains. E no matter whether Dey don launched the blockchain right away , copied or dey apart. Coins na means wey de fit use take dey pay for transaction fees on original blockchain. Examples for coins are: Bitcoin, Bitcoin Cash, Litecoin, Ethereum, Ethereum Classic, Cardano, Avalanche, Waves, Tezos and Dogecoin, etc.Token A token is based on a blockchain Wey don dey already in existed before token was created . This token ghats needs to dey  follow all characteristics of  blockchain on which it is based on, you go need some coin from the original platform to take send tokens and all the transaction of the token go dey recorded in this existing blockchain. The platform wey many people sabi for tokens is Ethereum [ETH]. You go fit create Ethereum tokens on it, wey all the transaction go dey recorded for the Ethereum blockchain. Na with Ethereum coins Dey dey pay fees. Other examples of tokens na Waves tokens, wey dey based on Waves [WAVES]. Na Waves Coins dey dey use pay fees. Another one na binance token wey dey based on binance [BNB]. Na Binance Coins dey dey use pay fees.So, if you wan move any token, you go always need some original platform coins. All the other coin wey you know dey dey called them \"Altcoins\" Except Bitcoin only. This one start wen for the time wey new project been dey dey on their own blockchain. Them the term \"Altcoin\" con dey arrange for one side. Na as Dem introduce Ethereum, many project con dey come,and e fit stay for as long as Ethereum blockchain de or e fit later go thier own blockchain. till then all of them dey Ethereum blockchain. So, make e for fit go well them dey call all of them \"Alttokens\" instead say make e be \"altcoins\"as for as say them be token. The name wey everybody de call this product na \"shittoken\" instead of \"shitcoin\" accordingly. Lie lie marketing wey dey deceive buyersThe word \"coin\" dey always make people think say na one kind big better thing wey get plenty value while \"token\" they sound like something wey no too good, na because e don de like this na why them dey advertise their work as \"coin\" when true  true na \"token\" e still be. Make una no allow all these one decieve una because all thier work na  wetin dey dey do make them fit sell all thier useless and mumu project. Make una dey avoid all this kind project as per say na real red flag e be.  E get one strategy wey competing project dey do to take trash another competing project. maybe dey fit confuse  and decieve una do competing work go una say na \"token\" but na \"coin\" e be because e dey base on e own blockchain. but all those competing project go con name am as token make them trash am and make una fit comot mind from am and make e de fear una may you wey be buyer no buy am as per say na competing coins. E fit even happen set all these competing project fit go Hire person con make may the person dey work for the other competitors marketing departments, work in marketing place they go con de change things there they go dey give am wrong identity make e dey confuse buyers and e go de change \"coin\" to \"token\" make the competitors coin dey look bad and dey go dey call am \"Token\". ICO, ITO, Shitcoin and ShittokenThe word \"token sale\"wey everybody de use now them get am when plenty ICOs de use Ethereum and As e con be like that all person assets con be token any time wey them de sell am.make e fit better de con say make them call am ITO (initial token  offering) instead of ICO (Initial Coin Offering), since them dey always given token for these point for majority of causes. These ones fit later become coins later.While them fit de argue am say ICO, where them dey give tokens e also mean say these token fit go later become \"coins\" and their old name token just de temporarily make them fit sell am early and record am as cryptocurrency, them no fit talk am say token na coin when e get e own  blockchain wey e the baseSo, e dey important say make we know about this cryptocurrency right whether no coin or token and if na shirt (wey de for most cases/matter), call am Shitcoin or Shittoken, respectively. We go need talk about all these technical matter wella.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471236",
  "comments": []
}