{
  "id": "topic_5476411",
  "title": "Synchronice",
  "author": "Synchronice",
  "created_time": "December 03, 2023, 07:59:06 PM",
  "content": "I don't know where should I have created this thread, on Service Announcement board or here but I think this board is a better choice because people come here when they have transaction problems.You probably missed this but recently mempool.space finally added transaction acceleration service on their website.I hope everyone uses RBF or at least CPFP (hope everyone will move on full-RBF) but still, if someone has any problem, they can test this service. I hope they are cheaper than viabtc's paid accelerator, Binance's accelerator and some others.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476411",
  "comments": [
    {
      "author": "SmartGold01",
      "created_time": "December 03, 2023, 09:10:17 PM",
      "body": "The acceleration service is have used is viabtc for free it works perfectly for me but that is only when your transaction fee is less than 40 sat/byte it was share in our local board by @Charles-Tim.The network congestion is really getting out of control, maybe when I am having issues towards confirmation I will also try their free acceleration service as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 03, 2023, 10:06:37 PM",
      "body": "Quote from: SmartGold01 on December 03, 2023, 09:10:17 PMThe acceleration service is have used is viabtc for free it works perfectly for me but that is only when your transaction fee is less than 40 sat/byteI think this is a typo. The fee should be at least not less than 10 sat/byte. The transaction must also not be more than 500 bytes. Also the transaction must not have unconfirmed parent. Recently the free accelerator is difficult to use unless you wait for another one hour to submit your txid. It takes seconds for the 100 transactions to have been submitted now. Although, I am still using it and it is working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 04, 2023, 04:50:52 AM",
      "body": "Quote from: Synchronice on December 03, 2023, 07:59:06 PMI hope they are cheaper than viabtc's paid accelerator, Binance's accelerator and some others.You can click that \"Accelerate\" button and their prices per tier will appear.And yes, it's significantly cheaper than ViaBTC's paid accelerator, even their maximum tier is less than half of viabtc's asking price.The issue is, there's currently no user here in Bitcointalk that reported their experience with mempool.space's accelerator.It would be great to have some legitimate feedbacks.Quote from: Synchronice on December 03, 2023, 07:59:06 PMI don't know where should I have created this thread, on Service Announcement board or hereThis belongs to \"Service Discussion\" board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 04, 2023, 07:22:51 AM",
      "body": "I wanted to try the service and it seems that you need to create an account. After creating the account, you need to top up your balance.It appears that the mining pool that will be adding transactions to it is Foundry USA and I believe that the transaction will be confirmed quickly, the only problem is that changing the priority of transactions according to this method will help them if they decide to filter transactions (such as black lists) without anyone noticing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 04, 2023, 08:49:19 AM",
      "body": "Quote from: Yamane_Keto on December 04, 2023, 07:22:51 AMthe only problem is that changing the priority of transactions according to this method will help them if they decide to filter transactions (such as black lists) without anyone noticing them.I don't see how that would be a problem. Any mining pool can already reject any transaction they want for any reason they can come up with. If they do, another pool will take the mining fee. If they reject transactions after accepting an additional payment for it, they'll get bad publicity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "December 04, 2023, 10:56:50 AM",
      "body": "Quote from: nc50lc on December 04, 2023, 04:50:52 AMThe issue is, there's currently no user here in Bitcointalk that reported their experience with mempool.space's accelerator.It would be great to have some legitimate feedbacks.AFAIK, their accelerator isn't fully open to the public yet [the feature in question is there, but as soon as you create and verify your account, they'll put you on a waitlist (almost one week and counting...) and that means you can't even top up your account (unfortunately)].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 04, 2023, 01:40:19 PM",
      "body": "Quote from: SmartGold01 on December 03, 2023, 09:10:17 PMThe acceleration service is have used is viabtc for free it works perfectly for me but that is only when your transaction fee is less than 40 sat/byte it was share in our local board by @Charles-Tim.Less? It works fine as long as it's above 10sat/b (not vbytes), you can accelerate even a tx that is 100sat/b if you are bored and have nothing to do for 10 minutes.Quote from: SFR10 on December 04, 2023, 10:56:50 AMQuote from: nc50lc on December 04, 2023, 04:50:52 AMThe issue is, there's currently no user here in Bitcointalk that reported their experience with mempool.space's accelerator.It would be great to have some legitimate feedbacks.AFAIK, their accelerator isn't fully open to the public yet [the feature in question is there, but as soon as you create and verify your account, they'll put you on a waitlist (almost one week and counting...) and that means you can't even top up your account (unfortunately)].I hope they add LN payments for that, the whole thing is a bit messy for those accelerators,  if you can't send or receive money because you paid a low fee and now you need to pay a higher fee to get a payment though to get that previous one confirmed it turns to funny situations like this one:Imagine you have some hosted wallet on an exchange, the dumb mofos send your withdrawal to your wallet with 10sat/b and now you need to accelerate it, you only have BTC there so you make another payment to mempool.space but again, the idiots send the tx with 10sat/b. So you need to accelerate the tx that should have paid for the acceleration",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 04, 2023, 01:45:41 PM",
      "body": "Quote from: Synchronice on December 03, 2023, 07:59:06 PMYou probably missed this but recently mempool.space finally added transaction acceleration service on their website.I hope everyone uses RBF or at least CPFP (hope everyone will move on full-RBF) but still, if someone has any problem, they can test this service. I hope they are cheaper than viabtc's paid accelerator, Binance's accelerator and some others.This is good news if it's truly what it looks like, but for now, I am good with my ViaBTC accelerator which is of course free. However, it's not until I test it that I can conclude about it, or at least someone tests it on BTT to give feedback. But all I've been reading from people's replies are still nothing to write home about, except the one that states we would have an account before using itI have no issues with that. All the stress will still amount to nothing if it's a free service, but I doubt it. Nevertheless, if the service is cheap compared to the outrageous ones out there, it will still be manageable.Let's see how far they will be distributing the accelerated service too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2023, 02:28:16 PM",
      "body": "Quote from: nc50lc on December 04, 2023, 04:50:52 AMThe issue is, there's currently no user here in Bitcointalk that reported their experience with mempool.space's accelerator.It would be great to have some legitimate feedbacks.Since I have registered an account with mempool.space since some days ago, this has been what was displayed anytime I signed in:QuoteYou are currently on the waitlist. You will get notified once you are granted access.I am not still able to have access to the accelerator.I also doubt anyone that knows ViaBTC free accelerator will want to use any paid accelerator.I noticed recently that ViaBTC accelerator free submission is no more congested all of a sudden, but transaction that has been submitted successfully may not get confirmed in the next block that ViaBTC mine. It is taking longer but it will still later be confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 04, 2023, 03:44:05 PM",
      "body": "So how much do we save by using this service? Say your transaction is 100 sat/byte currently and by using this service how much will it cost effectively? I don't really get why they would offer a service like this when they can just process the higher transaction fees instead of getting paid less than what they can get on the mempool. Can someone explain what the benefit is to the pool exactly?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "December 04, 2023, 10:33:04 PM",
      "body": "Quote from: Charles-Tim on December 03, 2023, 10:06:37 PMQuote from: SmartGold01 on December 03, 2023, 09:10:17 PMThe acceleration service is have used is viabtc for free it works perfectly for me but that is only when your transaction fee is less than 40 sat/byteI think this is a typo. The fee should be at least not less than 10 sat/byte. The transaction must also not be more than 500 bytes. Also the transaction must not have unconfirmed parent. Yeah sorry my bad..I also used it today to accelerate my transaction and this time around I sat it at 50 sat/byte and it confirmed within some minutes or an hour thereabouts, at least this saves some outrageous fee being spent at the cost of withdrawing one's btc to exchange.But will this ever stop?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 04, 2023, 10:59:52 PM",
      "body": "Quote from: adaseb on December 04, 2023, 03:44:05 PMSo how much do we save by using this service? Say your transaction is 100 sat/byte currently and by using this service how much will it cost effectively? I don't really get why they would offer a service like this when they can just process the higher transaction fees instead of getting paid less than what they can get on the mempool. Can someone explain what the benefit is to the pool exactly?Because people will essentially be paying at a premium price. Took a quick look at their pricing and there is a fixed 100K sats as a mempool.space fee among other things -- emphasis on among other things as there is more depending on the transaction/options you choose.With that said, you don't save anything, the service is more of a desperate attempt/last resort if the situation calls for it. If you wanna save, best to use viabtc's free transaction accelerator and setup your transaction in such a way that it meets viabtc's conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 05, 2023, 04:08:52 AM",
      "body": "Quote from: Charles-Tim on December 04, 2023, 02:28:16 PMQuote from: nc50lc on December 04, 2023, 04:50:52 AMThe issue is, there's currently no user here in Bitcointalk that reported their experience with mempool.space's accelerator.It would be great to have some legitimate feedbacks.Since I have registered an account with mempool.space since some days ago, this has been what was displayed anytime I signed in:Mine was about a week ago and it's still in their waiting list.And now, they've even changed the default overview page from \"deposit/balance\" into \"become a sponsor\" links.Perhaps they're suggesting that their sponsors have an advantage or currently required to make it in.Quote from: Charles-Tim on December 04, 2023, 02:28:16 PMI noticed recently that ViaBTC accelerator free submission is no more congested all of a sudden, but transaction that has been submitted successfully may not get confirmed in the next block that ViaBTC mine. It is taking longer but it will still later be confirmed.Yeah, bots for some reason, cannot solve the new captcha.For now, only legitimate users are competing with the 100 free acceleration slots/hr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "December 05, 2023, 01:06:14 PM",
      "body": "Quote from: stompix on December 04, 2023, 01:40:19 PMI hope they add LN payments for that,In addition to that, supporting payments with other alternative cryptocurrencies that have lower average TX fees will also come in handy.Quote from: Charles-Tim on December 04, 2023, 02:28:16 PMI also doubt anyone that knows ViaBTC free accelerator will want to use any paid accelerator.You have a point, but if the volume of their transaction exceeds ViaBTC's limit for their free accelerator, they have no choice but to use a paid accelerator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "December 05, 2023, 01:36:02 PM",
      "body": "Quote from: nc50lc on December 04, 2023, 04:50:52 AMThe issue is, there's currently no user here in Bitcointalk that reported their experience with mempool.space's accelerator.It would be great to have some legitimate feedbacks.I am not going to spend transaction with low fee and then pay to mempool.space to accelerate it, will be a waste of money and to be honest, I think, it doesn't need any legitimate feedback, it's mempool.space after all and this service will work as advertised.Quote from: SFR10 on December 04, 2023, 10:56:50 AMAFAIK, their accelerator isn't fully open to the public yet [the feature in question is there, but as soon as you create and verify your account, they'll put you on a waitlist (almost one week and counting...) and that means you can't even top up your account (unfortunately)].Good information! I didn't know if it still wasn't fully open to the public yet. I created this thread because I saw accelerate button when I was checking one of my transaction and since it was calculating acceleration fees for every transaction, I thought it was widely ready to use. Good point again, I'll edit my ANN post.Quote from: stompix on December 04, 2023, 01:40:19 PMI hope they add LN payments for that, the whole thing is a bit messy for those accelerators,  if you can't send or receive money because you paid a low fee and now you need to pay a higher fee to get a payment though to get that previous one confirmed it turns to funny situations like this one:Imagine you have some hosted wallet on an exchange, the dumb mofos send your withdrawal to your wallet with 10sat/b and now you need to accelerate it, you only have BTC there so you make another payment to mempool.space but again, the idiots send the tx with 10sat/b. So you need to accelerate the tx that should have paid for the acceleration   This business of accelerating transaction will dive down when we all support full RBF. Then, everyone will be able to speed up their own transaction without paying additional fees to these companies. Today the problem is that many people still make transaction from wallet that doesn't support RBF.Quote from: adaseb on December 04, 2023, 03:44:05 PMSo how much do we save by using this service? You are nto saving by using this service. There are times when you don't have enabled RBF and you need to accelerate your transaction. The problem is that every accelerator asks you for enormously high fees and mempool.space offers very competitive prices compared to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 06, 2023, 12:10:52 PM",
      "body": "Quote from: Synchronice on December 05, 2023, 01:36:02 PMThis business of accelerating transaction will dive down when we all support full RBF. Then, everyone will be able to speed up their own transaction without paying additional fees to these companies. Today the problem is that many people still make transaction from wallet that doesn't support RBF.One additional use of this accelerator is when you empty your wallet and it doesn't confirm, I was tempted to ask a friend who is using a mempool.space to accelerate the transaction coming from the wallet I emptied but was lucky that the transactions confirmed, majority of wallets now have RBF so these accelerators are just another option when you cannot RBF your transaction, but we still need these accelerators in case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 08, 2023, 08:45:43 AM",
      "body": "I have noticed that too the new feature and it's definitely 5 times cheaper compared to viabtc but it's not cheaper though.I just checked the acceleration fee for a random transaction and this is the estimated feeSo just make yourself that you are using a wallet that supports RBF and CPFP then you won't end up paying $50 or $500 more than what it used to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 08, 2023, 01:02:25 PM",
      "body": "Quote from: jrrsparkles on December 08, 2023, 08:45:43 AMSo just make yourself that you are using a wallet that supports RBF and CPFP then you won't end up paying $50 or $500 more than what it used to be.Unless you're the receiving guy and it's a 5 inputs 40 output tractions that will cost you more to CPFP than what you're receiving  Neither RBF nor CPFP are magically cures, they will only allow you some movement buy not always, and if we look right now what's happening, most of those tractions stuck that need help around are not made by users but by them claiming their coins from a service, and good luck doing something with those.Quote from: Charles-Tim on December 04, 2023, 02:28:16 PMI noticed recently that ViaBTC accelerator free submission is no more congested all of a sudden, but transaction that has been submitted successfully may not get confirmed in the next block that ViaBTC mine. It is taking longer but it will still later be confirmed.First is the limits that have killed the demand, Viabtc has really half closed to gate, so you have to pay 20sat/vb to be sure and keep your tx under 0.5kb, plus of course no unconfirmed parents, so there are times when there are simply no tx out there that match the requirements, as for the next block issue, it happens when ViaBTC has really bad luck and is not getting enough blocks spread across the day, they offer 100tx every hour but sometimes they don't mine a block for 6-7 hours, so not to fill the whole block with cheap tx they postpone a few of them to the next one, I read once something about a 500 cap but don't know how accurate that claim was, probably it's more about size than raw numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 08, 2023, 09:07:16 PM",
      "body": "Quote from: SFR10 on December 05, 2023, 01:06:14 PMQuote from: Charles-Tim on December 04, 2023, 02:28:16 PMI also doubt anyone that knows ViaBTC free accelerator will want to use any paid accelerator.You have a point, but if the volume of their transaction exceeds ViaBTC's limit for their free accelerator, they have no choice but to use a paid accelerator.I am one of those people that have paid a very low fee long time ago and the fees won't go down to that fee that I've paid for. Can't even use the free accelerator of viabtc. I ended up paying a paid service to accelerate that stuck transaction of mine because it really took long. Learning from my mistake there but at least I've got options now if the same thing happens again in the future and this time, there's this additional accelerator from mempool.space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}