{
  "id": "topic_5409351",
  "title": "Ondekinecakabilirim",
  "author": "Ondekinecakabilirim",
  "created_time": "August 10, 2022, 11:38:52 AM",
  "content": "2013 yılında yaptığı ev temizliği sırasında yaklaşık 7 bin 500 ile 8 bin arasında Bitcoin (BTC) içeren hard-diskini yanlışlıkla attığını iddia eden bilgisayar mühendisi James Howells, Bitcoin’lerinin kurtarılması durumunda paranın yüzde 10’uyla Newport’u, Birleşik Krallık’ın kripto merkezi haline getireceğine dair vaatlerde bulundu.https://uzmancoin.com/7500-btcyi-cope-atan-adamdan-bolge-halkini-heyecanlandiran-teklif/7500 Bitcoin'i bulmak için senelerdir uğraşıyor bu adam. 184 milyon dolar ediyor bugün kaybolan Bitcoinler. Bütün şehirden yardım istemiş. Şehrin geri dönüşüm çöplüğünde herkesi kaybolan hard diski aramaya çağırmış. Bulursak çöplüğün yerine rüzgar tribünleriyle elektrik üretim tesisi ve madencilik tesisi yaparız demiş. Çevreci proje sunmuş şehrine. Adam yıllardan beridir arıyor Bitcoinlerini. Bulur umarım aradığını. Çok üzücü bir olay yaşadıkları. Herkes atlatamaz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409351",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "August 11, 2022, 07:51:13 AM",
      "body": "Abi 10 sene olmuş bence salmalı artık insan. O hard disk o nemde yağmurda güneşte oluşan korozyonla haşat olur durduğu yerde bile. Zaten kim bilir üstünden neler geçti vuran kıran olmuştur çöp diye. Evet bence de o kadar parayı çöpe attığını bilerek yaşamaya devam etmek çok zor. Kabullenmek çok zor. Ama maalesef durum bu. Bir şey çıkmaz bu işten eminim buna. Forumdaşlar da katılacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 13, 2022, 01:54:47 PM",
      "body": "Katılıyorum tamamen boşa zaman harcıyor bunu tamamen unutmalı herkes. Kripto-para piyasasında bir çok kayıp yaşaadım ve başkalarının tecrübelerini dinledim, kazanmakta var kaybetmekte var. Giden bir şeyi yerine getireceğimizi hepimiz biliyoruz bu yüzden mevcut enerjiyi o düşünerek harcamaktansa yeni yatırımlarımda daha çok neye dikkat etmeliyim bence buna odaklanılmalıdır. Bu arkadaş bu arayıştan bir şey çıkaramayacak, ne yaparsa yapsın boşa kovalıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "August 19, 2022, 09:23:53 PM",
      "body": "Quote from: Pierre 2 on August 11, 2022, 07:51:13 AMAbi 10 sene olmuş bence salmalı artık insan. O hard disk o nemde yağmurda güneşte oluşan korozyonla haşat olur durduğu yerde bile. Zaten kim bilir üstünden neler geçti vuran kıran olmuştur çöp diye. Evet bence de o kadar parayı çöpe attığını bilerek yaşamaya devam etmek çok zor. Kabullenmek çok zor. Ama maalesef durum bu. Bir şey çıkmaz bu işten eminim buna. Forumdaşlar da katılacaktır.Psikolojik sıkıntılar yaşıyor muhtemelen. önüne geçemeyecek engelleri şu an duygu düşünceleriyle yaşıyor. elbette yağmur, kar gibi iklimsel sıkıntılarla zaten o hard disk çoktan contayı yakmış, devreleri mahvetmiştir. kısacası dün yediğin hurmalar, bugün ne yaparsan yap tırmalayacak zaten. giden gitti kabul edip psikolojik destek alması lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "August 27, 2022, 07:40:22 PM",
      "body": "Umut tükenmeyince Bitcoinlerinin peşinden gitmeye devam ediyor. Sonunda bu adamın hayatını film yapacaklar. Bitcoinlerden kazanamadığı parayı sinema sektöründen kazanacak. Keşkelerle yaşamamak için daha dikkatli olmak gerek. Kaybedilen Bitcoinlerin peşinden düşmek kadar bugün satın almadığımız Bitcoinler de yarın bizim için çok değerli olabilir. Geçmişe baktığımda daha fazla Bitcoin satın almadığım için James kadar hayıflanıyorum. Onun kaybettiği Bitcoinlerini bulma ihtimali var. Ben onun kadar şanslı değilim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "November 03, 2022, 02:51:21 PM",
      "body": "ingilterenin çöpleri adanaya geliyordu buralarda bakmak lazım",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugo_uzman",
      "created_time": "November 03, 2022, 02:57:15 PM",
      "body": "welcome !!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "November 04, 2022, 09:45:48 PM",
      "body": "Bitcoin haberlerinin eskimeyen konularının başında bu adam geliyor.Yıllardır bitcoinlerinin peşinde ama bulunamayacağı artık aşikar.Sadece kendi reklamını yapmayı amaçlıyor.Yakında bitcoin ailesi hakkında da bir haber görürsek forumca iyice nostaljik anlar yaşarız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 21, 2022, 08:11:19 AM",
      "body": "Quote from: teramit on November 03, 2022, 02:51:21 PMingilterenin çöpleri adanaya geliyordu buralarda bakmak lazım  Arkadaşa katılıyorum o çöp belki dünyayı gezdi press vs ile çoktan yok olmuş bile olabilir sırf bu ihtimal için neden aransın? Belediyelerin işi gücü milletin keyfi işlerimi? Bu adam kendi pr'nı yapmaktan bir türlü vazgeçmiyor bu arkadaşların sayısının çok olduğunu düşünüyorum bu sayede dolaşımdaki btc miktarı aşırı az ve votalite birkaç yılda bir aşırı artıyor. Yoluna bakmasına tavsiye ederim yapacak birşey yok bizde de böyle hayat hikayeleri var napalım takıntı mı yapalım?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}