{
  "id": "topic_5469544",
  "title": "DYING_S0UL",
  "author": "DYING_S0UL",
  "created_time": "October 07, 2023, 01:31:17 PMLast edit: October 07, 2023, 01:44:49 PM by DYING_S0UL",
  "content": "I was wondering if I could stake multiple BTC addresses on Bitcointalk! We all know that, in case our account gets compromised or hacked, we can use our stacked BTC address to sign a message to show that I am the real owner of the account in order to recover the account. No matter how much we try to protect something, sometimes we cannot. It's the same for the BTC address. That's why we see many cases of losing passphase or private keys due to hardware or software failure. It can be intentional or unintentional. Hacking, phishing or other means. Accidents happen, regardless of the precautions we take.I had another question. It may sound somehow off topic. Is there a board on Bitcointalk where posts can't be edited or deleted?I want to change my Bitcointalk password because it's been some time since I changed it. I feel like we should change our password at least once a year. But I don't like the message that says, This user recently changed the password. It may sometimes make others suspicious. That's why, before changing the password, I want to make a post on Bitcointalk saying, I, DYING_S0UL, the real owner of this account, am going to change the password.Some might say, Why don't you stake BTC or PGP and sign a message saying that? The thing is, I don't have a desktop device at this moment. Most of the time, I use Bitcointalk on my mobile. I hope everyone understands my situation.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469544",
  "comments": [
    {
      "author": "lovesmayfamilis",
      "created_time": "October 07, 2023, 01:37:49 PM",
      "body": "Don't go to extremes; where have you seen someone confirm their Bitcoin address to change their password?But on another issue, you can write several Bitcoin addresses; in case of hacking, you will have to confirm any address that was on the forum before you were hacked or lost your forum password.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AB de Royse777",
      "created_time": "October 07, 2023, 01:45:33 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMI was wondering if I could stake multiple BTC addresses on Bitcointalk! You can but what is the point to have more than one address?If you join any signature campaign or games and rounds, you might use different addresses. Staking one address doesn't mean you can only use that one to prove ownership. You can sign any address you've used on the forum before. It serves the purpose well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "October 07, 2023, 01:49:07 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMI had another question. It may sound somehow off topic. Is there a board on Bitcointalk where posts can't be edited or deleted?As far as I know, only Archival board prohibits you from deleting your own thread but can still be able to editQuote from: DYING_S0UL on October 07, 2023, 01:31:17 PMThat's why, before changing the password, I want to make a post saying, I, DYING_S0UL, the real owner of this account, am going to change the password.It's a good practice, but DT members can't just mark their accounts RED solely because they see someone changed their password. There needs to be additional evidence that suggests this account changed hands, such as changes in writing style or a shift in the boards they typically post in.Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMSome might say, Why don't you stake BTC or PGP and sign a message saying that? The thing is, I don't have a desktop device at this moment. Most of the time, I use Bitcointalk on my mobile. I hope everyone understands my situation.1 staked address will do just fine as long as you have the access to that particular wallet and be able to signed them again by mentioning the current date.For example: https://bitcointalk.org/index.php?topic=5408323.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "October 07, 2023, 01:57:09 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PM~snip~1# Staking 1 bitcoin address is enough, but you can take more than that. 2# You are free to change your password whenever you want, you can even change your email. As long as there is no change in personality, writing, or way of communicating, no one will doubt that it is you 3# Don't worry too much, if you don't make a mistake then everything will be fine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "October 07, 2023, 01:58:02 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMI was wondering if I could stake multiple BTC addresses on Bitcointalk! There is no rule against it.Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMNo matter how much we try to protect something, sometimes we cannot. It's the same for the BTC address. That's why we see many cases of losing passphase or private keys due to hardware or software failure. It can be intentional or unintentional. Hacking, phishing or other means. Accidents happen, regardless of the precautions we take.What you store is your seedphrase and not the private key. A hardware or software failure does not affect your offline back up. If your address is compromised, you should exclude it as a source of recovering your account.Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMI had another question. It may sound somehow off topic. Is there a board on Bitcointalk where posts can't be edited or deleted?None AFAIK.There are boards you cannot delete your posts until 24 hours, but that is the maximum.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 07, 2023, 02:26:47 PM",
      "body": "If you think you can't manage one address alone effectively, what makes you think you will have the capacity of coping when you're dealing with multiple wallet addresses, this will rather make things complicated to you instead, only one address is good and ok as long as you have a secured means to have access to that wallet, then you need to be also careful not to expose all your personal credentials to the public, especially that deals with the wallet that you use, there's no point in signing two addresses if i will advise on this, just try and maintain what you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "October 07, 2023, 03:01:23 PM",
      "body": "There are no restrictions to stake as many as you wanted though to me it's important you stake only 2 address whereby whenever you lost access to one you can use the other to restore your account here, otherwise it's not necessary to have much address staked.But does staking multiple address worth?To me you can be more careful with your account because staking your address is simply trying to protect your account if should any hack or compromise maybe unusual activity that may arise your stake address could stand as a backup to your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 07, 2023, 03:14:02 PMLast edit: October 07, 2023, 03:34:28 PM by hosseinimr93",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMThat's why, before changing the password, I want to make a post on Bitcointalk saying, I, DYING_S0UL, the real owner of this account, am going to change the password.According to BPIP, you have already changed your password via email three times. Did anyone accuse you of account changing hands? If there's nothing suspicions, no one will accuse you of account changing hands just because you changed your password.If there's something suspicious, you won't change anything just because you created a thread saying you will change your password before changing the password without proving you are the real owner of the account. Quote from: Maus0728 on October 07, 2023, 01:49:07 PMAs far as I know, only Archival board prohibits you from deleting your own thread but can still be able to editThreads can be deleted only by moderators. Whether you have posted your topic on Archival or other boards, there is no way you can delete the topic by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "October 07, 2023, 03:21:11 PM",
      "body": "Quote from: hosseinimr93 on October 07, 2023, 03:14:02 PMQuote from: DYING_S0UL on October 07, 2023, 01:31:17 PMThat's why, before changing the password, I want to make a post on Bitcointalk saying, I, DYING_S0UL, the real owner of this account, am going to change the password.You have already changed your password via email three times. Did anyone accuse you of account changing hands? No nobody accused me of anything. I just wanted to know because I was curious. I can't help my curiosity, and there isn't any rules says I can't question.  I changed 3 times because I keep forgetting my password. I never saved or noted my password because I consider Bitcointalk very valuable. Luckily this time it's written on my dairy. Email is still the same, if you check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 07, 2023, 03:24:46 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMI want to change my Bitcointalk password because it's been some time since I changed it. I feel like we should change our password at least once a year. But I don't like the message that says, This user recently changed the password. It may sometimes make others suspicious. That's why, before changing the password, I want to make a post on Bitcointalk saying, I, DYING_S0UL, the real owner of this account, am going to change the password.Oh god, imagine we would have 10 000 users changing their passwords so each day we have two full pages of me x I'm changing my password!!! People are going to get bored by it and nobody is going to give a damn about it anymore.Nobody is suspicious of you changing that or reading the message, it becomes suspicious when you're a trusted member here, you go offline for two weeks, then you change your password and you post malware links, that's when everyone is suspicious, or when after 8 years of writing only French you change it and start speaking Indonesian or Nigerian or Russian only. Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMThat's why we see many cases of losing passphase or private keys due to hardware or software failure. It can be intentional or unintentional. Hacking, phishing or other means. Accidents happen, regardless of the precautions we take.Shouldn't you be more concerned about your coins rather than a member account on a forum?Fix those issues first if you think you're in danger of losing a seed or a privatekey!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "October 07, 2023, 03:42:35 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 03:21:11 PMQuote from: hosseinimr93 on October 07, 2023, 03:14:02 PMQuote from: DYING_S0UL on October 07, 2023, 01:31:17 PM~~~~~~No nobody accused me of anything. I just wanted to know because I was curious. I can't help my curiosity, and there isn't any rules says I can't question.  Tbh, I don’t really get why some users like to draw unnecessary attention to themselves. You have already changed your password thrice so why not just proceed to change it the fourth time rather than create this thread?Password change ≠ hacked account/ bought account. The only time an account becomes suspicious whether they were hacked or bought is when they have been inactive for a long period and then comes to the forum with an entirety different posting style or their posting style change from a constructive poster to that of a typical spammer or if there’s a sudden change of interest that’s when suspicion arises, not just because password was changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 07, 2023, 03:46:06 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMSome might say, Why don't you stake BTC or PGP and sign a message saying that? The thing is, I don't have a desktop device at this moment. Most of the time, I use Bitcointalk on my mobile. I hope everyone understands my situation.What wallet do you currently use?Mycelium Wallet has a feature to sign and verify messages if you have a backup private key you can import it to Mycelium Wallet but make sure you only use it on an offline device for safety purposes.If you are using Electrum then currently it does not have this feature but someone mentioned this feature on Electrum Github to add sign/verify message and I saw someone contribute and tested it to Android. Let's hope developers will add this to the next Electrum version.-  https://github.com/spesmilo/electrum/issues/8576",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "October 07, 2023, 03:47:29 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 01:31:17 PMI was wondering if I could stake multiple BTC addresses on Bitcointalk! We all know that, in case our account gets compromised or hacked, we can use our stacked BTC address to sign a message to show that I am the real owner of the account in order to recover the account. Signing a Bitcoin message is only one of proof for your account ownership but it is not the only proof and is not enough if you only have it to prove you are a real owner of one account.Forum admins and global moderators can request you more evidence. Because if you store everything in one device, in one file like forum account password, wallet password ..., hackers can access to everything you have. So a signed message is not enough.Forum account: security, privacy, and recovery",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "October 07, 2023, 03:49:02 PM",
      "body": "Quote from: Cantsay on October 07, 2023, 03:42:35 PMQuote from: DYING_S0UL on October 07, 2023, 03:21:11 PMQuote from: hosseinimr93 on October 07, 2023, 03:14:02 PMQuote from: DYING_S0UL on October 07, 2023, 01:31:17 PM~~~~~~No nobody accused me of anything. I just wanted to know because I was curious. I can't help my curiosity, and there isn't any rules says I can't question.  Tbh, I don’t really get why some users like to draw unnecessary attention to themselves. You have already changed your password thrice so why not just proceed to change it the fourth time rather than create this thread?That was in the past. I wasn't much active at that time. I was having hard times, couldn't focus on anything. I have only been fully active in the forum for the last 2-3 months. After that, I never changed my password a single time. And I intend to keep active this time no matter what. That's the main reason for my concern. I don't want to violate any rules. So, I created this thread solely for learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 07, 2023, 04:20:14 PM",
      "body": "Quote from: lovesmayfamilis on October 07, 2023, 01:37:49 PMDon't go to extremes; where have you seen someone confirm their Bitcoin address to change their password?But on another issue, you can write several Bitcoin addresses; in case of hacking, you will have to confirm any address that was on the forum before you were hacked or lost your forum password.What if someone didn't use any BTC address in the forum before? Sometimes we lose access to our seed phrase if we are not serious enough about our account security. One question arise in my mind is that possible to use another address to recover? In case someone uses his BTC and ETH or other address in the forum and he only have access to his ETH address or any other address from a different blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 07, 2023, 04:34:23 PM",
      "body": "Quote from: DVlog on October 07, 2023, 04:20:14 PMIn case someone uses his BTC and ETH or other address in the forum and he only have access to his ETH address or any other address from a different blockchain.I think it depends a lot on the account at stake to be recovered.Although the pinned posts clearly say only BTC there is at least one case of recovery via ETH:https://bitcointalk.org/index.php?topic=5284615.0Quote from: DVlog on October 07, 2023, 04:20:14 PM Sometimes we lose access to our seed phrase if we are not serious enough about our account security.Same thing I asked OP about, if you can't keep your seed safe, then what about your coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 07, 2023, 04:53:27 PM",
      "body": "Quote from: stompix on October 07, 2023, 04:34:23 PMQuote from: DVlog on October 07, 2023, 04:20:14 PMIn case someone uses his BTC and ETH or other address in the forum and he only have access to his ETH address or any other address from a different blockchain.I think it depends a lot on the account at stake to be recovered.Although the pinned posts clearly say only BTC there is at least one case of recovery via ETH:https://bitcointalk.org/index.php?topic=5284615.0I understood that it was very rare but not impossible. I don't have much interest in account recovery so may I know what factors they look at when recovering someone's account? I think it's not like you just sign in with your BTC address and they will give you access to that account.Quote from: stompix on October 07, 2023, 04:34:23 PMQuote from: DVlog on October 07, 2023, 04:20:14 PM Sometimes we lose access to our seed phrase if we are not serious enough about our account security.Same thing I asked OP about, if you can't keep your seed safe, then what about your coins?I have learned my lesson before by losing a few thousand dollars. One time it was because of my carelessness and another time i wasn't careful enough to read the whole procedure (it was with a different blockchain where every time you use your Priver key to gain access to your account you will get a new one and your old one will be invalid).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "October 07, 2023, 04:58:14 PM",
      "body": "Quote from: stompix on October 07, 2023, 04:34:23 PMQuote from: DVlog on October 07, 2023, 04:20:14 PMIn case someone uses his BTC and ETH or other address in the forum and he only have access to his ETH address or any other address from a different blockchain.I think it depends a lot on the account at stake to be recovered.Although the pinned posts clearly say only BTC there is at least one case of recovery via ETH:https://bitcointalk.org/index.php?topic=5284615.0Quote from: DVlog on October 07, 2023, 04:20:14 PM Sometimes we lose access to our seed phrase if we are not serious enough about our account security.Same thing I asked OP about, if you can't keep your seed safe, then what about your coins?Thank you for the concerns, I really mean it. It's not that I lost my seed or something, its just I wanted know know, if by any chance someone looses it. I am serious about my account security. But despite everything, we still see, people loosing their seed, coins, account even with the highest security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 07, 2023, 05:11:34 PM",
      "body": "Quote from: DYING_S0UL on October 07, 2023, 04:58:14 PMQuote from: stompix on October 07, 2023, 04:34:23 PMQuote from: DVlog on October 07, 2023, 04:20:14 PMIn case someone uses his BTC and ETH or other address in the forum and he only have access to his ETH address or any other address from a different blockchain.I think it depends a lot on the account at stake to be recovered.Although the pinned posts clearly say only BTC there is at least one case of recovery via ETH:https://bitcointalk.org/index.php?topic=5284615.0Quote from: DVlog on October 07, 2023, 04:20:14 PM Sometimes we lose access to our seed phrase if we are not serious enough about our account security.Same thing I asked OP about, if you can't keep your seed safe, then what about your coins?Thank you for the concerns, I really mean it. It's not that I lost my seed or something, its just I wanted know know, if by any chance someone looses it. I am serious about my account security. But despite everything, we still see, people loosing their seed, coins, account even with the highest security.  I have a ballet cold wallet that can be used to secure user funds and as long as my wallet is not exposed to someone, I don't think I need to worry about anything. It's a steel plate and you can keep it safe like you keep your gold and diamonds if you have any.BTW, I can see you are new to the forum and I expect you are in the industry as well. But you are not a newbie and by observing your account, sometimes i can see you have gained basic knowledge as well. So it should not be hard for you to secure your asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}