{
  "id": "topic_5410475",
  "title": "Kakmakr",
  "author": "Kakmakr",
  "created_time": "August 19, 2022, 11:08:08 AM",
  "content": "This has been a contentious issue and a common discussion under online gambling for a long time... and I want us to talk about this too.  How does the \"Paid\" Streamers ..influence other gamblers experience? So, the common assumption is that \"Paid\" streamers basically have limitless funds that are paid by the casinos. They can play, until the Slot pays them, where other people play until their money runs out. (This is a misconception obviously, because the outcome of each bet is determined by it's seed and the Slots variance and RTP) People are also saying that \"Paid\" streamers are basically \"sweeping\" all money that are being played by others on those specific slots. (You often hear people saying... \"I cannot play XXX Slot now, because streamer YYY won big on that Slot) - If I am correct... all funds that are played in a casino goes into one \"Pot\" .....and wins are paid out of that... or in the case of a Jackpot system.. into a \"Pot\" at the 3rd party service provider. (Is this true or false...any experts out there that can clear this up?) Just to make something clear .... not all Streamers of gambling content are \"Paid\" streamers or affiliates of casinos.... some use their own money. (Example : Syztmz) Can a \"Paid\" streamer or an expert from a casino... please help with some factual inputs, so that we can clear up any misconceptions? On the flip side of the coin..... Some people believe that \"Paid\" streamers are actually \"feeding\" or \"funding\" other people's large wins. They can only \"sweep\" other peoples funds, when they win.... if someone else win before them... the opposite happens... right?Let's discuss.... and enjoy this thread please.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410475",
  "comments": [
    {
      "author": "Eternad",
      "created_time": "August 19, 2022, 11:18:55 AM",
      "body": "Actually only Drake and Eddie are the only streamer that I know that doing paid advertisement and the rest of the streamers that I’m watching is just streaming for views and content on youtube. Paid or not, I think it’s still the same because they are both showcasing playing gambling. They also just have a limited balance balance for gambling so it’s still feel the same on watching both. The only thing I like the most on paid streamers are there giveaways. They are giving huge amount on the winners since it’s sponsored compared on DIY streamer that just using there own money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 19, 2022, 11:21:34 AM",
      "body": "Quote from: Kakmakr on August 19, 2022, 11:08:08 AMThis has been a contentious issue and a common discussion under online gambling for a long time... and I want us to talk about this too.  How does the \"Paid\" Streamers ..influence other gamblers experience? So, the common assumption is that \"Paid\" streamers basically have limitless funds that are paid by the casinos. They can play, until the Slot pays them, where other people play until their money runs out. (This is a misconception obviously, because the outcome of each bet is determined by it's seed and the Slots variance and RTP) People are also saying that \"Paid\" streamers are basically \"sweeping\" all money that are being played by others on those specific slots. (You often hear people saying... \"I cannot play XXX Slot now, because streamer YYY won big on that Slot) - If I am correct... all funds that are played in a casino goes into one \"Pot\" .....and wins are paid out of that... or in the case of a Jackpot system.. into a \"Pot\" at the 3rd party service provider. (Is this true or false...any experts out there that can clear this up?) Just to make something clear .... not all Streamers of gambling content are \"Paid\" streamers or affiliates of casinos.... some use their own money. (Example : Syztmz) Can a \"Paid\" streamer or an expert from a casino... please help with some factual inputs, so that we can clear up any misconceptions? On the flip side of the coin..... Some people believe that \"Paid\" streamers are actually \"feeding\" or \"funding\" other people's large wins. They can only \"sweep\" other peoples funds, when they win.... if someone else win before them... the opposite happens... right?Let's discuss.... and enjoy this thread please.  I want to talk only about slot streamers and they don't influence the outcome of the game,in fact when someone hits big in a slot machine chances are it will continue to give payouts further because most likely the slot is full of money and it is in the state where it should regulate itself to meet the RTP requirements.Most of them are paid by gambling companies but they do not influence your chances to win no matter how much they make,the only thing that they influence is my mood which goes really high in a good manner when I see they hit the bonus round with the maximum bet and make those huge wins every slot player is after.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "August 19, 2022, 11:29:11 AM",
      "body": "We should invite streamers we know to know if they are getting paid by the casino or using their own funds to gamble.This will certainly clear up any misconceptions but regardless if it is a paid streamer or an unpaid streamer, it is the gambler's responsibility if it is about gambling.Here we play gambling and it uses our money so if we see the streamers win multiple times or win a lot, we have to think that luck may be with them or they benefit from the casino because they get paid.As far as I know, they serve content for viewers and if anyone joins through the threads they provide, those streamers earn extra money apart from the money they get from video uploading sites like Youtube and maybe some extra money from the casino.Whether it is paid or not will depend on how we judge them and I don't think it's a misunderstanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "August 19, 2022, 11:31:45 AM",
      "body": "Quote from: Kakmakr on August 19, 2022, 11:08:08 AM-skip-How does the \"Paid\" Streamers ..influence other gamblers experience? So, the common assumption is that \"Paid\" streamers basically have limitless funds that are paid by the casinos. They can play, until the Slot pays them, where other people play until their money runs out. (This is a misconception obviously, because the outcome of each bet is determined by it's seed and the Slots variance and RTP) Why is it obvious to you that this is a misconception? Can you give at least one argument in favor of this? If a streamer has a contract with a casino, then he plays for fake money and does not risk anything. He can \"lose\" a million before he gets a 200k jackpot and then he will promote the clip everywhere where he \"wins\" it. An ordinary player is deprived of such an opportunity, since in most cases his money will run out much earlier than he receives any big win.As for the relationship between the results of the game of the streamer and ordinary players, this is of course nonsense - the results of games in the casino for separate players are completely independent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 19, 2022, 11:38:07 AM",
      "body": "AFAIK, Paid streamers only just get additional balance for there payment but still they are using there funds to gamble in the casino. xQc is the best example here because he lose his own money on the process of gambling via livestream including his payment. Not all casino offers payment in cash but some streamers just receive extra bonus in there deposit and they have special referral fee when someone sign up using there affiliate link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 19, 2022, 11:48:32 AM",
      "body": "I don't think that's how it works? And even if the game they play is like what you said, I don't think the casino that would sponsor them would tell them to play on that specific game since as you said, it kills the entire pot, at least for a certain amount of time. The casinos in no way would ever influence the chances of a streamer winning, that'd require them to do some backdoor rigging which would have probably been noticed in the long term imo. The most I could say that is like that would be some online crane streams where staff would assist in trying to make it a \"tad bit\" easier to get the prize BUT letting the viewers know that it's actually happening, and not a \"behind the scenes\" kind of thing. They're mostly there for enjoyment, and maybe for a casino hyping their events up or something. Maybe giveaways as well as prizes, promos, etc. Most of the stuff that a viewer receives from a streamer are just \"add-ons\", they'd still gamble imo as usual without it or not. It's just a nice bonus, a cherry on top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 19, 2022, 11:50:15 AM",
      "body": "I've watched some paid gambling streamers a lot of times but I don't feel persuaded by what they're doing. Maybe because I don't find the games interesting or that I know the result in the end. Also, the platforms that they are playing on are usually those that are not within my 'line', or it just doesn't fit my preference. They are not entertaining enough for me to be persuaded, even though they are winning a lot and it looks good on the eye. Maybe I'm the sensible type of gambler that knows that these sessions are rigged but idk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "August 19, 2022, 11:54:06 AM",
      "body": "I've also heard of this, to be part of a gambling streamer, they will only get a balance, not paying cash. They will get bonuses from referrals which may be more than non-streamers because it will be easier to put a referral link in their profile. But, if the streamer has thousands or tens of thousands of views, I think the streamer will also ask for cash. because visitors, followers and viewers of live stream will provide more benefits for advertisers, so it is very normal for streamer ask cash payment. Because this will become win win solutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 19, 2022, 12:20:40 PM",
      "body": "I'm no sure if an expert here will come up and give us the real scores behind. And regarding the \"sweeping\", I'm not aware of that as well, as far as I know yes there are pots for that particular slots, and if so someone win big and take the jackpot he will be paid and the jackpot price is reset at the baseline money, which means it is back to 0 again and reset and by design, it might take sometime again before that slot will give up the jackpot to some lucky players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "August 19, 2022, 12:28:54 PM",
      "body": "Most provably those famous streamers can influence the existing experience gamblers thru competition they input on their minds, they always project that gambling is fun and profitable especially when they show the highlights of their big gains since for sure many people will turn on their interest to follow what the streamers do and compete them to aim much bigger wins since this is pleasurable to other to see that they also win the same with their favorite streamer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 19, 2022, 12:40:15 PM",
      "body": "It actually depends on the streamers as some of them are honestly good on influencing people during their live sessions to gamble even if we know that they are being paid to stream the gambling platform or casino. Also, only a few streamers has unlimited funds or probably they are playing outside the poll of each game which will not affect the jackpot prize. It is like they are playing on a \"test server\" where various parameters has been set. I guess, it's best to watch those streamers that are not affiliated to the casino but still choose to play on those platform as I find their stream more genuine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "August 19, 2022, 01:13:39 PM",
      "body": "Quote from: Jemzx00 on August 19, 2022, 12:40:15 PMI guess, it's best to watch those streamers that are not affiliated to the casino but still choose to play on those platform as I find their stream more genuine. If you want an honest review independent streamers are the go-to guys to watch, not those showing affiliate links in their description, or shilling too much for the casino where they are getting paid, I just don't feel these paid streamers can come out with a better or fair review of the site it's up to the gamblers or their followers if they buy these fake review and too many shillings because, in the end, they are the one who will deposit and play and will solve their own issue if they run issue with the casino they are playing.Gamblers are responsible for who to trust to lead them in the casinos they are going to play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 19, 2022, 01:14:23 PM",
      "body": "Aren't paid streamers has something pinned on their live video with something like the logo of a casino? Maybe gambling streamers are just doing it for affiliate or something that will try their referral links, after all there are folks out there that are still searching for gambling contents. Maybe with sheer luck they'll get noticed and support them, even just one can make a difference over it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "August 19, 2022, 01:24:34 PM",
      "body": "Quote from: dimonstration on August 19, 2022, 11:38:07 AMAFAIK, Paid streamers only just get additional balance for there payment but still they are using there funds to gamble in the casino. xQc is the best example here because he lose his own money on the process of gambling via livestream including his payment. Not all casino offers payment in cash but some streamers just receive extra bonus in there deposit and they have special referral fee when someone sign up using there affiliate link.Am just getting fussed when we are talking of streaming. I thought that streaming is same thing as gambling. But don't be offended because i do not understand the language stream. Is it like gambling or it's game that is under the jurisdiction of casino game. I need more explanation concerning this two things, incase I'm contradictory all this in the name of gambling kind of way or another branches of gambling. I need more wisdom concerning this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "August 19, 2022, 01:31:18 PM",
      "body": "Quote from: rhomelmabini on August 19, 2022, 01:14:23 PMAren't paid streamers has something pinned on their live video with something like the logo of a casino? Maybe gambling streamers are just doing it for affiliate or something that will try their referral links, after all there are folks out there that are still searching for gambling contents. Maybe with sheer luck they'll get noticed and support them, even just one can make a difference over it.There's money to be made in affiliate marketing, especially in casino-based affiliates, you only need at least 5 whales to make a lot of money without doing much work its the best residual income, the majority of casinos offer a percentage on deposits and more incentives coming from your referred actions and betting results, streamers are good in referring people because they are performer and artist and they are good at convincing people, I've seen some streamers who are very excited on what they are doing, they have to do this to compel their viewers to join through their affiliate links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 19, 2022, 02:20:35 PM",
      "body": "Quote from: fortunecrypto on August 19, 2022, 01:31:18 PMQuote from: rhomelmabini on August 19, 2022, 01:14:23 PMAren't paid streamers has something pinned on their live video with something like the logo of a casino? Maybe gambling streamers are just doing it for affiliate or something that will try their referral links, after all there are folks out there that are still searching for gambling contents. Maybe with sheer luck they'll get noticed and support them, even just one can make a difference over it.There's money to be made in affiliate marketing, especially in casino-based affiliates, you only need at least 5 whales to make a lot of money without doing much work its the best residual income, the majority of casinos offer a percentage on deposits and more incentives coming from your referred actions and betting results, streamers are good in referring people because they are performer and artist and they are good at convincing people, I've seen some streamers who are very excited on what they are doing, they have to do this to compel their viewers to join through their affiliate links.Yeah I get that but I think when it comes to getting people it will be credited to streamers as they are the one that has more reach and with just a simple ads on noticeable platforms like YouTube, Twitch, Discord for gambling, it's huge. I think second to get people on the platform are through contests and bounties or are they even top to get more people?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "August 19, 2022, 02:22:37 PM",
      "body": "I don't believe if a streamer hits a big jackpot they can sweep all gamblers on the same provider and game, usually it depends on the RTP. Influencing other gamblers to play according to their pattern and style is usually like that, but it is up to other gamblers too because of that not all can follow their playing pattern. Also money they can spend is not small but it runs out fast and different to other real gambler the average is always thinking of ways to stay long in game to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 19, 2022, 03:05:46 PM",
      "body": "I have never heard someone told that their losses are going to the streamer's win. If somebody has told that, basically, that gambler is just looking for someone to blame for his losses. This is typical when they're in a losing streak because it's hard to accept.What I know with these paid streamers, the money they're putting in is for real and it has a limitation. The casino that they advertise allows them to win and lose and it depends on their contract if the money will be claimed back by the casino or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "August 19, 2022, 03:10:56 PM",
      "body": "I was just thinking about how the streamer could influence the audience so that they could visit the casino site and end up gambling there. I think if the streamer can provide a live video about their gambling game, the audience will like it and follow what the streamer is doing, especially if they are loyal followers of the streamer. Viewers will not think about where the money used by the streamer comes from and whether the streamer gets paid from the casino or something else because what viewers want is an exciting spectacle from their favorite streamer. What is clear, the streamer will get paid if someone joins through his video channel and uses a lot of money to play gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}