{
  "id": "topic_5456904",
  "title": "Question:",
  "author": "roksana.hee",
  "created_time": "June 19, 2023, 08:21:40 PMLast edit: June 20, 2023, 06:01:09 PM by roksana.hee",
  "content": "We are currently seeking a skilled Full-Stack Developer to join our dynamic team. As a Full-Stack Developer, you will be responsible for the development and maintenance of a comprehensive web platform similar to the reference site https://www.bdtender.com/. This platform will provide users with up-to-date tenders and news information, user registration and login functionality, user profiles and subscriptions, and an integrated local payment gateway.Responsibilities:1. Tenders update (for all)2. Tenders details (for subscriber)3. News update4. News details5. User signup6. User login7. User profile and subscription8. Subscription initial/pricing9. You may keep a home page for basic where people will see both profiles, tenders, news contact info, etc.10. (optional) separate page for contact/support/help desk for subscriber11. Integrate a local payment gateway to facilitate secure and convenient payment transactions.Requirements:1. Strong proficiency in HTML, CSS, and JavaScript.2. Experience with front-end frameworks such as React, Laravel.3. Proficiency in back-end development using Node.js.4. Experience in building RESTful APIs and integrating third-party services.5. Ability to implement responsive web design principles and ensure cross-browser compatibility.6. Strong problem-solving and debugging skills.7. Excellent communication and teamwork abilities.If you are a passionate developer who thrives in a fast-paced environment and enjoys building user-friendly web applications, we would love to hear from you. Please submit your resume, portfolio, and any relevant work samples to be considered for this position. We offer competitive compensation and a stimulating work environment where your skills and creativity will be valued.Note: Kindly mention your previous experience with similar projects or provide any related references along with your application.We look forward to welcoming you to our team!Budget: Can I know your offer to complete it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456904",
  "comments": [
    {
      "author": "shasan",
      "created_time": "June 20, 2023, 01:49:30 AM",
      "body": "Thanks for the detailed project description. I have gone through the entire project description and it seems there is a hard chance to get a good Developer from this forum at the mentioned rate. Better try on freelance marketplace.Do not send any advance payment to anyone who is not reputed on the forum. Also better you may use any trusted escrow from the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roksana.hee",
      "created_time": "June 20, 2023, 03:28:58 AM",
      "body": "Quote from: shasan on June 20, 2023, 01:49:30 AMDo not send any advance payment to anyone who is not reputed on the forum.Thank you for your advice. I know the budget is very low because the site is not very hard or critical. I see here on 2 pages only workable (monthly subscription and payment gateway). The rest of the pages are so simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 20, 2023, 09:20:49 AM",
      "body": "Quote from: roksana.hee on June 20, 2023, 03:28:58 AMThank you for your advice. I know the budget is very low because the site is not very hard or critical. I see here on 2 pages only workable (monthly subscription and payment gateway). The rest of the pages are so simple.I think you are wrong, what you want is much more complicated than you see. It's not just a few simple pages, even the implementation of the payment gateway itself will cost you more than $200. Even if you were to ask someone to do it in WordPress, with ready-made plugins, it is not realistic to get it for that money. Certainly not a custom solution.Also, keep in mind that over time an upgrade and various adjustments will be needed, it is questionable whether you will be able to find the same cheap developer again who will be able to upgrade all that. A well-laid foundation is very important if you do not want additional complications later when the business becomes viral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roksana.hee",
      "created_time": "June 20, 2023, 09:27:44 AM",
      "body": "Quote from: examplens on June 20, 2023, 09:20:49 AMI think you are wrong, what you want is much more complicated than you see. It's not just a few simple pages, even the implementation of the payment gateway itself will cost you more than $200. Even if you were to ask someone to do it in WordPress, with ready-made plugins, it is not realistic to get it for that money. Certainly not a custom solution.Can I know your suggestive budget or price? How much you need to do complete, bro? If need, I can increase few.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tonydante",
      "created_time": "June 20, 2023, 10:54:34 AM",
      "body": "i will work with you if you can increase the budget. Escrow is allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roksana.hee",
      "created_time": "June 20, 2023, 10:58:35 AMLast edit: June 20, 2023, 05:58:37 PM by roksana.hee",
      "body": "Quote from: tonydante on June 20, 2023, 10:54:34 AMi will work with you if you can increase the budget. Escrow is allowed.Very interesting. I have 2 questions for you.1. Can I know your offer?2. Can I see if your portfolio belongs to you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tonydante",
      "created_time": "June 20, 2023, 11:00:35 AM",
      "body": "can i DM you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "June 20, 2023, 05:56:33 PM",
      "body": "Quote from: roksana.hee on June 20, 2023, 10:58:35 AMVery interesting. I have 3 questions to you.1. Can I know your offer?2. Where are you from?3. Can I see your portfolio belong with you?You should skip question number 2. You should not ask/share any personal information publicly on the forum. For rate/budget, there is almost no chance to get a cheap rated developer. But in the marketplace, there is a good chance to get low-budget developers. As many freshers try to complete projects only for review the amount is considered as tips.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roksana.hee",
      "created_time": "June 20, 2023, 06:03:20 PM",
      "body": "Quote from: shasan on June 20, 2023, 05:56:33 PMYou should skip question number 2. You should not ask/share any personal information publicly on the forum. For rate/budget, there is almost no chance to get a cheap rated developer. But in the marketplace, there is a good chance to get low-budget developers. As many freshers try to complete projects only for review the amount is considered as tips.Thank you for your kind advice bro. I already hide that question. Also, Can I know your targeted price to do it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tonydante",
      "created_time": "July 03, 2023, 05:21:57 PM",
      "body": "I will do milestones 1 &2 for $30 as a test",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}