{
  "id": "topic_5474812",
  "title": "Amphenomenon",
  "author": "Amphenomenon",
  "created_time": "November 20, 2023, 08:21:27 PM",
  "content": "We all are aware that our country is in debt, domestically (debt owned to organisations in the country) and externally (debts owned to organisations outside the country). We know the debts is not reducing rather increasing as year goes by and our main source of income which is exporting Crude Oil has been on the decline by some factors which has affected the government in being able to pay any of this debt and this continues to make our economy decline.How feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? since we know that bitcoin halving is coming next year and this may likely make Bitcoin hit a new all time high with the span of 2 years and also the high increased of the chance of SEC accepting Bitcoin ETF which is a great news for bitcoin and also we are currently in the bullish season.I thought about this recently when replying a post about the New Argentina president, since they are also in debt and we also, I brought it here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474812",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "November 20, 2023, 09:11:54 PM",
      "body": "If they could think in this direction, it would have been a great idea considering the prospect of Bitcoin. It could have been one of the best investment decision they could have made that would have earned us so much returns. Unfortunately,  our government have not been much interested in making productive investment rather much of our income are spent on privolities like buying exotic cars and houses for elected/appointed government officials who are already rich and comfortable. Imagine the proposed president yacht of N5b, car for the wife of president at N1.5b and other unnecessary expenditures on things that does not generate revenue. To further buttress the point that Nigerian government are not thinking investment, the took loan worth billions of dollars from China to build railway and roads and these project did not add a penny to our treasury neither is the railway functioning yet Nigeria is servicing these debts years and lavishing our scarce resources. Only Nigeria will change tomorrow, but I don't think our government is thinking about investment and even if they are, Bitcoin might not come into the picture because it will not afford them the opportunity to looth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 20, 2023, 09:25:26 PM",
      "body": "Quote from: Amphenomenon on November 20, 2023, 08:21:27 PMWe all are aware that our country is in debt, domestically (debt owned to organisations in the country) and externally (debts owned to organisations outside the country). We know the debts is not reducing rather increasing as year goes by and our main source of income which is exporting Crude Oil has been on the decline by some factors which has affected the government in being able to pay any of this debt and this continues to make our economy decline.How feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? since we know that bitcoin halving is coming next year and this may likely make Bitcoin hit a new all time high with the span of 2 years and also the high increased of the chance of SEC accepting Bitcoin ETF which is a great news for bitcoin and also we are currently in the bullish season.I thought about this recently when replying a post about the New Argentina president, since they are also in debt and we also, I brought it here. It will not be a very good idea for our government to do so because even without crypto currency in our country, the governments and their officials are lutein money secretly and openly, so imagine if they invest in Bitcoin, fir me I think it will be more worse than the way it is now, there are a long of untraceable crypto currency wallets and if they eventually do so as you have said, there will be a lot of stories and they and their families will not be the ones to suffer for it rather we the good citizens.Why I said so is because in our fiat banks, one can easily trace transactions but it is not like that in do many crypto currency wallet, if anyone wants to invest into Bitcoin he or she should just use his or her own money to invest and not the country money, the money in our country belongs to us nah not the government because the government are been paid already. So our own money, they are supposed to use them to do roads, build schools, hospital and also make the economy standard to be in a friendly position, if the government can do just that I really believe that they can save save up money to pay the loan that the country is owing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 20, 2023, 10:06:13 PM",
      "body": "Nigerian debt profile is untouchable and it is control by the international monetary organizations. Nigeria can survive without borrowing from the international bodies but Nigeria is force to collect loan every year. Okay look at this. Di house of Senate and Representatives bought cars that can finance Nigeria fiscal budget but instead Nigerian government prefer use the money for cars and go into borrowing. Only that you supposed understand that they not with their sense but control by international bodies.A country cannot just dash into cryptocurrency because of the RISK. If Nigeria will come in then they have to plan the bear bear Market the the next bull market so that when they start the investment they will not disappoint themselves and the projects to be executed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 20, 2023, 10:24:51 PM",
      "body": "Quote from: Mate2237 on November 20, 2023, 10:06:13 PMNigerian debt profile is untouchable and it is control by the international monetary organizations. Nigeria can survive without borrowing from the international bodies but Nigeria is force to collect loan every year. Okay look at this. Di house of Senate and Representatives bought cars that can finance Nigeria fiscal budget but instead Nigerian government prefer use the money for cars and go into borrowing. Only that you supposed understand that they not with their sense but control by international bodies.A country cannot just dash into cryptocurrency because of the RISK. If Nigeria will come in then they have to plan the bear bear Market the the next bull market so that when they start the investment they will not disappoint themselves and the projects to be executed.Nice thought share mate, Bitcoin and Nigeria has a really long way to go especially when it comes to the case study of involving the selfish politician that are the major cause of all this dept in the country.In terms of making proper plans before actually securing an investment in Bitcoin, that I think would be know by the government that's if they actually do decide they want to take such steps because proper planning is required for everything especially when it comes to something that has to deal with huge funds like the budget of a country.Let's take Argentina for example, just this few days after electing a Bitcoin activist as their president, the certainty of this man about an Bitcoin boasting the economy of Argentina would even draw other countries to take such leap because he makes the whole thing looks so easy and simple, but I would like to think latter is the case because proper planning and strategic measures need to fall in place before effective results can be gotten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 20, 2023, 10:33:40 PM",
      "body": "Quote from: Amphenomenon on November 20, 2023, 08:21:27 PMWe all are aware that our country is in debt, domestically (debt owned to organisations in the country) and externally (debts owned to organisations outside the country). We know the debts is not reducing rather increasing as year goes by and our main source of income which is exporting Crude Oil has been on the decline by some factors which has affected the government in being able to pay any of this debt and this continues to make our economy decline.How feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? since we know that bitcoin halving is coming next year and this may likely make Bitcoin hit a new all time high with the span of 2 years and also the high increased of the chance of SEC accepting Bitcoin ETF which is a great news for bitcoin and also we are currently in the bullish season.I thought about this recently when replying a post about the New Argentina president, since they are also in debt and we also, I brought it here. Your proposition sound like a fairy tell to me regarding weda our president go consider bitcoin investment to strengthen our economy. With all due respect to your well thought topic, and your good intentions to see say Nigeria, go de beta tru bitcoin adoption for our government level, dat one no fit happen. Oil money no go let dem reason something like bitcoin, wey dem need to wait, de analyze chart to predict wen halving go happen, after dat begin again to wait for ATH and bull run, dat one na very long process. Infact so far say crude oil still de commot from underground, I no see any innovative plan from our leaders.Assuming say we no get a profitable natural resources like crude oil, wey we depend on to survive. I believe say dem no go de see excess money from export as e be now, because dat one really make the country relax and no come de move forward. Dem for de think outside di box to develop oda profitable sectors like agriculture and dem go create an enabling environment for investors to bring dem technology here, wey we for be like China, of Africa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "November 21, 2023, 05:18:14 AMLast edit: November 21, 2023, 05:28:37 AM by Amphenomenon",
      "body": "Quote from: rachael9385 on November 20, 2023, 09:25:26 PMIt will not be a very good idea for our government to do so because even without crypto currency in our country, the governments and their officials are lutein money secretly and openly, so imagine if they invest in Bitcoin, fir me I think it will be more worse than the way it is now, there are a long of untraceable crypto currency wallets and if they eventually do so as you have said, there will be a lot of stories and they and their families will not be the ones to suffer for it rather we the good citizens.Oh @rachael9385, it seems like you forgot about the Transparency  of Blockchain, once the wallet address is known we can continuously track every transaction made on that address, it will make it more possible to trace them. We hear this or that governor squander money but even if they are ask to pay back how can we know except its made open for everyone to which Blockchain would help in this part. How can you tell if they don't have bitcoin now as a private investment or as a way of hiding their money. If they opt for investing in the country and its possible to release the wallet address then this is actually better for us. Quote from: Kelward on November 20, 2023, 10:33:40 PMOil money no go let dem reason something like bitcoin, wey dem need to wait, de analyze chart to predict wen halving go happen, after dat begin again to wait for ATH and bull run, dat one na very long process. Infact so far say crude oil still de commot from underground, I no see any innovative plan from our leaders. It is not totally reasonable because there is something called employment, they can employ expert on this, Analysis is still being done in the exportation of crude oil Infact nothing should be done if its not analyse and doesn't literally means the government will understand how to do it what matters is how effective it is. Quote from: Kelward on November 20, 2023, 10:33:40 PMAssuming say we no get a profitable natural resources like crude oil, wey we depend on to survive. I believe say dem no go de see excess money from export as e be now, because dat one really make the country relax and no come de move forward. Dem for de think outside di box to develop oda profitable sectors like agriculture and dem go create an enabling environment for investors to bring dem technology here, wey we for be like China, of Africa.This is already their alternative investing in Agriculture just that its currently not being done properly and its still not their priority. Importing technology will not help, we need to be able to create some for our self at least or better still being to export technology created by us which is less likely to be possible as things stand now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 21, 2023, 05:48:24 AM",
      "body": "rachael9385, I understand your points, and I know where you're heading to, all of us know how corrupt our government dem dey and wattin dem fit do their citizens without thinking twice, sometimes sef I dey think weda dem don forget say dem dey owe others loannnn, because since dem collect that loan I never hear anything like say dem dey plan to play back. Every government wey come go just mind em business thief em own commot for sit.But where I no agree with you na where you say bitcoin investment no go good for our government to take carry pay this loan, yes I know say dem fit convert the opportunity of anonymous transaction to their own favour to take dey dupe the country, but make you no forget say bitcoin na one of the solutions to our world today, and if them no fit use am now dem wan take allow their citizens to use am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "November 21, 2023, 06:37:48 AM",
      "body": "Quote from: AmphenomenonWe all are aware that our country is in debt, domestically (debt owned to organisations in the country) and externally (debts owned to organisations outside the country). We know the debts is not reducing rather increasing as year goes by and our main source of income which is exporting Crude Oil has been on the decline by some factors which has affected the government in being able to pay any of this debt and this continues to make our economy decline. The debt the country is owning is the thing that is making the citizens to cry every night and day because, by the time we will be facing all those things our bad leaders has caused for Nigeria to own such a debt their children children will be enjoying the money in other countries. The new president people have been looking unto to solve this issues of borrowing money from some countries, based on he is a wealthy man before he became president but the way things is going now show that he will do the same thing to increase the debt for incoming president to pay.Quote How feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? Just remove your mind from that aspect, because I never see anybody for Nigeria that will invest government money in this administration for the betterment of the country, and if they have such opportunity to invest government money in BTC, don't be surprise that the money will disappear from the government wallets and the matter will not go anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockson1",
      "created_time": "November 21, 2023, 07:11:52 AM",
      "body": "I won ask questions Luke thins because me I confuse too much, \"why e be say with the amount of loans way this our country dey owe still if the government of this country ask for another loan them go still give? Sometimes fishy is going on between our governments and those that are give this country loan.Is like say in one way or the other those people then dey milk Nigeria dry somehow, many if them no fit collet back the money them dey use the collateral because I no see any how way 9ja go collect that kind of big loans without any collateral.E go good if our government them invest for Bitcoin, more especially this season way we win enter the bull, at least small thing fit come out from the investment and them fit use an take pay the some of the loans way the country dey ow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 21, 2023, 08:10:26 AM",
      "body": "Quote from: Amphenomenon on November 20, 2023, 08:21:27 PMHow feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? since we know that bitcoin halving is coming next year and this may likely make Bitcoin hit a new all time high with the span of 2 years and also the high increased of the chance of SEC accepting Bitcoin ETF which is a great news for bitcoin and also we are currently in the bullish season.I thought about this recently when replying a post about the New Argentina president, since they are also in debt and we also, I brought it here. It would have been better if our government invest our money on bitcoin to recover our dieing or epileptic economy. But am am afraid even if that is possible it would be for there selfish interest. I believe those our politian are great investors of bitcoin. The money they loot from our reserve are used to invest in bitcoin. They make more profit while the economy die gradually. For your information they have no plan to recover our economy. All what they want is to enter power and take there own national cake. Haven't you been woundering why EFCC hasn't been probing the politicians? Because money laundering is no longer on GP tank and suckaway but has been upgraded to bitcoin investment.If you check the top 10 contries that adopt bitcoin massively you will discover that Nigeria is top 10 but if you check properly you will see that CBN has pertialy ban the use of bitcoin where as it still stand as top 10 where do you you think those money is coming from? Consedring the inflation of our country where the youth manage to eat a 3 square meal a day, will spend about $562.9b in 2022. in bitcoin investment. My only advice to you is to forget about how the government will invest in bitcoin to revive the economy because they are doing it but for there personal interest so you should invest for yourself and forget about them because even if they invest and the money grew, when they will share the money you not be there, probably it will still be channeled under a proposed project where dey can perfectly shear it amongst themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "November 21, 2023, 08:15:30 AM",
      "body": "I blv some politician get BitcoinDem get finance expert wey dey help dem Nigeria as a country wey dey borrow anyhow nor fit investMake we say tinubu invest nowE use e human mind leave ahn nor touch ahnThe next person na go enjoy ahnEverything na politics if e nor benefit me I nor go doanLet's say dey are jux been patrioticIf dem accept to invest in Bitcoin self naira wey don dey die go loss more valueBitcoin go bcom mainstream for NigerE go dey easier to scam peopleQuotewhy e be say with the amount of loans way this our country dey owe still if the government of this country ask for another loan them go still give? Sometimes fishy is going on between our governments and those that are give this country loan. we get collateralNigeria worth dey way higher dan d debtSo as a creditor dem go dey pray make Niger nor fit pay",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 21, 2023, 11:00:44 AM",
      "body": "Quote from: Kelward on November 20, 2023, 10:33:40 PMAssuming say we no get a profitable natural resources like crude oil, wey we depend on to survive. I believe say dem no go de see excess money from export as e be now, because dat one really make the country relax and no come de move forward. Dem for de think outside di box to develop oda profitable sectors like agriculture and dem go create an enabling environment for investors to bring dem technology here, wey we for be like China, of Africa.No be lie. Resources full ground wey dem go take lift the country comot inside this economic quagmire wey dem sink the country enter all because them don rely on only crude oil money. Them forget say if them properly diversify the economy of this country things go move . The solution na to become exporting country and not consumption country but them no dey do the right thing.The reason wey this country no go better at least not now be say no trust, any president wey enter go carry him family and friends take role. Some positions for this country, na civil society organizations suppose dey appoint people wey dey work there but everything dey president table, is unfortunate.For the bitcoin talk, hmmm . If government invest in bitcoin, e no go still make any impact in the economy, na only adoption and legality e go give to the Nigerian system but say make the economy improve because say dem put government money for bitcoin na lie. In fact e go become another area for embezzlement as some people go still carry am enter house. Moreover, El Salvador wey wey invest, me I never see that kind economic improvement.To invest in bitcoin means say person want additional money on top the one wey the person get, so instead of talking about Nigerian government to invest in bitcoin to better the economy (if at all because I debt say those politicians go do right thing), make dem borrow money take do wetin go make the economy improve but for where? The ones wey dem don dey borrow come, dey end up for people pocket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 21, 2023, 01:15:29 PM",
      "body": "Quote from: Gozie51 on November 21, 2023, 11:00:44 AMQuote from: Kelward on November 20, 2023, 10:33:40 PMAssuming say we no get a profitable natural resources like crude oil, wey we depend on to survive. I believe say dem no go de see excess money from export as e be now, because dat one really make the country relax and no come de move forward. Dem for de think outside di box to develop oda profitable sectors like agriculture and dem go create an enabling environment for investors to bring dem technology here, wey we for be like China, of Africa.For the bitcoin talk, hmmm . If government invest in bitcoin, e no go still make any impact in the economy, na only adoption and legality e go give to the Nigerian system but say make the economy improve because say dem put government money for bitcoin na lie. In fact e go become another area for embezzlement as some people go still carry am enter house. Moreover, El Salvador wey wey invest, me I never see that kind economic improvementNa true you talk, even if our government eventually invest in bitcoin, to increase our sources of revenue, and the investment come begin yield fruit. So fa say corruption still de for di DNA of government officials, na to find loops Holmes to de embezle am. If we no fit to manage our crude oil revenue well, I no think say bitcoin profits go fit make any impact.Wetin we need na good governance, even if na palm oil be the only natural resources wey we get, and di government de proactive and accountable, dat one go fit turn dis economy for beta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "November 21, 2023, 03:06:33 PM",
      "body": "OP... I think right now we should be able to think outside the box, Nigeria is in  debt domestically (debt owned to organisations in the country) and externally (debts owned to organisations outside the country) but who ever told you Nigeria is broke and for that reason can't pay off those debts.See Nigeria has more than enough to clear off those debts in no longer time if only the every sector of the Nigeria Government decides to stop the secret luting and mismanagement of our resources only then we can be free.I even stay sometimes and imagine at what purpose are those loans collected and how did they spend them with out the citizens benefiting, this country has all it takes to survive and provide for ourselves without being indebted to any country, you can see how hard the politicians fight themselves not for the good and betterment of the citizens but for their own selfish reasons all cos dey no the benefits of holding those positions. Bitcoin can not be the ultimate solution for this country rather they should work on becoming selfless and remove greed from their various Governmental positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 21, 2023, 03:32:26 PM",
      "body": "Quote from: Amphenomenon on November 20, 2023, 08:21:27 PMWe all are aware that our country is in debt, domestically (debt owned to organisations in the country) and externally (debts owned to organisations outside the country). We know the debts is not reducing rather increasing as year goes by and our main source of income which is exporting Crude Oil has been on the decline by some factors which has affected the government in being able to pay any of this debt and this continues to make our economy decline.How feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? since we know that bitcoin halving is coming next year and this may likely make Bitcoin hit a new all time high with the span of 2 years and also the high increased of the chance of SEC accepting Bitcoin ETF which is a great news for bitcoin and also we are currently in the bullish season.I thought about this recently when replying a post about the New Argentina president, since they are also in debt and we also, I brought it here.  the question you should have asked is if the government is making any conscious effort to ensuring that these debt is being paid in the first place. The only thing we hear is that they have borrowed some huge amount of money for projects that are not even capital-intensive. If they are concerned about becoming a debt free nation, then an option as this won't be out of place I consider but as long as they don't even give us a reason to believe that they want anything good for the country, let's see how the one sided oil mindedness takes us to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 21, 2023, 04:01:09 PM",
      "body": "Quote from: Amphenomenon on November 20, 2023, 08:21:27 PMI thought about this recently when replying a post about the New Argentina president, since they are also in debt and we also, I brought it here. We aren't sure on how the new Argentina President is going to go about bitcoin adoption and also it's debts overdues repayments and settlements, let's watch and see what their next move will look like concerning bitcoin, now regarding your country Nigeria, you need to wait first to see how the government and it new administrative will take a look on bitcoin and how it going to be fair with it adoption concerned it's citizens, if they government can allow for bitcoin and also make an investment and wait over time to see it making profits on investment, maybe such could be used in the settlements of its debts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 22, 2023, 06:33:54 PM",
      "body": "Quote from: Amphenomenon on November 20, 2023, 08:21:27 PMHow feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? Well, if you ask, I will say it's a great idea, because if the Nigerian government decides to invest some billions of naira into Bitcoin, it obviously would yield a very huge profit that can help them either to repay some of their debt or the profit they will get from Bitcoin will help them not to take more loans. But the question is, will the government in question accept the idea? This is the same government that has not freely allowed the use of cryptocurrency in the country. I know that there are many cryptocurrency users in Nigeria, but the government doesn't actually have the policy that citizens can freely use cryptocurrency, and that's why the Nigerian banks are not allowing cryptocurrency interaction in their banks because of the CBN policy. So, if the government is not 100% supportive of cryptocurrency, then they will obviously not accept investing in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "November 22, 2023, 08:04:38 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on November 22, 2023, 06:33:54 PMQuote from: Amphenomenon on November 20, 2023, 08:21:27 PMHow feasible will it be for our president to invest in bitcoin to cover up these debts and strengthen our economy? Well, if you ask, I will say it's a great idea, because if the Nigerian government decides to invest some billions of naira into Bitcoin, it obviously would yield a very huge profit that can help them either to repay some of their debt or the profit they will get from Bitcoin will help them not to take more loans. But the question is, will the government in question accept the idea? This is the same government that has not freely allowed the use of cryptocurrency in the country. I know that there are many cryptocurrency users in Nigeria, but the government doesn't actually have the policy that citizens can freely use cryptocurrency, and that's why the Nigerian banks are not allowing cryptocurrency interaction in their banks because of the CBN policy. So, if the government is not 100% supportive of cryptocurrency, then they will obviously not accept investing in it.Yes, you know the chances of the government setting regulations is getting higher and remember about a post here which is about Tinubu's plan for Blockchain and eNaira is appealing despite lacking details.. If they are in support in Blockchain its more likely they will support cryptocurrency since its built on Blockchain and if they probably do a feasibility and analytical study about investing in bitcoin now, they may accept it, especially when they know what they can earn will go a long way on the debt and they also getting their share",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "November 22, 2023, 08:13:33 PM",
      "body": "Quote from: Odohu on November 20, 2023, 09:11:54 PMIf they could think in this direction, it would have been a great idea considering the prospect of Bitcoin. It could have been one of the best investment decision they could have made that would have earned us so much returns. Unfortunately,  our government have not been much interested in making productive investment rather much of our income are spent on privolities like buying exotic cars and houses for elected/appointed government officials who are already rich and comfortable. Imagine the proposed president yacht of N5b, car for the wife of president at N1.5b and other unnecessary expenditures on things that does not generate revenue. To further buttress the point that Nigerian government are not thinking investment, the took loan worth billions of dollars from China to build railway and roads and these project did not add a penny to our treasury neither is the railway functioning yet Nigeria is servicing these debts years and lavishing our scarce resources. Only Nigeria will change tomorrow, but I don't think our government is thinking about investment and even if they are, Bitcoin might not come into the picture because it will not afford them the opportunity to looth. You are talking about government and you are also talking about government and their lavish lifestyle. That lifestyle you are seeing started not today but since everyone become woke about the last election, attentions are everywhere and opposition parties are using that to attack them.Let's talk about the bitcoin adoption and the government. From day one, the government position about bitcoin remain the same, no commercial banks nor any type of banks must engage in cryptocurrency or any form of digital currency as directed by the monetary policy enforcers. So, don't expect our government to look at that acceptance any time soon but perhaps when there is a new change in government, they will allow the policy to be review.Bitcoin and economy, do you think right now is bitcoin that Nigerian need to protect her economy amidst this high inflation that is earten everybody, I don't think so. Have you conidered the negative side of bitcoin to economy? What will happen if the price sink and a country put everything on it as reserve, the country will suffer hyperinflation anytime bitcoin enters the bear market, it's not even a debate but reality.Argentina is a green flag for Bitcoin because the new elected president loves bitcoin but that doesn't mean bitcoin will be a thing of investment for the country but rather people will have the free will to buy and sell and possibly be allow as legal tender which is a good thing for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}