{
  "id": "topic_5461400",
  "title": "lieutfunaki",
  "author": "lieutfunaki",
  "created_time": "July 29, 2023, 01:46:29 PM",
  "content": "I have an Original Helium miner that I purchased that absolutely killed it at one point. The firmware SD card has since become corrupted and failed. Does anyone know if:1. The original Helium Miner equipment is still viable for mining on the network?2. Where to get firmware file for the miner so I can replace the SD card?Helium support isn't emailing me back. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461400",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "July 29, 2023, 02:32:59 PM",
      "body": "Would you mind to share the exact model of your Helium miner?If you just say original Helium miner we can't guarantee that we can give you the correct firmware for your unit.And I'd like to suggest try to hard reset the unit by holding the reset button(5 or 15 seconds) then release and check if it solves the issue but if not update here and add more details about your unit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lieutfunaki",
      "created_time": "July 30, 2023, 12:53:07 AM",
      "body": "https://www.trustedreviews.com/reviews/helium-hotspotIt's one of these. Literally the original hotspot, ordered from helium. It has no model # on it that I can find.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 31, 2023, 10:50:30 PM",
      "body": "Quote from: lieutfunaki on July 30, 2023, 12:53:07 AMhttps://www.trustedreviews.com/reviews/helium-hotspotIt's one of these. Literally the original hotspot, ordered from helium. It has no model # on it that I can find. That's just a review, you are going to be more specific on manufacturer or vendor you bought the device from for example these are some of the LoRaWAN device manufacturers/vendors1. https://www.milesight.com2. https://www.sensecapmx.com3. https://www.piscesiot.com/#/home",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 01, 2023, 11:58:51 PM",
      "body": "Quote from: lieutfunaki on July 30, 2023, 12:53:07 AMhttps://www.trustedreviews.com/reviews/helium-hotspotIt's one of these. Literally the original hotspot, ordered from helium. It has no model # on it that I can find. How about the brand name?Like samples Bobcat, SenseCap or Nebra use the brand name and search it on Google with a double quote like sample belowCode:\"Bobcat\" firmwareThe result should be the right site that includes the firmware for your hotspot miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lieutfunaki",
      "created_time": "August 02, 2023, 12:08:25 AM",
      "body": "None of the above. This is the original hotspot marketed and sold by Helium (no longer available). Helium support finally sent me the firmware file. I successfully flashed it to the microSD and got a green light back on the miner/hotspot. Next question is, how do I make sure it is connected to the App again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}