{
  "id": "topic_5450106",
  "title": "SandyBY",
  "author": "SandyBY",
  "created_time": "April 25, 2023, 10:56:57 AM",
  "content": "Hallo!Vielleicht kann mir jemand helfen...Ich habe letztes Jahr bei stoxdc 250€ \"investiert\" mit der Aussage, das würde alles ein Bot machen, ich kann das einfach laufen lassen.Okay, gesagt, getan; kann man ja mal versuchen.Dann wurde ich tagtäglich mehrmals von verschiedenen Tradern belästigt, obwohl ich immer betont habe, daß ich das nicht will.Tatsächlich hätte ich dann nach ca. 2 Wochen einen Gewinn von 70€ erzielt.Wieder diese lästigen Anrufe; daraufhin wollte ich das Ganze auszahlen lassen und kündigen.Geht nicht, brauche ich ein Wallet und die wollten dann auch mit dem TeamViewer (die spinnen wohl) auf meinen PC.Ich bin dann einfach nicht mehr an mein Handy gegangen und irgendwann hörten die Anrufe auf und die Website gab's dann auch nicht mehr.Hatte dann das Geld abgeschrieben.So, jetzt habe ich letzte Woche von einer angeblichen Aufsichtsbehörde eine Mail bekommen, daß stoxdc wegen Geldwäsche untersuchtwird, die auf meinen Namen ein Wallet angelegt und gehandelt haben und da jetzt 126.000 USDT liegen würden. Und es wäre jetzt MEIN Guthaben, da mein Wallet und ich müsste mich bei Atomic-Wallet identifizieren.Atomic-Wallet (scheint ja seriös zu sein) hat mir das bestätigt und ich müsse dann ein neues Wallet aufmachen, dann bekommeich aus dem inaktiven Wallet das Guthaben.Das kann ich alles gar nicht glauben, das ist doch der nächste Versuch, mir wieder irgendwie Geld abzuzocken, oder?Hat da von Euch einer eine Idee? und kann mich aufklären?Besten Dank",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450106",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "April 25, 2023, 02:16:38 PMLast edit: April 25, 2023, 02:29:47 PM by bullrun2020bro",
      "body": "Quote from: SandyBY on April 25, 2023, 10:56:57 AM~Wie sollen denn die $126,000 zustande gekommen sein? Insbesondere wenn du vorher nur einen Gewinn von €70 erzielt hast. Auch wäre es mir neu, dass dich eine Aufsichtsbehörde auffordert bei Atomic-Wallet zu registrieren (lol). Das ist eindeutig ein weiterer Betrug. Bitte fang an deinen gesunden Menschenverstand einzusetzen:1. Es gibt keine automatischen Trading-Bots, die einfach so Geld verdienen. Auch wenn eine Tradingstrategie kurzfristig Gewinne macht, heißt das noch lange nicht, dass diese auch in allen Marktphasen längerfristig funktioniert. Wer hiermit wirbt, ist nicht seriös! Niemand hat Geld zu verschenken! Warum hätte die Person es denn nötig einen Trading-Bot zu verkaufen der unlimitierte Gewinne verspricht? Man könnte den Bot doch selbst einfach laufen lassen und wäre zeitnah Millionär! Kopf einschalten!2. Ich hoffe die ganze Nummer ist dir eine Lehre sensibler mit deinen Daten umzugehen. Wenn die Website mittlerweile down ist und du unzählige Male von Spam-Anrufen belästigt wurdest, kannst du davon ausgehen, dass alle (!) Daten die du bei diesem Service angegeben hast mittlerweile durch das Internet geistern bzw. im Darknet an die nächsten Betrüger verkauft wurden. Ich würde dementsprechend mindestens meine E-Mail bzw. Telefonnummer wechseln. Spam-Anrufe sind die eine Sache, aber mit einem Daten-Paket von E-Mail, Telefonnummer, Namen, Adressen und ggf. sogar noch Bankkonto kann man noch einige weitere Sachen anstellen. Leider ein typischer Fall von Gier frisst das Gehirn, sorry wenn ich das so offen sage. Eine kurze Google-Recherche hätte dich übrigens vor dem ganzen Drama bewahrt:Quelle: https://de.trustpilot.com/review/stoxdc.com?stars=1Daneben gibt es dann noch unzählige weitere negative Rezensionen.Und bzgl. der Aussage, dass du jetzt auch noch eine Wallet bei Atomic Wallet anlegen sollst. Dies ist ein weiterer typischer Scam-Versuch vor dem sogar in den FAQs gewarnt wird:QuoteGovernment agency staff impersonation Sometimes the scammers will masquerade as government employees. Some examples of such government agencies could be the Financial Investigations Union of Sweden, the South African Financial Sector Conduct Authority, etc. While some of these could be checked fairly easily (for example, a quick Google search will reveal that the \"Financial Investigations Union of Sweden\" does not exist), some could be tricky. If you receive an email from a government agency, it's best to contact them yourself and check if the person who contacted you actually works there. You can also check said government agency's contact info and see if their public email address matches the one you received the message fromQuelle: https://support.atomicwallet.io/article/342-wallet-setup-scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "April 25, 2023, 02:25:37 PMLast edit: April 25, 2023, 05:25:31 PM by 5tift",
      "body": "Mal davon abgesehen das nie eine Behörde freiwillig auf die Idee kommen würde Dir einfach mal Geld ohne lästige Nachfragen zu überweisen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 25, 2023, 05:08:41 PM",
      "body": "Hallo SandyBY und herzlich willkommen hier im Forum und Deutschen bereich ! Ich kann mich da meinen vorrednern und das was sie geschrieben haben nur anschließen.Keiner gibt dir irgendwas oder etwas umsonst , speziell wenn es um Krypto oder Geld geht.Check doch mal die Email der angeblichen Aufsichtsbehörde und schreibe dennen wenn es diese gibt über die von der offiziellen Webseite ,nachfragen ob die davon was wissen und so weiter , gegebenfalls von wo ich ausgehe das es Scam ist auch die ganze sache der Polizei melden.Aufjedenfall nichts machen oder irgenwelche persönliche Informationen preis geben oder sonst was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SandyBY",
      "created_time": "April 26, 2023, 05:33:12 AM",
      "body": "Vielen Dank für die Antworten!Ich bin normalerweise kein leichtgläubiger Mensch und sehe alles kritisch.Als ich die 250€ \"investiert\" habe, gab es seltsamerweise noch gute Bewertungen!Natürlich ist mir das sehr, sehr suspekt und ich habe tatsächlich überlegt, zur Polizei zu gehen.Dieses atomic-Wallet scheint aber durchaus seriös zu sein?Egal, ich habe jetzt nicht mehr geantwortet und ans Telefon gehe ich auch nicht mehr.Der Wahnsinn, was sich die alles einfallen lassen.Danke nochmal!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "April 26, 2023, 06:51:12 AM",
      "body": "Quote from: SandyBY on April 26, 2023, 05:33:12 AMAls ich die 250€ \"investiert\" habe, gab es seltsamerweise noch gute Bewertungen!Das ist leider durchaus möglich. Gerade zu Beginn wenn ein neuer Betrugsservice an den Start geht, werden meist massig positive Rezensionen auf Trustpilot oder anderen Plattformen gekauft. Zusätzlich werden meist sogar dubiose Webseitenbetreiber bezahlt einen positiven Artikel oder ein wohlwollendes YouTube-Video zu verfassen. Hier muss man immer skeptisch sein. Du könntest, falls du dir in Zukunft unsicher bist, am besten hier im Forum nachfragen. Wir helfen gerne und das Schwarmwissen des Forums hat schon oft vor Scams bewahrt.Quote from: SandyBY on April 26, 2023, 05:33:12 AMNatürlich ist mir das sehr, sehr suspekt und ich habe tatsächlich überlegt, zur Polizei zu gehen.Das würde ich auch empfehlen. Immerhin wurdest du um dein Geld und deine Daten betrogen - auch wenn die Geldsumme nur relativ klein ist. Durch eine Anzeige besteht zumindest eine geringe Chance, dass den Betrügern das Handwerk gelegt wird und du andere Leute davor bewahrst auch betrogen zu werden.Quote from: SandyBY on April 26, 2023, 05:33:12 AMDieses atomic-Wallet scheint aber durchaus seriös zu sein?Atomic Wallet ist ein Anbieter für Bitcoin und Krypto-Wallets. Für wie seriös man diesen einschätzt, kann man nur nach einer eigenen Recherche beurteilen. Ich würde bei größeren Summen, die man verwahren möchte, aber immer auf Hardware-Wallets, wie Ledger oder Trezor verweisen, da diese einfach ein größeres Maß an Sicherheit versprechen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SandyBY",
      "created_time": "April 26, 2023, 08:49:32 AM",
      "body": "@bullrun2020broVielen Dank nochmal; mein Geld werde ich lieber weiterhin old-school-mässig anlegen...war halt mal so ein Testballon; ich weiss gar nicht mehr wie ich drauf gekommen bin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "April 26, 2023, 09:05:33 AM",
      "body": "Quote from: SandyBY on April 26, 2023, 08:49:32 AM@bullrun2020broVielen Dank nochmal; mein Geld werde ich lieber weiterhin old-school-mässig anlegen...Kein Problem!  Ich hoffe du meinst damit nicht, dass du Bitcoin und dem Kryptobereich den Rücken kehrst. Auch wenn das Investment jetzt ein Reinfall war, lag das ja daran, dass der Anbieter sich als Betrug herausgestellt hat.Bitcoin ist weiterhin ein tolles Investment, das in keinem ausgewogenen Portfolio fehlen sollte. Viele hier sind sowohl in Bitcoin, Aktien als auch Immobilien investiert. Das schließt sich also keinesfalls aus! Und wenn man sich mit der Materie auseinander setzen möchte, ist dieses Forum der perfekte Ort für einen guten Start. Alle grundlegenden Fragen werden hier beantwortet und man erhält derart viel Input von vielen erfahrenen Mitgliedern, dass man auch andere Projekte neben Bitcoin meist viel früher entdeckt als die überwiegende Mehrheit da draußen. Lohnt sich also hier ein wenig mitzulesen, oder sich am besten auch noch zu beteiligen!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "April 26, 2023, 01:38:30 PM",
      "body": "Eine absolut hammerharte Geschichte, aber was mich wirklich freut, ist, dass jemand den Weg in dieses Forum findet und fragt! Ich weiß natürlich nicht, ob das jetzt der erste Account von @SandyBY ist. Aber jedenfalls wurde der Weg direkt hierher gesucht und @bullrun2020bro hat es auf den Punkt erklärt. Absoluter Schwachsinn. Ich wünschte, es gäbe öfter Leute, die so einen Thread eröffnen und dann einfach fragen, bevor sie eben der Sache den Rücken kehren. Dafür gibt es von mir auch den ersten Merit für @SandyBY.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "April 26, 2023, 09:09:33 PM",
      "body": "Die anderen haben ja schon gesagt, welcher Humbug das alles ist. Das ist leider eine der gängigen Maschen. Die Scammer täuschen einen Gewinn vor. Zur Auszahlung muss man aber noch etwas Geld einzahlen. Irgendwann versuchen sie per Teamviewer Zugang zu den PC zu bekommen und dann wird ein Trojaner eingeschleust und gleichzeitig drum gebeten, eine Banküberweisung zu machen. Quote from: SandyBY on April 25, 2023, 10:56:57 AMUnd es wäre jetzt MEIN Guthaben, da mein Wallet und ich müsste mich bei Atomic-Wallet identifizieren.Atomic-Wallet (scheint ja seriös zu sein) hat mir das bestätigt und ich müsse dann ein neues Wallet aufmachen, dann bekommeich aus dem inaktiven Wallet das Guthaben.Was meinst du, dass das Atomic Wallet das bestätigt hat? Hast du Atomic Wallet kontaktiert?Quote from: SandyBY on April 25, 2023, 10:56:57 AMDas kann ich alles gar nicht glauben, das ist doch der nächste Versuch, mir wieder irgendwie Geld abzuzocken, oder?Da ist der gesunde Menschenverstand ja doch noch aufgetreten und du hast rechtzeitig den Weg hier ins Forum gefunden. Auch von mir ein herzliches Willkommen.Übers Ohr gehauen zu werden ist immer ärgerlich und sowas kann leider auch den erfahrensten passieren. Wie du schon geschrieben hast, ist es Lehrgeld. Das gute ist, dass du es gleich am Anfang bezahlt hast. Also bleib ruhig bei Krypto, mach dich schlau, frage hier nach und du wirst feststellen, dass alles andere wirklich nur noch \"old school\" und langweilig ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 26, 2023, 10:02:33 PM",
      "body": "Quote from: SandyBY on April 26, 2023, 08:49:32 AM@bullrun2020broVielen Dank nochmal; mein Geld werde ich lieber weiterhin old-school-mässig anlegen...war halt mal so ein Testballon; ich weiss gar nicht mehr wie ich drauf gekommen bin.Ich hoffe doch ebenfalls wie bullrun2020bro bereits geschrieben hat das du durch dieses Leergeld nicht Bitcoin den rücken kehrst.In gewisserweiße haben wir alle schon mal dies durchgemacht , die einen auf die harte tour und die anderen nur leicht.Ich würde aufjedenfall das ganze zur Anzeige bei der Polizei bringen , natürlich bei der nächsten Dienststelle die für sowas spezialisiert ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SandyBY",
      "created_time": "April 27, 2023, 06:00:29 AM",
      "body": "Quote from: bct_ail on April 26, 2023, 09:09:33 PMWas meinst du, dass das Atomic Wallet das bestätigt hat? Hast du Atomic Wallet kontaktiert?ja, ich habe Atomic Wallet kontaktiert, ob ich Einblick in das Wallet nehmen kann.Als Antwort bekam ich, daß dies ja inkaktiv wäre weil ich das ja nicht angelegt habe, sondern Betrüger in meinem Namen und es wegen Geldwäsche gesperrt sei.Das Guthaben kann ich einsehen und auf ein Wallet übertragen, daß ich selber neu anlegen muss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 27, 2023, 06:20:00 AM",
      "body": "Quote from: SandyBY on April 27, 2023, 06:00:29 AMja, ich habe Atomic Wallet kontaktiert, ob ich Einblick in das Wallet nehmen kann.Als Antwort bekam ich, daß dies ja inkaktiv wäre weil ich das ja nicht angelegt habe, sondern Betrüger in meinem Namen und es wegen Geldwäsche gesperrt sei.Das Guthaben kann ich einsehen und auf ein Wallet übertragen, daß ich selber neu anlegen muss.Könntest du noch genauer erklären, wie du \"Atomic Wallet\" kontaktiert hast?Lief das über Kontaktdaten oder einen Link, den dir die vermeintlichen Betrüger geschickt haben oder hast du selbstständig die Kontaktdaten aus dem Internet rausgesucht?Das klingt zu 100% nach einem weiteren Betrugsversuch, bei dem du dann wahrscheinlich eine Gebühr zahlen musst, um dir die 126.000 USDT auszuzahlen.Umso mehr Informationen du uns bereitstellen kannst, desto mehr kann dir und evtl. weiteren Personen geholfen werden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "April 27, 2023, 07:08:15 AMLast edit: April 27, 2023, 10:03:02 AM by AHOYBRAUSE",
      "body": "Quote from: SandyBY on April 27, 2023, 06:00:29 AMQuote from: bct_ail on April 26, 2023, 09:09:33 PMWas meinst du, dass das Atomic Wallet das bestätigt hat? Hast du Atomic Wallet kontaktiert?ja, ich habe Atomic Wallet kontaktiert, ob ich Einblick in das Wallet nehmen kann.Als Antwort bekam ich, daß dies ja inkaktiv wäre weil ich das ja nicht angelegt habe, sondern Betrüger in meinem Namen und es wegen Geldwäsche gesperrt sei.Das Guthaben kann ich einsehen und auf ein Wallet übertragen, daß ich selber neu anlegen muss.Also das klingt auch schon wieder etwas komisch.Zuerst einmal gibt man bei Atomic keinen Namen an, das ist 100% anonym.Desweiteren können die dir gar keine Auskunft über irgendein Wallet geben ohne zu wissen das du der Eigentümer bist.Bei Atomic hat man wenn man Hilfe vom Support braucht auch eine \"Anonymous Atomic ID\" , über diese kann dann der Support auf ein Wallet schauen und ggf Fehler oder ähnliches auswerten.Das schaut dann so aus:Meine Vermutung ist dass du bei Twitter oder so Atomic angeschrieben hast und dir ein Fake Account geantwortet hat, dort treiben sich viele solche rum.Du sollst quasi wieder reingelegt werden weil sie aus der Historie her sehen \" diese Person kann man scammen\" .Tut mir Leid für deinen Verlust aber diese USDT existieren nicht. Falls doch dann sollen sie dir doch eine Walletadresse auf welcher sich wirklich 126.000$ liegen geben, denke das wird aber schwer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SandyBY",
      "created_time": "April 27, 2023, 09:56:59 AM",
      "body": "ja, jetzt wo Ihr es sagt..ich habe den Link von der angeblichen Aufsichtsbehörde genommen...BLÖD!!!! ich weiß genau, daß man nicht auf Links geht...Die haben dann wahrscheinlich die Atomic-ID auch gefälscht.Ich habe nur Atomic gegoogelt und das schaut seriös aus.Oh Mann(Frau)   das mir so was passiert...ich bin normal der volle Bürokrat...Naja, die 250€ machen mich jetzt nicht ärmer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 27, 2023, 01:18:45 PM",
      "body": "Quote from: SandyBY on April 27, 2023, 09:56:59 AMja, jetzt wo Ihr es sagt..ich habe den Link von der angeblichen Aufsichtsbehörde genommen...~Naja, die 250€ machen mich jetzt nicht ärmer.Na dann würde ich doch sagen, haben wir das Rätsel gelöst Wie du schon sagst, sollte man bei so etwas, gerade wenn es schon verdächtig klingt, niemals auf fremde Links klicken. Auch hier besteht die Gefahr, dass dein System infiziert wird (in deinem Fall halte ich das für nicht so wahrscheinlich, da man dich ja auf anderem Wege nochmal abzocken wollte).Du kannst von Glück sprechen, dass es \"nur\" 250€ waren.Ähnliche Geschichten enden damit, dass teils ältere Menschen Kredite aufnehmen und noch Teilverkäufe ihrer Immobilien tätigen, bis dann die Realisierung eintritt, dass man über den Tisch gezogen wurde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 27, 2023, 07:53:42 PM",
      "body": "Quote from: SandyBY on April 27, 2023, 09:56:59 AMja, jetzt wo Ihr es sagt..ich habe den Link von der angeblichen Aufsichtsbehörde genommen...Danke für deine Information bezüglich des Links und der angebelichen Aufsichtsbehörde.Es ist zwar schlimm umd auch schade so etwas immer zu lesen und zu hören das leute um geld und coins gebracht werden,aber um so mehr ist es wie in deinem Fall dann auch gut dies öffentlich zu machen so das andere nicht auf die selbe masche reinfallen.Und ich bleibe nach wie vor dabei das dies der polizei gemeldet werden sollte , auch wenn du eventuell bedenken dabei hast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "April 30, 2023, 12:51:36 PM",
      "body": "Quote from: SandyBY on April 27, 2023, 09:56:59 AMich habe den Link von der angeblichen Aufsichtsbehörde genommen...BLÖD!!!! ich weiß genau, daß man nicht auf Links geht...Auch von meiner Seite noch einmal der Rat: Prüfe wie oben bereits angeführt genau ob dein System über den Link ggf. mit Malware infiziert wurde. Versuche dich zu erinnern: Was ist passiert als du den Link angeklickt hast? Wurde ggf. ein Download ausgeführt? Hast du ggf. eine Datei geöffnet? Falls ja: Höchste Vorsicht! Dann hast du vermutlich jetzt irgendwas auf deinem Rechner und der nächste Scam bei der deine Wallet leergeräumt wird, ist nicht weit.Daneben noch einmal der Hinweis: Wechsel deine E-Mail! Du wirst jetzt in Zukunft regelmäßig Betrugs-Emails (die teilweise täuschend echt aussehen) von verschiedensten Anbietern bekommen. Und dann reicht ein falscher Klick und die ganze Nummer geht von vorne los. Denn die Betrüger wissen jetzt, dass du für einen Betrug anfällig bist und das bei dir ggf. noch mehr zu holen ist. Sollte zusätzlich auch noch deine Telefonnummer + weitere persönliche Daten (Perso, Bankkonto etc.) betroffen sein, bitte auch an Angriffe wie SIM-Swapping denken. Und das sind dann wirklich Dinge die als Betroffener keinen Spaß mehr machen. Darum lieber jetzt das Thema seriös abhaken und entsprechende Schritte einleiten (neue E-Mail, je nach Ausmaß ggf. neue Handynummer).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SandyBY",
      "created_time": "May 09, 2023, 01:04:42 PM",
      "body": "Hallo, nochmal lieben Dank für Eure Tipps und Kommentare.War einfach mal blöd von mir...und ich habe gerade noch mal geschaut, ich bin nicht durch einen Link auf angeblich \"atomicwallet\" gekommen, sondern die mail-Adresse wurde mir von der angeblichen Aufsichtskommission geschickt.Das echte atomicwallet hat atomicwallet.io und ich habe geschrieben mit atomicswallet.comein kleines \"s\"; die machen das schon seehr geschickt! GRRRIch habe übrigens seit ich hier im Forum geschrieben habe, keine Mail und keinen Anruf mehr bekommen.Die lesen wahrscheinlich hier auch noch mit und lachen sich eins...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "May 09, 2023, 02:21:32 PM",
      "body": "Quote from: SandyBY on May 09, 2023, 01:04:42 PMnochmal lieben Dank für Eure Tipps und Kommentare.War einfach mal blöd von mir...Das machen wir hier doch gerne.Und nicht ärgern. Einfach als Erfahrung verbuchen.Quote from: SandyBY on May 09, 2023, 01:04:42 PMein kleines \"s\"; die machen das schon seehr geschickt! GRRRIch habe übrigens seit ich hier im Forum geschrieben habe, keine Mail und keinen Anruf mehr bekommen.Die lesen wahrscheinlich hier auch noch mit und lachen sich eins...Ja, Phishingmails sind mittlerweile sehr geschickt aufgebaut. Aber wenn man niemals auf irgendwelchen Email-links klickt, dann ist man auch ziemlich sicher. Und falls man eine Suchmaschine nutzt, dann darauf achten, nicht gleich den erstbesten Link zu nehmen. Das kann auch ein als Werbung getarnter Scam-link sein. Mitlesen werden sie wahrscheinlich nicht bzw. wenn ja, keine Zuordnung zu deiner Person machen können.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}