{
  "id": "topic_5420577",
  "title": "ingiltere",
  "author": "ingiltere",
  "created_time": "November 11, 2022, 08:59:30 PM",
  "content": "I don't see any basketball thread here, nobody watch World Cup qualifiers or nobody want to talk about betting on them? Anyway I'll start one, hope there will be some interest so we can discuss. Right now Europe and America qualifier games are played. At the same time Euroleague and NBA matches are still going on so this tournament don't have most of the star players.2023 FIBA Basketball World Cup will begin on Friday, August 25 and ends on Sunday, September 10.There will be 32 teams.Official website: https://www.fiba.basketball/basketballworldcup/2023Participating TeamsJapanPhilippinesAustraliaCanadaChinaCote d'IvoireFinlandGermanyLatviaLebanonNew Zealand",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420577",
  "comments": [
    {
      "author": "Balmain",
      "created_time": "November 13, 2022, 04:53:58 PM",
      "body": "Monday's competitive matches are waiting for us. I'm looking forward to the Serbia-Turkey match. Turkey will play a kind of fateful match with Serbia on the rival field. Turkey carried its World Cup chances to other matches by beating Belgium by 34 points during the week. The great contribution of the short actors, especially Onuralp and the effectiveness of Sadık, Yiğitcan and Furkan in the painted area made a difference. Nedovic Kalinic and Micic will not play in this match. Good luck for Turkey. If Turkey shows its defensive resistance in the Belgium match in this match the chances of winning will increase. I think Turkey will be the winning team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chigo",
      "created_time": "January 24, 2023, 09:04:02 AM",
      "body": "Quote from: Balmain on November 13, 2022, 04:53:58 PMMonday's competitive matches are waiting for us. I'm looking forward to the Serbia-Turkey match. Turkey will play a kind of fateful match with Serbia on the rival field. Turkey carried its World Cup chances to other matches by beating Belgium by 34 points during the week. The great contribution of the short actors, especially Onuralp and the effectiveness of Sadık, Yiğitcan and Furkan in the painted area made a difference. Nedovic Kalinic and Micic will not play in this match. Good luck for Turkey. If Turkey shows its defensive resistance in the Belgium match in this match the chances of winning will increase. I think Turkey will be the winning team.after losing to serbia in november 2002, turkey will face latvia on 24 february.I don't think turkey is the favorite team but they are better than the UK team.https://www.fiba.basketball/basketballworldcup/2023/european-qualifiers/game/2402/Turkey-Latvia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "January 24, 2023, 10:35:53 AM",
      "body": "Kudos to Japan, the Philippines and Indonesia for the join hosting this prestigious event. This will be the first time that there are 3 countries hosting FIBA just like the next FIFA World Cup wherein the US, Canada and Mexico are also hosting it at the same time.It's good to see that both New Zealand and Australia are part of the event. By the way, I am curious since Canada is already qualified right? But the US is yet to join the American qualifiers? How did it happened when the US is known as the powerhouse of basketball in their continent?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "January 25, 2023, 11:08:21 PM",
      "body": "I think the thread is cold due to the promptness in the subject...Until now we have only had the qualifying phases and by the way, this basketball world cup is losing hierarchy.In our zone of 16 teams,  now 7 qualify, lol.I suppose it is the new idea of ​​this type of tournament to give more countries the opportunity to participate above excellence, which was what happened before.Quote from: inthelongrun on January 24, 2023, 10:35:53 AM...//...,,, But the US is yet to join the American qualifiers? How did it happened when the US is known as the powerhouse of basketball in their continent?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "August 29, 2023, 10:57:24 PM",
      "body": "Since FIBA Basketball World Cup started we should reactivate this thread. There are pretty good players playing for their national teams. I think this is better than most of last big tournaments as we see too many NBA players. It used to be tournament bans for NBA players.Doncic in Slovenia, Schröder in Germany, Vucevic in Montenegro, Valanciunas in Lithuania, Jovic in Serbia, Towns in Dominic are some of the best NBA based players in the tournament. Team USA is natural favorite in this tournament. Edwards, Bridges, Brunson, Ingram and Jackson Jr. is a killer starting five. Haliburton, Reaves, Banchero, Portis and Cam Johnson from the bench show us that Team USA is ready to win the cup. Their group was somehow easy. In later stages we will see their real power. Right now they only use small part of their power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "August 30, 2023, 05:53:41 PM",
      "body": "Quote from: ingiltere on August 29, 2023, 10:57:24 PMSince FIBA Basketball World Cup started we should reactivate this thread. There are pretty good players playing for their national teams. I think this is better than most of last big tournaments as we see too many NBA players. It used to be tournament bans for NBA players.Doncic in Slovenia, Schröder in Germany, Vucevic in Montenegro, Valanciunas in Lithuania, Jovic in Serbia, Towns in Dominic are some of the best NBA based players in the tournament. Team USA is natural favorite in this tournament. Edwards, Bridges, Brunson, Ingram and Jackson Jr. is a killer starting five. Haliburton, Reaves, Banchero, Portis and Cam Johnson from the bench show us that Team USA is ready to win the cup. Their group was somehow easy. In later stages we will see their real power. Right now they only use small part of their power.I wonder what the US will do when a tough competitor comes up against it. They have played easy matches so far. It's a different feeling to watch the NBA players in the tournament.In the cup, the teams that advanced to the 2nd round in groups B, C, F and G were announced. Serbia and Puerto Rico in Group B, the USA and Greece in Group C, Slovenia and Georgia in Group F, Spain and Brazil, the reigning champions in Group G, were the teams that advanced to the 2nd round.Teams that did not meet in the previous round will face each other in the second round. The second round matches will be played on 1-3 September.The second round groups are as follows;Serbia, Dominican Republic, Italy, Puerto RicoUSA, Lithuania, Montenegro, GreeceSlovenia, Germany, Australia, GeorgiaCanada, Spain, Brazil, Latvia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "August 30, 2023, 11:41:01 PM",
      "body": "With how laughable the Philippines are performing in the game that they themselves are hosting, it’s safe to say that they are outclassed in the game that they pool millions of pesos for, and they are not going to bag any gold medals nor be part of any major international tournaments moving forward. Poor performance, coaching from one of the most senile people on the planet, and just downright lukewarm players that are in there cause of hype and nothing else to back that hype for are just the tip of this disappointment iceberg. I would say I hope things change and their team performs better in future games but I can’t bring myself to believe in them anymore. It’s just so disappointing watching “professional” players play the ball game like they are high school students in tryouts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 30, 2023, 11:49:10 PM",
      "body": "Quote from: ingiltere on August 29, 2023, 10:57:24 PMSince FIBA Basketball World Cup started we should reactivate this thread. There are pretty good players playing for their national teams.There’s already existing thread that is active with same topic here https://bitcointalk.org/index.php?topic=5461543.0. This thread become dormant for a long time while the mew topic becomes active later than this. Much better to adjust and lock this thread to avoid split of conversation with same discussion.Team USA is dominating their group because only Canada can give them a close match on this tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "August 30, 2023, 11:49:59 PM",
      "body": "Quote from: ingiltere on August 29, 2023, 10:57:24 PMSince FIBA Basketball World Cup started we should reactivate this thread. There are pretty good players playing for their national teams. I think this is better than most of last big tournaments as we see too many NBA players. It used to be tournament bans for NBA players.Doncic in Slovenia, Schröder in Germany, Vucevic in Montenegro, Valanciunas in Lithuania, Jovic in Serbia, Towns in Dominic are some of the best NBA based players in the tournament. Don't forget Quinones is with Towns in Dominican Republic. Anyway for the summary and list of it, we've got this list[1].[1] Record 55 NBA players on rosters for FIBA Basketball World Cup 2023Quote from: ingiltere on August 29, 2023, 10:57:24 PMTeam USA is natural favorite in this tournament. Edwards, Bridges, Brunson, Ingram and Jackson Jr. is a killer starting five. Haliburton, Reaves, Banchero, Portis and Cam Johnson from the bench show us that Team USA is ready to win the cup. Their group was somehow easy. In later stages we will see their real power. Right now they only use small part of their power.As always, there's not much pressure on this roster but the expectation is still high. Having those names, they're still the best team that's currently on this world cup - FIBA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "August 31, 2023, 09:43:03 AM",
      "body": "Quote from: Casdinyard on August 30, 2023, 11:41:01 PMWith how laughable the Philippines are performing in the game that they themselves are hosting, it’s safe to say that they are outclassed in the game that they pool millions of pesos for, and they are not going to bag any gold medals nor be part of any major international tournaments moving forward. Poor performance, coaching from one of the most senile people on the planet, and just downright lukewarm players that are in there cause of hype and nothing else to back that hype for are just the tip of this disappointment iceberg. I would say I hope things change and their team performs better in future games but I can’t bring myself to believe in them anymore. It’s just so disappointing watching “professional” players play the ball game like they are high school students in tryouts. Chill mate. It is what it is. What do we expect from a very corrupt country? The unwanted coach is also like a government official, he's got no shame and will continue to do the job and accept his salary and incentives no matter how ineffective he is.It is really funny that most of the country ignored the sports and athletes that are actually playing world level yet they never get the attention or enough support from the government, media, business sector, and its citizens. And to realize that the Philippines along with Lithuania are the only 2 countries in the world where this sport is number 1. Lithuania at least with only 2 million population is playing like a real basketball country. The Philippines has over a hundred million in population. I heard it spent over a million dollars for Jordan Clarkson alone to play. Its lawmaking body is also quick to approve foreigners to become naturalized citizens just for the sake of this sport. While offering minimal to zero support from the other sports athletes which prompted some of them to just relocate to other countries where they got sponsorships.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "August 31, 2023, 11:52:08 AM",
      "body": "Quote from: Casdinyard on August 30, 2023, 11:41:01 PMWith how laughable the Philippines are performing in the game that they themselves are hosting, it’s safe to say that they are outclassed in the game that they pool millions of pesos for, and they are not going to bag any gold medals nor be part of any major international tournaments moving forward. Poor performance, coaching from one of the most senile people on the planet, and just downright lukewarm players that are in there cause of hype and nothing else to back that hype for are just the tip of this disappointment iceberg. I would say I hope things change and their team performs better in future games but I can’t bring myself to believe in them anymore. It’s just so disappointing watching “professional” players play the ball game like they are high school students in tryouts. That how it is in the Philippines though, even though they didn't win so far, as they are basketball crazy nation, might hard to swallow it right now. But nevertheless, you can't discount the heart of Gilas team. Even NBA star KAT acknowledge that when they face the Philippines.It's tough in Asia though, there are China, Iran, Japan that they have to face and be the best in that region. But this is FIBA and the standards are high for them to achieved something great. But it will never change, if you haven't been in the Philippines and see how they embrace this sport, then you wouldn't understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "August 31, 2023, 12:28:00 PM",
      "body": "Quote from: Casdinyard on August 30, 2023, 11:41:01 PMWith how laughable the Philippines are performing in the game that they themselves are hosting, it’s safe to say that they are outclassed in the game that they pool millions of pesos for, and they are not going to bag any gold medals nor be part of any major international tournaments moving forward. Poor performance, coaching from one of the most senile people on the planet, and just downright lukewarm players that are in there cause of hype and nothing else to back that hype for are just the tip of this disappointment iceberg. I would say I hope things change and their team performs better in future games but I can’t bring myself to believe in them anymore. It’s just so disappointing watching “professional” players play the ball game like they are high school students in tryouts. Home court advantage turns into a disadvantage for the Philippines. Nevertheless though, I think they haven't had a good record in the FIBA if I'm not mistaken. Perhaps it was due to lack of preparation for this tournament as some of them didn't have the time to gel.It might be a disappointment for them, but the players have big heart. And after that they still have their own league and others could be playing somewhere else like Kai Sotto who if I'm not mistaken, it going back to Australian league.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "September 01, 2023, 02:54:02 PM",
      "body": "Quote from: TravelMug on August 31, 2023, 12:28:00 PMQuote from: Casdinyard on August 30, 2023, 11:41:01 PMWith how laughable the Philippines are performing in the game that they themselves are hosting, it’s safe to say that they are outclassed in the game that they pool millions of pesos for, and they are not going to bag any gold medals nor be part of any major international tournaments moving forward. Poor performance, coaching from one of the most senile people on the planet, and just downright lukewarm players that are in there cause of hype and nothing else to back that hype for are just the tip of this disappointment iceberg. I would say I hope things change and their team performs better in future games but I can’t bring myself to believe in them anymore. It’s just so disappointing watching “professional” players play the ball game like they are high school students in tryouts. Home court advantage turns into a disadvantage for the Philippines. Nevertheless though, I think they haven't had a good record in the FIBA if I'm not mistaken. Perhaps it was due to lack of preparation for this tournament as some of them didn't have the time to gel.It might be a disappointment for them, but the players have big heart. And after that they still have their own league and others could be playing somewhere else like Kai Sotto who if I'm not mistaken, it going back to Australian league.The team alone lacks consistency and it's quite evident that they haven't had enough time to prepare what is coming for them hence the record of 0-3 now and that defeat might not be the last because they still have a game against the China. It will be a good game but unfortunately, they might face the same results like the other 3 games they had.Also, it's worth noting that their head coach made a lot of mistakes as well, lots of calls that should've been challenge and some plays that should've been rectified but he failed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "September 06, 2023, 09:47:23 PM",
      "body": "Semi finals are coming. In first game Serbia and Canada will play. Another match-up will be USA and Germany.Canada is like little America. There are too many NBA players and their chemistry is quite good. They passed Slovenia with Dončić so they proved their quality. SGA and RJ Barrett took this tournament serious, Dillon Brooks also contributed quite a lot to the team. Serbia rely on Bogdanovic most. Petrušev also played good. If it was Jokic, I would give Serbia a serious chance, but it's a success for them to play in the semi-finals as it stands.I think Germany went above expectations and being in the semi-final is a big achievement for them. I don't give them any chance against USA. Just like Italy game, USA will destroy their opponent. My final expectation would be USA vs. Canada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 06, 2023, 10:19:59 PM",
      "body": "Quote from: ingiltere on September 06, 2023, 09:47:23 PMIf it was Jokic, I would give Serbia a serious chance, but it's a success for them to play in the semi-finals as it stands.It would truly been a different story if Jokic was part of the team. But they've just proven themselves to be strong and Bogdanovic was there to rely on.Quote from: ingiltere on September 06, 2023, 09:47:23 PMI think Germany went above expectations and being in the semi-final is a big achievement for them. I don't give them any chance against USA. Just like Italy game, USA will destroy their opponent. My final expectation would be USA vs. Canada.I don't want to conclude yet until the matches are finished. Just like with other matches that I have seen, there could be some catches and twists that we may see at the end of these matches.But, everyone's expectation is the same about meeting that two at the finals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "September 07, 2023, 05:23:52 AM",
      "body": "Quote from: ingiltere on September 06, 2023, 09:47:23 PMSemi finals are coming. In first game Serbia and Canada will play. Another match-up will be USA and Germany.Canada is like little America. There are too many NBA players and their chemistry is quite good. They passed Slovenia with Dončić so they proved their quality. SGA and RJ Barrett took this tournament serious, Dillon Brooks also contributed quite a lot to the team. Serbia rely on Bogdanovic most. Petrušev also played good. If it was Jokic, I would give Serbia a serious chance, but it's a success for them to play in the semi-finals as it stands.I think Germany went above expectations and being in the semi-final is a big achievement for them. I don't give them any chance against USA. Just like Italy game, USA will destroy their opponent. My final expectation would be USA vs. Canada.Yeah, same here and I think majority here have predicted that it will be USA vs Canada. Although there are some upsets that happen, but I think both of this teams are strong and obviously Canada has a lot of NBA players so it's going to be a good matchup.Doncic though felt very frustrated on the calls and non-calls on him as he was ejected, same with Brooks, we all know how provocative he is and so it was very effective in the beginning against Luka but he was also ejected for unsportmanlike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "September 08, 2023, 05:36:18 PM",
      "body": "Two games have two surprise results, I don't know what to say. That's the beauty of the basketball though, even underdogs can win games. Germany started very impressive and just when we thought USA can take the lead, Germany didn't give up the game and fight until the last minutes. Austin Reaves tried extra hard for his team but that wasn't enough. Turnovers in second half cost USA the game probably. Wagner, Obst and Schröder played pretty good. Germany deserved to win the game and now they are in the final. Serbia also beat Canada while Canada was the favorite. The final game will be very interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "September 10, 2023, 10:47:00 PM",
      "body": "The tournament is over. Underdogs Germany won the championship! Most people expected Team USA to win it this time but they choked in semi final and Germany beat Serbia in final to win the tournament. Dennis Schröder played excellent whole tournament long. Voigtmann and Franz Wagner did whatever needs to be done in their roles.Germany showed team work is more important than personal play. Stars can win matches but teams win championships. This tournament is the last example of that.Congratulations to Germany. If you want to discuss more it's open for now but I'll close the thread tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}