{
  "id": "topic_5468847",
  "title": "bbc.reporter",
  "author": "bbc.reporter",
  "created_time": "October 02, 2023, 03:58:00 AM",
  "content": "This is the only the beginning, I reckon. How many more leading technology companies will join the cryptospace and support the many platforms in the cryptospace? Also, what of these platforms will be supported by these technology companies?Google has expressed their support for Polygon. Elon and the social media company presently called X might express their support for Dogecoin. I speculate X might not be the final name of this social media platform. I also speculate that Chinese companies will support Chinese blockchain platforms like Conflux. What will be next?Tech giant Google Cloud is now participating as a validator node operator on the Polygon proof-of-stake blockchain network. Polygon and Google both announced this week that Google Cloud has joined the decentralized set of over 100 validators helping secure the Ethereum scaling platform.Validators like Google Cloud are crucial to verifying blocks and signing checkpoint votes that finalize transactions on Polygon’s proof-of-stake consensus model. By contributing node infrastructure, Google is playing a governance role in the network.Read in full https://watcher.guru/news/polygon-network-welcomes-google-cloud-as-a-validator#google_vignette",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468847",
  "comments": [
    {
      "author": "Fundamentals Of",
      "created_time": "October 02, 2023, 05:36:06 AM",
      "body": "Great development for Polygon. The Google brand is not just an ordinary name. It is Google. This decision of Google Cloud must mean a lot to other companies or brands that are still looking for which particular project to join in the wide cryptocurrency industry. There are a lot of choices, but Polygon got the good graces of Google Cloud. Let's wait and see how other popular brands join the crypto game.This decision is also a big vote for Ethereum, specifically its scaling development.I doubt Elon has plans to integrate Dogecoin in his platform X. It seems he's trolling more than he really supports this meme coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 02, 2023, 07:29:57 AM",
      "body": "I wonder if this will turn into another cycle of \"partnered with\" situation where others might try and get on the bandwagon aswell. Just like back in the day when someone was using AWS they described it as being partnered with Amazon lolIts cool that Polygon is being noticed ofc, its a decent chain but suffers from same issues as all Eth based tokens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 02, 2023, 03:33:32 PM",
      "body": "That is a huge collaboration, indeed. Regardless of the consequences of centralization or rather their claim of increasing the Polygon network's collective security, governance, and decentralization, this initiative surely improves Polygon in a general way.Quote from: edmundduke on October 02, 2023, 07:29:57 AMI wonder if this will turn into another cycle of \"partnered with\" situation where others might try and get on the bandwagon aswell. Just like back in the day when someone was using AWS they described it as being partnered with Amazon lolI suppose it is way more than merely using Google services and just claiming to partner up with them. Google Cloud stated they do indeed contribute to the networks, and also affirm the partnership as per the Tweet referenced. So yeah, other project may use their services and claim the partnering up notion, but specifically for this case, Google's team approved and sounded this collaboration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 03, 2023, 01:45:10 AM",
      "body": "Quote from: edmundduke on October 02, 2023, 07:29:57 AMI wonder if this will turn into another cycle of \"partnered with\" situation where others might try and get on the bandwagon aswell. Just like back in the day when someone was using AWS they described it as being partnered with Amazon lolIts cool that Polygon is being noticed ofc, its a decent chain but suffers from same issues as all Eth based tokensI reckon this is not something similar to the partnerships of 2017 hehehee. I also remember the project Omisego's announcement telling everyone that they have partnered with McDonalds. However, the truth was their team was only buying hamburgers to feed their team members and staff hehehehe.In any case, on Polygon and Google, there are no partnerships. Anyone can run a validator if people want and it appears that Google Cloud just wanted to run a Polygon validator. Will Google Cloud develop something on Polygon is uncertain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 03, 2023, 05:31:08 AM",
      "body": "Quote from: bbc.reporter on October 03, 2023, 01:45:10 AMQuote from: edmundduke on October 02, 2023, 07:29:57 AMI wonder if this will turn into another cycle of \"partnered with\" situation where others might try and get on the bandwagon aswell. Just like back in the day when someone was using AWS they described it as being partnered with Amazon lolIts cool that Polygon is being noticed ofc, its a decent chain but suffers from same issues as all Eth based tokensI reckon this is not something similar to the partnerships of 2017 hehehee. I also remember the project Omisego's announcement telling everyone that they have partnered with McDonalds. However, the truth was their team was only buying hamburgers to feed their team members and staff hehehehe.In any case, on Polygon and Google, there are no partnerships. Anyone can run a validator if people want and it appears that Google Cloud just wanted to run a Polygon validator. Will Google Cloud develop something on Polygon is uncertain.Oh man this was amazing indeed! We have gone through so many of these lol. I even remember a \"partnership with Microsoft\" after a team started using Excel lolAs for will Google dev something on Polygon, i find that unlikely. Not because Polygon is bad or anything like that, its just there is very little appetite for blockchain development at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 04, 2023, 01:41:10 AM",
      "body": "@edmundduke. Agreed, Google might not presently develop something on Polygon, however, having an interest to run a validator is not something similar to those fake partherships from 2017. Those announcements from Omisego or Vechain were only marketing tactics to pump their tokens. This news from Polygon was only about their development team expressing welcome to Google Cloud. There is no hype in this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ahyadinnn",
      "created_time": "October 04, 2023, 04:59:57 AM",
      "body": "will this have a good impact on matic prices? or is it just good news without a big impact? i hope matic can return to the price of $1 because i still have some matic that i bought and haven't had time to sell for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 04, 2023, 05:21:36 AM",
      "body": "The decentralized group, which includes more than 100 entities (if true), will gradually turn into services and companies managed by Alphabet in one way or another, and it is only a matter of time. Polygon will turn into a centralized network if it continues to accept central auditors like Google, which always seeks monopoly. This news is the beginning of the transformation of POS into a completely centralized system that is managed by separate companies, but it may be for the same service exactly like BSC.The new decentralization wil be group of multi millions companies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 05, 2023, 02:36:48 AM",
      "body": "Quote from: ahyadinnn on October 04, 2023, 04:59:57 AMwill this have a good impact on matic prices? or is it just good news without a big impact? i hope matic can return to the price of $1 because i still have some matic that i bought and haven't had time to sell for now.No it will not, I reckon. We are presently in a bear market and bear markets imply that not much inflows will go to the coins in the cryptospace. There might be some, however, it will be not enough to pump in much of these coins to an all time high. However, every investor should know the most recent developments and the lastest news to know where to invest their money when the cryptospace market becomes more bullish. There are many good developments on protocols in DeFi and NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 05, 2023, 03:01:27 AM",
      "body": "Quote from: bbc.reporter on October 05, 2023, 02:36:48 AMQuote from: ahyadinnn on October 04, 2023, 04:59:57 AMwill this have a good impact on matic prices? or is it just good news without a big impact? i hope matic can return to the price of $1 because i still have some matic that i bought and haven't had time to sell for now.No it will not, I reckon. We are presently in a bear market and bear markets imply that not much inflows will go to the coins in the cryptospace. There might be some, however, it will be not enough to pump in much of these coins to an all time high. If Google buys Polygon, then it will be positive news, and even if the market is falling, you will find some rise in this pair, but they did not buy, but rather became a validator, and this will not add value to the market, but on the contrary, some may consider it negative news because we are talking about companies with trillions of dollars that will manage one or a group. Of the contract in a token based on proof of stake.Without buying Polygon it is difficult to view this as a positive sign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 06, 2023, 03:07:11 AM",
      "body": "@Husires. However, to become a validator the node should take some tokens. This news clearly implies that Google Cloud has bought some tokens and they might be testing Polygon as a platform. This might not be something similar to Elon where he declares something and pumps the coin only to dump later very much similar to what he has done to bitcoin.But @edmundduke has reminded the skeptical me that this news might only be similar to the partnerships that we have witnessed before hehehe. Google Cloud's participation on Polygon as a validator might only be someone in the office who is using an office computer to run a node hehehehehee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 06, 2023, 10:21:49 AM",
      "body": "Good move actually by Google/Cloud. I've seen them having some programs for start ups that are in AI and web3 too. So I think it all interconnects and Google Cloud wants to be in every space that can be related to cryptocurrencies. It's also a win for Polygon to have Google Cloud as their validator. Maybe soon we'll see AWS having its own brand partner and crypto project that they'll support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}