{
  "id": "topic_5467391",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "September 19, 2023, 11:17:53 PMLast edit: September 20, 2023, 10:27:36 AM by letteredhub",
  "content": "First of all let me make it clear am not a miner and have a little or no clue about mining as am not a tech savvy. All we do on the other side is to trade and hold in addition to having some security knowledge. Now let me stop here on that note. Lol.So guys I stumbled on this article while doing my normal reading routine and I decided to bring it here to know how miners in the forum will react about this development by freely expressing their take about  it by way of a discussion.Microbt Plans to Launch Next-Gen Bitcoin Mining Machine With 1X Efficiency Rating.Quote Source: https://news.bitcoin.com/On September 19, 2023, Microbt, the manufacturer of bitcoin (BTC) application-specific integrated circuit (ASIC) mining rigs, revealed its intentions to introduce an innovative mining machine with an efficiency rating of 1X joules per terahash (J/T). This announcement from Microbt closely follows Canaan’s recent release of the A1466I, which also claims an efficiency rating of 1X J/T or approximately 19.5 J/T. Meanwhile, Bitmain is gearing up to launch a new series later this week, anticipated to align closely with this efficiency benchmark.What do you think about Microbt’s plans to launch a new bitcoin miner with an efficiency rating of 1X J/T?  Share your thoughts and opinions about this subject just for the purpose of discussion.EDITED:Source:https://news.bitcoin.com/microbt-plans-to-launch-next-gen-bitcoin-mining-machine-with-1x-efficiency-rating/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467391",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "September 20, 2023, 12:26:28 AM",
      "body": "What kind of thoughts are you looking for exactly? I mean, if miners can find new hardware that is more efficient then they'll definitely buy them. If the aftersales and services are good, that can also increase the appeal of the hardware. It is basically how the market works in general, no matter what product is being sold on the market.But if they claim something ridiculous like a new algorithm that can increase profit by 250% then most of us would ridicule them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 20, 2023, 06:12:36 PM",
      "body": "I know that miners are in no hurry to buy and use new ASICs until their partners or they themselves purchase equipment and spare parts for repairs and learn how to repair themselves. Most miners use the S19 series 100-150 terahash, which is easily repaired.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 21, 2023, 08:53:51 AM",
      "body": "Quote from: letteredhub on September 19, 2023, 11:17:53 PMSo guys I stumbled on this article while doing my normal reading routine and I decided to bring it here to know how miners in the forum will react about this development by freely expressing their take about  it by way of a discussion.If you have any investments in Bitcoin or are adopting any investment plan according to articles on bitcoin.com, it is a misleading site and may intentionally publish false information related to Bitcoin, and sometimes BCH is mentioned as if it were Bitcoin, review the article more than once or stop browsing them.Quote from: letteredhub on September 19, 2023, 11:17:53 PMWhat do you think about Microbt’s plans to launch a new bitcoin miner with an efficiency rating of 1X J/T?  Share your thoughts and opinions about this subject just for the purpose of discussion.Planning is different from implementation. Implementation requires testing several times before we can say that the promises they make are true. Therefore, we rarely witness rapid transformation of mining devices without tests. Some people may request a device or two, and after several months of experimentation, we can give an evaluation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 22, 2023, 02:08:20 AM",
      "body": "Quote from: Yamane_Keto on September 21, 2023, 08:53:51 AMQuote from: letteredhub on September 19, 2023, 11:17:53 PMSo guys I stumbled on this article while doing my normal reading routine and I decided to bring it here to know how miners in the forum will react about this development by freely expressing their take about  it by way of a discussion.If you have any investments in Bitcoin or are adopting any investment plan according to articles on bitcoin.com, it is a misleading site and may intentionally publish false information related to Bitcoin, and sometimes BCH is mentioned as if it were Bitcoin, review the article more than once or stop browsing them.Quote from: letteredhub on September 19, 2023, 11:17:53 PMWhat do you think about Microbt’s plans to launch a new bitcoin miner with an efficiency rating of 1X J/T?  Share your thoughts and opinions about this subject just for the purpose of discussion.Planning is different from implementation. Implementation requires testing several times before we can say that the promises they make are true. Therefore, we rarely witness rapid transformation of mining devices without tests. Some people may request a device or two, and after several months of experimentation, we can give an evaluation.I have good power deal and I upgrade in waves.soa few s17s lefta lot of s19 and s19 proa few s19 xpI will be replacing the s17s with  s19 xpsI will get a couple of  s21 15-16 watts per th to testI will get a new m5? to replace a m10in 2024 I will decide if I move into new whatsminers or new antminer s21smy next 10 buys will likely be 6-7 s19xp and 1 s21 and 1 whatsminer m50? along with 1 L7Then step back and decide to buy s21 or m50?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 22, 2023, 06:22:15 PM",
      "body": "Antminer S21 (200Th) has already been shown to all miners, but most likely miners will receive this ASIC after the halving in April 2024. But some miners will be able to mine on a test batch now.Why is Bitmain delaying the sale? Are they waiting for the price of Bitcoin to rise and want to sell ASICs at a higher price?https://bitcointalk.org/index.php?topic=5465088.msg62886704#msg62886704",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 09, 2023, 01:38:27 AM",
      "body": "That was definitely crazy when they found a mining machine with an x1 Efficiency Rating. But I do believe when Miner launches there will be a bulk order for institutional and sold out very quickly or when the Miner already sold out fastest the difficulty of the bitcoin will also increase fast and Micro Bt should make other efficient miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}