{
  "id": "topic_5406324",
  "title": "gredinger",
  "author": "gredinger",
  "created_time": "July 14, 2022, 09:36:37 PM",
  "content": "https://www.nist.gov/news-events/news/2022/07/nist-announces-first-four-quantum-resistant-cryptographic-algorithmsTake back mining for a while until they build new ASICs. Probably do software for CPU/GPU if feasible before ASIC preferably please.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406324",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "July 14, 2022, 09:54:57 PM",
      "body": "Although there have been much challenge with the use of PoW in bitcoin mining all because of the high demanding nature of the required energies for this purpose, there have been suggestions about building a new ASIC miner that consume less and work has been steadily going on through that, and to say the fact proof of work can't be dealth with as expected not until renewable energy, PoS or the rest blocks of 210,000 bkocks had been all mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gredinger",
      "created_time": "July 14, 2022, 11:00:46 PM",
      "body": "pos ensures network stalls eventually, as all the stakeholders die and their kin give zero fucks other than money which isn't the purposeif we wanted to move to lower energy, we could do proof of capacity or proof of spacetime, but I'd rather just convert electricity to heat and entropy for now, I guess.Preferably in the comfort of my own home [at least for a while].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gredinger",
      "created_time": "July 15, 2022, 06:41:05 PM",
      "body": "Any input? https://crypto.stackexchange.com/questions/100980/why-did-nist-select-kyber-and-dilithium",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 15, 2022, 07:35:28 PM",
      "body": "It probably goes without saying, but someone, or a group of someones, is going to have to build it, put it on a testnet, prove it works and then submit a proposal.  Mission-critical parts of the protocol need to be thoroughly tested and guaranteed to function without issues before anyone would approve.  We're nowhere near the stage of discussing a fork yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 16, 2022, 04:55:43 AM",
      "body": "It will need at least a decade for quantum resistant algorithms be considered seriously or even make their way into bitcoin. Right now we have no reason to want to think about any kind of fork whatsoever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 16, 2022, 05:10:15 AM",
      "body": "Quote from: pooya87 on July 16, 2022, 04:55:43 AMIt will need at least a decade for quantum resistant algorithms be considered seriously or even make their way into bitcoin. Right now we have no reason to want to think about any kind of fork whatsoever. yes I do agree with you too, if the quantum arrives sooner our developer will think of it sooner although the quantum computer was made not for bitcoin priority but for something else in my opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 16, 2022, 08:13:13 AM",
      "body": "Quote from: gredinger on July 14, 2022, 09:36:37 PMhttps://www.nist.gov/news-events/news/2022/07/nist-announces-first-four-quantum-resistant-cryptographic-algorithmsTake back mining for a while until they build new ASICs. Probably do software for CPU/GPU if feasible before ASIC preferably please.If you would know a bit better the history of bitcoin, you would know that such forks are pretty much impossible to be done because of politics. If this would be done, it would end up in a split, where the actual miners will still remain on one of the chains.So, as we keep saying to people coming with... ideas... \"make your own fork and see how many will use it\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 16, 2022, 01:25:38 PM",
      "body": "Quote from: pooya87 on July 16, 2022, 04:55:43 AMIt will need at least a decade for quantum resistant algorithms be considered seriously or even make their way into bitcoin. Right now we have no reason to want to think about any kind of fork whatsoever. We need a similar amount of time for commercially viable, portable quantum computers to make their way into the market too. We need actual speed benchmarks on how faster they are compared to ASICs, so that people's hard work doesn't get undone by low speed (and hence security) assumptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 17, 2022, 07:57:15 PM",
      "body": "Quote from: gredinger on July 14, 2022, 09:36:37 PMhttps://www.nist.gov/news-events/news/2022/07/nist-announces-first-four-quantum-resistant-cryptographic-algorithmsTake back mining for a while until they build new ASICs. Probably do software for CPU/GPU if feasible before ASIC preferably please.At the present time, in the medium and short term, you do not have to worry about the technology in the Bitcoin protocol, and the continuous development will make all fears in the future just illusions.We may see more rumors that may carry some mathematical and logical calculations, but you should not waste your time tracking them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 17, 2022, 08:04:47 PM",
      "body": "Every week there's a new topic about quantum computing and cryptography. I won't be surprised if mods stick a post explaining how there's still a decade before the general populace have to worry about it lolAnd I don't think you should take anything suggested by NSIT seriously(Especially a new algo, definitely got a backdoor lol)https://www.ams.org/notices/201402/rnoti-p190.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gredinger",
      "created_time": "July 19, 2022, 09:29:23 PM",
      "body": "Several comments that missed the point.It's interesting how ECC was popularized by bitcoin even though it was fairly novel as a cipher back in the hayday.The team was fairly small the built the first bitcoin, but forking from old system to new system is quite a challenge, because eventually addresses will be cracked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gredinger",
      "created_time": "July 20, 2022, 08:11:31 PM",
      "body": "Quote from: NeuroticFish on July 16, 2022, 08:13:13 AMIf you would know a bit better the history of bitcoin, you would know that such forks are pretty much impossible to be done because of politics. If this would be done, it would end up in a split, where the actual miners will still remain on one of the chains.So, as we keep saying to people coming with... ideas... \"make your own fork and see how many will use it\".  ( Date Registered: June 09, 2011 )You do realize that if the keys are broken, it doesn't matter _how_ much you mine... when addresses are compromised via quantum computers, theft of coins seem feasible.So you'd have to question any coins transmitted on the broken network post-fork  ECC was around for a decade before bitcoin came on swinging. I'd be curious to see if we can push quantum resistance within 3-5 years. With hard-fork date [old txn cut off entirely within 7 years].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gredinger",
      "created_time": "July 25, 2022, 03:41:42 PM",
      "body": "https://blog.cloudflare.com/nist-post-quantum-surprise/Hm. TLS 1.3 exist. Already engaging in quantum-resistant connections _in the wild_.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "July 25, 2022, 04:53:54 PM",
      "body": "Quote from: pooya87 on July 16, 2022, 04:55:43 AMIt will need at least a decade for quantum resistant algorithms be considered seriously or even make their way into bitcoin. Right now we have no reason to want to think about any kind of fork whatsoever. There has been discussion of this quantum computer powers but to be honest i don't see it as a threat for a decade or even two decades. Yes, technology is evolving fast but then the developers will also come up with some sort of fork/solution. There is no need for anyone to be panic on the quantum technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 25, 2022, 05:37:50 PM",
      "body": "Quote from: pooya87 on July 16, 2022, 04:55:43 AMIt will need at least a decade for quantum resistant algorithms be considered seriously or even make their way into bitcoin. Right now we have no reason to want to think about any kind of fork whatsoever. This seems to be the conclusion that most computer scientists come to when discussing quantum computing.  I always laugh when experts think they can make predictions about technology advancements.  I know that quantum computing is being worked on and will be a real thing far sooner than the experts predict.  I also know that a lot of people are going to be reactive instead of proactive when it happens.  This is why \"smart people\" are dangerous and shouldn't look for reasons to put off necessary development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 25, 2022, 08:18:49 PM",
      "body": "we didnt build asics to be binary resistant. we used binary systems asics to be stronger, efficient than singular home use domestic systems of binary.instead of trying to avoid quantum.people will use quantum to boost the hashrate. no fork needed. just the future generations of asics will be quantum based where the difficulty will make it expensive for even quantum 'pcs' to try",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 25, 2022, 08:25:02 PM",
      "body": "Quote from: gredinger on July 20, 2022, 08:11:31 PMYou do realize that if the keys are broken, it doesn't matter _how_ much you mine... when addresses are compromised via quantum computers, theft of coins seem feasible.What you're doing is like you'd be trying to \"sell\" anti-tsunami protection to the citizen of El Alto, ignoring the fact that if they're in danger to get hit by tsunami, they're pretty much hopeless already (with most of the world underwater, food shortage is probably their first problem and not the tsunami).I was probably greatly inaccurate, but I hope it helps understanding a quite wide point of view here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 25, 2022, 08:36:05 PM",
      "body": "Quote from: gredinger on July 19, 2022, 09:29:23 PMbecause eventually addresses will be cracked.That very assertion leads to different conclusions. It's confusing, because there isn't anything to be \"cracked\"; only hash collisions, at least if there are no public keys revealed. Addresses \"being cracked\" nearly instantly versus \"being cracked\" in a few years is a tangible difference. Also, solving the ECDLP will happen far sooner than the former, which will likely thrive us to a hard fork. Quote from: OgNasty on July 25, 2022, 05:37:50 PMI know that quantum computing is being worked on and will be a real thing far sooner than the experts predict.Do you happen to have any papers that describe this \"speed-up\" in quantum computing's work, that will lead to bitcoin's death before 2032?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gredinger",
      "created_time": "July 25, 2022, 08:43:22 PMLast edit: July 26, 2022, 12:54:03 AM by gredinger",
      "body": "People will be able to take your coins in your cold wallet via just reading the public ledger and seeing a balance. They'll dump from your private key with the right code and enough qubits.When the genesis key gets dumped, how much value is there in the useless coins?By forking _new_ we can have people _safely_ move their coins to another in a fair and equitable manner.Technically, we could just outlaw stealing keys, but that'd totally not work >.<Mind you:Not all attacks are small improvements. It’s possible that improvements in cryptanalysis break all security levels at once.Assuming that hashing is broken before key generation is a bit foolish as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}