{
  "id": "topic_5488125",
  "title": "btcpond",
  "author": "btcpond",
  "created_time": "March 09, 2024, 01:00:23 AMLast edit: March 09, 2024, 08:13:10 PM by btcpond",
  "content": "Is Bitcoin Smart Contracts an OP_return with financial transaction",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5488125",
  "comments": [
    {
      "author": "ObscurePen",
      "created_time": "March 10, 2024, 02:40:13 AM",
      "body": "OP_return and smart contracts are different. OP_return is an opcode that allows you to store data on the blockchain without cluttering up the unspent cache of nodes because these outputs are 'unspendable'. This allows you to store arbitrary data such as a timestamped contract on the blockchain with little clutter in the network.Smart contracts automates the process by executing the actions of the contract without the need for a third party. While OP_return can be used to code data into the blockchain, they cannot be used for smart contracts. Here are some articles which are useful. Both are pretty old but are good resources:Is the OP_RETURN for contracts and smart properties?Explanation of what an OP_RETURN transaction looks like",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 10, 2024, 08:50:10 AM",
      "body": "No, Bitcoin doesn't have smart contract (as in turing-complete programming). But Bitcoin have stack-based script which can be used for some thing such as creating multi-signature address, locking Bitcoin for certain time or enable LN. Those script doesn't utilize OP_RETURN, but rather using either P2SH, P2WSH or P2TR address. There are attempt to use either OP_RETURN or witness data to perform on-chain smart contract, but those aren't part of Bitcoin protocol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "March 10, 2024, 01:04:41 PM",
      "body": "Why are you trying to deploy smart contract on Bitcoin when there are chains that are much better and efficient with low transaction fee and much higher transaction speed?Do not spread shit in Bitcoin network and keep all of your \"smart\" stuff on the shitchains. There are thousands of these fighting with each other in terms of \"SPEED\".I hope this helps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}