{
  "id": "topic_5440654",
  "title": "walletrecovery",
  "author": "walletrecovery",
  "created_time": "February 21, 2023, 07:36:50 AM",
  "content": "Загружаем и устанавливаем свежую версию кошелька BitcoinHD (дождаться синхронизации можно позже)https://github.com/bhdone/btchd/releases/download/build-54/BitcoinHD-2.1.0.54-win64-setup.exeПосле установки снимаем галку (не запускаем программу после установки), а сначала выводим ярлык на рабочий стол.В свойствах ярлыка дописываем параметр -test как это показано на скриншоте и в итоге получаем 1000 монет.Кто майнит CHIA может настроить объединенный майнинг и поучаствовать в тестировании сети BitcoinHD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440654",
  "comments": [
    {
      "author": "xandry",
      "created_time": "February 21, 2023, 01:16:13 PM",
      "body": "А кошель они обновить не планируют? Последние изменения 3 года назад были. Сейчас Bitcoin Core 22.0, а у них база на 0.19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoinside",
      "created_time": "February 21, 2023, 07:13:38 PM",
      "body": "В названии чего не указал,что тестовые монеты раздают? Кран тоже не рабочий при попытке получить монеты выходит ошибка.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "walletrecovery",
      "created_time": "February 21, 2023, 09:42:58 PMLast edit: February 22, 2023, 12:21:06 PM by xandry",
      "body": "Quote from: xandry on February 21, 2023, 01:16:13 PMА кошель они обновить не планируют? Последние изменения 3 года назад были. Сейчас Bitcoin Core 22.0, а у них база на 0.19Качайте свежий релизhttps://github.com/bhdone/btchd/releasesQuote from: cryptoinside on February 21, 2023, 07:13:38 PMВ названии чего не указал,что тестовые монеты раздают? Кран тоже не рабочий при попытке получить монеты выходит ошибка.Всё очень даже рабочее... не сам же себе я монетки перевел.Обратите внимание, что кошелек начинается с числа 2это тестовая сеть, а это значит, что и кошелек вам надо создавать в тестовой сети,т.е. запустить программу кошелька с параметром -testnet (как на первом скриншоте)но я предполагаю, что за помощь в тестировании разработчикиобменяют или начислят всем, кто принимал участие вполне себе обычныемонеты из mainnet (поэтому хоть монеты и тестовые, но это только пока).Что касается увеличения общего количества монет с 21 до 63 миллионов,то это не сильно меняет картину, поскольку во-первых: награда за блокувеличена с 7,5 до 30 монет и во-вторых: для майнеров решение неплохое, им же надогде-то стейкать обеспечение (на каждый имеющийся у них терабайт 3 BitcoinHD),поэтому монетки все равно быстренько выйдут из оборота и будут застейканы,там, кстати 4 вида стейкинга по срокам заморозки: неделя, год, два и три,вполне себе так грамотно придумали разработчики. Майнить можно параллельно,используя уже имеющиеся плоты CHIA, поэтому большая просьба к тем, у когополучилось настроить этот DUAL майнинг, делиться тут информацией, а то я ужевторой день мучаюсь и у меня не получается. Спрашивайте, отвечу о чем знаю.https://medium.com/@bitcoinhd.community/bhd-mining-tutorial-win-98a4b1f86335https://medium.com/@bitcoinhd.community/update-on-bhd-wallet-out-of-password-solution-97c2d5021ed1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 24, 2023, 10:55:04 PM",
      "body": "Тоже поставил кошелек на машину и при запросе монет с крана вылетает ошибка.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}