{
  "id": "topic_5463407",
  "title": "Paredao",
  "author": "Paredao",
  "created_time": "August 15, 2023, 08:38:24 PM",
  "content": "Ontem mexendo no meu armário de velharias, encontrei uma caixinha de tvbox que ainda funciona. Ele usa um antigo android 4.4.2. Já não me serve para mais nada. Usava numa antiga televisão que eu tinha que não era Smart Tv. Ele possui um processador Amlogic, tem 1 GB de ram e capacidade interna de armazenamento de 8 gb. Ele também aceita hdd externo de até 1 tera.Alguém saberia dizer se tem algum projeto no Github que mostre como fazer tal transformação ? Pelo menos para participar de uma Lotery Mining ? Ou montar um full node LN ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463407",
  "comments": [
    {
      "author": "tg88",
      "created_time": "August 15, 2023, 10:06:07 PM",
      "body": "Não vou falar que é impossível rodar um node nele pois as vezes as pessoas conseguem fazer rodar coisas inimagináveis nesses hardwares, eu não considero muito viável com 1 GB de RAM mas  sei que tu é entusiasta dos pc's antigos então se o objetivo for se divertir lutando contra as adversidades vale prosseguir mas se quiser algo confiável e que não de tanta dor de cabeça para configurar e manter aconselharia desistir.Quanto a Lotery Mining acho que seria mais fácil caso fosse um arduino pois nesse caso tu poderia pegar a base do NerdMiner para se basear e tentar fazer uma adaptação. Vou dar um única sugestão prática mas não significa que ela é rentável  , você poderia instalar a carteira e o software de mineração da Veruscoin que roda no Android e é uma moeda especifica para mineração via celular e CPU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "August 15, 2023, 11:18:17 PM",
      "body": "Quote from: Paredao on August 15, 2023, 08:38:24 PMOntem mexendo no meu armário de velharias, encontrei uma caixinha de tvbox que ainda funciona. Ele usa um antigo android 4.4.2. Já não me serve para mais nada. Usava numa antiga televisão que eu tinha que não era Smart Tv. Ele possui um processador Amlogic, tem 1 GB de ram e capacidade interna de armazenamento de 8 gb. Ele também aceita hdd externo de até 1 tera.Alguém saberia dizer se tem algum projeto no Github que mostre como fazer tal transformação ? Pelo menos para participar de uma Lotery Mining ? Ou montar um full node LN ?Então @Paredao , dei uma pesquisada e descobri que existe uma wallet não custodiada (sob seu inteiro controle) e open-source que é capaz de rodar tanto em dispositivos Android quanto IOs: Blixt WalletMas... como o @tg88  já te adiantou, a questão dos 1Gb de ram de fato podem ser um impeditivo porque hoje qualquer celular de entrada já vem com 4gb de ram no mínimo (salvo aqueles bem capetinhas).Outra questão é a firmware que você tem rodando nessa TVBox, pois o Android que está aí já é um Android bastante customizado para fins específicos de rodar vídeos, então se você colocar um app que consome mais processamento é capaz de \"dar ruim\".Enfim... soluções em questão de software tem, acho que a sua maior limitação é o hardware que possui em mãos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 16, 2023, 07:29:35 PM",
      "body": "Pois para um node, o recomendado é pelo menos 2GB RAM. Mas, acredito que mesmo com 1GB consiga montar um node Bitcoin.Agora, primeiro você tem de trocar o firmware dele, como já foi comentado ele tem um Android personalizado para multimédia. Mas, na net existe de certeza o firmware para fazer essa alteração. Qual é a marca/modelo dessa tvbox?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "August 16, 2023, 08:19:45 PM",
      "body": "Quote from: joker_josue on August 16, 2023, 07:29:35 PMPois para um node, o recomendado é pelo menos 2GB RAM. Mas, acredito que mesmo com 1GB consiga montar um node Bitcoin.Agora, primeiro você tem de trocar o firmware dele, como já foi comentado ele tem um Android personalizado para multimédia. Mas, na net existe de certeza o firmware para fazer essa alteração. Qual é a marca/modelo dessa tvbox?Ele é xing ling. É mxq alguma coisa.   Ele usa um processador bem fraquinho. Um tal de Amlogic s805. Nem tem muita opção para ele não. Como o pessoal respondeu nos comentários anteriores, não vale a pena nem o trabalho de abrir o aparelho e dar uma \"turbinada\" nele. Acho que voltará para o armário para depois ir para o \"lixo eletrônico\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "August 16, 2023, 09:40:05 PM",
      "body": "Quote from: Paredao on August 16, 2023, 08:19:45 PMEle é xing ling. É mxq alguma coisa.  Eu tenho um desses, acho que tu consegue vender ele no mercadolivre por uns 80 reais caso tiver interesse. Muita gente não se motiva muito a vender produtos de baixo valor porque tem que ir até os correios despachar mas eu sempre procuro por um novo dono para meus eletrônicos usados e costuma valer a pena.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 20, 2023, 03:00:20 AM",
      "body": "Quote from: tg88 on August 16, 2023, 09:40:05 PMMuita gente não se motiva muito a vender produtos de baixo valor porque tem que ir até os correios despacharBoa ideia para uma startup.. ao invés de entregar, ela busca os produtos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 20, 2023, 08:01:42 AM",
      "body": "Quote from: sabotag3x on August 20, 2023, 03:00:20 AMQuote from: tg88 on August 16, 2023, 09:40:05 PMMuita gente não se motiva muito a vender produtos de baixo valor porque tem que ir até os correios despacharBoa ideia para uma startup.. ao invés de entregar, ela busca os produtos Isso já existe... muitas transportadores já tratam disso. A questão é se o custo de transporte compensa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 20, 2023, 09:28:13 AM",
      "body": "Quote from: sabotag3x on August 20, 2023, 03:00:20 AMQuote from: tg88 on August 16, 2023, 09:40:05 PMMuita gente não se motiva muito a vender produtos de baixo valor porque tem que ir até os correios despacharBoa ideia para uma startup.. ao invés de entregar, ela busca os produtos A Amazon e Americanas já fazem algo parecido no Brasil, pelo menos com os produtos frutos de devolução. Se eu quero devolver um produto por ter chegado errado/quebrado, posso escolher que o entregador passe aqui para pegar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "August 20, 2023, 08:04:54 PM",
      "body": "Quote from: sabotag3x on August 20, 2023, 03:00:20 AMBoa ideia para uma startup.. ao invés de entregar, ela busca os produtos Seria uma ótima ideia. Aqui em São Paulo, para você descartar produtos usados ou até mesmo empresas que compram produtos usados e venham retira-los é uma das coisas mais difíceis. Tenho um sofá antigo que não consigo me livrar dele de forma alguma. Só pagando uma boa grana para conseguir tal feito. Imagino uma empresa que compre produtos recicláveis e retirasse-os. Será que os custos permitiriam tal coisa ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 29, 2023, 07:47:08 AM",
      "body": "Quote from: TryNinja on August 20, 2023, 09:28:13 AMA Amazon e Americanas já fazem algo parecido no Brasil, pelo menos com os produtos frutos de devolução. Se eu quero devolver um produto por ter chegado errado/quebrado, posso escolher que o entregador passe aqui para pegar.Já usei tal serviço com a garantia da Kabum.. mas é um caso diferente. Também lembro que precisei entregar a NF, algo que seria mais difícil em descartes de produtos 'velhos'.Quote from: Paredao on August 20, 2023, 08:04:54 PMSeria uma ótima ideia. Aqui em São Paulo, para você descartar produtos usados ou até mesmo empresas que compram produtos usados e venham retira-los é uma das coisas mais difíceis. Tenho um sofá antigo que não consigo me livrar dele de forma alguma. Só pagando uma boa grana para conseguir tal feito. Imagino uma empresa que compre produtos recicláveis e retirasse-os. Será que os custos permitiriam tal coisa ?O problema do sofá é que é pesado  eletrônicos são mais fáceis de transportar..Eu tenho uns notebooks antigos aqui, cada qual com seu problema.. até hoje não achei um fim para eles.. já pensei em deixar rodando um full node, mas nunca fui atrás disso.. dependendo da sua experiência posso me animar em ligá-los novamente, vá nos atualizando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}