{
  "id": "topic_5437425",
  "title": "Sarah Azhari",
  "author": "Sarah Azhari",
  "created_time": "January 31, 2023, 06:12:51 AM",
  "content": "Sejauh ini aku baru mencoba bitcoin mixer seperti chipmixer dan yomix mixer, yang hanya digunakan untuk bitcoin, penasaran saja, apakah ada mixer untuk altcoin?.Soalnya pemakai kripto itu tidak hanya bitcoin tapi hampir separuhnya juga menggunakan altcoin baik itu trading atau pembayaran. kalau menurutku perkembangan mixer ke depan ini cukup bagus. Apa lagi tidak banyak coin atau token yang mengutamakan privasi seperti Monero, Zcash, Dash, Verge, dan PIVX.Thankks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437425",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "January 31, 2023, 08:37:23 AM",
      "body": "Untuk Ethereum dan Binance Smart Chain (BEP20) ada yang namanya Tornado Cash (TORN), saya pribadi belum pernah menggunakan platform Tornado Cash ini, yang saya tahu banyak orang-orang yang menggunakan platform ini untuk melakukan tindakan kriminal seperti pencucian uang.Juga mekanisme dari platform Tornado Cash ini sangat berbeda dengan mixer konservatif yang sifatnya tersentral, karena menggunakan smart-contract sebagai landasan bertransaksi-nya, sehingga kita bisa menyebutnya sebagai decentralized mixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "January 31, 2023, 01:45:32 PM",
      "body": "Quote from: MAAManda on January 31, 2023, 08:37:23 AMUntuk Ethereum dan Binance Smart Chain (BEP20) ada yang namanya Tornado Cash (TORN), saya pribadi belum pernah menggunakan platform Tornado Cash ini, yang saya tahu banyak orang-orang yang menggunakan platform ini untuk melakukan tindakan kriminal seperti pencucian uang.Saya sempat membaca berita mengenai tindak kriminal ini ditahun lalu yang menyebabkan Netherlands Crime Agency (FIOD) menangkap pria yang di perkirakan sebagai Developer Tornado cash di Amsterdam. Apakah Tornado Cash saat ini masih bisa digunakan dengan kasus ini? karena jujur saya memang belum pernah memakainya. Maaf kalau melenceng dari topik, tapi mungkin jika tidak menggunakan Mixer saya pernah mendengar jika Monero juga memiliki prifasi yang cukup baik karena kalau tidak salah mereka memiliki fitur menyebunyikan pengirim, penerima, bahkan jumlah transaksi. Disamping itu saya juga pernah mendengar mengenai dompet Wasabi yang bisa menghasilkan alamat baru setiap transaksi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "January 31, 2023, 03:02:29 PMLast edit: January 31, 2023, 04:19:52 PM by MAAManda",
      "body": "Quote from: Luzin on January 31, 2023, 01:45:32 PMApakah Tornado Cash saat ini masih bisa digunakan dengan kasus ini? karena jujur saya memang belum pernah memakainya.Saya tidak tahu pasti terkait masih bisa di gunakan atau tidaknya om, karena sejak sanksi yang diberikan oleh Office of Foreign Assets Control (OFAC), link situs mereka yang tersemat di Coinmarketcap juga sudah tidak bisa diakses (saya sudah mencobanya bahkan dengan menggunakan VPN), selain itu update terakhir pada sosial media (twitter) mereka berada pada tanggal 9 Agustus 2022 (tahun lalu), berikut penampakan tweet terakhir mereka:Sumber Gambar: TwitterNamun ketika saya mencoba untuk cari di Google dengan keyword: Tornado Cash Website, pada pencarian teratasnya ada website yang mengatasnamakan Tornado.cash dengan link berikut: https://tornadocash.eth.link, tidak tahu apakah itu resmi milik mereka atau tidak, yang pasti jangan coba-coba berinteraksi karena saya pribadi juga belum mencobanya, takutnya malah dituduh saya nyebar link yang tidak beres.Sumber Gambar: Tornado.cashDiatas merupakan penampakan dari sedikit tampilan yang ada pada website Tornado.cash, bisa dilihat bahwa beberapa menit yang lalu bahkan transaksi disana masih beroperasi (jaringan BEP20).Quote from: Luzin on January 31, 2023, 01:45:32 PMMaaf kalau melenceng dari topik, tapi mungkin jika tidak menggunakan Mixer saya pernah mendengar jika Monero juga memiliki prifasi yang cukup baik karena kalau tidak salah mereka memiliki fitur menyebunyikan pengirim, penerima, bahkan jumlah transaksi. Tentang Monero (XMR) itu benar adanya om, jujur, sebelumnya saya hanya tahu bahwa $XMR merupakan privacy coin tanpa pernah melakukan interaksi secara langsung, namun setelah berhasil menjadi reviewer pada review campaign untuk Fryx Finance di Service Board beberapa waktu lalu, saya langsung takjub dengan apa yang dibangun oleh Monero . Bagaimana tidak, bahkan untuk melihat isi sebuah transaksi saja kita memerlukan 3 komponen (TX Hash, Address, View Key atau TX Key), kalau mau testing, bisa di praktekin sendiri nanti di Blockchair untuk mencari data transaksinya.Referensi:[1] Coinmarketcap (2023, 31 Januari). Diakses pada 31 Januari 2023, dari https://coinmarketcap.com/currencies/torn/[2] Tornado.cash (2023, 31 Januari). Diakses pada 31 Januari 2023, dari https://app.tornado.cash[3] Twitter (2022, 9 Agustus). Diakses pada 31 Januari 2023, dari https://twitter.com/TornadoCash/status/1557048526986780677[4] Tornado.cash (2023, 31 Januari). Diakses pada 31 Januari 2023, dari https://tornadocash.eth.link[5] Blockchair (2023, 31 Januari). Diakses pada 31 Januari 2023, dari https://blockchair.com/monero",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "January 31, 2023, 08:30:40 PM",
      "body": "Quote from: MAAManda on January 31, 2023, 08:37:23 AMUntuk Ethereum dan Binance Smart Chain (BEP20) ada yang namanya Tornado Cash (TORN), saya pribadi belum pernah menggunakan platform Tornado Cash ini, yang saya tahu banyak orang-orang yang menggunakan platform ini untuk melakukan tindakan kriminal seperti pencucian uang.Juga mekanisme dari platform Tornado Cash ini sangat berbeda dengan mixer konservatif yang sifatnya tersentral, karena menggunakan smart-contract sebagai landasan bertransaksi-nya, sehingga kita bisa menyebutnya sebagai decentralized mixer.Tornado Cash Memang bisa katakan pedang bermata dua . Tornado Cash di anggap traksaksi yang sempurna untuk melakukan transaksi kejahatan dan krimanal. Sebalik nya juga bisa untuk para invastasi besar untuk melakukan traksaksi privat agar tidak terlacak oleh hecker.Pemerintah Amerika mulai memerangi Tornado Cash dengan memberikan sanksi kepada perusahaan2 yang berfaliasi dengan Tornado cash, semua protokolnya pun di banned. Semua warga UAS di larang bertraksi dengan protokol ini. Yang jadi pertanyaan apakah masih aman untuk transaksi menggunkan Tornado Cash?Sumber : https://www.protocol.com/bulletins/coinbase-lawsuit-tornado-cash",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 04, 2023, 04:28:00 PM",
      "body": "Seingat ane setahun/dua tahun yang lalu banyak mixer altcoin semacam Smartmixer, Bestmixer (iirc), dst tapi udah pada tutup sekarang. Kalau agan lihat ada iklan mungkin itu situs phishing karena setahu ane rata-rata mereka tutup begitu saja (exit scam) setelah beberapa bulan beroperasi. Tornado cash juga sempet rame seperti yang disebutkan di atas. Alternatif yang mungkin ada kalau agan ingin melakukan mixing altcoin mungkin ya instant swap ke coin lain yang disupport oleh exchange/platform yang mau agan pakai. Instant swap/atomic swap sejauh yang ane tahu belum support (belum dikembangkan) fitur\" lain misalnya delayed transaction dst, jadi mungkin ga bakal memenuhi kebutuhan kalau agan bener-benar ingin privasi yang sempurna. Agak susah juga kalau ingin privasi tapi agan berinteraksi dengan centralized platform/pihak ketiga yang punya syarat A-Z karena mereka punya kewajiban hukum sih.Kalau sudah mentuk ya pake BTC saja kalau mau dimix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "February 05, 2023, 08:40:51 AM",
      "body": "Quote from: MAAManda on January 31, 2023, 03:02:29 PMQuote from: Luzin on January 31, 2023, 01:45:32 PMApakah Tornado Cash saat ini masih bisa digunakan dengan kasus ini? karena jujur saya memang belum pernah memakainya.Saya tidak tahu pasti terkait masih bisa di gunakan atau tidaknya om, karena sejak sanksi yang diberikan oleh Office of Foreign Assets Control (OFAC), Pernah denger juga Tornado cash yang kukira itu adalah token, ternyata basicnya adalah mixer. tapi kalau ribet, menurutku mending dituker ke btc dan mixer ke konvesional btc.Aku juga sempat mencari dan nemu https://monero-mixer.in untuk mixer altcoin, entah masih jalan atau tidak, atau scam?. karena belum menemukan review valid soal mixer ini. Kalau pun jalan apa itu coin malah makin privacy ya?, soallnya tidak pakai mixer pun monero itu sudah tidak bisa dilacak, apa lagi dimixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "February 06, 2023, 03:20:17 AM",
      "body": "Quote from: Sarah Azhari on February 05, 2023, 08:40:51 AMAku juga sempat mencari dan nemu https://monero-mixer.in untuk mixer altcoin, entah masih jalan atau tidak, atau scam?. karena belum menemukan review valid soal mixer ini. Kalau pun jalan apa itu coin malah makin privacy ya?, soallnya tidak pakai mixer pun monero itu sudah tidak bisa dilacak, apa lagi dimixer. Untuk mixer altcoin sebenernya ada banyak yang beredar di internet dengan cara search google dengan rumus begini :  \"[nama top koin yang ada di CMC] mixer\". Contohnya : BNB Mixer, Monero Mixer, Eth Mixer, dsb. Pada halaman pertama hasil pencarian di google pasti akan ada judul website atau halaman mengenai layanan mixer terkait.Tapi seperti yang agan katakan, banyak PR dan sangat perlu perhatian bahwa dari semua mixer altcoin yang ada di hasil pencarian search engine Google, belum ada review positif dari pengguna valid. Mungkin ada beberapa review positif dan jumlahnya pun sangat sedikit. Tentu saja tidak menutup kemungkinan itu adalah fake review yang dibuat scammer sebagai daya tarik untuk menggiring mangsa. Menurut saya mixing altcoin hingga saat ini masih sangat berbahaya dan rawan terjadinya penipuan, lebih baik untuk menghindari website mixer altcoin terlebih dahulu.Dan sesuai rekomendasi diatas, saya lebih memilih untuk melakukan penukaran aset altcoin menjadi BTC terlebih dahulu, lalu melakukan mixer BTC pada website yang sudah terpercaya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tumanggor",
      "created_time": "February 06, 2023, 12:12:33 PM",
      "body": "Quote from: bayu7adi on February 06, 2023, 03:20:17 AMQuote from: Sarah Azhari on February 05, 2023, 08:40:51 AMAku juga sempat mencari dan nemu https://monero-mixer.in untuk mixer altcoin, entah masih jalan atau tidak, atau scam?. karena belum menemukan review valid soal mixer ini. Kalau pun jalan apa itu coin malah makin privacy ya?, soallnya tidak pakai mixer pun monero itu sudah tidak bisa dilacak, apa lagi dimixer. Untuk mixer altcoin sebenernya ada banyak yang beredar di internet dengan cara search google dengan rumus begini :  \"[nama top koin yang ada di CMC] mixer\". Contohnya : BNB Mixer, Monero Mixer, Eth Mixer, dsb. Pada halaman pertama hasil pencarian di google pasti akan ada judul website atau halaman mengenai layanan mixer terkait.Tapi seperti yang agan katakan, banyak PR dan sangat perlu perhatian bahwa dari semua mixer altcoin yang ada di hasil pencarian search engine Google, belum ada review positif dari pengguna valid. Mungkin ada beberapa review positif dan jumlahnya pun sangat sedikit. Tentu saja tidak menutup kemungkinan itu adalah fake review yang dibuat scammer sebagai daya tarik untuk menggiring mangsa. Menurut saya mixing altcoin hingga saat ini masih sangat berbahaya dan rawan terjadinya penipuan, lebih baik untuk menghindari website mixer altcoin terlebih dahulu.Dan sesuai rekomendasi diatas, saya lebih memilih untuk melakukan penukaran aset altcoin menjadi BTC terlebih dahulu, lalu melakukan mixer BTC pada website yang sudah terpercaya.benar, bahkan di forum ini sendiri mixer altcoin belum ada pembahasan, itu berarti resiko nya masih sangat besar untuk kita bisa mempercayai mixer mixer altcoin yang mengklaim diri mereka adalah terpercayalebih bijak memang jika menukar aset yang mau kita kirim ke btc lalu di mixer di sana karena chipmixer, sinbad dan yomix sudah bisa kita lihat review dan komentar positif dari member di forum ini",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "February 07, 2023, 06:47:41 AM",
      "body": "Quote from: bayu7adi on February 06, 2023, 03:20:17 AMDan sesuai rekomendasi diatas, saya lebih memilih untuk melakukan penukaran aset altcoin menjadi BTC terlebih dahulu, lalu melakukan mixer BTC pada website yang sudah terpercaya.mungkinn menurutku kendala mengubah altcoin ke bitcoin sebelum dimixer itu adalah biaya pengiriman atau fee, kitaa tahu sendiri sekarang ini, masa dimana harga cryptoo sedang naik membuat biaya fee jadi naik karena meningkatnya transaksi. Apa lagi kalau bicara altcoin dari jaringan erc20, biaya pengirimanya malah lebih besar dari pokok. Oleh karena itu jika ada mixer yang mengubah altcoin ke bitcoin malah lebih bagus lagi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 11, 2023, 02:10:18 PM",
      "body": "Quote from: Sarah Azhari on February 05, 2023, 08:40:51 AMAku juga sempat mencari dan nemu https://monero-mixer.in untuk mixer altcoin, entah masih jalan atau tidak, atau scam?. karena belum menemukan review valid soal mixer ini. Kalau pun jalan apa itu coin malah makin privacy ya?, soallnya tidak pakai mixer pun monero itu sudah tidak bisa dilacak, apa lagi dimixer. Kalau agan menggunakan Monero, ga perlu mixer untuk membuat transaksi agan jadi lebih privat. Malah bisa jadi agan kena scam/ditrack sama pemilik mixer tersebut. Setahu ane, Monero sudah secara default bersifat privat, jadi tools semacam itu hanyalah scam yang ingin mencuri duit agan. CMIIW.Quote from: Tumanggor on February 06, 2023, 12:12:33 PMbenar, bahkan di forum ini sendiri mixer altcoin belum ada pembahasan, itu berarti resiko nya masih sangat besar untuk kita bisa mempercayai mixer mixer altcoin yang mengklaim diri mereka adalah terpercayalebih bijak memang jika menukar aset yang mau kita kirim ke btc lalu di mixer di sana karena chipmixer, sinbad dan yomix sudah bisa kita lihat review dan komentar positif dari member di forum iniSudah ada beberapa pembahasan kok, hanya saja jasa mixer altcoin banyak yang mati atau jadi scam jadi banyak yang menghindari layanan semacam ini. Kalau privasi jadi masalah utama salah satu opsi yang bisa diambil adalah melakukan jual beli dan memakai koin yang berfokus ke privasi seperti yang disebutkan di atas. Mengubah ke BTC juga bisa jadi opsi khususnya kalau agan sering memakai BTC untuk membayar/membeli jasa/produk online, mengingat BTC lebih populer daripada koin\" privasi untuk jadi alat pembayaran.Quote from: Sarah Azhari on February 07, 2023, 06:47:41 AMmungkinn menurutku kendala mengubah altcoin ke bitcoin sebelum dimixer itu adalah biaya pengiriman atau fee, kitaa tahu sendiri sekarang ini, masa dimana harga cryptoo sedang naik membuat biaya fee jadi naik karena meningkatnya transaksi. Apa lagi kalau bicara altcoin dari jaringan erc20, biaya pengirimanya malah lebih besar dari pokok. Oleh karena itu jika ada mixer yang mengubah altcoin ke bitcoin malah lebih bagus lagi.Apakah biaya di ETH masih begitu mahal? Ane sudah lama tidak berinteraksi dengan altcoin. Saat ane cek di Etherscan ane lihat rata\" transaksi memakan biaya $3, agak mahal sih memang, terutama kalau agan mau berinteraksi dengan smart contract. Jasa yang mengubah altcoin ke Bitcoin itu instan swap dan bukan mixer lagi gan setahu ane. Kalaupun ada ane bakal berhati-hati kalau mereka menggunakan label mixer mengingat mereka pasti menyimpan beberapa data untuk mengantisipasi masalah transaksi yang terlambat, gagal, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "February 13, 2023, 09:42:00 AM",
      "body": "Quote from: joniboini on February 11, 2023, 02:10:18 PMQuote from: Sarah Azhari on February 05, 2023, 08:40:51 AMAku juga sempat mencari dan nemu https://monero-mixer.in untuk mixer altcoin, entah masih jalan atau tidak, atau scam?. karena belum menemukan review valid soal mixer ini. Kalau pun jalan apa itu coin malah makin privacy ya?, soallnya tidak pakai mixer pun monero itu sudah tidak bisa dilacak, apa lagi dimixer. Kalau agan menggunakan Monero, ga perlu mixer untuk membuat transaksi agan jadi lebih privat. Malah bisa jadi agan kena scam/ditrack sama pemilik mixer tersebut. Setahu ane, Monero sudah secara default bersifat privat, jadi tools semacam itu hanyalah scam yang ingin mencuri duit agan. CMIIW.setahuku juga gitu, bahkan beberapa waktu lalu IRS-CI mengadakan sayembara bagi siapa saja yang dapat melacak address monero dari dan ke siapa sejumlah $600K. Belum ada kabar kalau ada yang bisa ngelacak sampai sekarang, sehingga dari situ saja monero tanpa mixer akan tetap anonim.Quote from: joniboini on February 11, 2023, 02:10:18 PMKalaupun ada ane bakal berhati-hati kalau mereka menggunakan label mixer mengingat mereka pasti menyimpan beberapa data untuk mengantisipasi masalah transaksi yang terlambat, gagal, etc.Tornado cash menurutku juga bagus, tak tahu gimana sekarang perkembangannya, semenjak di Unbanned oleh github september 2022 lalu, mungkin dibatasi untuk pemakaian dari korea utara.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 18, 2023, 03:13:36 PM",
      "body": "Quote from: Sarah Azhari on February 13, 2023, 09:42:00 AMsetahuku juga gitu, bahkan beberapa waktu lalu IRS-CI mengadakan sayembara bagi siapa saja yang dapat melacak address monero dari dan ke siapa sejumlah $600K. Belum ada kabar kalau ada yang bisa ngelacak sampai sekarang, sehingga dari situ saja monero tanpa mixer akan tetap anonim.Perlu diingat kalau menilai apakah jaringan privat atau tidak dari bounty bukan merupakan hal yang tepat gan. Memahami bagaimana jaringan/koin itu bekerja tentunya lebih bisa diandalkan daripada melihat apakah ada sayembara yang sudah diklaim atau tidak. Bisa saja ada yang sudah menemukan celah di jaringan tertentu tapi mereka tidak mensubmit laporan tersebut karena hal itu lebih menguntungkan dari imbalan yang dihadiahkan. Yang jelas, dibandingkan koin\" yang ada saat ini, Monero masih jadi salah satu opsi terbaik kalau yang agan inginkan adalah privasi.Quote from: Sarah Azhari on February 13, 2023, 09:42:00 AMTornado cash menurutku juga bagus, tak tahu gimana sekarang perkembangannya, semenjak di Unbanned oleh github september 2022 lalu, mungkin dibatasi untuk pemakaian dari korea utara.Agan sudah pernah mencoba memangnya? Bagus dari segi apa gan? Mengingat terakhir yang ane tahu adalah developer yang sedang dipenjara/bakal dijatuhi hukuman lagi atas keterlibatannya membuat code Tornado Cash, CMIIW. Agan tahu kodenya difork Korea Utara darimana? Hati-hati saja kalau melihat ada situs yang menamakan diri sebagai Tornado cash, mengingat situs\" phishing dengan nama mixer yang sempat trend seperti Blender, Smart Mixer, dst, berkeliaran dimana\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "February 19, 2023, 06:56:20 AM",
      "body": "Quote from: joniboini on February 18, 2023, 03:13:36 PMAgan tahu kodenya difork Korea Utara darimana? ku denger dri situs chat di dark web tornado cashh. itu juga ku translate dari bahasa rusia, entah apa kusalah transate, tapi intinya ada bau-bau korea utara di percakapan forum tersebut.Quote from: joniboini on February 18, 2023, 03:13:36 PMBisa saja ada yang sudah menemukan celah di jaringan tertentu tapi mereka tidak mensubmit laporan tersebut karena hal itu lebih menguntungkan dari imbalan yang dihadiahkan. Yang jelas, dibandingkan koin\" yang ada saat ini, Monero masih jadi salah satu opsi terbaik kalau yang agan inginkan adalah privasi.kejujuran di dunia maya memang sulit dimengerti, kalau bisa dapat uang jujur 600k napa gk itu saja dihunting dibaniding nyari celah cari yang haram. btw menurut anda, apakah mixer itu tidak halal?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 25, 2023, 04:31:05 PM",
      "body": "Quote from: Sarah Azhari on February 19, 2023, 06:56:20 AMkejujuran di dunia maya memang sulit dimengerti, kalau bisa dapat uang jujur 600k napa gk itu saja dihunting dibaniding nyari celah cari yang haram. btw menurut anda, apakah mixer itu tidak halal?Kalau agan ingin jawaban yang memuaskan, lebih baik tanya ke orang yang punya pengetahuan baik di dunia hukum agam agan dan mixer itu sendiri. Kalau agan tanya member forum tentu jawaban banyak yang akan jadi bias. Kalau pendapat ane pribadi, mixer itu cuma alat seperti pisau/senjata api. Penggunaannya yang menentukan apakah tindakan menggunakan mixer itu jadi halal atau tidak. Prinsipnya kan membuat agan jadi terlindungi dari pihak ketiga yang bisa saja punya kepentingan yang buruk buat keamanan agan, layaknya VPN, enkripsi DNS, dst. Kalau mau lebih detail mungkin bisa ditanyakan ke grup Telegram atau media lain, daripada malah jadi offtopik di thread ini gan.Quote from: Sarah Azhari on February 19, 2023, 06:56:20 AMku denger dri situs chat di dark web tornado cashh. itu juga ku translate dari bahasa rusia, entah apa kusalah transate, tapi intinya ada bau-bau korea utara di percakapan forum tersebut.Agan masih punya link/image situs chat yang bersangkutan? Apakah percakapan itu melibatkan bukti\" selain hanya omongan/posting dari user-user anonim? Kalau kasusnya yang kedua, ane tidak akan terlalu menanggapi hal tersebut dengan serius. Banyak orang yang bilang omong kosong meskipun tidak di dark net, susah kalau mau menggap info mereka bisa dipercaya kalau ga ada hal lain yang mendukung.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "February 27, 2023, 01:05:17 AM",
      "body": "Quote from: joniboini on February 25, 2023, 04:31:05 PMPrinsipnya kan membuat agan jadi terlindungi dari pihak ketiga yang bisa saja punya kepentingan yang buruk buat keamanan agan, layaknya VPN, enkripsi DNS, dst. Kalau mau lebih detail mungkin bisa ditanyakan ke grup Telegram atau media lain, daripada malah jadi offtopik di thread ini gan.Sepertinya tujuan dibuatnya mixer ini cukup mulia yaitu untuk melindungi privasi. sebenarnya kalau dilihat dari fungsi VPN dan DNS juga cukup jelas kalau mau dibandingkan dengan mixer ini. Betul apa yang mas katakan, VPN juga banyak yang pakai buat porno-porno, begitu juga mixer, banyak yang pakai buat cuci uang. semua juga ada sisi negatif dan menurutku jelas tujuan mixer ini untuk privasi yang positif.Quote from: joniboini on February 25, 2023, 04:31:05 PMAgan masih punya link/image situs chat yang bersangkutan? Apakah percakapan itu melibatkan bukti\" selain hanya omongan/posting dari user-user anonim? Kalau kasusnya yang kedua, ane tidak akan terlalu menanggapi hal tersebut dengan serius. Banyak orang yang bilang omong kosong meskipun tidak di dark net, susah kalau mau menggap info mereka bisa dipercaya kalau ga ada hal lain yang mendukung.cuma percakapan dari akun gak jelas. ku cek barusan chat tersebut sudah hilang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 04, 2023, 03:13:38 PM",
      "body": "Quote from: Sarah Azhari on February 27, 2023, 01:05:17 AMBetul apa yang mas katakan, VPN juga banyak yang pakai buat porno-porno, begitu juga mixer, banyak yang pakai buat cuci uang. semua juga ada sisi negatif dan menurutku jelas tujuan mixer ini untuk privasi yang positif.Kalau kebutuhan agan adalah privasi, agan juga tetap harus waspada meskipun memakai mixer. Ada banyak mixer yang merupakan atau diduga merupakan honeypot dari badan intelijen negara tertentu, atau dimiliki oleh kelompok yang mengoleksi data pengguna mixer untuk menjualnya di darknet. Jangan lupa untuk melihat bagaimana mixer bekerja terlebih dulu sebelum memakainya, termasuk mixer yang saat ini kita pakai sebagai signature. Bisa juga agan mengombinasi beberapa mixer untuk menambah kompleksitas pelacakan transaksi agan, walaupun bakal nambah biaya dan pada kondisi tertentu malah membuat level keamanan dan privasi agan berkurang. So, jangan lupa untuk tetap riset. Begitu pula dengan jasa VPN dan sejenisnya, ane rasa berita VPN menjual data ke pihak tertentu bukan hal baru dan bisa agan temui dengan mudah di internet.Kalau altcoin adalah koin pilihan agan untuk bertransaksi, usahakan jangan mencari jasa yang mengharuskan KYC kalau agan ingin menjaga level privasi dan susah menemukan mixer. Selain itu, pakai/gunakan jasa yang menerima koin semacam Monero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "March 06, 2023, 09:14:49 AM",
      "body": "Quote from: joniboini on March 04, 2023, 03:13:38 PMJangan lupa untuk melihat bagaimana mixer bekerja terlebih dulu sebelum memakainya, termasuk mixer yang saat ini kita pakai sebagai signature. Karenaku tak begitu paham mengenai honeypot atau sejenisnya, menurut agan joni, apakah mixer yang kita pakai ini juga termasuk ke dalam itu?. Soalnya ku sering dan mungkin sudah jadi rutinitasku kalau tiap mau mengirim bitcoin, tidak langsung dari wallet ku sendiri ke exchange. melainkan melalui mixer dulu, untuk privasi atau sejenisnya, supaya orang tidak tahu seberapa banyak BTC yang kumiliki sekarang ini,Yang jadi pertanyaan sekarang ini, kenapa tidak begitu banyak mixer-mixer selain bitcoin?, padahal menurutku peluangnya cukup besar, karena marketcap altcoin selalu beriringan dengan bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "March 13, 2023, 12:47:11 AM",
      "body": "Quote from: Sarah Azhari on March 06, 2023, 09:14:49 AMYang jadi pertanyaan sekarang ini, kenapa tidak begitu banyak mixer-mixer selain bitcoin?, padahal menurutku peluangnya cukup besar, karena marketcap altcoin selalu beriringan dengan bitcoin.Ane Juga penasaran masalah ini mungkin karena orang sudah pada suka sama tornado cash atau menurut mereka lebih baik HODL bitcoin daripada altcoin.Dulu di rekt.news pernah dengar bahwa orang bisa ngemix uangnya pakai bridge seperti WormHole karena bridge yang satu ini banyak dgunain orang jadi mungkin gak ke trace",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 13, 2023, 03:01:18 AM",
      "body": "Quote from: Sarah Azhari on March 06, 2023, 09:14:49 AMKarenaku tak begitu paham mengenai honeypot atau sejenisnya, menurut agan joni, apakah mixer yang kita pakai ini juga termasuk ke dalam itu?. Honeypot bisa dibilang jebakan gan. Di ranah mixer, gampangnya mixer yang agan pakai itu dikelola oleh pemerintah/organisasi tertentu yang mencatat semua transaksi agan dan alamat yang agan gunakan. Apakah mixer yang agan pakai termasuk honeypot atau bukan agak susah kalau tidak ada bukti yang mendukung. Apakah ada potensi? Tentu ada, rata-rata tim mixer kan juga anonim. Sebagai antisipasi agan sendiri juga harus aktif melakukan aksi untuk memastikan informasi privat tidak terekspos begitu saja ketika menggunakan jasa baru ataupun jasa lama. Kalau mau benar-benar privat dan tidak bisa yakin plus risiko memakai jasa anonim terlalu besar buat kebutuhan agan, bisa melirik koin yang memang didesain khusus untuk privasi seperti monero.Quote from: Sarah Azhari on March 06, 2023, 09:14:49 AMYang jadi pertanyaan sekarang ini, kenapa tidak begitu banyak mixer-mixer selain bitcoin?, padahal menurutku peluangnya cukup besar, karena marketcap altcoin selalu beriringan dengan bitcoin.Saya sendiri tidak begitu yakin apa sebab pastinya, selain tentunya keuntungan tidak terlalu besar. Kalau profitnya gede ane rasa bakal banyak mixer altcoin di pasaran. Ada juga kemungkinan mendapatkan altcoin yang bersih dari riwayat transaksi orang lain susah, mengingat rata-rata menggunakan PoS. Mungkin member lain lebih tahu masalah ini, khususnya yang lebih berpengalaman daripada ane seperti agan etf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}