{
  "id": "topic_5438836",
  "title": "Rikafip",
  "author": "Rikafip",
  "created_time": "February 08, 2023, 05:02:57 PMLast edit: February 09, 2023, 08:52:42 AM by Rikafip",
  "content": "Seems like yet another big name in crypto won't survive this bear market as Coin Cloiud (according to coinatmradar the world's 2nd biggest ATM operator in the world) filed for bankruptcy, owning between $100 million and $500 million. Quote from: https://www.coindesk.com/business/2023/02/08/bitcoin-atm-operator-coin-cloud-files-for-bankruptcy-with-liabilities-of-100m-500m/Coin Cloud, which operates more than 4,000 bitcoin ATMs across the U.S. and Brazil, has filed for bankruptcy with estimated liabilities of between $100 million and $500 million.The Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the Bankruptcy Court for the District of Nevada dated Feb. 7.The company's largest creditor is Genesis Global Trading, which has an unsecured loan of just over $100 million. Genesis is a subsidiary of Digital Currency Group, which is also the parent company of CoinDesk. Genesis also discussed injecting equity into the ATM operator, Bloomberg reported in November.I've used Bitcoin ATM for years while there were no better (cheaper) options to buy & sell bitcoin but then competition started showing up that can offer lower fees, making me using BATM only as a last resort and I think that many (at least in my country) do the same so I am not surprised at all to see that companies that offer those services are having troubles.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438836",
  "comments": [
    {
      "author": "noorman0",
      "created_time": "February 09, 2023, 01:33:29 AM",
      "body": "Bear markets allow bitcoiners to save even more, right? Use alternatives with the lowest possible cost instead or don't spend bitcoins at all.The average fee for bitcoin transactions through ATMs is quite expensive, at least around 10%. I also don't think if the overall cost of cashing out bitcoin through local exchanges will instead be half that which should still be people's priority choice over using bitcoin ATMs in all market conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "February 09, 2023, 01:52:51 AM",
      "body": "Yep, doesn't surprise me at all that any BTCATM operators are going bust.  After using a few of them and seeing the outrageous fees they charge, I can't imagine why anyone would use them consistently.  If they allowed sales of crypto, that would probably be a different story but all of the ones I've seen don't.I haven't checked coinatmradar in a while, but last I did ATMs were springing up all over my city, and Coin Cloud was just one of the operators.  There's still one at the closest gas station to me, but I bet that's not going to be there much longer since it seems like no one ever uses the thing.  I am hoping that they don't all disappear, because I love the concept of them, just not the fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "February 09, 2023, 02:07:45 AM",
      "body": "In my country ATMs don't take 10%, they take 3-5% + 1 usd in BTC per transaction in general.I like ATMs, I like BTC and I like to use cash when I need FIAT.Going through another service seems complicated when I need cash, I don't want to sell in P2P and wait to receive the cash by postal service when in my country there is not even a functionnal national postal service...Going through a bank, Revolut, Paypal or other makes KYC mandatory, at least in Europe.So for me it's not a good thing that the companies in charge of ATMs are not able to adapt and propose better offers on a global scale.I used to wonder about the profitability for ATM owners, but apparently it's as I imagined, no crazy money. I guess you have to own 50 ATMs or you don't care about the profits. In my opinion, ATMs (I'm talking about honest ATMs owners, not the ones that take +10% fees lol) are a service of public interest, just like nodes and small BTC mining pools",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 09, 2023, 09:31:27 AMLast edit: February 09, 2023, 09:56:41 AM by Rikafip",
      "body": "Quote from: noorman0 on February 09, 2023, 01:33:29 AMThe average fee for bitcoin transactions through ATMs is quite expensive, at least around 10%. Fees can be lower than that. ATM that I was using for years had 4.5% and then in  2020 the owner decided to increase it to 6% and for me that was the last straw as I could easily find much cheaper options so I ended up using ATM as the last resort only (it happened two or three times since then). Fee may seem low, but it adds up over time and it especially hurts when you are buying/selling big amount in one go as then you realize the difference.Quote from: The Sceptical Chymist on February 09, 2023, 01:52:51 AM  If they allowed sales of crypto, that would probably be a different story but all of the ones I've seen don't.Wait, so the ATMs around you allow you to only buy bitcoin, not sell it? Man that sucks big time. ATM that is closest to me is a 2 way (you can both buy and sell bitcoin) and the right next to it its another (buy only) altcoin ATM that supports 4-5 most popular altcoins. Its pretty much the same thing in few other EU countries that I visited and checked their BATM (its a habit of mine to check on cointamradar if there's bitcoin atm around).Quote from: The Sceptical Chymist on February 09, 2023, 01:52:51 AMI am hoping that they don't all disappear, because I love the concept of them, just not the fees.Same here, I really like the concept and the whole little ritual; I would go to the ATM, do the business there and while waiting for transaction to get confirmed (if I was selling) I would sit in a nearby bar and drink beer or two and added bonus was meeting fellow crypto enthusiast that were doing the same thing.Quote from: iwantmyhomepaidwithbtc2 on February 09, 2023, 02:07:45 AMI used to wonder about the profitability for ATM owners, but apparently it's as I imagined, no crazy money. I guess you have to own 50 ATMs or you don't care about the profits. Yep, their profit margin ain't big at all. Since I was a regular customer of ATM (going like once per week) I kept seeing the owner so one time I actually asked him about profitability and when he mentioned me all the things he had to pay (2x machines that ain't cheap, rent for the place, WiFi, employers, taxes etc) he really doesn't have much room for profit. I don't blame them for having higher fees relative to others, but unfortunately for them there are cheaper ways to buy and sell. Their big advantage used to be no KYC, but now even that is changing and I don't see how that business can survive in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 09, 2023, 04:08:10 PM",
      "body": "Quote from: Rikafip on February 08, 2023, 05:02:57 PMSeems like yet another big name in crypto won't survive this bear market as Coin Cloiud (according to coinatmradar the world's 2nd biggest ATM operator in the world) filed for bankruptcy, owning between $100 million and $500 million. It looks like this happened because of their connection with Genesis Global Trading who had financial problems recently and they are one of the biggest creditors for CoinCloud.I don't think CoinCloud have any Bitcoin ATM's in Europe, and most of them are located in North and South America.Maybe there is still hope someone could buy them for a good discount price and ATM's could continue operating with rebranding.Quote from: Rikafip on February 08, 2023, 05:02:57 PMI've used Bitcoin ATM for years while there were no better (cheaper) options to buy & sell bitcoin but then competition started showing up that can offer lower fees, making me using BATM only as a last resort and I think that many (at least in my country) do the same so I am not surprised at all to see that companies that offer those services are having troubles. I think having Bitcoin ATM option is still very important, maybe they don't offer lowest fees but sometimes this is the quickest way to exchange Bitcoin for cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 09, 2023, 05:06:55 PM",
      "body": "Dave's opinion. They also saturated some areas where there is a lot of competition. Take a look at their map around Las Vegas NV or Miami, FL. Dozens and dozens of machines (which is good) along with dozens of machines from their competitors (which is good for consumers but bad for them). Perhaps putting a few in some places that were less well served might have dome them some good.Quoting myself from a couple of weeks ago:Quote from: DaveF on January 25, 2023, 05:03:45 PM...I see there here. On LI where there are only 1 or 2 operators fees are higher then when I head to NYC where you can get better deals since there are at least 4 providers of BATMs there....Obviously I don't have any kind of market survey information, but 5 machines making you 15% per transaction for buy or sell may be more profitable then 20 machines making you 7.5% if you are the only operator in the area. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 09, 2023, 05:14:03 PMLast edit: February 09, 2023, 05:28:57 PM by Rikafip",
      "body": "Quote from: dkbit98 on February 09, 2023, 04:08:10 PMIt looks like this happened because of their connection with Genesis Global Trading who had financial problems recently and they are one of the biggest creditors for CoinCloud.Well, looks like $100M they got from them wasn't enough to keep them alive. Maybe they expanded too quickly and then the bear market came so in the end they got into problems. Or they were spending money in a stupid way as I saw they even hired Spike Lee to make them commercial, which probably wasn't cheap.Quote from: dkbit98 on February 09, 2023, 04:08:10 PMMaybe there is still hope someone could buy them for a good discount price and ATM's could continue operating with rebranding.Well, all those ATM for sure worth something so someone will probably buy them out but I don't think that it will be easy to find someone willing to just take over the whole business as they have huge amount of ATMs and I don't think that you can put BATM just about anywhere and expect to make a profit. Quote from: dkbit98 on February 09, 2023, 04:08:10 PMI think having Bitcoin ATM option is still very important, maybe they don't offer lowest fees but sometimes this is the quickest way to exchange Bitcoin for cash.I do hope that they survive as well, but there is another \"problem\" with them (at least for me) : they are often located inside some other business and not right outside on the street (I used BATM in several EU countries and never saw it right outside) like a regular ATM so when you need money in some weird hour or during the weekend, you may not be able to access it. And that should be one of the main ATM advantages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 10, 2023, 05:07:46 PM",
      "body": "Quote from: Rikafip on February 08, 2023, 05:02:57 PMI've used Bitcoin ATM for years while there were no better (cheaper) options to buy & sell bitcoin but then competition started showing up that can offer lower fees, making me using BATM only as a last resort and I think that many (at least in my country) do the same so I am not surprised at all to see that companies that offer those services are having troubles. I like ATMs. I have one nearby that chargets 3% of transaction, requires no KYC and you can sent coins from home and withdraw at the ATM. You basically transact with it online and get a text message to your phone with a confirmation, then go to the ATM, enter your phone or email and the ATM sends you another message with a pin code that allows you to withdraw cash. Since I like to remain anonymous this is the best way to get some fast and anonymous cash in my area. Quote from: Rikafip on February 09, 2023, 09:31:27 AMQuote from: iwantmyhomepaidwithbtc2 on February 09, 2023, 02:07:45 AMI used to wonder about the profitability for ATM owners, but apparently it's as I imagined, no crazy money. I guess you have to own 50 ATMs or you don't care about the profits. Yep, their profit margin ain't big at all. Since I was a regular customer of ATM (going like once per week) I kept seeing the owner so one time I actually asked him about profitability and when he mentioned me all the things he had to pay (2x machines that ain't cheap, rent for the place, WiFi, employers, taxes etc) he really doesn't have much room for profit. I don't blame them for having higher fees relative to others, but unfortunately for them there are cheaper ways to buy and sell. Their big advantage used to be no KYC, but now even that is changing and I don't see how that business can survive in the long run. I think it was the problem was in KYC. People like me were using ATMs exactly for that, but if it's changing most of their clients are going to leave. The only reason why I'd pay 3-5% per transaction is if I were to remain anonymous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 10, 2023, 05:24:47 PM",
      "body": "Quote from: coolcoinz on February 10, 2023, 05:07:46 PMI like ATMs. I have one nearby that chargets 3% of transaction, requires no KYC and you can sent coins from home and withdraw at the ATM. You basically transact with it online and get a text message to your phone with a confirmation, then go to the ATM, enter your phone or email and the ATM sends you another message with a pin code that allows you to withdraw cash. Since I like to remain anonymous this is the best way to get some fast and anonymous cash in my area. That's a very reasonable fee, kudos to your ATM operator. If my ATM had 3% fee I would still use it on the regular basis but I have never seen one with such a low fee (lowest was 4% I think). Regarding getting text message on your mobile phone, is it possible to avoid that part? I am asking because if you gave your ID to get a sim card (its becoming standard here in EU, no ID no SIM card) then you are not selling it anonymously.Quote from: coolcoinz on February 10, 2023, 05:07:46 PMI think it was the problem was in KYC. People like me were using ATMs exactly for that, but if it's changing most of their clients are going to leave. The only reason why I'd pay 3-5% per transaction is if I were to remain anonymous. Unfortunately, mandatory KYC for BATM is just a matter of time. It is already in some countries and it will just get worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "February 10, 2023, 05:49:58 PM",
      "body": "Quote from: Rikafip on February 08, 2023, 05:02:57 PMThe company's largest creditor is Genesis Global Trading, which has an unsecured loan of just over $100 million. Oh god! This shit is going out of control, just when it seems as it stopped for a moment there you have another one going bankrupt who owes money to a company that just filed fro bankruptcy, Gemini will have to cough another 100 million to bail out Genesis again just two days after the first batch.How, just how do you burn 500 million dollars? How the hell do you manage to waste $100k for each installed BATM?From the filling seems like they haven't paid a lot of shop owners for the rent, maybe? I see a lot of names there are for sure gas stations and chain stores.Not sure how this work but why is every state listed there in the creditor matrix, taxes?Quote from: Rikafip on February 09, 2023, 05:14:03 PMI do hope that they survive as well, but there is another \"problem\" with them (at least for me) : they are often located inside some other business and not right outside on the street (I used BATM in several EU countries and never saw it right outside) like a regular ATM so when you need money in some weird hour or during the weekend, you may not be able to access it. And that should be one of the main ATM advantages.It's because of the risks involved, you might have a gang buying 50k of BTC, grab the coins and then blow the ATM and there you have it, and nobody is ensuring these at the same rate as banks do. Plus, a lot of them are really cheap stuff, not even close to the normal level of protection a normal ATM has, I saw one of those getting refills and I could probably bend the inner case with a simple crowbar in one swing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 10, 2023, 07:18:37 PM",
      "body": "Quote from: stompix on February 10, 2023, 05:49:58 PMOh god! This shit is going out of control, just when it seems as it stopped for a moment there you have another one going bankrupt who owes money to a company that just filed fro bankruptcy, Gemini will have to cough another 100 million to bail out Genesis again just two days after the first batch.How, just how do you burn 500 million dollars? How the hell do you manage to waste $100k for each installed BATM?Eliminating the out and out owners taking money out of the company. If they bought a lot of BTC during the 2021 runup ATH they might have wound up selling a lot of it at a massive loss.As a person you can DCA a lot of things, as a business that is in so many states / locations they may have actually been selling $55k BTC for $30k or less. And at that point you really can't afford to buy more since you are now in a loosing situation. I do not know what the requirements were where they were located but if some states / municipalities required 'X' holdings it could have been a really massive number.Add on some inflated salaries and too much staff and it's not that hard to get to big numbers quickly.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "February 10, 2023, 07:35:15 PMLast edit: February 10, 2023, 10:09:23 PM by stompix",
      "body": "Quote from: DaveF on February 10, 2023, 07:18:37 PMQuote from: stompix on February 10, 2023, 05:49:58 PM~Eliminating the out and out owners taking money out of the company. If they bought a lot of BTC during the 2021 runup ATH they might have wound up selling a lot of it at a massive loss.As a person you can DCA a lot of things, as a business that is in so many states / locations they may have actually been selling $55k BTC for $30k or less. And at that point you really can't afford to buy more since you are now in a loosing situation. Wait a minute, why would they have bought and held for long term any kind of cryptos in the first place?They are just intermediaries between the exchange on which they buy and liquidate coins depending on the order received at the ATM, even assuming each of those would get more than 10k a day which is highly improbable they would still need to hold at any time more than 50 million in assets at any time, and they would keep adjusting those as the orders flow. They are just munching on fees, they don't have to stock up on anything, if they want to invest they could do that with a separate business but not throw operational funds at that.Quote from: DaveF on February 10, 2023, 07:18:37 PMAdd on some inflated salaries and too much staff and it's not that hard to get to big numbers quickly.This one might be indeed, maybe some secret headquarter in a penthouse in the Bahamas also?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 11, 2023, 12:19:03 AM",
      "body": "Quote from: stompix on February 10, 2023, 07:35:15 PMQuote from: DaveF on February 10, 2023, 07:18:37 PMQuote from: stompix on February 10, 2023, 05:49:58 PM~Eliminating the out and out owners taking money out of the company. If they bought a lot of BTC during the 2021 runup ATH they might have wound up selling a lot of it at a massive loss.As a person you can DCA a lot of things, as a business that is in so many states / locations they may have actually been selling $55k BTC for $30k or less. And at that point you really can't afford to buy more since you are now in a loosing situation. Wait a minute, why would they have bought and held for long term any kind of cryptos in the first place?They are just intermediaries between the exchange on which they buy and liquidate coins depending on the order received at the ATM, even assuming each of those would get more than 10k a day which is highly improbable they would still need to hold at any time more than 50 million in assets at any time, and they would keep adjusting those as the orders flow. They are just munching on fees, they don't have to stock up on anything, if they want to invest they could do that with a separate business but not throw operational funds at that.Quote from: DaveF on February 10, 2023, 07:18:37 PMAdd on some inflated salaries and too much staff and it's not that hard to get to big numbers quickly.This one might be indeed, maybe some secret headquarter in a penthouse in the Bahamas also?Because some states DFS have very strict rules about what you have to have on hand \"just in case\" Usually it's 2x average daily sales. So if you sell 1BTC a day you need to ALWAYS have at least 2BTC in your hot wallet.It's not per machine, it's company wide so while they could keep buying on the open market as BTC fell they were always chasing losses.And if someone said lets buy a bunch at $55k before it goes even higher they could have dropped millions there and then sold it back to people at 1/2 of what they paid.Add in some odd rules that some states have, using Texas since I have it handy, does not let you count your crypto holdings as assets but you must have at least $500k in other assetsFrom https://www.dob.texas.gov/sites/default/files/files/consumer-information/sm1037.pdf: QuoteA virtual currency business that conducts money transmission must comply with all applicablelicensing provisions of Finance Code Chapter 151 and of Title 7, Texas Administrative Code,Chapter 33. In addition, several considerations should be highlighted. First, because a moneytransmitter conducting virtual currency transactions conducts business through the Internet, theminimum net worth requirement under Finance Code §151.307 is $500,000.6 Be advised that theCommissioner may increase the required net worth up to a maximum of $1,000,000 based on thefactors set out in §151.307(b). Second, a license holder may not include virtual currency assets incalculations for its permissible investments under Finance Code §151.309And now you have money that you can't spend because it has to stay as an 'asset' Insurance, people to get the cash from the machines, other people to put the cash into the machines, it staff, security, lawyers, accountants.Have to go to the trade shows or you don't look legit. Can drop an easy $50k+ there between staffing, booth rental, hotels, flights, and so on. And a few hundred million USD is gone real quick.It's actually why a small BATM operator left the market here. Was a small shop and the runup made him a lot of money, the 2022 drop left him operating at a loss so he just packed it in and sold his locations to another provider.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}