{
  "id": "topic_5463924",
  "title": "Odohu",
  "author": "Odohu",
  "created_time": "August 20, 2023, 01:57:25 PM",
  "content": "I have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears. Well, I feel the aspect of fear is normal since I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  Actually, my little buys might not influence the price much but my joy is having Bitcoin and holding unto it with the believe I will be among those that will look back sometime in the future and congratulate myself for taking that bold step when some people were doubting and panicking. I draw my inspiration from the saying: \"you will regret more for opportunities you never took than those you took and they went bad\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463924",
  "comments": [
    {
      "author": "Adbitco",
      "created_time": "August 20, 2023, 03:00:15 PM",
      "body": "Investment is a matter of choice whether someone chooses to buy now the market is still dip is of choice, you could be surprised that people only think of investment when they noticed there are some potentials for the market to make new wave like, when there is no positive signs they seems to withhold their funds until they noticed some great signs that shows a strong buy in the market. That is why some people today still don't believe or have total reliability on bitcoin price maybe it could be scam or not but one thing I know too well that bitcoin has been here for decades now and I don't believe to see any silly things to affect the market although I know that going down more is possible and we could witness more dip maybe yes or no but in general, investment depends on self willingness because from what you said \"All funds are important to you\" it could be for others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "August 20, 2023, 03:58:54 PM",
      "body": "Quote from: Odohu on August 20, 2023, 01:57:25 PMI have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears. Well, I feel the aspect of fear is normal since I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  As long as the money you used to buy Bitcoins doesn't cause trouble in your own life, I think you are not creating problems in your life because your own courage in buying Bitcoins at this point should be considered a very wise move. It is also your own passion in investing even if only in Bitcoin and you yourself also don't need to think about those who are still afraid to buy Bitcoin at this time because when they are disappointed because they don't take advantage of opportunities they will also think about themselves individually.QuoteActually, my little buys might not influence the price much but my joy is having Bitcoin and holding unto it with the believe I will be among those that will look back sometime in the future and congratulate myself for taking that bold step when some people were doubting and panicking. Small purchases may not have an effect on the market, but they are always good for the whole market when there are many people doing it at the same time. Actually you have used the right moment for this because when other people are still hesitant to buy Bitcoin, you actually muster up the courage to do it at this time and I think that is a very extraordinary thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 20, 2023, 04:13:56 PM",
      "body": "Well this is a dip and it is usually a good idea to buy in the dips and I always try to buy some sats if I have some extra funds to spare which I don't right now. As for \"how passionate I am\" these days, I have to say not a lot because I still believe that the ongoing global recession is affecting the bitcoin price and will continue to exist as a sell pressure preventing the rises. On top of that we have an increased amount of market manipulation and FUD once again preventing rises and creating artificial sell pressure.Quote from: Odohu on August 20, 2023, 01:57:25 PM~ I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  In that case maybe it is time to find a way to get some \"spare money\". It could be some additional work you do like freelance on the internet or it could be selling some old stuff from the storage that you don't need or use like an old laptop for example to get some extra funds to buy bitcoin with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "August 20, 2023, 04:32:59 PM",
      "body": "Already did it a few days ago but not with a large amount, I think it's the best way to buy bitcoin at the lowest price of $26K even if there will be a decline again there will be no more regrets buying at that price I believe this is the best time to buy.Not with spare money it will be used when there is an emergency, as it must be that buying bitcoin is extra money that is earned and then saved when the price of bitcoin correction falls then use the extra funds to buy, the rest is still safe because the reserve funds for me are intended for other needs that I will use later if needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "August 20, 2023, 05:52:17 PM",
      "body": "You can be passionate about buying bitcoin but you need to do it within reason.I’ve seen way to many people go overboard. Like liquidating their entire 401K and putting it in bitcoin. Or borrowing money from a credit card or home line of credit and investing it all. They usually buy the top and end up paying huge interest on top of it. So you can be passionate but doing it with reason. Don’t make it a finance decision which will wreck you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "August 20, 2023, 06:42:21 PM",
      "body": "Quote from: adaseb on August 20, 2023, 05:52:17 PMYou can be passionate about buying bitcoin but you need to do it within reason.I’ve seen way to many people go overboard. Like liquidating their entire 401K and putting it in bitcoin. Or borrowing money from a credit card or home line of credit and investing it all. They usually buy the top and end up paying huge interest on top of it. So you can be passionate but doing it with reason. Don’t make it a finance decision which will wreck you. Many think that bitcoin is a quick rich scheme where you just have to put money and within short span of time you will be rich. We need to be rational about bitcoin while investing our hard earned money here. 2 days back bitcoin price was 30k and today its around 26k. Novice investors are the one who lose in such DIPs as they quickly sell there holdings. We need to understand bitcoin before jumping with capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "August 20, 2023, 07:25:30 PM",
      "body": "Can't stopping with my passionate for buying and keep accumulate for investing in Bitcoin right now although in dip price, actually last three days when bitcoin price crashing make my self more passionate keep accumulate to buy bitcoin in daily day. I don't have much capital and less place get borrowing for investing in bitcoin. I don't think has any investor are disappointed with current Bitcoin price and they will more passionate to buy as much possible during Bitcoin under $26,000. Bitcoin take progress and need longer time if want get rich as investment assets, we need patience and keep accumulate when Bitcoin still in lower price and take profit later after Bitcoin raising up, don't blame and give up during have fund or free money keep accumulate and investing as much possible in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "August 20, 2023, 08:03:08 PM",
      "body": "Do not get too excited, no matter what you do. Getting overly hyped up can set us up for a big letdown down the road. So, I think keeping a level head and looking at things from all sides is much better. It's like, excitement can be a good thing, but keeping it in check is even better, in my humble opinion.Regarding the current dip, it is nothing new in the Bitcoin world. If you happen to have some extra cash to invest, that is great, but remember to be moderate and think things through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "August 20, 2023, 08:12:01 PM",
      "body": "Not really way more than normally. I mean we are not going to end up suddenly changing our point of view all that much suddenly, we are going to end up with a much better result without a doubt. I always believed in bitcoin and I am going to keep believing in it and that's not going to change anytime soon. Just because its a little up or down doesn't change anything for me, its all the same. I personally believe that we will do a lot more on the long run and that is why there is nothing wrong with it. Of course it will take a bit of a while, but I have bought up until now, and I am going to keep buying until from now on as well, that will not change, so the end result is the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "August 20, 2023, 08:36:29 PM",
      "body": "Quote from: Odohu on August 20, 2023, 01:57:25 PMI have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears. Well, I feel the aspect of fear is normal since I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  Actually, my little buys might not influence the price much but my joy is having Bitcoin and holding unto it with the believe I will be among those that will look back sometime in the future and congratulate myself for taking that bold step when some people were doubting and panicking. I draw my inspiration from the saying: \"you will regret more for opportunities you never took than those you took and they went bad\"I'm not afraid to invest most of my budget in bitcoin so far. In fact I could still consider buying periodically with DCA if I'm on a budget, so it doesn't just do it when the dip is there. I agree that bitcoin is an investment asset and a more useful store of value than fiat, but we all have our own limitations on how much we can afford to lose, especially how much we can afford to lose.Bitcoin can be said to be quite good in terms of performance compared to gold. The price of bitcoin fluctuates, this poses a risk but still bitcoin is a good choice to choose as a long term investment asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "August 20, 2023, 09:30:03 PM",
      "body": "Quote from: Odohu on August 20, 2023, 01:57:25 PMI have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears. Well, I feel the aspect of fear is normal since I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  Actually, my little buys might not influence the price much but my joy is having Bitcoin and holding unto it with the believe I will be among those that will look back sometime in the future and congratulate myself for taking that bold step when some people were doubting and panicking. I draw my inspiration from the saying: \"you will regret more for opportunities you never took than those you took and they went bad\"When it comes on being passionate then this isnt really just only limited to Bitcoin alone but also in other investment which i do have. Everytime i do see some opportunity then it would be always best to dive in and never ever tend to make yourself able to miss out if ever there's one. Now that we are seeing currently on the current market as of this time which its already declining then it would be best on buying or accumulating cheaper coins. This is why its always been ideal that you should set aside some funds for the said situation or condition because you could eventually be able to maximize potential profits that you could really be able to generate.In speaking solely with my Bitcoin holdings then i do divide it on two different allocations which one is intended for holding for long term and one is really that intended for me to do short term trades which means that i would really be needing to face up that volatility. Accumulation does vary since not all would really be mindful on the things that they've been doing basing on the recent market condition or whatever conditions it would be.So results or outcomes will really vary on each person or investors decisions towards their investment which it could neither be positive or negative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "August 21, 2023, 10:08:54 AM",
      "body": "The economy is not doing well - so I can't expect everyone to keep up their enthusiasm for investing in bitcoin. Even if some of the users here say they bought it - but I believe they are more likely to be lying to themselves.Some also buy - but only if they have an income higher than their monthly living expenses. A person who is able to save $100/month monthly income cannot be expected to invest it in bitcoins. They need to adjust their monthly needs and expenses - so of course they will avoid investing more. I'm just not denying that some people here are lying - but that's up to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mttewndew",
      "created_time": "August 21, 2023, 12:23:18 PM",
      "body": "Quote from: Odohu on August 20, 2023, 01:57:25 PMI have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears. Well, I feel the aspect of fear is normal since I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  Actually, my little buys might not influence the price much but my joy is having Bitcoin and holding unto it with the believe I will be among those that will look back sometime in the future and congratulate myself for taking that bold step when some people were doubting and panicking. I draw my inspiration from the saying: \"you will regret more for opportunities you never took than those you took and they went bad\"Your smart way of dealing with Bitcoin is great – every bit of money counts. While you're on this journey, think about checking out XGo. Their XGoID feature is like a magic trick that makes handling crypto addresses easier. It's about finding platforms that fit well in this ever-changing crypto world!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "August 21, 2023, 12:54:42 PM",
      "body": "Quote from: Odohu on August 20, 2023, 01:57:25 PMI have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears.That part of you that's insisting you invest in Bitcoin at a time like now is the part of you from the heart – a place of reasoning while the part that show fear is emotional (the mind). Anyone who's into Bitcoin but aren't finding a way to buy and keep now in pursuant of the bull rally that's imminent isn't true to type.Quote from: adaseb on August 20, 2023, 05:52:17 PMSo you can be passionate but doing it with reason. Don’t make it a finance decision which will wreck you. Nice advice. Though the second paragraph makes me ponder on how dangerously risky someone can be to themselves and their finances. Liquidating $400k+ for a crypto investment for an individual is a bad decision for me. Even at its very low ebb where we think price has crashed enough and the only way it can go is up, it will still be ill advised to ask anyone to invest all they've got into Bitcoin (or any business at that.l). Every business minded person should know how to take calculated risk. Doing what you narrated in that paragraph is one taking unreasonable risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "August 21, 2023, 12:55:36 PM",
      "body": "Yes, I too buy the coins in every 15 days irrespective of the price. I have seen what Bitcoins are capable of. Years back they were hardly 500$, now they have touched mighty 69k usd. I know I might sound greedy, but yes I am investing and accumulating Bitcoins on a regular basis now. I don’t care about these small dumps. I know 2024 will be big for Bitcoins, for that reason I am holding it. Let’s hope for the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "August 21, 2023, 01:55:43 PM",
      "body": "Quote from: Odohu on August 20, 2023, 01:57:25 PMI have never been passionate making any investment than I am buying Bitcoin of recent. While a part of me is so optimistic that I am making the best decision with my funds, a part still entertain some fears. Well, I feel the aspect of fear is normal since I am not buying with 'spare money' as some people will call it... that concept of spare money does not really resonate with me as every penny I have is very important to me now.  Actually, my little buys might not influence the price much but my joy is having Bitcoin and holding unto it with the believe I will be among those that will look back sometime in the future and congratulate myself for taking that bold step when some people were doubting and panicking. I draw my inspiration from the saying: \"you will regret more for opportunities you never took than those you took and they went bad\"Hello, I have reason to think English isn't your first language so I understand things sometimes come across differently. That's just fine my friend.Anyways you use ALLOT of words to express emotions in buying. Emotions should be very distant or surpressed when making decisions with money especially when investing with \"not spare money\".Buy small bits at a time as to not extend yourself and cause emotional worry. Don't go all in build a cash war fund and buy a few percent at a time and enjoy your life not pasted to a screen worried about money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "August 21, 2023, 02:01:01 PM",
      "body": "Quote from: _BlackStar on August 21, 2023, 10:08:54 AMThe economy is not doing well - so I can't expect everyone to keep up their enthusiasm for investing in bitcoin. Even if some of the users here say they bought it - but I believe they are more likely to be lying to themselves.Some also buy - but only if they have an income higher than their monthly living expenses. A person who is able to save $100/month monthly income cannot be expected to invest it in bitcoins. They need to adjust their monthly needs and expenses - so of course they will avoid investing more. I'm just not denying that some people here are lying - but that's up to them.A lot of people I know including myself actually bought Bitcoin this period and I am still buying. There is no point pretending to be doing something you are not doing. I agree with you that a lot of people are not doing well financially this period but there are still those who  also just met their major breakthrough this period. As far as accumulating Bitcoin, irrespective of the global economic situation, there are still some people that will ensure they don't miss out on any opportunity to buy low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 21, 2023, 02:24:36 PM",
      "body": "QuoteHow passionate are you buying Bitcoin now? You are probably referring to this specific moment (the dip) and I understand that those who want to buy a little \"cheaper\" always feel something special when something like this happens, especially if they do not practice the DCA method but only buy when the dip happens. I personally believe that the best time to invest in BTC is when I estimate that the price has touched the bottom, and I believe that that moment in this cycle has already passed - although some very bad news can drop the price by 15-20% without any problems, especially at the time when demand is very low.It would be logical for someone who understands and believes in Bitcoin to always be \"excited\" in some way when buys Bitcoin, of course always taking into account that what he bought does not get an unwanted owner",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martinex",
      "created_time": "August 21, 2023, 02:53:30 PM",
      "body": "What you convey is true, fear that if the price drops again there must be and is seen as normal. if i see you are very passionate in your current investment in btc and keep on accumulating step by step. Yes. The adage you convey will apply if it's a bull run, but for now it hasn't and many are still hesitant to enter, waiting for the price to dip again. yes. Friend. once again it's normal, the important thing is not just going against the mainstream,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}