{
  "id": "topic_5445385",
  "title": "S3300",
  "author": "S3300",
  "created_time": "March 18, 2023, 12:58:22 PM",
  "content": "Can Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445385",
  "comments": [
    {
      "author": "_act_",
      "created_time": "March 18, 2023, 01:19:11 PM",
      "body": "The higher the marketcap, the less chance of a coin to increase in price. Little amount of money pumped into low marketcap coin can result to high increase in the price of the coin. Ether is having lower marketcap to bitcoin, definitely the price may increase than bitcoin, but many other altcoins too. Many other altcoins that have lower marketcap to ether can increased in price than ether also. Altcoins can pump more than bitcoin generally because they have low marketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "March 18, 2023, 01:20:51 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? They have not recently starting burning supply but from few months but has ETH reach it's new ATH after that? You are making comparison with bitcoin of a centralised altcoin so it would never happen.At current the market cap for bitcoin is $533.17B with 19,320,762 while ETH is at $224.26B with 122,373,866 coins in circulation as per Coinmarketcap so do you think it can surpass it with this bull run? I don't know with what calculations you are expecting it to happen but it will never happen and they have burnt the supply just to make their coins more valuable and if you care to look for gas (tx fees) you would not feel to make any transaction in it.The true deflationary nature lies with bitcoin not by burning supply you would make utility of your coins so bitcoin is true king.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "March 18, 2023, 02:18:40 PM",
      "body": "Burning some transaction fees would not trigger a surge past Bitcoin and does not particularly changed how a protocol works. I cannot predict on the next bull run and how much each currency would change in valuation, but Bitcoin wound still be the top cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "March 18, 2023, 02:26:08 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? You're on the wrong board, this should be on Altcoins boards or speculation boards. To answer your question, I don't think so, IMO, Bitcoin still remains the dominant cryptocurrency with a market capitalization several times that of Ethereum.  While market capitalization alone does not determine the value of a crypto coin, though both of them have potential in the market but I strongly believe no one surpasses the Bitcoin market cap.And I think burning transaction fees alone might not be a sustainable solution in the long run as it may lead to deflationary pressures and potentially limit the ability of a cryptocurrency to incentivize miners and validators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 18, 2023, 02:45:25 PM",
      "body": "With what i can see for now, there's no other coin that can overcome bitcoin price during a bullrun no matter how they try hard the more they see lesser, the economy of bitcoin already set the pace other coins follows, as bitcoin go a little dip other coins fall massively but in the opposite way doesn't applies if bitcoin rises they also double the potential rising as bitcoin did, but their market cap and market volume during this period determines how far they can move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FirmWars",
      "created_time": "March 18, 2023, 07:36:26 PM",
      "body": "Nothing can best Bitcoin and it will remain this way for a long time, if you are talking about profits then altcoins will always do better because they have a smaller market cap than Bitcoin, if you want to maximize your profit go for altcoins instead of Bitcoin, you can make better money from Ethereum but Ethereum will never flip Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 18, 2023, 09:47:50 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? If that's the reasoning then before that upgrade that Ethereum made, bitcoin is already known to be a deflationary cryptocurrency. In that case, if bitcoin surges, ETH goes with the flow, and yes possible that it can surge more than bitcoin but I'll hope more for bitcoin. But if bitcoin doesn't move at all then that means that altcoins including ETH will not move at all. That's why all of the altcoins including ETH are reliant on bitcoin's motion and even if there will be altcoins that will surge more than bitcoin, they're gonna do it temporarily. There can be an exception with ETH as it's at the top of the altcoins and very likely will stay there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "southerngentuk",
      "created_time": "March 19, 2023, 01:28:11 AM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? I first found that ETH works well when it comes to deflation.However, the question is, do you feel the need to compare it to BTC again, with top cryptocurrencies like this it is a waste of time to see which is the best.The truth here is that each is good in terms of the nature of its existence, BTC has been too cautious with the market and is almost the face of the entire market, ETH is similar after many years out. As life develops, they are growing and maintaining that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "naikturun",
      "created_time": "March 19, 2023, 03:14:28 PM",
      "body": "even though ETH has jumped up to make new ath, still bitcoin will always lead above it.i don't eth will surpass bitcoin in terms of marketcap.and also keep in mind all altcoin prices depend on bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "March 20, 2023, 02:17:05 AM",
      "body": "Quote from: naikturun on March 19, 2023, 03:14:28 PMeven though ETH has jumped up to make new ath, still bitcoin will always lead above it.i don't eth will surpass bitcoin in terms of marketcap.and also keep in mind all altcoin prices depend on bitcoin.The relationship between BTC/altcoin in this market we all know affects the price. And here the fact that ETH has achieved such success is a worthy result, its current position is enough to show it as one of the current irreplaceable cryptocurrencies.In terms of current and future history, I don't see ETH's ability to surpass BTC, so no matter how the market moves, we will only see more and more similarity in the chart of btc and ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 20, 2023, 02:46:10 AM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen beforeI am very sure that Ethereum will make its new all time high in future.But I am doubtful that Ethereum will surge over Bitcoin in future. I believe it will never happen if you know Ethereum network has become more centralized after the Merge. Such centralization is not attractive to decentralization enthusiasts and cryptocurrency investors.Interesting to see how supply of Ethereum has dropped dramatically after the Merge and its forecast.https://ultrasound.money/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "March 20, 2023, 03:44:54 AM",
      "body": "Quote from: naikturun on March 19, 2023, 03:14:28 PMeven though ETH has jumped up to make new ath, still bitcoin will always lead above it.i don't eth will surpass bitcoin in terms of marketcap.and also keep in mind all altcoin prices depend on bitcoin.While others are still  having this hope yet I believe that even if another 10 years come ? ethereum will never make it to take the ranking or surpassing that Bitcoin marketcapitalization.what I can see here is that only that hopes remains and the prayers from those who support ETH more than bitcoin but the reality stays Bitcoin is the biggest and will remain top one coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "March 20, 2023, 02:20:38 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? It could but remember tho, BTC has always been the catalyst for the bull market in crypto overall.  The flippening depends on how much of the value that came into BTC would trickle down to ETH and stay in ETH.  I guess supply reduction helps but it really all depends on the demand.  I mean I'd like to see the flippening happen and I thought there was the possbility of it happening a couple of years ago but no.  It's a fun narrative but don't be too hopeful imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "March 20, 2023, 05:38:52 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? Well, I think you are not totally right. Ethereum might grow pretty high and even have a new all-time high but for it to surpass Bitcoin doesn't really seem like a possible feat to cross in my opinion. Ethereum is one of the top cryptocurrencies and the best one among altcoins, and no one can deny that, but comparing it to Bitcoin will be an injustice, I believe.Ethereum can have a very high value, it has its own position which isn't really bad, and we should let things be the way they are instead of trying to replace places of coins or tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kalchef",
      "created_time": "March 20, 2023, 06:34:33 PM",
      "body": "Ethereum will grow higher than what we used to see in the past bull market but its never going to overtake Bitcoin position, the insanely high market cap of Bitcoin should be enough to confuse you, it is never going to happen, Ethereum is the best and the leader of altcoins but when it comes to Bitcoin, it stands no chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "March 20, 2023, 08:11:16 PM",
      "body": "Quote from: naikturun on March 19, 2023, 03:14:28 PMeven though ETH has jumped up to make new ath, still bitcoin will always lead above it.i don't eth will surpass bitcoin in terms of marketcap.and also keep in mind all altcoin prices depend on bitcoin.Yeah, BTC will always be on the first spot. No coin can beat BTC in terms of pricing, market cap and others. It may be true that some coin follows BTC but I think ETH is different among them. Don't forget that ETH is also an equivalent of Bitcoin but only in the altcoin category. We can even say that other alts follow ETH.ETH already proved many times that it is not dependent in Bitcoin. It's a big coin and also has lots of supporters so it can always move on its own. Overall I am still proud of ETH if the coins supply have truly dropped and now more deflationary than before. Maybe the transition of it to POS does help a lot to create these these new changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DOH!",
      "created_time": "March 21, 2023, 05:40:41 AM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? So far, no plans to announce how to optimize eth's deflation after moving to pos?  It is understood that the deflationary structure of eth still does not achieve the same high level of trust as bitcoin.  There won't be any change to bitcoin's position, ETH may reach new ATH in future and it will depend on bitcoin for sure.  Accompanied by burning along with pushing power into the hands of the rich, eth also becomes more centralized.  I personally have always doubted it and it only increases the importance of bitcoin but ETH is still the soul of altcoins and it is still a good choice to seek long-term profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ivankoh",
      "created_time": "March 21, 2023, 04:01:47 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? Given the problem of deflation, I think bitcoin vs pow is the best place to fight inflation, which for me is still better than removing more focus on eth.  The trend of ETH will continue to depend on bitcoin.  ETH will still perform as well as it does now, but without having to depend on deflation and probably not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 21, 2023, 06:55:31 PM",
      "body": "Quote from: S3300 on March 18, 2023, 12:58:22 PMCan Ethereum surge past Bitcoin in this upcoming Bull Market? The supply has dropped a lot and it's no more inflationary, I think with this, Ethereum will make a new all-time high we have never seen before, do you think I am wrong? Nothing is off limits but i have hard time trusting that ETH would get higher marketcap than bitcoin. It will be having new ATH, that's for sure. But people have been predicting that it would flip bitcoin and be nr1 in marketcap since eth started and every time it ends in the bear market and huge drop in eth price.I would definitely welcome it to nr1 place but not before it has scaled and fees are fraction of the current fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}