{
  "id": "topic_5470685",
  "title": "Baki202",
  "author": "Baki202",
  "created_time": "October 17, 2023, 12:33:50 PM",
  "content": "Some red flag to aviod in p2p transaction P2p transaction is one of the most used transaction to trade bitcoin and crypto Nigeria is one of the most biggest country that trade in p2p exchanges, the reason for this is because of the exchange serving as the middle man for traders. They feel it is safe and fast but the more you look at it there are red flags that every trader should aviod. Most exchanges that have p2p platforms make sure they remove any form of scam but still some traders find a way pull related scams and red flags that will affect your trades. By visuals and history of trades, it is easier to point out some traders and merchants that have violate the rules of p2p but some you have to do a deep check into them so that you don't turn there next victim of scam or waste your time in trading a maximum time of 1 hours to 24 hours of even more. I will be listing some of this red flags so that when you want to trade, choosing the right trader to trade your coin will be easy and I will be using Binance as reference because that is one the biggest p2p exchange that Nigeria use the most and that's where scammers hide the most. Here are some of the redflags you should know.1.Don't release your coin until you confirm payment: If you must use p2p exchanges, anytime you want to trade and you want to sell. If the buyer send you money, make sure that you confirm you received the money before you releasebthe coin to any buyer. If you didn't receive the money and the buyer want to to force you to release, just ignore and make sure to check your mobile app for confirmation of payment. The lesson here is that you should never release coin if you have not received payment, if you do and release coin without proof of payment, there is nothing that will be done after you release, always put this red flag in consideration. 2. Don't trade when you see a trader with few numbers of trade and 98%: P2p platforms used number of trade completion to determine % of trades that sre complete but there is a plot twist about it if you are not careful. If you see a trader with 98% with lower trades, avoid there services and when you also see a trade with much number of trade and  70% completion, you should also avoid . What you should be looking at is a trader that has high numbers of trade with high %. 3. Don't submit your real phone number if they ask for it: Many traders in p2p are guilty of this habit, they will not send you funds if you don't drop your phone number for them and the reason they do this is  to call you if you don't release coin for them on time. However, I think a serious trader will release coin immediately they confirm payment , there is no reason to drop phone number because they can use it to send you fake alert as proof of payment, they can also spam you with texts you don't like. Never give them your phone number or if they insist, give them fake phone number.4. Don't use another bank that doesn't match your p2p name to send if you want to buy: This is the mistake some people do in p2p transaction, when selling a coin in p2p and you provide a third party account, the buyer might agree to send you the funds but if you are the one buying, make sure you don't send from another bank. The seller might say he didn't send and he has the right to denied it if its included in his trade terms, so in other to avoid any trade dispute and appeal, make sure you read the rules.Human mistakes happened when we don't expect buy we must also make sure to avoid them because these kind of trader exist everywhere in all exchanges that have p2p, you need to be careful and mindful of these kind of traders.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470685",
  "comments": [
    {
      "author": "RockBell",
      "created_time": "October 18, 2023, 06:50:10 AM",
      "body": "Everyone in Nigeria uses P2P, and the reason is very valid. They may be centralized as a result of the involvement of KYC and the others, but people continue to use that platform because they want to avoid certain scams, as previously stated, since the exchanges have a reputation to uphold and people occasionally manage to scam on P2P platforms. I had most of the experience of encountering issues with traders and eventually wasting your time and some might even end in treats. The main warning sign is that most people find it very difficult to handle, especially beginners who are afraid they may release the coin even though they haven't verified the payment. The second red flag People don't understand how crucial it is to look at the trader's rating before clicking to complete the transaction. is a major warning sign. It may also be difficult for them to contact you if any problems arise as a result of dropping phony numbers. It is also preferable to utilize mobile apps to confirm payments in order to avoid problems with fake alerts. Its very important when doing p2p transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "October 19, 2023, 07:28:22 PM",
      "body": "P2P is full of tyrants and some con traders. Just because it's a trading exchange that is protected by the exchange doesn't mean you cannot be scammed. You need to open your eyes wide open and look between trades and select the best trader that will send you money without stress or send money to and release coin without much delay.You should also be aware of fake alert. Some of these guys do that most of the time, they can send you fake alert and claim that money has been sent. They can also send you 1 instead of 7, you need to use 4 eyes to check your bank account for this type of mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "October 20, 2023, 05:50:11 AM",
      "body": "The whole conclusion I go add for this matter be say ehh no matter how urgent u need the money ehh no rush release asset If you never see the money for you account and also make u use your mobile app dey check no believe on alert because many na so them dey talk fall for them when them see alert message them go believe say the money don drop and them go go release asset's. So abeg dey use UR BANK MOBILE APPS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "October 20, 2023, 07:13:34 AM",
      "body": "Scam and p2p de synonymous, weda na direct or through exchanges, because if one party send and di oda one no reciprocate by sending back, di one wey first send don enter one chance. People suppose de more careful for p2p inside exchanges because you no even know di identity of di oda person wey you de do transaction with , if you go release your coin without confirming payment inside your bank account and e come be say na scammer you de deal with , you de on your own because di exchange no go refund you your money back. So dis advice dem wey you give make sense very well, and na wetin anybody wey wan do p2p transaction for exchange suppose carry for mind. Evendo say exchanges de provide conducive platform for bitcoin p2p transactions, dat one no means say di parties involved go just trust each oda, sake of say di exchange de reputable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "October 20, 2023, 07:55:13 AM",
      "body": "I have fallen victim to p2p scam, though it wasn't due to the above listed reason. I was the seller in this case and the buyer had a reputation of high successful trades and good percentage level. What happened was that after he had marked the trade as paid, I tried logging in to my bank app and the app wasn't opening after attempts and it had taken more than 30 minutes after he marked the trade as paid. So I felt that the money was already in my account since my Gt bank app wasn't opening. I didn't know that gt bank was having network issues. I went ahead and release the asset. When the network finally came back and my bank app opened I didn't see the money. I contacted the buyer and he confirmed that the money was reversed back to his account, but his bank has blocked his account. This was when I realized that I have been scammed. I couldn't appeal because I already released the assets.I want to bring this up here so that others can learn from my experience. No matter how long it takes you to verify your payment don't release the assets. I believe I was a newbie that was why I suffered such thing. I don't want others to have such experience like I did.I couldn't appeal the case since I already released the asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 20, 2023, 01:57:46 PM",
      "body": "Quote from: Baki202 on October 17, 2023, 12:33:50 PM2. Don't trade when you see a trader with few numbers of trade and 98%.What about those that are just starting out in the P2P market? that is the market newbies, if we the pros avoid trading with them on the account that they have a low number of trade and a high percentage of completed trades, how are they going to grow?Personally, i do not see this particular flag of yours as a flag worthy of mention except its the other version of it, which is that, if one find a trader with high number of trades, but with low percentage in completed trades, then such trader should be avoided since there is a chance that such trader may end up wasting your time for nothing, but for a trader with low number of trades and high percentage in completed trades - like lets say 98% as you stated above, such a trader is still in the safe zone to trade with, since there are still some other factors that could have contributed to the trader not having a 100% completed trade score, and one of such factors is, delay in confirming received  payment due to internet network issues, at least, this has happened to me on several occasions and it did affect my trade score a bit.Quote3. Don't submit your real phone number if they ask for it: A good one indeed, and i would want to add that, aside not sharing your real phone number to avoid being sent a fake alert, it is still very wrong to depend on SMS alert to confirm receipt of payment from p2p trades, a p2p trader should depend on their mobile banking app to confirm payment, do not depend on SMS alert, like myself, i get SMS alert, but until i find the money received, registered and added to my account balance through my mobile banking app, I no dey release trade ooh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "October 20, 2023, 05:10:15 PM",
      "body": "Quote from: Baki202 on October 17, 2023, 12:33:50 PM2. Don't trade when you see a trader with few numbers of trade and 98%.I no see that one as red flags atall cos em get I no think sae this can be used as some people wey be identify themselves newly for the  Binance p2p merchant trades newly. Na as number of trade d go so, naso their rating go d go so. You can't kukuma conclude those that have 98% rating as red flags to look out for cos rating is done by number of deals wey d merchants run. Quote3. Don't submit your real phone number if they ask for it: Whether na to submit a real phone number or fake phone number I no see anything woroworo to happen in that case. But if a merchant decide to send you a fake alert for phone, em go fit still send you fake alert for your email and mobile app? I think no. As p2p trader, em go d wrong to use only phone alert to the confirm transaction made. You add additionally or use mobile app or email to confirm bank transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 20, 2023, 06:04:19 PM",
      "body": "Another point to add to this is that to avoid delays in banking network, look out for traders who will pay you from a the same bank . For instance, if your receiving bank for payment is OPAY, the patronize the buyer who is also using OPAY. That way, you know that you have a higher chance of receiving payment faster. Two weeks ago I had an issue where the buyer made payment with Palmpay to my OPAY . It took 24 hours to receive the payment. I had to report the issue to their customer support because I thought I was about to be scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "October 20, 2023, 06:50:22 PM",
      "body": "I just want chop mouth for the matter concerning the dropping of phone number so that the buyer fit contact you. Aside sending you fake credit alert for that particular transaction, a scammer fit use your phone number send you phishing link and steal your assets since him don know say you be crypto holder. No be every trader wey dey do P2P trade be genuine trader, some na scammers and na beta avenue to get crypto users phone numbers. Whenever I get the message to drop my phone number, I dey always ignore am and the buyer get the option to continue with the trade or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}