{
  "id": "topic_5427140",
  "title": "Portocervo777",
  "author": "Portocervo777",
  "created_time": "December 08, 2022, 07:42:45 PM",
  "content": "Top fuds the fud The greatest whales shake out to scare the retail traders.The xrp fud everybody remembered price went up after xrp case anyways xrp fud was so scammy.Now LUNA and FTX Next fuds.Also every \"crypto ban\" news just making crypto cheaper for bigger guys to buy and making the retail scared.I wondering do really people belive bad news it's clear that bad news are there to just scare retail traders.Don't be like weak hands don't be scared of bad news",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427140",
  "comments": [
    {
      "author": "crzy",
      "created_time": "December 08, 2022, 09:17:07 PM",
      "body": "They are spreading FUD for their own benefits and we should already know how to deal with this.Whales will always do their best to earn money and if they are capable of spreading fud probably they can earn more. Though what happened to LUNA and FTX are not just a FUD since it happened in real time and many realized that those investments are not safe, they collapsed because of their own mistakes and not the whales manipulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "December 08, 2022, 09:57:49 PM",
      "body": "Quote from: Portocervo777 on December 08, 2022, 07:42:45 PMI wondering do really people belive bad news it's clear that bad news are there to just scare retail traders.Don't be like weak hands don't be scared of bad news Some bad news are just FUD while some are real and you should act right away or else your funds will be totally be gone. FTX for example, once the issues started to spread out many are panicking and they a day after, they got hacked and many funds are totally gone, so if this is just a FUD then where is our funds? Wales will manipulate small tokens and spreading FUD for the top coins, they are doing this for many years now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 08, 2022, 09:58:41 PM",
      "body": "There's a huge difference between 'real' bad news and merely spreading negative rumours to push down price. XRP and LUNA was already bad to start with so I wouldn't call it \"FUD\" — because the negativity surrounding them was totally warranted and justified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 08, 2022, 11:56:41 PM",
      "body": "Quote from: Portocervo777 on December 08, 2022, 07:42:45 PMI wondering do really people belive bad news it's clear that bad news are there to just scare retail traders.Sadly yes. If it's news that has been verified and tends to be a bad one, why wouldn't they believe it if it's a real thing that has happened? But, as we know in the market, when there is news being spread to give everyone the thought of being scared then it's up to you whether you'll allow them to scare you or you will use that moment so that you can buy. That's how it goes in this market, either you'll be the one to take advantage or you'll be the one that will be taken advantage of due to the news that they cascade down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "December 09, 2022, 02:55:12 AM",
      "body": "There is a difference between FUD and bad news, FUD is untrue news that is spread to cause fear but it is not the truth while bad news is an actual incident, instead we have to be vigilant when bad news appears rather than FUD, but as traders we shouldn't have to always stick to news that appears because the truth is difficult to verify and as traders we should focus on strategy not news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "December 10, 2022, 10:09:43 AM",
      "body": "Quote from: goaldigger on December 08, 2022, 09:57:49 PMQuote from: Portocervo777 on December 08, 2022, 07:42:45 PMI wondering do really people belive bad news it's clear that bad news are there to just scare retail traders.Don't be like weak hands don't be scared of bad news Some bad news are just FUD while some are real and you should act right away or else your funds will be totally be gone. FTX for example, once the issues started to spread out many are panicking and they a day after, they got hacked and many funds are totally gone, so if this is just a FUD then where is our funds? Wales will manipulate small tokens and spreading FUD for the top coins, they are doing this for many years now.If you store your money in the exchange or invested in their own coin then yes you could have acted quick before worse has yet to come but if you aren't among this then there is no need for you to panic. It doesn't help but it can only affect your decisions.If the whales manipulate small tokens, then this token are only going to be shaken and not the entire market. Why will people be affected when they spread fud about it? Fuds are a part of this market and the only key to combat them is to become more knowledgeable but even if there are no fuds, there will always be a time for the market to fall down though this is better. At least it was natural.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "December 10, 2022, 10:47:35 AM",
      "body": "I wouldn't say what happened with FTX is FUD – Fear, Uncertainty & Doubt. Nope, it's not. What happened was a clear case of misapplication of business sense and strategy by Sam Fried. We read a part of what happened and how CZ Binance who wanted to take over the exchange said the books/records were really messed up. No matter how the real situation was going to be masked, it will still be exposed sooner than later. Sam Fried messed up FTX. He shouldn't blame anyone for what happened. It's just a pity that its app which I use for tracking my tokens is gone now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 10, 2022, 06:20:36 PM",
      "body": "Quote from: Portocervo777 on December 08, 2022, 07:42:45 PMTop fuds the fud The greatest whales shake out to scare the retail traders.The xrp fud everybody remembered price went up after xrp case anyways xrp fud was so scammy.Now LUNA and FTX Next fuds.Also every \"crypto ban\" news just making crypto cheaper for bigger guys to buy and making the retail scared.I wondering do really people belive bad news it's clear that bad news are there to just scare retail traders.Don't be like weak hands don't be scared of bad news You are confusing concepts, if a bad news emerge about one of the top coins in the market and then it is confirmed to be true and the market begins to go down that is not FUD, that is just a natural reaction by the market participants in order to protect themselves from the decrease in the price that is coming, FUD is when negative rumors are spread about a coin and those rumors are false, now it is true that whales use such events to take advantage of retail traders, but that is natural as most people will do the same if they were in the same position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 10, 2022, 07:07:01 PM",
      "body": "Quote from: Portocervo777 on December 08, 2022, 07:42:45 PMI wondering do really people belive bad news it's clear that bad news are there to just scare retail traders.Don't be like weak hands don't be scared of bad news Yes in my opinion, bad news or fundamental upcoming topics are really affected with the ongoing news. Yes people are really easily get scared when it comes to price action but the more the you get fall on such even small is really differentiate the changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}