{
  "id": "topic_5464253",
  "title": "TrifectaFi",
  "author": "TrifectaFi",
  "created_time": "August 23, 2023, 07:10:41 AMLast edit: October 17, 2023, 10:55:03 PM by TrifectaFi",
  "content": "BOUNTY POOL: $10,000 worth $PIGS1. The bounty will run from 18th October to 1st November2. The total bounty pool for the 2 weeks combined is 333,333,333,333 $PIGS3. The distribution will happen within a week after the bounty campaign ends.Important: By opting to engage in this bounty program, you understand and accept that the wallet address and details you have provided are definitive and unalterable. The bounty manager retains the authority to modify the terms and conditions at their discretion. We reserve the right to cancel your participation from the bounty if the participant does not follow the rules mentioned.1. All participants must join the MoonPig's official Telegram Group2. Talking about the bounty in the project chat group will lead to immediate disqualification from the campaign and an instant ban from the company chat group. If you have any questions please ask here or message us at bitcointalk.3. KYC is not required for the bounty campaign. However, we reserve the right to require KYC for extremely suspicious cases.4. Any offensive or inappropriate behavior might lead to disqualification from the campaign.5. Using multiple accounts, cheating and spamming are not allowed. Doing so will lead to immediate disqualification. 6. All participants must send the Proof of Authentication post to join the bounty program.Proof Of Registration Post Format:Code:#PROOF OF REGISTRATIONForum Username:Forum Profile Link:Telegram Username:Participated Campaigns:ETH Address (capable of receiving erc20 tokens):Twitter 30%Reddit 20%Telegram 20%Youtube 20%Articles 10%The 2 weeks for the bounty are as follows: Week 1: 18th - 25th OctoberWeek 2: 26th - 1st NovSubmit your weekly report on this thread.https://docs.google.com/spreadsheets/d/1TLgEA0UzDdBwXvq8iV_YtUz-1BBI-1InzArTG_Mduho/edit?usp=sharingIf you have questions or complaints please reach out to Mike on telegram: Stakes:1. Have more than 500 followers: 1 stake/week2. Have more than 3000 followers: 2 stakes/week3. Have more than 5000 followers: 3 stakes/week4. Have more than 10,000 followers: 5 stakes/weekRules:1. Every participant must follow MOONPIG's Twitter Page.2. Twitter accounts must have a minimum of 500 followers.3. Participants have to make 2 new tweets and 3 retweets per week. (maximum 1 retweet and 1 Tweet per day)5. Participants must use @APYMoonPigs $PIGS #moonpigs #pepe #doge #shiba #Gems hashtags in every tweet.How to Join:1. Join the MOONPIG's official Telegram Group2. Fill this form -> Stakes:1. Have more than 500 Karma: 1 stake/week2. Have more than 3000 Karma: 2 stakes/week3. Have more than 5000 Karma: 3 stakes/week4. Have more than 10000 Karma: 5 stakes/weekRules:1. Participants must have 500+ positive karma2. Must publish 5 articles weekly on top Reddit groups or pages.3. Posts should have a minimum of 40 characters.How to Join:1. Join the MOONPIG's official Telegram Group2. Fill this form -> Stakes:10 stakes per weekRules:1. Write at least 3 constructive messages on this group: https://t.me/APYMoonPigs and 2 messages weekly in other crypto-related telegram groups with a minimum of 500 members.Posts/messages must be constructive, useful, and in a way that will not be considered as spamming.2. Deleted messages will not be counted.3. Report your telegram message links weekly.How to Join:1. Join the MOONPIG's official Telegram Group2. Fill this form -> Stakes:Extremely high quality: up to 20 stakesHigh quality: 5 stakesGood quality: 3 stakesAverage quality: 1 stakeRules:1. Must have at least 10+ youtube subscribers. Videos need to be a minimum of 2 minutes in length.2 One participant can make maximum 3 videos.3. Videos must be relevant.4. Only original video content will be accepted.5. Face cam video will be highly recommended and considered. 6. Bot voices will not be rewarded. But, a good quality animation video with bot voices will be rewarded.7. Removal/deletion of videos will result in disqualification8. All videos must have any or all of the following: Website link, telegram, twitter, etc9. In the video description mention your Bitcointalk to ensure authenticity.How to Join:1. Join the MOONPIG's official Telegram Group2. Fill this form -> Stakes:1-10 stakes depending on the quality of articleRules:1. Articles should be good quality and unique with a minimum of 250 words.2. Engagement on your article (views,likes, comments, etc) will be highly considered during stakes distribution.3. Each participant can write a maximum of 5 articles.4. Articles should be published on publicly accessible platforms such as Steemit, Medium, and LinkedIn, blogs, etc5. Articles should never be removed.6.  Content must focus on a relevant topic: project features, Pre Sale, latest token updates, blockchain, etc7. At the end of the article, provide your Bitcointalk username or wallet address to ensure authenticity.How to Join:1. Join the MOONPIG's official Telegram Group2. Fill this form ->",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464253",
  "comments": []
}