{
  "id": "topic_5452609",
  "title": "SeriouslyGiveaway",
  "author": "SeriouslyGiveaway",
  "created_time": "May 13, 2023, 01:40:46 PM",
  "content": "I download Electrum 4.4.2 for my Android and I get some bugs.https://electrum.org/#downloadLocalBitcoins shut down their service in middle of February 2023. Service Closure announcement.Electrum wallet still shows LocalBitcoins as one of websites in option to get fiat rate. It should not be there.With this version, on Android, I can not export a private key of one receiving address. Is it a bug or the Electrum developers team wanted to remove it from Android?I really like the version that allows me to check mempool and fee rates in Network tab. It helps me to not lose too much with expensive fee rates when Ordinals are still there.Thank you Thomas!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452609",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 13, 2023, 01:52:24 PM",
      "body": "Quote from: SeriouslyGiveaway on May 13, 2023, 01:40:46 PMLocalBitcoins shut down their service in middle of February 2023. Service Closure announcement (https://localbitcoins.com/service_closure/).Update it to Electrum 4.4.3. Only four exchange rate providers are listed there:Quote from: SeriouslyGiveaway on May 13, 2023, 01:40:46 PMWith this version, on Android, I can not export a private key of one receiving address. Is it a bug or the Electrum developers team wanted to remove it from Android?This is true. Same complain on this thread: Where is the private key on Electrum Android?Quote from: SeriouslyGiveaway on May 13, 2023, 01:40:46 PMI really like the version that allows me to check mempool and fee rates in Network tab. It helps me to not lose too much with expensive fee rates when Ordinals are still there.What do you mean by this? Mempool, ETA and Static options are still there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "May 13, 2023, 02:08:40 PM",
      "body": "Quote from: Charles-Tim on May 13, 2023, 01:52:24 PMQuote from: SeriouslyGiveaway on May 13, 2023, 01:40:46 PMLocalBitcoins shut down their service in middle of February 2023. Service Closure announcement (https://localbitcoins.com/service_closure/).Update it to Electrum 4.4.3. Only four exchange rate providers are listed there:My wallet is 4.4.3. Sorry for the typo in topic.And the list is longer than you. It is like in my screenshot.Quote from: Charles-Tim on May 13, 2023, 01:52:24 PMWhat do you mean by this? Mempool, ETA and Static options are still there.See screenshot.It is not about Mempool, ETA or Static options. It is about their visual chart for mempools. You can tap on the chart and see fee rate at that point. The chart shows you max and min fee rates like a real-time chart. I like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 13, 2023, 11:55:39 PM",
      "body": "Enable historic rates and the list will be reduced to 4 exchange rate providers- Coingecko- Coincap- CoinDesk- BitcoinVenezuelaI think the individual private key exportation feature was removed to encourage better wallet security practices. It's not a bug.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 14, 2023, 12:17:03 AM",
      "body": "Quote from: Bitcoin_Arena on May 13, 2023, 11:55:39 PMEnable historic rates and the list will be reduced to 4 exchange rate providers- Coingecko- Coincap- CoinDesk- BitcoinVenezuelaYou are correct. I tried to know if I get anything wrong and I redownloaded the wallet and import a seed phrase on it. When check fiat currency, the historic rates was automatically enabled and it gives only just four options which you also listed. It will be good if Localbitcoins is removed, but that is not what should be called bug as it has nothing to do with the wallet function and performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 16, 2023, 06:43:10 AMLast edit: May 16, 2023, 08:10:19 AM by NotATether",
      "body": "Quote from: Charles-Tim on May 14, 2023, 12:17:03 AMIt will be good if Localbitcoins is removed, but that is not what should be called bug as it has nothing to do with the wallet function and performance.The Localbitcoins code is actually still there in the source code, but I don't think it's actually displayed anywhere. I also saw a bunch of other exchanges that were (apparently) never listed on the Electrum settings' Fiat page.Anyway, I have created a pull request to remove the code: https://github.com/spesmilo/electrum/pull/8437EDIT: Done and dusted, the PR has been merged after only 1 hour. There is no more localbitcoins code left in Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}