{
  "id": "topic_5467366",
  "title": "Crypto Library",
  "author": "Crypto Library",
  "created_time": "September 19, 2023, 06:49:18 PM",
  "content": "Actually, I am seeing that on the local section, There many local boards have child boards and also have pin posts for guidelines for newbies and some don't have both child boards and pin posts also, take for example - Nigeria (Naija)Actually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?I guess, just getting a local board doesn't look like a local thread if there are no childboards? At least if there is a pin topic then maybe some common guidelines for the beginners could have been taught in the beginning. My reason for opening this topic is just curiosity to know about these things and mechanisms.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467366",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "September 19, 2023, 07:02:13 PM",
      "body": "I think the application should be made in meta where the application for a local board was made and the requirements should be traffic for discussions related to the child board; so a local board which wants a child board on technical discussions ideally should have lots of threads on technical discussions to show there is a demand for that section.After doing this, it is up to the admins to approve the request.Pinned tgrafs should depend on if there is a local mod in that mod.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hg_away",
      "created_time": "September 19, 2023, 07:34:06 PM",
      "body": "Only admins can create new child boards, you need to PM them with a child board name and a good reason for that like more than 20 threads in tge last 60 days and active new threads weekly created.Local mods can sticky topics, move topics, delete replies inside local board but cant create new child boards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 19, 2023, 07:41:17 PM",
      "body": "Quote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?It's the same for adding any child boards on any boards even not on the local boards — it's the demand (number of posts/threads). Locals make suggestions, polls then request it to admins based on the results with the help of their local mods as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 19, 2023, 08:00:10 PM",
      "body": "Quote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?Afaik, only theymos and Cyrus can create new local boards so what I would suggest is to make a request topic in Meta (but first talk about it in your local board to figure out which boards you actually need) and explain the reason why you need them. Just wanna warn you though that it may take some time to get them as nothing gets done fast around here. Quote from: Crypto Library on September 19, 2023, 06:49:18 PMAt least if there is a pin topic then maybe some common guidelines for the beginners could have been taught in the beginning.You can send a PM to admins and ask them to pin specific thread that yoy think is very important and should be at the top, easily visible ot everyone. At least that's what one of our local members (marlboroza) did since we don't have our own local board and he thought that its a good idea to have translated LoyceV's trust system guide pinned in our local.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 19, 2023, 08:03:07 PM",
      "body": "Quote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?I think one should create a thread on Meta to ask for those child boards if they are needed in a local board. But I think that in order to get new child boards the majority of the members of that particular local board should agree upon the decision to have a new child board. Once its properly analyzed by staff and admin that yes a child board could be a good step for a local board then the admin will create that child board. I'm not very sure but I think moderators may not be able to create the child boards themselves and only admin could create those boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 19, 2023, 08:23:56 PM",
      "body": "There is no requirement needed to have a child board but you cannot create one and only the admin have the ability to do so. All you can do is request here in the forum to create new board or child board and then you wait. It's either the request is accepted by theymos or not fulfilled. As you have known, admin is very busy although some requests are accepted like changing display name and adding new feature like what you can see near your name (OP).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 19, 2023, 10:09:05 PM",
      "body": "Quote from: nakamura12 on September 19, 2023, 08:23:56 PMThere is no requirement needed to have a child boardNo - there should be a requirement that allows admin to approve requests about adding child boards at local board. For example - the main board has been mixed up with discussions from different categories [bitcoin discussion, altcoin discussion, trading, politics or others], so that the local board has to separate the categories of different topic for organized discussion with child board. But only admin can do that - but if you and your community don't make those specific requests then it feels like adjustments won't be made either.Local board moderators can also help contact admin to make those adjustments - but I think it's only easier to agree if your local board is already very active but doesn't yet have child boards for different discussion categories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 19, 2023, 10:24:00 PM",
      "body": "Quote from: _BlackStar on September 19, 2023, 10:09:05 PMNo - there should be a requirement that allows admin to approve requests about adding child boards at local board. For example - the main board has been mixed up with discussions from different categories [bitcoin discussion, altcoin discussion, trading, politics or others], so that the local board has to separate the categories of different topic for organized discussion with child board. But only admin can do that - but if you and your community don't make those specific requests then it feels like adjustments won't be made either.My bad, I get your point and understand it completely. I realize that my post is about if the admin will accept the request or not which means it does have requirement before the admin will accept the request. I know about main board that has discussions that is a bit far from the main topic or category just as you have explained with the example you have given. Well, not that I know the requirement for it but I am sure the admin will decide if it should be added or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "September 20, 2023, 05:08:51 AM",
      "body": "Quote from: SamReomo on September 19, 2023, 08:03:07 PMI think one should create a thread on Meta to ask for those child boards if they are needed in a local board.Things related to forum issues, discussions should be in Meta board. Creating a new child board surely belongs to Meta board but this thread is not a request to forum head admins to create a new child board for Nigerians.QuoteBut I think that in order to get new child boards the majority of the members of that particular local board should agree upon the decision to have a new child board.It is not in a formal procedure and if it is executed, it is only tip of iceberg as I guess no local members will be against it.QuoteOnce its properly analyzed by staff and admin that yes a child board could be a good step for a local board then the admin will create that child board.Usually it depends on activities in a local board. If big and diversify enough for categorization, child boards can be approved.QuoteI'm not very sure but I think moderators may not be able to create the child boards themselves and only admin could create those boards. Only head admins, two now, theymos and Cyrus can create new boards so the same for child boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "September 20, 2023, 09:51:04 AM",
      "body": "It is the admin that creates child boards and not the moderators. Before then someone will need to call the attention of the admin to that effect. I have raised a topic in Nigerian local board proposing that we need child board but some of the old Nigerian users didn't agree to that. They said what we have now is serving us which I also agreed with. If there is need for a child board, a simple pm to theymos can solve this problem. For sticky post, it is only when there is a worthy post to be pinned that it would be pinned. When such a post is made by any member, there is no doubt that it would be pinned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 20, 2023, 11:36:41 AM",
      "body": "Quote from: uchegod-21 on September 20, 2023, 09:51:04 AMIf there is need for a child board, a simple pm to theymos can solve this problem. It is not as simple as that,  as it could take quite a long time, it could take as much time as requests for a local board and there has to be at least enough traffic in the main board for the admin to even consider it.Quote from: uchegod-21 on September 20, 2023, 09:51:04 AMFor sticky post, it is only when there is a worthy post to be pinned that it would be pinned. When such a post is made by any member, there is no doubt that it would be pinned.Sticky posts as well have to be done by the admins, so the request has to be made to one of the admins as to why the post should be stickied and they will decide whether to stick it or not. None of these is so straightforward or guaranteed to be done, especially with how the admins are usually reluctant to make too many changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "September 20, 2023, 01:33:18 PM",
      "body": "Quote from: Rikafip on September 19, 2023, 08:00:10 PMQuote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?Afaik, only theymos and Cyrus can create new local boards so what I would suggest is to make a request topic in Meta (but first talk about it in your local board to figure out which boards you actually need) and explain the reason why you need them. Just wanna warn you though that it may take some time to get them as nothing gets done fast around here. The submission must have a clear purpose and purpose in order to be understood, and also it must show response from the local members as well as proof that they need a child's board on their local council.Local activities are also very influential in this case to strengthen the submission, and it requires a long time in making it because the admin may review the prospects of the local council first before doing work.In addition, as far as I know that what is allowed to submit a request to the admin to add several boards or boards of children is a moderator from the local council itself, I myself at the Indonesian local council after discussing with other local members and making the decision to ask for new children's boards, steps Furthermore, it is urged the local council moderator to make a submission to Cyrus or other admins (I think it's a hierarchical manner that needs to be done).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 20, 2023, 01:43:59 PM",
      "body": "Quote from: Rikafip on September 19, 2023, 08:00:10 PMQuote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?Afaik, only theymos and Cyrus can create new local boards so what I would suggest is to make a request topic in Meta (but first talk about it in your local board to figure out which boards you actually need) and explain the reason why you need them. Just wanna warn you though that it may take some time to get them as nothing gets done fast around here. They certainly won't do that because they are expected to switch to the new Epochtalk forum software and all changes waiting for that moment. I believe that when the transition starts, then new child boards and some new stuff will be added or whatever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 20, 2023, 02:01:33 PM",
      "body": "Quote from: examplens on September 20, 2023, 01:43:59 PMThey certainly won't do that because they are expected to switch to the new Epochtalk forum software and all changes waiting for that moment. I believe that when the transition starts, then new child boards and some new stuff will be added or whatever. I do not see a relationship between them. In the end, it is more data that is added, and there are some local boards that were created after Epochtalk discussions.As I mentioned previously, the fact that the Nigerian LB does not have a local mod will limit the possibility of establishing sub-boards. I have been distributing merits to that board over the past two weeks, and the local langauge they use (although it is close to English) but understanding it requires some time. True, you do not need to understand entire post to send merits but you need to it to delete the post.A summary of what I would like to say is that only admins can create sub-boards and when a request comes from a local mod, the probability of it being approved is higher, and it is difficult to create sub-boards for LBs that do not contain mods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 20, 2023, 02:14:44 PM",
      "body": "Quote from: examplens on September 20, 2023, 01:43:59 PMThey certainly won't do that because they are expected to switch to the new Epochtalk forum software and all changes waiting for that moment. I believe that when the transition starts, then new child boards and some new stuff will be added or whatever.Since they added few child boards to put local board back in 2021, I see no reason why they wouldn't do that they same for another local board. It won't be easy and it will tale something to me but it's imho worth a shot. Imho, waiting for Epochtalk is like waiting for Godot and we all know how that story ended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 20, 2023, 02:32:44 PM",
      "body": "Quote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I am seeing that on the local section, There many local boards have child boards and also have pin posts for guidelines for newbies and some don't have both child boards and pin posts also, take for example - Nigeria (Naija)Actually, I wanna know, is there any requirement to get child boards for the local board? Or give as soon as you apply? And if you have to apply, to whom should you apply? Can moderators do this? Or the admin himself? What is the process?I guess, just getting a local board doesn't look like a local thread if there are no childboards? At least if there is a pin topic then maybe some common guidelines for the beginners could have been taught in the beginning. My reason for opening this topic is just curiosity to know about these things and mechanisms. A request should be made by the people of that same board who are prominent enough to write and post on it to the meta board, this is the thing they can do and probably send a PM to Theymos with the link to the thread, then you have acted from your own part, if the admin sees a need in granting such request he will, but i need to remind you that there have been many applications pending that needed Theymos attention and you have to be more patient with these because you will have to wait for some time, during which you can also encourage for active participation on the local board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 20, 2023, 04:06:23 PM",
      "body": "Quote from: Crypto Library on September 19, 2023, 06:49:18 PMActually, I am seeing that on the local section, There many local boards have child boards and also have pin posts for guidelines for newbies and some don't have both child boards and pin posts also, take for example - Nigeria (Naija)We're not in a rush on the Nigeria board, after so many years of asking we just got the board (based on the date on our request thread, it'll look like it took us just months but the appeal started since with other threads that didn't get much feedback). We're taking things slowly, currently there isn't much need of a child board, when we see a need a request will be brought to the meta baord. Our focus now for the board is getting more merit source and an increase of the current merit source allocation on the board; A good statistics to show Nigeria need more merits source to approved at least 2 after that we might prepare a proper request thread and list of board we need, based on threads on those topics dominating the main page. Quote from: Crypto Library on September 19, 2023, 06:49:18 PMI guess, just getting a local board doesn't look like a local thread if there are no childboards? At least if there is a pin topic then maybe some common guidelines for the beginners could have been taught in the beginning.There's no need of getting a child board when that child board will become dormant because of lack of interest from the local baord members. The main page of the local thread has to be full of topics on a specific area of discussion before a request for subboard get more merit. Pin topic are important and when we submit the subboard request, pinned post request will also be included for some important threads like the Rules and Regulations thread (mostly likely a translated version) but until then we have other focus which is why those areas you raised concern about aren't at the top of the agenda since most local board users are also main board visitors but it won't be neglected. Ps: Just know.the board is still young and we'll be growing gradually, no rush.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 20, 2023, 10:13:20 PM",
      "body": "Quote from: nakamura12 on September 19, 2023, 10:24:00 PMQuote from: _BlackStar on September 19, 2023, 10:09:05 PM-snip-My bad, I get your point and understand it completely. I realize that my post is about if the admin will accept the request or not which means it does have requirement before the admin will accept the request. I know about main board that has discussions that is a bit far from the main topic or category just as you have explained with the example you have given. Well, not that I know the requirement for it but I am sure the admin will decide if it should be added or not.Yes - I'm just giving a general view of ​​the possibilities, but only the admin will decide whether to add child boards or not. However if your local board is a very active and every topic category is still present in the main board - then there is a good chance that admin can add child board to make discussions more organized.But compared to child board – I tend to wonder why local board Nigeria have not had their own moderators since the request for local board was approved. Appointing moderators to local board is one of the most important things so that moderation in local board becomes better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 20, 2023, 10:54:25 PM",
      "body": "Maybe the global moderators are the ones designated to moderate the local boards that don't have assigned moderators. Only moderators or administrators have the authority to create child boards based on the community's needs, and there might be a formal process or set of requirements for this. It's possible that a certain level of activity or number of members is necessary before a child board can be established. I'm not sure if users need to submit a request or proposal to the administrators to explain why a child board is needed. Who should you contact for this? Do you need to reach out to an administrator or moderators? Can they provide you with information about the specific processes and requirements?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}