{
  "id": "topic_5460196",
  "title": "Z390",
  "author": "Z390",
  "created_time": "July 18, 2023, 09:04:39 AM",
  "content": "I have read some interesting stories of few members on this forum that did all they could to buy their first set of BTC years ago and also how they made it through the journey, but one thing that I found missing from those stories is a secured job..Newbies or Beginners, who are aiming to start buying Bitcoin for future sakes, I want you to take this advice very seriously, do not start your Bitcoin investment living under a roof that still feeds you, it could work but it will make things to be more difficult for you.When you don't have anything else to fall back on, after asking your brothers or sisters in the family to give you some money for investment, what will you do when you get the Bitcoin? You need to live, you will have desires to buy things, and you will panic if the market move downside even more..All this will happen because you have no job secured, as a beginner, before investing in Bitcoin, make sure you have a job or source of income, it will make the journey of accumulation to be easier and less bothered about the market behavior.Pocket money, or the money that someone gives you will only bring you unrest mind if you plan to invest with such money,  it's the type of money you are not ready to lose, because it's all you have, because you have no other money coming from else where.You don't need Bitcoin first, What you need is a JOB, work on that first.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460196",
  "comments": [
    {
      "author": "sesterceshop",
      "created_time": "July 18, 2023, 09:19:38 AM",
      "body": "Great advice. Financial stability should definitely come first. Invest in yourself, get a job that pays well, and then dollar cost average to get to your 1st Bitcoin. I wish I've gotten this advice back in the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "July 18, 2023, 09:20:12 AM",
      "body": "I understand your point that bitcoin investment is solely for the financial buoyant people and it is true because of the volatility it possesses. But I wouldn’t say people without much Should stay away from it. They can simply use it as a trading method to buy things. Also even the less buoyant can as well save in bitcoin of at all the the money is meant to be saved for a very long time, this will help them curb the devaluation effect affecting fiat. The only thing is when a Person who is struggling financially runs to save every little penny they have into bitcoin with the intention of making profit then that is where the problem lies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "July 18, 2023, 09:21:01 AM",
      "body": "You made a valid point and there's something I'd like to stress on. While Bitcoin has the potential to make you rich, it also has the power to cause an early death(esp if you are faint hearted )..how do I mean? With it's penchant for volatility, it is better to start with something small, like the Op pointed out but that's when youve got a job on the side.  But imagine one who's got a job on the side but does not fully make a research about bitcoin trading and just jumps in can still panic when the market goes down. Do another key factor to consider after all these you've mentioned is to carry out a proper research before investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 18, 2023, 09:33:39 AM",
      "body": "It's hard to accept but it is the harsh reality. I have also met many people even I am included. Who tries to invest in BTC or Trade in BTC in the hope of making money out of it. The funny thing is we are using the money that's is all we have and starting with zero knowledge.I mean, in this situation if the market will come down then obviously the trader/investor will panic trade. And will face loss too. So, to keep your mind relaxed and to avoid yourself from all the market sentiments, a source of income is necessary. It's not that compulsory but I would say it's the best practise to have a source of income before investing in BTC or any other currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "July 18, 2023, 09:34:36 AM",
      "body": "Having a source of income is a good start to begin bitcoin investment. Bitcoin is a kind of money in which people can invest, and for this to happen their must be a source of income. Bitcoin is money , for one to have more money money their should be a source of income. Acquiring your first bitcoin does not mean one will start becoming financially buoyant.  It is when we have a job that generate money , then more bitcoin can be gotten from its investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 18, 2023, 09:37:47 AM",
      "body": "Quote from: Z390 on July 18, 2023, 09:04:39 AMYou don't need Bitcoin first, What you need is a JOB, work on that first. Yeah, nicely said, although one should add that bounty hunting is not a job!Quote from: Zaguru12 on July 18, 2023, 09:20:12 AMI understand your point that bitcoin investment is solely for the financial buoyant people and it is true because of the volatility it possesses. But I wouldn’t say people without much Should stay away from it. They can simply use it as a trading method to buy things.People who don't have the capital to start over again if they fail 10 trades in a row or are unfamiliar with trading at all should simply stay away from it! The whole investing and trading scheme is pretty simple, it's money moving around, when yours go away they are in somebody else's pocket, when you score it's the opposite. And most of this money flow comes from newbies and guys who think that just because they got lucky 5 times in a row with a shitcoin they can do so forever when it's just luck mistaken as knowledge!Just like not everybody can fix a broken fridge not everybody can trade successfully!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 18, 2023, 09:41:28 AM",
      "body": "Not just bitcoin, it applies to every investment when someone have the source of income to meet their daily needs, handle unexpected expenses, and have a safety net in case of any market volatility. The success you made from investing with the money as pocket money, gift or anything small as one time then it all just experimental so this can't serve enough to take the big risk of taking loan and use that money as capital for investment.But with stable financial situation you can approach your investment journey with a more confident and also gives you the freedom to take the risks which are worth for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fat buddah",
      "created_time": "July 18, 2023, 09:54:28 AM",
      "body": "That's just basic, I never thought that should be told. I mean, there is nothing wrong, I just think that if someone wouldn't follow that simple advice he's not too smart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 18, 2023, 10:14:24 AM",
      "body": "Quote from: Z390 on July 18, 2023, 09:04:39 AMNewbies or Beginners, who are aiming to start buying Bitcoin for future sakes, I want you to take this advice very seriously, do not start your Bitcoin investment living under a roof that still feeds you, it could work but it will make things to be more difficult for you.No one knows, so far we are still trying and trying our best to be as ideal as possible to be part of the Bitcoin holders. It doesn't matter when we need to sell it or we are determined to hold it as long as we can.Quote from: Z390 on July 18, 2023, 09:04:39 AMWhen you don't have anything else to fall back on, after asking your brothers or sisters in the family to give you some money for investment, what will you do when you get the Bitcoin? You need to live, you will have desires to buy things, and you will panic if the market move downside even more..Of course, if the finances you get are only from one source, whether it's a gift or an automatic loan to meet life's needs. The most important thing that needs attention, obviously this is not the right point for any type of investment.Quote from: Z390 on July 18, 2023, 09:04:39 AMAll this will happen because you have no job secured, as a beginner, before investing in Bitcoin, make sure you have a job or source of income, it will make the journey of accumulation to be easier and less bothered about the market behavior.If you just wait until you have a steady and stable job in terms of income, you will never realize the investment. There is no challenge, even when we have little income but dare to invest for a better future. I will not belittle people who have dreams of investing in bitcoin. Because sometimes they can actually appreciate ownership more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 18, 2023, 11:28:14 AM",
      "body": "Quote from: Z390 on July 18, 2023, 09:04:39 AMYou don't need Bitcoin first, What you need is a JOB, work on that first. If they want to have bitcoin, they must get it somehow. From working, faucets, giveaways, airdrops, whatever can help them. Working is the best because nowadays giveaways and airdrops are more related to altcoins, tokens. Bitcoin faucets only allow to claim small amount of satoshi and waste your time.Working to get bitcoin as your salary or get your salary in fiat currency or stable coin and use it to buy bitcoin.Quote from: jrrsparkles on July 18, 2023, 09:41:28 AMNot just bitcoin, it applies to every investment when someone have the source of income to meet their daily needs, handle unexpected expenses, and have a safety net in case of any market volatility. The success you made from investing with the money as pocket money, gift or anything small as one time then it all just experimental so this can't serve enough to take the big risk of taking loan and use that money as capital for investment.Investment means you must have capital to invest. The capital can be from inheritance, salary but most of us have it from our income, salary not from inheritance. Because we must work hard to get capital for investment, we must know how to store our bitcoin safely.Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "July 18, 2023, 11:40:09 AM",
      "body": "Anyone who’s irresponsible enough to borrow amounts of money that could negatively impact their life if they can’t pay debt anymore is gonna cause big time wreckage to their financial and personal life. It’s just a ticking bomb tbh.Even a job won’t be enough. If you borrow money and lose your job, what do you do? Borrowing is risky business, it’s always been like that. Responsibility isn’t a joke, you need to calculate risks and possible outcome. Is it worth risking to live a shitty life just for a couple grand of non-guaranteed profit? If you take the risk and fail, live with it lol.. you agreed by investing in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "July 18, 2023, 12:15:00 PM",
      "body": "Quote from: Z390 on July 18, 2023, 09:04:39 AM()You don't need Bitcoin first, What you need is a JOB, work on that first. Not only should we have a stable job before investing in bitcoin, but we should also have savings, an emergency fund for life, before thinking about investing in bitcoin. There is no guarantee that an investment will always yield a return, and there is no guarantee that our work will always go smoothly. There are many important things to prepare before we want to invest in bitcoin, an asset class with high volatility and an uncertain future. But many people only dream about profits and ignore these things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "July 18, 2023, 12:33:37 PM",
      "body": "Of course, this is already given. You need money to be able to buy Bitcoin and even in trading it. So if one has no source of funds for the same purpose, then the best thing to do is to make sure you either have a job, have a side hustle or a stable business. Getting funds from family members or friends is not always a good idea since this industry is very volatile - a roller-coater ride that others may not appreciate. However, one can start small and with the use of the internet there are now many ways to make some money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "July 18, 2023, 12:54:35 PM",
      "body": "As of my own way of interpretation of what a bitcoin investment means and how it should be covered without the investors being affected, you need to realized that if you must invest then it has to be with a fund you have earned, something that belongs to you and you think you could hodl it for a while for future benefits whereby it will not depreciate in value but instead appreciate more, then with this you can invest but while investing, there must still be something in which you could fall back on for your daily life maintenance without having the need to touch from what you have invested to earn your daily living, lastly it's not also advisible for one to make an investment when he's not fully equipped with the bitcoin knowledge required before making an investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 18, 2023, 01:04:24 PM",
      "body": "Don't invest money you don't have. Does it make a splash? Let me put it this way: Don't use money that come from some family's member pocket to do things you consider smart; like buying bitcoin. Use only yours. Okay, I think it's quite cleared out now. Just in case someone misses the obvious. Oh, and don't try to convince them, because you won't pay any damage. Taking risks for other people's money is only something the government can do. Let's just leave it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "July 18, 2023, 01:14:13 PM",
      "body": "Quote from: Z390 on July 18, 2023, 09:04:39 AMAll this will happen because you have no job secured, as a beginner, before investing in Bitcoin, make sure you have a job or source of income, it will make the journey of accumulation to be easier and less bothered about the market behavior.because those who can actually invest well are those who are financially calm enough. having some income and setting aside a little gradually for long term investment planning in Bitcoin would be great. but consider that our finances must also be stronger. because if not then it could interfere with investment planning that is done. that's what makes beginners experience buying at high prices and then selling at a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "July 18, 2023, 01:38:44 PM",
      "body": "Quote from: fat buddah on July 18, 2023, 09:54:28 AMThat's just basic, I never thought that should be told. I mean, there is nothing wrong, I just think that if someone wouldn't follow that simple advice he's not too smart.You can never be too careful and remember that not a lot of people have common sense so it's not like there's something wrong with what OP is saying, it's just a good thing that most people are reminded after some time. I wouldn't say that they're not smart just because they've skipped that step, I was a student when I discovered bitcoin and I was able to accumulate back then even without a job through faucets, so I don't necessarily agree that getting a job is always the right step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "July 18, 2023, 01:45:02 PM",
      "body": "Quote from: Smack That Ace on July 18, 2023, 12:15:00 PMQuote from: Z390 on July 18, 2023, 09:04:39 AM()You don't need Bitcoin first, What you need is a JOB, work on that first. Not only should we have a stable job before investing in bitcoin, but we should also have savings, an emergency fund for life, before thinking about investing in bitcoin. There is no guarantee that an investment will always yield a return, and there is no guarantee that our work will always go smoothly. There are many important things to prepare before we want to invest in bitcoin, an asset class with high volatility and an uncertain future. But many people only dream about profits and ignore these things.I agree with you on this, we do not only Need a job first to invest in bitcoin but we also need savings, an emergency fund that we call always run to back up, this is to prevent one from depending on the the investment. Investing in Bitcoin their should be a good preparation, having a job alone is not enough and not a good idea for an investment.  One can have a job but yet their is still no savings, savings needs to comes first before one is thinking of making an investment plan. Investment is unpredictable that can't be relied on, but savings will always  be a back up for emergency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 18, 2023, 02:01:42 PM",
      "body": "A good way to invest in bitcoin while having no extra money to spare is to start getting some extra money that you couldn't before! This would make more sense with examples. One way is to get extra money is to cut back on a bad habit like smoking and invest the money you were wasting before in bitcoin. Another good way is to sell some stuff you don't need, something second hand you no longer need and is occupying space. You can sell them on Craigslist or the equivalent in your country or just a good ol' yard sale. Then you invest that money in bitcoin.And of course as OP said a job or even a second job (could be online as freelance or something similar) would give you extra money too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}