{
  "id": "topic_5433748",
  "title": "koshik044",
  "author": "koshik044",
  "created_time": "January 10, 2023, 12:24:47 PM",
  "content": "Name: DonkeyDogAs I write this post, the market cap is at 3900. The name of the project is very memable, there is a chance that it will fly to the moon. Contract renounced and lp locked. We need your support, the maximum wallet is very cheap. Let's send it! It's easier to push off the bottom and fly to the moon. Market cap is very low, so there is little risk. Our community will be happy with every buy / repost.Good luck everyone and have a good day!  Tokenomics:Buy: burn 1%, rewards 4%(usdt) dev 1% marketing 3% liq 1%Sell: burn 1%, rewards 4%(usdt) dev 1% marketing 3% liq 1%https://t.me/DonkeyDoghttps://twitter.com/DonkeyDogBSC0x5ce24fe57c85d5591ebe4f404bf421692f5d98a6 (BSC chain)https://i.imgur.com/6Zt6BDs.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433748",
  "comments": [
    {
      "author": "dwminer1",
      "created_time": "January 10, 2023, 01:29:07 PM",
      "body": "Support, but why? This looks like another, needed by no one project with poor quality graphics. No team, no roadmap, no community, and the only purpose of existence I can imagine is to get a few bucks from naive. I really think the crypto world would be better if all these meme coins disappeared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "January 10, 2023, 01:46:40 PM",
      "body": "Quote from: koshik044 on January 10, 2023, 12:24:47 PMName: DonkeyDogAs I write this post, the market cap is at 3900. The name of the project is very memable, there is a chance that it will fly to the moon. Contract renounced and lp locked. We need your support, the maximum wallet is very cheap. Let's send it! It's easier to push off the bottom and fly to the moon. Market cap is very low, so there is little risk. Our community will be happy with every buy / repost.Good luck everyone and have a good day!  Tokenomics:Buy: burn 1%, rewards 4%(usdt) dev 1% marketing 3% liq 1%Sell: burn 1%, rewards 4%(usdt) dev 1% marketing 3% liq 1%https://t.me/DonkeyDoghttps://twitter.com/DonkeyDogBSC0x5ce24fe57c85d5591ebe4f404bf421692f5d98a6 (BSC chain)If this is all you say, dude, I don't think what you did will not give help to boost what you say should be supported. There is a lot to improve and fix, there should also be a good plan for the future.Rather than wasting time on this, it is better to focus on other cryptos that are better investments and have a good track record in the market as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koshik044",
      "created_time": "January 10, 2023, 02:41:09 PM",
      "body": "Quote from: dwminer1 on January 10, 2023, 01:29:07 PMSupport, but why? This looks like another, needed by no one project with poor quality graphics. No team, no roadmap, no community, and the only purpose of existence I can imagine is to get a few bucks from naive. I really think the crypto world would be better if all these meme coins disappeared.Yes, you may be right. It's not a low-quality graphic, it's a graphic aimed at meme culture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "January 10, 2023, 03:23:14 PM",
      "body": "I don't understand what's on your mind for you to post this kind of thing here, mate, the atmosphere here is very different from any telegram groups you've ever been in. I mean, the people here are wiser than you can imagine. If you make posts like this (shillings), you won't get any positive response, moreover the things that post are obscure things like meme token. Also in the navigation menu I only see \"Tokenomics\", \"How To Buy\" and \"Swap\". There are no clear fundamentals. The people here are too stupid to buy this token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "January 10, 2023, 04:21:21 PM",
      "body": "Rules number one.Avoiding a token/coin because the @OP already mention you the reason, it's because about \"MEME\" word. It's already simple things the token area should be avoided because of that.Never interested with MEME.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "January 11, 2023, 03:27:07 AM",
      "body": "Yeah, another shitcoin that you want others to invest in so you can dump on them. Low marketcap means you are easily manipulate the market. Give us one reason why we should support this shitcoin? To make us rich over night? What about the others that will end up losing everything? What about the rugpull that you might do? Worst way to promote your shitcoin to be honest. All red flag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "January 11, 2023, 04:08:03 AM",
      "body": "Since many investors has learned from their past experiences, I think I will Carry out more research concerning this project before investing because I don't want to lose my money in this new year. But if the project will going to scam investors in the community, I don't think you will get any investors, because through the research investors will definitely expose the project to other investors not to fall victim. Well, I have invested a huge amount of money on Ethereum few days ago, because I believed so much on that coin that I will definitely achieve something good that will make me happy when the price increase higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "evichi",
      "created_time": "January 11, 2023, 12:45:24 PM",
      "body": "DonkeyDog is obviously a meme token - with no utility and I am yet to see the purpose for this token. Form the look of things I think you are somewhat new in crypto and quite new in this platform. I don't think you will get the desired attention you need here because this platform have intelligent people that will like to know the reasons for coming to the platform to post a meme token. You said the marketcap is very low and there is little risk? The point is that whether high or low marketcap, investing in any coin at all is a risk much less a meme token. I think you ought to have taken time to study this platform so that you know the stage on the project when you can post here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "January 11, 2023, 01:10:34 PM",
      "body": "Thank you for the tip OP. In addition to asking for people's support to the project, also add that everyone indulging should also do well to do their own research and not just take your word straight up because you are a member of this forum. Advising people to do their own research before supporting the project will indicate that you are also interested in the safety of people here. For anyone considering the project, please be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}