{
  "id": "topic_5409357",
  "title": "Vvang",
  "author": "Vvang",
  "created_time": "August 10, 2022, 12:02:28 PM",
  "content": "For a crypto beginner like me is the so-called whitepaper some I should count on when doing research? people are still talking about the whitepaper of crypto projects but few people said it doesn't matter.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409357",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 10, 2022, 12:09:04 PM",
      "body": "Most fake projects plagiarized white paper of another project, you can easily tell that a project is fake if plagiarized white paper is used. White paper contains the information about a project for you to know the aims and objectives of the project, it is good to consider reading it. But having legit white paper does not still guarantee a project not to still fail or resulting to pump and dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 10, 2022, 12:09:29 PM",
      "body": "Actually anything e.g. whitepaper, roadmap, team, use cases, social media etc are pointless since it's just a promise from the CEO and you wouldn't know the aim of the CEO behind the project. He may want to get $1 Million and then run away with investors money, he may offer a privacy oriented use cases, but after SEC force them to regulating his project, he will change the coin to centralized and so on.The best thing is stick with Bitcoin and avoid the rest since it's full of shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 10, 2022, 12:12:01 PM",
      "body": "Quote from: Vvang on August 10, 2022, 12:02:28 PMFor a crypto beginner like me is the so-called whitepaper some I should count on when doing research? people are still talking about the whitepaper of crypto projects but few people said it doesn't matter. If you are asking for this then I think that you're already doing something wrong.Be careful because most projects (tokens, altcoins, whatever) don't live up their promises (some are scam, some become scam, some are just unlucky or bad projects) and you will be tempted to invest your money into those.You may want to stick with Bitcoin until you understand (much!) better all those \"offers\". (LOL, previous post also tells \"stick with bitcoin\")",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "August 10, 2022, 12:28:58 PM",
      "body": "Whitepaper still does matter but not with coins/tokens that appears nowadays out of thin air with unrealistic claims.Read the whitepaper of bitcoin and major altcoins instead rather than those low volume cap tokens/coins because doing so will be far more helpful to your technical grasp of how other coins work as well as helping you pick which other assets to buy.After that you'll realize that the whitepaper of emerging ICO's/tokens are pretty much a copy paste version of what bitcoin or any other top altcoins that offers the same solution to a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 10, 2022, 12:40:02 PM",
      "body": "For a crypto beginner if you will be reading the bitcoin whitepaper1, then it is good, it may be difficult for you to understand though, especially if you are not too much into tech, but there are other simpler articles2 & 3 that can be much better for non-tech people to read and understand bitcoin without reading the whitepaper. Altcoin projects most times have plagiarized whitepaper, and even if the whitepaper is written by the project and not plagiarized, it often contains things that the projects cannot achieve, for example a project's whitepaper can read that \"they are going to change the digital financial system for good\", but they have no usefulness to do that, you can call it a \"white elephant project\". Some of these whitepapers are poorly written with bad grammar and many other flaws, altcoin whitepapers many times can't tell you correctly what to expect from them.https://bitcoin.org/bitcoin.pdfhttps://learnmeabitcoin.com/https://bitcoin.org/en/how-it-works",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 10, 2022, 12:54:05 PM",
      "body": "The whitepaper usually represents the face of the project. You should receive all the information on the idea and further use of the project. Good projects produce a fairly informative document, and in addition, they have a team that you can ask for all the subtleties that you do not understand. But what happens in most cases? A whitepaper is created, consisting of one or two pages, in which usually there is nothing significant, but simply in order to supposedly have this document. And another important factor is that the documents are simply copied. This already signals the upcoming scam.But we should not deceive ourselves with the presence of all the points by which we usually assume that the project is legal. Some do not spare money either on advertising or on creating a colorful white document. However, in the end, the projects turn out to be scams.As you know, cryptocurrency is a very risky business, and those who are more skeptical prefer to invest in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 10, 2022, 01:39:02 PM",
      "body": "The whitepaper is still needed because all information you need is there before you invest in the project. Investors are always reading the whitepaper first to decide if the project is a scam or if it has a future to grow. All you need as an investor is already in the whitepaper. Just be careful on another whitepaper that looks legit and has the potential to grow but the whole thing is fake if it is plagiarized just like the other said above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "August 10, 2022, 02:09:08 PM",
      "body": "Quote from: Vvang on August 10, 2022, 12:02:28 PMFor a crypto beginner like me is the so-called whitepaper some I should count on when doing research?In the same way you're not in the position to verify claims or statistics from medical researches because you're not a doctor, you can't understand complicated whitepapers if you're not a mathematician or cryptographer. It is strongly recommended to try to understand, which as unlikely to happen might \"push\" you to learn something new, even if you don't succeed.The Bitcoin whitepaper is the easiest opposed to the rest. As a beginner who wants to get involved, you should firstly comprehend that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "August 10, 2022, 02:16:48 PM",
      "body": "Quote from: Vvang on August 10, 2022, 12:02:28 PMFor a crypto beginner like me is the so-called whitepaper some I should count on when doing research? people are still talking about the whitepaper of crypto projects but few people said it doesn't matter. Those people that saying it doesn’t matter are same people that usually invest on scam projects. Whitepaper contains all about the detail of the project. It’s the only thing you need to tell the credibility of the project and what it's structure. Ignoring the whitepaper is just investing on a project blindly. Skipping the plagiarism part, A good project whitepaper will not contain a recycled idea which you will know if you will read whitepaper of different project.Whitepaper is the most important thing in the project. You should pay attention on it and DYOR always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "August 10, 2022, 02:30:43 PM",
      "body": "Quote from: _act_ on August 10, 2022, 12:09:04 PMMost fake projects plagiarized white paper of another project, you can easily tell that a project is fake if plagiarized white paper is used. White paper contains the information about a project for you to know the aims and objectives of the project, it is good to consider reading it. But having legit white paper does not still guarantee a project not to still fail or resulting to pump and dump.Because fake projects plagiarize whitepaper does not reduce the importance of whitepaper, all projects must have whitepaper. We just need to look beyond whitepaper to determine a viable project. Even real projects fail, could be hacked and could later scam. At the moment investors are still learning  and new scam idea are coming up daily in crypto, that is the reason for good investment strategy, not putting all your investment in a project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 10, 2022, 04:38:42 PM",
      "body": "If you want to go a bit more technical, sure. But for most people, not really. There are a lot of resources out there that's easier to grasp for the day-to-day non-technical person.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9Nnj",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 10, 2022, 04:42:23 PM",
      "body": "If you are newbies, don't read whitepaper because scammers will write very attractive ones to make you believe in their projects.If you read, don't trust in white paper that is too good in graphics and have too many good promises in technology and finance.You can skip white paper of new or upcoming projects, and only choose projects that have 4 or 6 years in history to invest. If they exist 4 or 6 years, they are not scam and no rug pull.If you know how to use explorers, use it to check token distribution. If distribution is too centralized, risk of rug pull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "August 10, 2022, 05:04:08 PM",
      "body": "I think that's a need for what they will put up in whatever project. It's always going to be a reference to how much a project can do or something. If you were to say that it doesn't matter, then it's just a shitcoin with plagiarized stuff inside it or something. Unless it has become something of a viral project, it should be notable to what it will be and what it will show. Most current and notable projects have their whitepaper in an easy and readable way, but as for the original one, it's a research paper. So I guess it could be a source of doubt as well? It is better to check their results instead of just the whitepaper itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ketesnuko",
      "created_time": "August 10, 2022, 05:46:49 PM",
      "body": "Whitepapers should not be used as a buying signal, it consists of how a project is functioning, its good to go through Whitepaper after you are certain about the project but do not let it be your buying signal, look into team and the project utility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "August 10, 2022, 06:38:17 PM",
      "body": "Quote from: Vvang on August 10, 2022, 12:02:28 PMFor a crypto beginner like me is the so-called whitepaper some I should count on when doing research? people are still talking about the whitepaper of crypto projects but few people said it doesn't matter. Yes I think the whitepaper matters to an extent, though many projects plagiarize their whitepaper from other projects. It makes it easy to know a scam project when they  plagiarize the whitepaper of other legitimate projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "August 10, 2022, 06:50:10 PM",
      "body": "Quote from: hd49728 on August 10, 2022, 04:42:23 PMIf you are newbies, don't read whitepaper because scammers will write very attractive ones to make you believe in their projects.If you read, don't trust in white paper that is too good in graphics and have too many good promises in technology and finance.You can skip white paper of new or upcoming projects, and only choose projects that have 4 or 6 years in history to invest. If they exist 4 or 6 years, they are not scam and no rug pull.If you know how to use explorers, use it to check token distribution. If distribution is too centralized, risk of rug pull.experience will help everyone to read whitepaper, it took me time to know what to look at in whitepaper. There are no guarantee that a 4 year and more project can be succesful, I used to beleive in that until the last cycle came with new hype like the Defi, NFTs etc. that left bitcoin hardfork coin, privacy tokens etc out of the cycle. However, some project idea will last several cycle eg. exchange coin that have several used cases like IEO, transaction fee, blockchain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "August 10, 2022, 07:04:35 PM",
      "body": "Quote from: Vvang on August 10, 2022, 12:02:28 PMFor a crypto beginner like me is the so-called whitepaper some I should count on when doing research? people are still talking about the whitepaper of crypto projects but few people said it doesn't matter. I think the people that said whitepaper of a crypto project doesn't matter don't know the benefit of it because whitepaper is like a room where the project establishes itself as a credible project, address the investor's interest, and gives more insight about the project concept. Besides, most start-up project in which Dragonfly Capital Partners, Anthony Pompliano, etc invested was able to convince them through their official whitepaper. Tell me why is whitepaper not important?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bhig Daddy",
      "created_time": "August 10, 2022, 09:46:48 PM",
      "body": "Whitepaper shows you the aim and objectives of the project, it show you how a the roadmap on how a project want to archives it goal, but also have in mind that it still doesn't guarantee that the project will be a success. So it is very considerate to read the Whitepaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "August 10, 2022, 10:45:26 PM",
      "body": "The whitepaper is known as a detailed or authoritative report. It contains a detailed breakdown of what the project is to offer and how they plan to go about it in the future terms. Every project has its whitepaper that is different from the other. Some are plagiarized, sugar-coated by a paid writer and also have unreliable information.In crypto, most of the projects don't go by the timeline they have in their whitepaper. They keep failing to deliver on the timeframe promises according to their whitepaper.The whitepaper is just full of empty promises, lies and uncorroborated findings. Reading a project whitepaper is okay but don't put their plans at heart",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}