{
  "id": "topic_5461343",
  "title": "jaimie0501",
  "author": "jaimie0501",
  "created_time": "July 28, 2023, 06:10:02 PM",
  "content": "When BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461343",
  "comments": [
    {
      "author": "BD Crypto",
      "created_time": "July 28, 2023, 06:20:55 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.Do you think is there any other potential or secured investments in crypto than Bitcoin? I never think. Why you are willing to sell Bitcoin in Bear Market and there will be probably a big pump as there is an upcoming halving event. And if you observe history of it you may see how Bitcoin reacts after halving.So I will not suggest to sell it now but if you want to need urgent money or unable to hold it more then you can sell partially. Anyway Bitcoin is the most potential cryptocurrency to invest and we all know market reacts according to Bitcoin movement. So you should grab profit from Bitcoin then you can go for other investments with small amount. But never invest without proper research or a investment strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 28, 2023, 06:36:31 PM",
      "body": "If you could had patient to hold till it reaches $69k what then stops you from not holding till the market bounces back?Are you in a rush to use the money for any other investment or what? Because I still believe bitcoin is the right the choice and the right coin to hold despite its stagnation in 29k to 31k for over some months now.Investing in another coin that is not bitcoin is only distracting you from being focused, since some of the newly launched altcoin are there to steal your funds to get ready for the bull run. So I will advise you keep holding and stay from your wallet otherwise you could be tempted to sell it of since no progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 28, 2023, 07:02:56 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.There is not a standard answer to this as everything depends on the circumstances surroundings your life and the assets in which you are interested to invest, now this being a bitcoin forum you will most likely get answers regarding the upcoming bull market and how the profits you can get will be very high if you can hold for that long, and they will be right about their comments, however if for some reason you cannot wait for that long and you have assets in other markets which you think can offer a better short term performance, then maybe trying to invest in those assets could be the best move for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 28, 2023, 07:33:02 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.Since you didn't sell Bitcoin when the bear market brought it to its lowest in recent years ($16K),  it means you can hold for a couple of months more. A few months from now, Bitcoin halving event will take place and the mining rewards will be reduced by 50% - Historically, Bitcoin's price has had upside runs around the time of the event. You can choose to tell now but carefully analyze your options as it won't be long now. While I don't know where the market would be at that time, I do know for a fact that history tends to repeat itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "July 28, 2023, 07:45:19 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.If you have held bitcoin for many years, is it now that is the preferable time to sell it when the bull run is close by? Selling your bitcoin assets at a price below $30k will show that your long years of holding bitcoin in your portfolio is a waste since you didn't sell your bitcoin when the price was $69k. You only lose money when you sell bitcoin at a low price, according to a phrase that is frequently used in the cryptocurrency world. Maintain your current holdings of bitcoin and don't consider switching to another investment that will yield returns comparable to that of bitcoin. The finest investment one can make for their upcoming investments is still bitcoin. Even while the price of bitcoin may be falling right now, that doesn't guarantee that it won't rise again and surpass its previous all-time high of $69k. In light of that, avoid selling your bitcoin at the current price. Shortly, 2024 will be a significant year for the crypto market where the price of bitcoin will skyrocket due to the halving season",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 28, 2023, 07:47:02 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.I think selling now will be one of the dumbest decisions that you will ever make because you saw profit when you could have taken it, but you chose to ignore it because you hope to make more profit. For you to ignore the pump of the last ATH and decide to hold for more profit, I believe you must be a great holder. What then changes now? Are you afraid that the price might fall more than it is right now? But you were positive about the price going above $69,000 when you last saw it, which is a serious calculation that you have made.My suggestion is that your selling decision should all be based on the price at which you purchased your bitcoin. If it was for a price lower than $29,000 as of when you purchased it, then selling now will be of no harm to you as you will not be recording any losses. Those figures you saw when the price was at $69k were never yours.But if you purchased it above $30,000 and now the price is below what you paid, selling now will only make you lose money, which will really be unwise of you, so I will suggest you use that same energy and faith that gave you a strong holding decision to hold until you make some profit or at least hit the price where you bought it. What I don't know is when it will hit that price, but it is certain that it will get there in the near future; it could take months or years. All you have to do is just wait and hold in a secured wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "July 28, 2023, 07:57:05 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.It's actually how to manage yourself.For some it's emotional, feeling and betting. Take a look around at all the post \"wondering\" what it's going to do and if they buy, sell or hold.Not having a plan is a plan to fail.Write it out, what are your goals and in what time frame. Clearly state what to to do at certain way points. Example: at 33% I am going to take profits down to my original investment. If it goes down below my blended cost average I will buy more in lump some or DCA. Follow that plan not your gut",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 28, 2023, 08:27:53 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.I can see that you are new here and you lack the knowledge of bitcoin that is why you want to sell of your bitcoin. I can still say that you are lying and don't have any bitcoin during the last bull run, if not by now you would know that the price of bitcoin will still pump more than the last ATH in the next bull run coming 2025 or late 2024. I will advice you to read and learn on bitcoin price movement so that you don't think that bitcoin is doomed. If you sell your bitcoin,which other investment do you want to invest on shitcoins, or what ? As long as investment is concerned presently, it is only bitcoin that can give high profit because of its volatile nature if you can be patient with your investment and hodli for long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "July 28, 2023, 08:51:51 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.It all hinges on your patience and belief that Bitcoin will re-explode at $69k. If I were you, I would never sell Bitcoin even if it meant losing some of my money. I am confident in Bitcoin's upside potential and will not be concerned. If I wish to invest in altcoins because I believe they are promising, I will never sell Bitcoin and instead add money to invest in those altcoins. I always keep in mind that the majority of the time, the price movement of cryptocurrencies is dependent on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "July 28, 2023, 09:00:43 PM",
      "body": "For what reason do you feel the need to sell right now? apart from the notorious change that this asset has had in the past, is there another reason than the uncertainty of whether the bearish movements will continue?, in the event that do that you are having this idea due to a necessity, i'm not the one to tell you not to do it but if it is out of simple fear, i would tell you not to take this step, in recent years it has been possible to show that bitcoin has not managed to rise as It was expected, but even so, it continues to stand and its volatility has not been so bad, in addition to the fact that, with the beginnings of adoption and the proximity of an event as important as the halving, there is an expectation that at any moment it will see values again as in those years that it appeared for the first time, if you are patient and do not despair as many do, you could once again reinforce your confidence regarding this asset. Bitcoin is still the best investment, so instead of thinking about giving up, think carefully about how to use it to your advantage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 28, 2023, 09:23:23 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions.What are the other investments that you want to turn to? You also didn't tell us what the price of BTC was when you bought the coins, if the price was less than what it is now, then you have still made revenue, so it depends on you. It isn't the most reasonable choice to sell now since you held BTC through its all time high, so a better choice will be to continue holding until BTC sets a new all time high.Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMAlthough I have held BTC for many years. I am not good at management.Do you mean managing your keys and seed phrases? Just hold your funds in a hardware wallet or in an air-gapped device and also back up your seed phrase in more than one secure location.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 28, 2023, 09:29:20 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.here the thing is how much do you spect from the investment, because to get a x4 with bitcoin would be really hard, at the current price we would need to see it going up to $120k, to get that x4. But with other coins isn't that hard, I mean, if we look at LTC all-time high we will see how it was up to $360, while now is at $90, so, to make a desition about what coin is better to invest first look at those coins ATH, and that will give you a good hint about your next investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "July 28, 2023, 09:34:21 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.When bitcoin got to $69k, you did not sell because you believed the price will go up. Do not loose that believe now if not you would have wasted all those years waiting. Bitcoin will get back up to what the price was and even expected to do more and set a higher all time high, the patient people will be the most excited during this time but people that would have taken this decision you are about to take now to turn attention to another cryptocurrency will regret their decision to leave bitcoins then. Do not leave bitcoins for another investment in bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "July 28, 2023, 09:34:46 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments?Do you know that altcoins follow the Bitcoin price trend? If Bitcoin fails to pass $69k (its ATH), I'm not sure that we have a big altcoins season anymore. So, investing in Bitcoin should be the priority (main asset), Bitcoin is the main coin in crypto. The current price is still around $29k - $30k, but it is just a temporary price. We believe that Bitcoin price will grow gradually, it won't increase suddenly to $69k. You must know that halving is always the main reason for Bitcoin to skyrocket, so just wait for the halving schedule first. I suggest to keep your Bitcoin and buy other coins if you have an excess money.*DWYOR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 28, 2023, 09:40:22 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.If you are familiar with Bitcoin 4 year cycle, you might have a second thought of selling your BTC.  It was observed that every four years, a year after the halving event, Bitcoin surpass its ATH and records a series of ATH breaking event.  If you don't have an urgent need for money, I would suggest that you wait a year after the Bitcoin halving and see if you can take a profit from the market surge.  You have been holding for years now, I think it won't harm if you wait a few years more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "July 28, 2023, 09:42:18 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.Dont!Hold up your position and never ever sell those coins. Those are just paper loss and not something considered to be realized loss on which we know that every market cycle would really be havingbearish and bullish movement on which we know that on the time that bullrun  comes then we might be seeing on breaking that previous ATH.Yes, it isnt really that something simple or easy but there's no other way on going but into that path because we know that not all the time the market would really be going down.It might not that simple because you would really be mainly battling against with your emotion that you are bad on handling your emotions and having that bad management but in due time and experience, you would be able to realize that its never been that worth on cutting your losses. Hold your current position and wait up until the bull run moment on which we would be able to seethose breaking those previous ATH's and would be making a new one. It would really be just depending if you would really be deciding to sell out on those peak pricesand never ever make yourself get caught into those points and waiting up for another cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 28, 2023, 09:49:59 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000.Even reached $16600.Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMIs it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.If you're in profit, why not? It's always about your satisfied and gratitude depending on the price when you've bought it. Do you really need to sell it and do you need money? Then go.But if not, you have to determine yourself whether you like selling now or not. That's what you just need to think of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 28, 2023, 09:51:50 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments?No, this is not the most reasonable time to sell considering you've hold bitcoin when it has gotten to it all time high yet you refuse to sell, we have different categories of bitcoin holders, some are long time while some are short time holders, but in this case, i don't think any of these matters than OP himself being inexperienced in trading, when holding, you must know your target point of entry, have a specific period of sell, compare the previous data on ATH and ATL from what the record gives and compare to were we are currently to predict where you should place your target for the future, changing investment will not change anything if you being the trader is bot changed, you will keep getting same result over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 28, 2023, 09:57:32 PM",
      "body": "Quote from: jaimie0501 on July 28, 2023, 06:10:02 PMWhen BTC reached $69000. I didn't choose to sell it. but the current price of Bitcoin dropped to less than $30000. Is it the most reasonable choice to sell BTC now and turn your attention to other investments? I hope to get some good suggestions. Although I have held BTC for many years. I am not good at management.With the current decline, it is totally normal to start thinking about selling and looking into other investments. I totally get it! Deciding what to do can be a tough call. Here is my two cents: think about your long-term goals. How long are you planning to invest? Do you think other types of investments could bring you better profits compared to Bitcoin? Weighing these factors might help you make a better choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}