{
  "id": "topic_5475280",
  "title": "Pierre 2",
  "author": "Pierre 2",
  "created_time": "November 24, 2023, 04:48:40 AM",
  "content": "Fatih Terim fonu olayı,Bir bankanın eski müdürü Seçil Erzan’ın, aralarında Fatih Terim, Arda Turan, Emre Belözoğlu gibi ünlü futbolcuların da bulunduğu 39 kişiyi, yüksek karlı gizli bir fon vaadiyle dolandırdığı iddia edilen bir olay. Erzan ve diğer 6 sanık, 80 milyon dolarlık vurgun yapmakla suçlanmakta. Bu olayla ilgili olarak İstanbul Cumhuriyet Başsavcılığı tarafından soruşturma başlatılmış ve iddianame hazırlanmıştır. Erzan ve diğer sanıkların yargılanmasına ise devam edilmekte.Olayda Fernando Muslera, Semih Kaya ve Ayhan Akman'ın da isimleri geçiyor.Banka teftiş raporu da şöyle:\"Erzan'ın 46 gün vadede dolar bazında %253 getiri vaadine inanılmış olsa bile bu dökümanlardan şüphelenilmemesi, elden ve üçüncü kişi üzerinden para verilmesi, ortalama zekaya sahip herhangi bir kişiden beklenmeyecek bir davranıştır.\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475280",
  "comments": [
    {
      "author": "verbakalim",
      "created_time": "November 24, 2023, 05:59:53 AM",
      "body": "Vay vay vay. Faiz getirisine bir bak. 46 günde %31 alıyorsun. Öf ya. Neden bu şans şu parasahibi olan futbolculara vuruyor. Hani mahalle arasında maç yaparken okulu kırıp top oynayan çocuklardan seçilmiş takımlardan sivrilip gelmiş olan kişilerin parayı bulunca okumadan akıllanmaları sonucu oluyor sanırım. Dolar bazlı yıllık %253 aylık 32 günlük %22 kar. Öf anam öf. Bunların bu işi yaptığı dönemde tl ye aylık faiz bu kadar verilmiyordur. Demek ki bunu anlatan iyi anlatmış. Alaşılmayan hiç bir nokta bırakmamış.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 24, 2023, 06:10:09 AM",
      "body": "Herifler sadece ayakları çalıştırmış keşke birazda kafayı çalıştırsalarmış.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 24, 2023, 06:24:35 AM",
      "body": "Sadece Arda Turan'ın 14 milyon dolar kaptırdığı söyleniyor benim anlamadığım bu kadar büyük bir parayı güvenerek nasıl verebiliyorsunuz. Bu kadar kazanma hırsı neden var, birde b kadar getiri durumu hiç normal değil biraz matematikle bunun mümkün olmadığını anlamaları gerekiyor o dönem için. Dememki kolay kazandıkları için kolay riske atabiliyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 24, 2023, 11:21:08 AM",
      "body": "(Not: Genele konuşuyorum)İşte posterlerini astığınız, çocuğunuzun tam yaşını bilmezken ayakkabı numaralarına kadar bildiğiniz, hangi doktora ne zaman gittiğini takip ettiğiniz, takımınız için eşiniz dostunuzla kavga ettiğiniz, hatta uğruna kan dökmekten çekinmediğiniz vb vb, futbol camiasının içindekilerin aslında ne kadar dangalak ve bir o kadar da orospu çocuğu olduğunun güncel kanıtı.Üstelik baş dangalağın bir de liderlikle ilgili lakabı var, herkes öyle anıyor.Beter olsunlar, az bile, bunları o kadın tek başına mı ....miş, yoksa başkaları da var mıymış bilmiyorum ama afiyet olsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "November 24, 2023, 01:05:37 PM",
      "body": "Bu işin altından daha neler çıkacağını merakla takip ediyorum. Bilirkişi raporlarında kafası ortalama düzeyde çalışan biri bu vaatlere kanmaz demişler. Bir insan gerizekalı değilse böyle paralar yatırmaz diyorlar yani açık açık. Ya bu işin altından başka şeyler çıkacak ya da para hırsıyla cidden hiç düşünmeyecek duruma gelmişler. Şimdi oklar FTye döndü biz battık o kâr etti diyorlar.  Dönen paralara bak ya milyonlarca dolar. Arda 20 bin dolarım kaldı diyor Emre'nin hiç parası kalmadı diyor. Deprem sonrası 500k yardım ettik diye millet dalga geçti diye ağlıyor. Çok garip olaylar gerçekten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 24, 2023, 01:42:45 PM",
      "body": "Terim çıkıpta bir açıklama vs yapmadı hiç Bir de abi senin paran çok. Yediğin önünde yemediğin arkanda daha ne istiyorsun. Söylenen miktar ile neler yapılır neler.Demek ki insan oğlu çok aç gözlü. Nefis istedikçe istiyor. Fatih Altaylı pazar günü kendi kanalında Rezzan Epozdemir'i konuk edecekmiş. Ger şeyi soracağım ona dedi. Ben de merakla bekliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ILuckyGuyI",
      "created_time": "November 24, 2023, 02:03:35 PM",
      "body": "Fatih Altaylı Fatih Terim ile ilgili de bir şeyler söylemiş ben de gördüm. Gerçekten de Fatih Terim dolandırılanlar arasında gözükmüyor. Twitter'da bugün kimin ne kadar dolandırıldığı ile ilgili bir listeye rastlamıştım ve orada adı geçmiyordu. Görünüşe göre Fatih Terim bir şekilde kendini kurtarmayı başarmış ama nasıl?   Fatih Terim de bildiğim kadarıyla ciddi miktarda para yatıranlardan birisiydi. Ondan bu aralar ses seda çıkmaması da şüpheleri iyice artırıyor. Bu arada daha geçen gün Arda Turan Seçil Erzan'ı arayıp sesini kayda almış onu paylaşmışlardı. Gerçekten akıl almaz bir olay yani nasıl böyle bir şeye inanabilir ki insan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 24, 2023, 02:11:39 PMLast edit: November 30, 2023, 01:28:37 PM by Vispilio",
      "body": "Cehaletin başkenti Türkiye'den rutin manzaralar, bir kere her şeyden önce Kadın Fon Yöneticisi diye bir kavram neredeyse dünyada yok, yani araştırın ABD'de bile finansal işlemlerle kara geçen kadın çok nadir bulunur, burada bazı emekli futbolcular Seçil Erzan'ın albenisine ve tatlı diline aldanıp hipnotize olmuş gibi ponziye parayı basmışlar, sonra olayı çevrelerine yaymışlar, futbolcu olmayıp da benzer cehaleti gösteren çok insan var Türkiye'de burası biliniyor...Daha tuhaf olan Seçil Erzan ve \"arkadaşı\" gerçekten beceriksiz dolandırıcıymış, ponziyi idare edebilmek için tefecilere borçlanmışlar, sonraki aşamalarda yatırılan paranın büyük bölümü direkt tefecilere yani mafyaya gittiği için kurtarılması zor görünüyor, bir de erken ve uyanık davranıp Seçil Erzan'ı tartaklayarak misliyle kazananlar da olmuş sadece Fatih Terim değil Semih Kaya vs de Seçil'i döverek zorla bu işten çok kar etti deniliyor, Türkiye futbol dünyasının kirli sicili düşünüldüğünde sürpriz olmayan dolandırıcılık ilişkileri, İsmail Saymaz'ın konuyla ilgili açıklamaları güzel:https://www.youtube.com/watch?v=AO4u2GEAdBo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "November 24, 2023, 02:50:19 PM",
      "body": "Milyonlarca lira paraları olan insanlar çok daha fazla para kazanmak için hırs uğruna bütün birikimlerinden olmuşlar. Evleri, lüks arabaları var olması gereken her şeye sahipsin normal bir iş yaparak paranı kolay katlayabileceksin ne gerek var olta olduğu çok belli değil mi hiç mi araştırma yapmazsın bu kadar faizin normal olmadığını bilmiyorsan bile üstelik elde para vermeler. Fatih Terim'in açıklama yapmaması çok garip geliyor.Aç adam para kazanır, açgözlü adam hiçbir şey kazanamaz. Kazanamadığı gibi, milletin kanına da ekmek doğrar. Tuncay Kantarcı kurtlar vadisi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 24, 2023, 04:01:27 PM",
      "body": "dün Bitmeyen Para Yapmışlar (Türkiye) konusunda da yazdım. lan böyle bir para yok arkadaşlar. elden teslim edilen paralar ile ne yapıldığı hakkında sanırım kimsenin tam olarak bir bilgisi yok. sonuçta bu kadar parayı toplayan bankacı hanım bunu banka gibi bir yere koymadı. nasıl bir işlem yaptılar gerçekten ilginç. bazıları işin içine trade vs gibi işlemlerin olmadığını söylüyor.banka müfettişine ait olduğu iddia edilen söz tüm olayın özeti aslında:“Bahçekapılı Erzan'ın 46 gün vadede dolar bazında yüzde 253 getiri vaadine inanmış olsa bile dokümanlardan şüphelenmemesi, elden ve üçüncü kişi hesabı üzerinden para vermesi ortalama zekaya sahip herhangi bir kişiden beklenmeyecek bir davranıştır.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 24, 2023, 05:55:05 PM",
      "body": "Quote from: gospodin on November 24, 2023, 04:01:27 PM“Bahçekapılı Erzan'ın 46 gün vadede dolar bazında yüzde 253 getiri vaadine inanmış olsa bile dokümanlardan şüphelenmemesi, elden ve üçüncü kişi hesabı üzerinden para vermesi ortalama zekaya sahip herhangi bir kişiden beklenmeyecek bir davranıştır.”Ortalama zeka ve üstün zeka farkı bu kadar parayı ortalama zeka ve altının rahatlıkla kazanabiliyor olması çünkü üstün zeka diyebileceğimiz yani ortalamanın üstü eğer ki kötü niyetlere sahip değilse mükemmeliyetçi bir hal ve tavır ile işi yapmaya çalışır ve 10 liraya ürettiğini 11-12 liraya satar çünkü iletişim yani kazıklama becerisi yoktur. Gelelim diğer kitleye onlarda bu tarz becerileri sokakta kazıklaya kazıklaya öğrendiklerinden bu üst zekaya 10 liralık ürünü 30-40 liraya kitleyebilirler. Gelelim üst zekadaki kötü niyetlilere of onlarda gider orta ve ortanın alt zekasındaki insanları 1e 5 10 kat verme bahanesi ile kandırır  Normal bir şekilde karşılıyorum bu durumu yani bedava peynirin anca fare kapanında olduğunu anlayamayan insan için dolandırılmak kaçınılmaz bir sondur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "November 24, 2023, 06:57:00 PM",
      "body": "Dünyalar kadar paraları var ama hala daha fazlasının sahibi olmak istiyorlar. Para hırsı yalnızca bizim gibi insanlarda olur sanıyordum. Bu kadar çok paraya sahip olan insanlar bile biraz daha fazla para kazanmak için akıl almaz işler yapabiliyormuş. Bedava peynir fare kapanında. Bedava peynir arayanlar sahip olduklarını da kaybeder. Emek ve alın teri ile kazandıkları paraları bir hiç uğruna yok ederler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "November 24, 2023, 09:07:48 PM",
      "body": "Buna para kaptırmaları ultra gerizekalılık gibi geliyor ama kapalı kapılar ardında kim bilir daha ne işler dönüyor ki bu da onlardan biri gibi geldi onlara demek. Ortalama zeka göndermesi bomba ya ilk gördüğümde çok gülmüştüm. Yalnız anlamadığım bir şey var. Volkan Bahçekapılı yani Fatih Terim'in damadı da yaklaşık 5 milyon dolar kaptırmış gözüküyor. Fatih Terim kendini kurtarıp kızını kötü durumda bırakmaz. Ayrıca banka müdürü kadın böyle bir ponziye başladı diyelim. Yurtdışına kaçma imkanı olmadan vs mi başlamış yani? Paşa paşa gidip futbolcudan dayak da yemiş. Böyle bir ponziye kalkışacaksa kaçış planının olması lazımdı ya da arkasında çok daha büyük kişilerin olması lazımdı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 24, 2023, 09:15:22 PM",
      "body": "Quote from: LGD2Business on November 24, 2023, 01:05:37 PMBu işin altından daha neler çıkacağını merakla takip ediyorum. Bilirkişi raporlarında kafası ortalama düzeyde çalışan biri bu vaatlere kanmaz demişler. Bir insan gerizekalı değilse böyle paralar yatırmaz diyorlar yani açık açık. Ya bu işin altından başka şeyler çıkacak ya da para hırsıyla cidden hiç düşünmeyecek duruma gelmişler. Şimdi oklar FTye döndü biz battık o kâr etti diyorlar.  Dönen paralara bak ya milyonlarca dolar. Arda 20 bin dolarım kaldı diyor Emre'nin hiç parası kalmadı diyor. Deprem sonrası 500k yardım ettik diye millet dalga geçti diye ağlıyor. Çok garip olaylar gerçekten.Bunu okuyunca aklıma anında viral olan o video geldi: E okumuş kadın, hayatını sikmişler diyemedi, incinmişsin dedi...Burada da bilirkişi ve müfettişler açıkça \"sizin kaz kafanızı siksinler\" diyemedikleri için \"kafası ortalama düzeyde çalışan biri bu vaatlere kanmaz\" demişler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "November 25, 2023, 02:42:17 PM",
      "body": "Quote from: püsür on November 24, 2023, 09:07:48 PMBuna para kaptırmaları ultra gerizekalılık gibi geliyor ama kapalı kapılar ardında kim bilir daha ne işler dönüyor ki bu da onlardan biri gibi geldi onlara demek. Ortalama zeka göndermesi bomba ya ilk gördüğümde çok gülmüştüm. Yalnız anlamadığım bir şey var. Volkan Bahçekapılı yani Fatih Terim'in damadı da yaklaşık 5 milyon dolar kaptırmış gözüküyor. Fatih Terim kendini kurtarıp kızını kötü durumda bırakmaz. Ayrıca banka müdürü kadın böyle bir ponziye başladı diyelim. Yurtdışına kaçma imkanı olmadan vs mi başlamış yani? Paşa paşa gidip futbolcudan dayak da yemiş. Böyle bir ponziye kalkışacaksa kaçış planının olması lazımdı ya da arkasında çok daha büyük kişilerin olması lazımdı. Olayların girişi fena oldu da gelişme ve sonuç kısmını merak ediyorum bende eğer gruplarda bir şey duyarsam buraya yazarım olayın ponziden farklı geliştiğini düşünüyorum banka müdüresi bayanın da bir şeylerden haberi olmayabilir belki maşa olarak kullanılmıştır bilmiyorum sadece arda turan en büyük parayı kaybetmiş herhalde o kadar parayı bankaya yatırmak yerine böyle garip sistemlere sokmak sanırım bir bizim oyuncuların aklına gelirdi te allahım bitmiyor olay Türkiye’de",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 25, 2023, 02:53:13 PM",
      "body": "Quote from: RaltcoinsB on November 25, 2023, 02:42:17 PMQuote from: püsür on November 24, 2023, 09:07:48 PMBuna para kaptırmaları ultra gerizekalılık gibi geliyor ama kapalı kapılar ardında kim bilir daha ne işler dönüyor ki bu da onlardan biri gibi geldi onlara demek. Ortalama zeka göndermesi bomba ya ilk gördüğümde çok gülmüştüm. Yalnız anlamadığım bir şey var. Volkan Bahçekapılı yani Fatih Terim'in damadı da yaklaşık 5 milyon dolar kaptırmış gözüküyor. Fatih Terim kendini kurtarıp kızını kötü durumda bırakmaz. Ayrıca banka müdürü kadın böyle bir ponziye başladı diyelim. Yurtdışına kaçma imkanı olmadan vs mi başlamış yani? Paşa paşa gidip futbolcudan dayak da yemiş. Böyle bir ponziye kalkışacaksa kaçış planının olması lazımdı ya da arkasında çok daha büyük kişilerin olması lazımdı. Olayların girişi fena oldu da gelişme ve sonuç kısmını merak ediyorum bende eğer gruplarda bir şey duyarsam buraya yazarım olayın ponziden farklı geliştiğini düşünüyorum banka müdüresi bayanın da bir şeylerden haberi olmayabilir belki maşa olarak kullanılmıştır bilmiyorum sadece arda turan en büyük parayı kaybetmiş herhalde o kadar parayı bankaya yatırmak yerine böyle garip sistemlere sokmak sanırım bir bizim oyuncuların aklına gelirdi te allahım bitmiyor olay Türkiye’de Ya yapma Allahaşkına RaltcoinsB, tamamen kayıt dışı bir şekilde, banka çıkışlarında, orada burada Whatsapp yazışmasıyla haberleşip X kişilere bavulla teslim edilen balya balya paralardan bahsediyoruz, kimin neyden haberi olmayabilir? İşin içindeki herkes ne bok yediğinin gayet farkındaydı, kendisi kazanırken birilerinin canının yanacağını da gayet iyi biliyorlardı.O yüzden beterin beteri olsunlar, umuyorum ki (ama ihtimal vermiyorum) hapishanede açlıktan ranza tahtası kemirsinler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "November 25, 2023, 02:58:40 PM",
      "body": "Quote from: bobita on November 25, 2023, 02:53:13 PMQuote from: RaltcoinsB on November 25, 2023, 02:42:17 PMQuote from: püsür on November 24, 2023, 09:07:48 PMBuna para kaptırmaları ultra gerizekalılık gibi geliyor ama kapalı kapılar ardında kim bilir daha ne işler dönüyor ki bu da onlardan biri gibi geldi onlara demek. Ortalama zeka göndermesi bomba ya ilk gördüğümde çok gülmüştüm. Yalnız anlamadığım bir şey var. Volkan Bahçekapılı yani Fatih Terim'in damadı da yaklaşık 5 milyon dolar kaptırmış gözüküyor. Fatih Terim kendini kurtarıp kızını kötü durumda bırakmaz. Ayrıca banka müdürü kadın böyle bir ponziye başladı diyelim. Yurtdışına kaçma imkanı olmadan vs mi başlamış yani? Paşa paşa gidip futbolcudan dayak da yemiş. Böyle bir ponziye kalkışacaksa kaçış planının olması lazımdı ya da arkasında çok daha büyük kişilerin olması lazımdı. Olayların girişi fena oldu da gelişme ve sonuç kısmını merak ediyorum bende eğer gruplarda bir şey duyarsam buraya yazarım olayın ponziden farklı geliştiğini düşünüyorum banka müdüresi bayanın da bir şeylerden haberi olmayabilir belki maşa olarak kullanılmıştır bilmiyorum sadece arda turan en büyük parayı kaybetmiş herhalde o kadar parayı bankaya yatırmak yerine böyle garip sistemlere sokmak sanırım bir bizim oyuncuların aklına gelirdi te allahım bitmiyor olay Türkiye’de Ya yapma Allahaşkına RaltcoinsB, tamamen kayıt dışı bir şekilde, banka çıkışlarında, orada burada Whatsapp yazışmasıyla haberleşip X kişilere bavulla teslim edilen balya balya paralardan bahsediyoruz, kimin neyden haberi olmayabilir? İşin içindeki herkes ne bok yediğinin gayet farkındaydı, kendisi kazanırken birilerinin canının yanacağını da gayet iyi biliyorlardı.O yüzden beterin beteri olsunlar, umuyorum ki (ama ihtimal vermiyorum) hapishanede açlıktan ranza tahtası kemirsinler.Belki dedim hani bir ihtimal diye abi elbette bağının detaylı bulunması mahkeme ile birlikte kanıtlanacak mahkeme sonucunda duruma göre hareket edilir bence bu arada başlıktaki %253 getiriyi okumamışım sanırım eğer gerçekten buna göre hareket edip milyon dolarları veriyorlarsa bence de rapordaki gibi ortalama bir insanın inanmayacağı bir hareket olur o kadar yılların emeklerini böylece çalabiliyorlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yenerbatmaz",
      "created_time": "November 25, 2023, 05:31:46 PM",
      "body": "Umarım bu olayı sümen altı etmezler.Nerede bu sinyor terim arkadaş?Twitter'da lube ayar diye bir hesap bir haber paylaştı. Adamın birisi elden verdiği paraya çip koymuş..para dönmüş dolaşmış Semih Kaya'nın eline ulaşmış. O da beni takipmi ediyorsunuz felan demiş. Adam da benim verdiğim paranın sen de ne işi var demiş falan filan Inter Milan..Bu işini ucu bombok bir yere çıkacak gibi vaziyet alın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "November 25, 2023, 06:16:36 PM",
      "body": "Bence çok garip bir olay, mahkeme kayıtlarına göre ortada 80 milyon euroluk bir dolandırıcılık var. Bu paralar elden verilmiş. Yani bankaya gidip müdüre elden bavulla para verilmiş. Ve bu kadın tek başına bu paraları bavulla bankadan çıkarıp hiç etmiş. Ne bu futbolcular elinde paraları bavulla götürüp teslim eder ne de bu kadın bu işi tek yapabilir gibi geliyor. Şu ana kadar kimsenin bir isim vermemesi akıllara tek bir soru getiriyor. Acaba siyasi birileri mi var? Sanki belli bir süredir yapılan bir işlemmişte, bu kadar futbolcu ve ekürisinin atlamasının sebebi de sanki belli süredir devam eden ve arkasında sağında solunda siyasilerinde olması ile katılmışlar ama kucaklarında patlayınca ne yapacaklarını bilememişler gibi geldi. Ne şikayet edebiliyorlar ne de isim verebiliyorlar gibi geldi bana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}