{
  "id": "topic_5402622",
  "title": "Flyingjack123",
  "author": "Flyingjack123",
  "created_time": "June 14, 2022, 07:32:02 PM",
  "content": "There have been different events pouring in and a lot of people are jittery that bitcoin winter is setting in.The fall of celsius, though it rebound back is another chip down Many crypto exchanges are laying off employees.Yet many well read people like American billionaire businessman David Rubenstein said that crypto would not go anywhere despite the ongoing market correction.How long will this market correction will continue and where will this stop.. and where will Bitcoin stabalize",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402622",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "June 14, 2022, 07:37:35 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMYet many well read people like American billionaire businessman David Rubenstein said that crypto would not go anywhere despite the ongoing market correction.Firstly, do not base your investment decision on the comments of \"experts\" or \"well read\" individuals. Do your own Research.I agree that the crypto market is not going anywhere, but lots of cryptocurrencies would fizzle out during this period, this is an effect of market sentiments and scam projects getting exposed as they were just riding on hype.Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeNo one can answer any of these questions with accuracy.If you have done your fundamental research and believe Bitcoin is going to rebound then you buy or hodl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angshuagt",
      "created_time": "June 14, 2022, 08:33:55 PM",
      "body": "A million dollar question. Here you can find a decent analysis:https://youtu.be/F8f7XUvD2tc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 14, 2022, 08:52:59 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeDoes it seem like any of us has the magic answer to all of these questions?  Had we known, we would have been multi millionaires or billionaires years ago already.  You have to realize these are questions someone can only provide a personal opinion to as an answer.  Truth is, nobody knows the real answer to all of your questions.  Troll or not, the most accurate answer is, 'the market will either go up or down'.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FlamingFingers",
      "created_time": "June 14, 2022, 09:13:14 PM",
      "body": "No one can actually predict the bottom, only if you have an inside information about it, in my opinion and according to chart that I drew I think 20k is the bottom, remember whales do lots of manipulation, they might dump it a little bit and later pump it, this is just my opinion and not a financial advise",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 14, 2022, 09:25:35 PM",
      "body": "If the market capitalization keeps dropping then we can't be sure where the bottom is. From my point of view, the current price is too high for the current market cap and we can expect the price to go under $20k for a price correction without a big change in the market cap. It will be hard to see the capitalization over 1T again, or at least it will not happen soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 14, 2022, 09:33:08 PM",
      "body": "Quote from: seoincorporation on June 14, 2022, 09:25:35 PM<snip>Market cap as a metric is not really significant and should not be used as a case study when considering an asset. Think of it more like a way for altcoins to get more relevant as they can easily inflate their market cap by minting lots of tokens into the market to create the impression that they are high capped assets.What do you mean by \"the current price is too high for the current market cap\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LegendaryK",
      "created_time": "June 14, 2022, 09:39:36 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMwhere will Bitcoin stabalizeSome analysts are claiming it will keep going down until $8k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "June 14, 2022, 09:42:21 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeHey Bro !Nobody can answer your queries in a decent way. Even those you called experts.In my opinion, the market will not recover sooner as many scam schemes have been exposed by the second quarter of 2022. Personally, i believe in the opinion of bitcoin will recover by the next halving scheduled in the next year 2023. And till that time coming up, the market will sway under 30k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinycoiny",
      "created_time": "June 14, 2022, 09:55:45 PM",
      "body": "There is no doubt there is a recession coming. Shares are down 20% or so from their highs of 6 months ago. The 20% fall is a good indicator of the average sentiment is. i.e. People expect businesses to make 20% less profit or so due to inflationary pressures or whatever and so the share prices fall.Remember, most shares pay a dividend, so a share is always going to have people wanting to buy it if the price is right if they believe that they will get a return on their investment.Problem with cryptos is there is no fundamental value, just that you might sell it to someone else for more later. Hence bitcoin went from 1 cent to $70k while shares maybe doubled over the same period. So what is the fundamental support for bitcoin? There isn't one. Get out while you can, people are selling because they need the money, there will be more distressed sellers until this recession is over. Do not think this is a buying opportunity, it isn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ayuskabob",
      "created_time": "June 14, 2022, 09:56:40 PM",
      "body": "i think we can see 12k,but the ultimate and bigger bull run of all will be when we as a community entirely address tether usdt,this is long overdue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fenican",
      "created_time": "June 14, 2022, 10:14:55 PMLast edit: June 30, 2022, 10:01:50 PM by Mr. Big",
      "body": "Historically it tends to fall about 80% off peak in a crypto winter. So that means the low is probably in the $14k type range. We're not far from that, so this isn't a bad time to buy. It may, of course, stabilize much higher than that and begin a new bull market.Quote from: ayuskabob on June 14, 2022, 09:56:40 PMi think we can see 12k,but the ultimate and bigger bull run of all will be when we as a community entirely address tether usdt,this is long overdue.USDT has performed admirably so far. They've redeemed every request. USDC is solid as well. Both infinitely better than the UST/LUNA scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "June 14, 2022, 10:39:08 PM",
      "body": "Quote from: coupable on June 14, 2022, 09:42:21 PMQuote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeHey Bro !Nobody can answer your queries in a decent way. Even those you called experts.In my opinion, the market will not recover sooner as many scam schemes have been exposed by the second quarter of 2022. Personally, i believe in the opinion of bitcoin will recover by the next halving scheduled in the next year 2023. And till that time coming up, the market will sway under 30k.Exactly! Long-time crypto users or self-proclaimed experts, they can't be the answer.But everyone can make their own prediction on this market. Even if we have past histories to refer on, still, it is not safe to say, you will know the next movement. Just observe and make a smart guess, if you are depending on this for your next financial decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "June 14, 2022, 10:46:41 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMThere have been different events pouring in and a lot of people are jittery that bitcoin winter is setting in.The fall of celsius, though it rebound back is another chip down Many crypto exchanges are laying off employees.Yet many well read people like American billionaire businessman David Rubenstein said that crypto would not go anywhere despite the ongoing market correction.How long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeThat's how in a bear market. I remember several threads at the height of bitcoin run in 2017, and they said that they are going to quit their jobs and will focus on crypto trading or everything that involved around it to make the needed money because they have been profiting big. But they forgot that there is a bear market and this is just another repeat.As far as the blood shed, nobody can really tell, heck maybe this is not the lowest price that we can see this year. So just be prepared for the worst. And not expect something huge that is going to happen so that you won't get disappointed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "June 14, 2022, 11:29:32 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMThere have been different events pouring in and a lot of people are jittery that bitcoin winter is setting in.Bitcoin winter was predicted to happen this year after the bullrun in 2021. If you learn the bullrun/bearish cycle every 4 years, you will know that 2022 is the beginning of Bitcoin winter (bearish). People who feel jittery, only those people who have a weak mentality or don't understand about crypto market nature. If we understand how crypto market works, we won't be afraid of the current situation. Instead, we will feel happy because we have the chance to buy Bitcoin or top altcoins at the lowest prices.Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeIn theory, this bearish season will stop in 2024-2025.So, it will last around 2-3 years. But it is just a theory, the fact may happen a bit differently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto2047",
      "created_time": "June 15, 2022, 05:58:02 PM",
      "body": "20 k is the most stabilize price,i think",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 15, 2022, 06:10:35 PM",
      "body": "Quote from: Crypto2047 on June 15, 2022, 05:58:02 PM20 k is the most stabilize price,i thinkPossible but actually no one could predict what will be the price of Bitcoin and what will be the bottom price of the current market condition. But the only thing that I could suggest learn more about the history of Bitcoin and learn about TA and FA to predict what will be the next Bitcoin price movement. Blockhalving is always the starting point for investors because the supply after blockhalving is reduced while the demand increases which is a sign of a bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AliKhan5544",
      "created_time": "June 15, 2022, 06:12:58 PM",
      "body": "i think bitcoin is going to stabilize at 20k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "June 15, 2022, 06:37:11 PM",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeNobody knows, and let it run its course. Do not let us use one source to ascertain the position of the Bitcoin market which is so broad. On the other hand Bitcoin has generally reached ATH, so now that we are facing bear season it is appropriate from the beginning of June to be aware of price volatility. Don't panic, we're not going any deeper, even if it's deep then the later bounce will surpass the previous ATH. Above +$70K it's definitely a hit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 15, 2022, 07:18:29 PMLast edit: June 16, 2022, 02:15:42 PM by BlackHatCoiner",
      "body": "Quote from: Flyingjack123 on June 14, 2022, 07:32:02 PMHow long will this market correction will continue and where will this stop.. and where will Bitcoin stabalizeIt'll drop to 18k, then it'll pump to 24k within a few hours, whoever had the guts to buy, bought; then gradually we'll reach 30k, when we'll initially start stabilizing... Then, Coinbase & Binance will get hacked and boom! Back to 20k, with a continuous market upheaval. Then, something from someone, out of nowhere, happens which sends us back to the moon. The Wall Observers can't believe their eyes. We've broken another ATH.Seriously now, do you actually believe:There are people who know such stuff, and if there are,do they have a single reason to inform you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}