{
  "id": "topic_5463248",
  "title": "GrLinkey",
  "author": "GrLinkey",
  "created_time": "August 14, 2023, 02:50:15 PM",
  "content": "Мне нужно купить VPN с Dedicated IP. Год назад покупал это у Private Internet Access, платил биткоинами (они дали адрес и я перевёл с Bitvoint Core). Теперь попробовал повторить и оказалось, что так не получится: у них в вариантах только какой-то Bitpay. Сказали, платить можно только через Bitpay. Я пока не очень разобрался, что это такое - клиент, криптобиржа или что-то другое?Возможно я догадываюсь, о чём речь: на Западе закручивают гайки и требуют деанонимизации платежей, поэтому платить приходится через такого посредника. Но в остальном я совсем не разбираюсь в теме, просветите пожалуйста.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463248",
  "comments": [
    {
      "author": "GrLinkey",
      "created_time": "August 15, 2023, 09:28:28 AM",
      "body": "Quote from: Ratimov on August 14, 2023, 02:53:22 PMQuote from: GrLinkey on August 14, 2023, 02:50:15 PMСказали, платить можно только через Bitpay. Я пока не очень разобрался, что это такое - клиент, криптобиржа или что-то другое?Это платежный шлюз, многие сервисы не принимают напрямую битки для оплаты тех или иных услуг, а привлекают платежные процессоры, такие как bitpay, moonpay, coinprocessor, сoigate, итд. Их множество. В фиатных платежках также привлекаются процессоры, типо робокассы, фрикассы, итд.Платёжные Биткоин СистемыКриптопроцессинг: как это работает, кому и зачем он нуженНу можно краткий ликбез, что такое платежный шлюз? Я буду слать со своего Bitcoin Core биткоины на Bitpay, а он будет пересылать моему VPN сервису?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "August 15, 2023, 02:45:45 PM",
      "body": "Quote from: GrLinkey on August 15, 2023, 09:28:28 AMНу можно краткий ликбез, что такое платежный шлюз? Я буду слать со своего Bitcoin Core биткоины на Bitpay, а он будет пересылать моему VPN сервису?Ratimov в общем-то ответил на ваш вопрос, ваш VPN провайдер пользуется услугами BitPay для менеджмента приема платежей, конвертации валют, возможных рефундов и так далее. Но если прием криптоввлют доступен только через BitPay, то возможно стоит отказаться от подобного VPN провайдера. Он должен обеспечивать пользователям конфиденциальность, помогать бороться с последствиями санкций или решений диктаторов, а вместо этого он нанимает худший сервис на Земле, который не даст вам вздохнуть без дополнительного KYC, который вы как подсанкционный пользователь можете и не пройти. Это явно не забота о конфиденциальности, а наоборот торговля вашими данными. Я бы избегал этого дерьма.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "August 15, 2023, 03:18:05 PM",
      "body": "Quote from: witcher_sense on August 15, 2023, 02:45:45 PM а вместо этого он нанимает худший сервис на Земле, который не даст вам вздохнуть без дополнительного KYC, который вы как подсанкционный пользователь можете и не пройти. Не пугайте новичков.Bitpay требует  KYC только для транзакций свыше 1000 EUR.Всё что меньше 1000 KYC не требует.Cтоимость даже двухгодичной VPN подписки намного меньше.Сервис нормальный. У меня к нему нареканий никогда не было.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "August 15, 2023, 03:47:41 PM",
      "body": "Quote from: satscraper on August 15, 2023, 03:18:05 PMQuote from: witcher_sense on August 15, 2023, 02:45:45 PM а вместо этого он нанимает худший сервис на Земле, который не даст вам вздохнуть без дополнительного KYC, который вы как подсанкционный пользователь можете и не пройти. Не пугайте новичков.Bitpay требует  KYC только для транзакций свыше 1000 EUR.Всё что меньше 1000 KYC не требует.Cтоимость даже двухгодичной VPN подписки намного меньше.Сервис нормальный. У меня к нему нареканий никогда не было.Может мне так везло, но они требовали с меня создание аккаунта и прохождения верификации для абсолютно любой, даже ничтожной суммы, поэтому я их услугами не разу не воспользовался. Кстати, именно благодаря BitPay я так и не приобрел Ledger Nano X в одну из черных пятниц, так что может они помогли мне сэкономить. А вообще, новичкам полезно будет насторожиться и воспользоваться поиском перед использованием подобного сервиса. К примеру, в https://bitcointalk.org/index.php?topic=5381043.0 перечислены основные проблемы с BitPay, часть из которых более чем актуальна на данный момент.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "August 15, 2023, 10:48:30 PM",
      "body": "У меня Bitpay был привязан к ИМ, пришлось с ними распрощаться после того, как начали дергать по каждой транзакции от клиентов. Quote from: witcher_sense on August 15, 2023, 02:45:45 PM без дополнительного KYC, который вы как подсанкционный пользователь можете и не пройти. Это явно не забота о конфиденциальности, а наоборот торговля вашими данными. Я бы избегал этого дерьма.О каком KYC идет речь? Для того, чтобы оплатить ВПН, необходимо просто отправить битки на адрес, который указал Bitapy. Странно, что у вас такой опыт.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "August 16, 2023, 03:32:40 PM",
      "body": "Я поставил Bitpay на планшет, и он показывает баланс 0.0. Т.е. это по сути обычный клиент? Мне надо перевести на него с Bitcojn core, и потом с него провайдеру VPN?И повторю свой вопрос про причину появления Bitpay. Правильно ли я понял, что его ввели для борьбы с анонимностью?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "August 17, 2023, 08:12:13 AM",
      "body": "Quote from: GrLinkey on August 16, 2023, 03:32:40 PMПравильно ли я понял, что его ввели для борьбы с анонимностью?Нет, не правильно) Это просто удобнее для сервиса, который оказывает вам услуги) Это я вам говорю как в прошлом владелец интернет магазина)Разве только борьба с анонимностью владельцев сервисов   GrLinkey, Вы каким-то прям черными делами промышляете?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "August 19, 2023, 10:35:53 AM",
      "body": "Прошу прощения за профанство, но я по-прежнему не понимаю как этим пользоваться. VPN провайдер сгенерировал мне QR код для платежа. Я его отсканировал, получил ссылку, кликнул по этой ссылке на планшете (на нём поставлен Bitpay) и он перевёл меня к сайту bitpay, а не к приложению.1) Правильно ли я понял, что можно пользоваться как сайтом, так и приложением bitpay на устройстве, разницы особой нет;2) И далее всё-таки не так что bitpay это кошелёк на который надо сначала закинуть биткоины с компьютера, потом появится баланс и с этого баланса можно будет заплатить за VPN?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "August 19, 2023, 01:02:19 PM",
      "body": "Quote from: Ratimov on August 19, 2023, 10:46:53 AMQuote from: GrLinkey on August 19, 2023, 10:35:53 AMПрошу прощения за профанство, но я по-прежнему не понимаю как этим пользоваться. VPN провайдер сгенерировал мне QR код для платежа. Я его отсканировал, получил ссылку, кликнул по этой ссылке на планшете (на нём поставлен Bitpay) и он перевёл меня к сайту bitpay, а не к приложению.1) Правильно ли я понял, что можно пользоваться как сайтом, так и приложением bitpay на устройстве, разницы особой нет;2) И далее всё-таки не так что bitpay это кошелёк на который надо сначала закинуть биткоины с компьютера, потом появится баланс и с этого баланса можно будет заплатить за VPN?Дай ссылку на сайт VPN, который ты хочешь купить, я тебе покажу, как надо оплатить, иначе этот разговор бесконечно будет продолжаться.https://www.privateinternetaccess.comp.s. всё-таки отмечу, что я задал конкретные вопросы, на них можно ответить \"да\" или \"нет\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}