{
  "id": "topic_5466779",
  "title": "Eoveriero",
  "author": "Eoveriero",
  "created_time": "September 14, 2023, 11:58:55 AMLast edit: September 22, 2023, 02:26:04 PM by Eoveriero",
  "content": "Fortunejack scam me for 279.6 usdtCashback bonus on my 3rd deposit 20%Fortunejack does not immediately credit the bonus to your balance. He awards a bonus in the form of “free money”. This money still needs to be bet and only if you win, the money will be transferred to the balance.Fortunejack figured out how to deceive its users (perhaps this is an unaccounted for situation) - it credits this same bonus money, but makes the possible maximum bet less than the bonus amount! And after this, the bonus cannot be used because a message pops up that the bet size is too high! Also, you cannot split the bonus into parts.I wrote to the casino support asking why you apply restrictions to bonus money? And you create a system in which you are, in fact, a fraudster! But I never received a clear answer.I lost a large amount of money and I am entitled to this bonus!I also asked Fortunejack to resolve this issue and suggested several options for a solution:1. cancel the maximum bet limit on bonus money2. credit bonus money to the balance with the requirement of a 1x wager - in fact, these are similar conditions, only there I will be able to place bets at 0.5USDT and although it will be terribly uncomfortable, it will be possible to take advantage of my bonus!Fortunejack replied that everything was according to the rules and that nothing could be done!I want to clarify that it is normal if the office wants to limit the size of the bet or refuse a bonus. But in this situation, the bonus was offered to me and at the moment when I activated it, they promised it to me! And what Fortunejack did was a bonus scam! He kind of gave it to me, but at the same time it’s impossible to use!Fortunejack does not need to look for someone to blame on a third party! There are only two sides: Me and the Casino. And in the example I described, the casino created the conditions under which fraud with a bonus occurs on the part of the casino!I offered you honest options to solve the problem!Now it remains for the casino side to decide what to do - you can do evenly as I wrote to you above. Or you can use this scam to enrich yourself!Your reputation will depend on your decision!Bonus amount 279.6USD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466779",
  "comments": [
    {
      "author": "Mahdirakib",
      "created_time": "September 14, 2023, 01:06:50 PM",
      "body": "Quote from: Eoveriero on September 14, 2023, 11:58:55 AMCashback bonus on my 3rd deposit 20%Fortunejack does not immediately credit the bonus to your balance. He awards a bonus in the form of “free money”. This money still needs to be bet and only if you win, the money will be transferred to the balance.Have you checked the terms of the bonuses properly before taking it? Probably, you have lost your deposit in sports betting and received the 'free money' as cashback, which can be used in sports betting only with at least 1.40× odds.Quote from: https://fortunejack.com/promotions/welcome-offers● Reward from sport loses will be credited as a “free money” directly in sportsbook and can be used in sports betting.● Free money is only available on selections with odds of 1.40 or above.Quote from: Eoveriero on September 14, 2023, 11:58:55 AM~snip~ it credits this same bonus money, but makes the possible maximum bet less than the bonus amount! And after this, the bonus cannot be used because a message pops up that the bet size is too high!279.6 USDT isn't a big amount, FortuneJack accept a bigger bet than this in sports event. Are you limited by the sportsbook odds provider of FortuneJack? Can you share the screenshot of the error message which isn't allowing you to place the bets on the sports event?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eoveriero",
      "created_time": "September 14, 2023, 01:56:28 PM",
      "body": "Quote from: Mahdirakib on September 14, 2023, 01:06:50 PMQuote from: Eoveriero on September 14, 2023, 11:58:55 AMCashback bonus on my 3rd deposit 20%Fortunejack does not immediately credit the bonus to your balance. He awards a bonus in the form of “free money”. This money still needs to be bet and only if you win, the money will be transferred to the balance.Have you checked the terms of the bonuses properly before taking it? Probably, you have lost your deposit in sports betting and received the 'free money' as cashback, which can be used in sports betting only with at least 1.40× odds.Quote from: https://fortunejack.com/promotions/welcome-offers● Reward from sport loses will be credited as a “free money” directly in sportsbook and can be used in sports betting.● Free money is only available on selections with odds of 1.40 or above.Quote from: Eoveriero on September 14, 2023, 11:58:55 AM~snip~ it credits this same bonus money, but makes the possible maximum bet less than the bonus amount! And after this, the bonus cannot be used because a message pops up that the bet size is too high!279.6 USDT isn't a big amount, FortuneJack accept a bigger bet than this in sports event. Are you limited by the sportsbook odds provider of FortuneJack? Can you share the screenshot of the error message which isn't allowing you to place the bets on the sports event?My maximum bet is very small. Much less than the freemoney bet. This is probably some kind of limitation. But it only appeared when I received this bonus!I ask fortunejack to do something about this!because such a situation makes it impossible to use my cashback! It's in my account now, but I can't use it!If it were possible to split it, then I would be able to place bets and spend the bonus.No matter how you describe it, for me it looks like this - I made bets, everything was fine. As soon as I received the bonus, they made conditions for me not being able to use it. Deception? or coincidence?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 14, 2023, 02:28:50 PM",
      "body": "OP I understand your pain but to be frank with you I really can not tell if this accusations of yours are real or fake because I can not see anything that proves you are saying or making a case with fortune Jack casino. All you have written are mere articles without back up to prove your points.I will advise you provide proof or facts backing up your accusations claims against fortuneJack casino. I see you are a newbie and can not upload pictures but you can still drop the link to the pictures here if you want the platform to look into your case otherwise it will just end up in speculations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "September 14, 2023, 02:32:19 PM",
      "body": "Quote from: Eoveriero on September 14, 2023, 01:56:28 PM~snip~I don't know how to address the issue. But FortuneJack is a reputable betting site, they will have some reasonable explanation of this issue. Were you able to bet more than $280 on sports betting in a single bet before receiving the cashback bonus? I think their representative has missed to read your post in their ANN thread. You should send them a PM with the link of this thread.BTW, as CryptSafe has said above. You have to provide some evidence here, as an example: the screenshot of your account bonus page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eoveriero",
      "created_time": "September 14, 2023, 02:50:31 PM",
      "body": "available bonus - https://prnt.sc/e6c-4lxldbAzbet limit for EPL, ManchesterCity - https://prnt.sc/Qhs03kT9JMMl",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hirishimogato",
      "created_time": "September 15, 2023, 05:34:01 PM",
      "body": "oh manI have exactly the same problem!only my story is even more confusing =(Fortunejack didn't credit me with the bonus at all!Fun fact: I checked the maximum bet size and it was fine! I just wanted to bet on an unpopular market and was wondering how much I could bet.At the same time, I contacted the support chat asking why I was not credited with the already activated bonus. The next day I was credited with part of the bonus. Then I wrote again, and in the end they credited me with the entire bonus. When I tried to place a bet, my limit was also greatly reduced, so there was no way to use the bonus!In my case, I know for sure that my maximum bet was reduced at the same time as the bonus was awarded! This looks like a bonus scam.Now I am corresponding with the support service, which tells me that nothing can be done!But I immediately give them the example that at first you didn’t give me any bonuses at all! Then they added the first part, then another. I currently have two active bonuses that cannot be used.I immediately asked the support that if you have already divided my bonus into two parts, then you can split it again, into many $2 bonuses, so that I can place bets!But they told me that nothing could be done!I keep messaging Fortunejack, but it sounds a lot like a bonus scam! I know for sure that before the bonus was credited, my maximum bet was high! And as soon as the bonus was credited, the maximum bet immediately became very low!Fortunejack writes that it’s all the provider’s fault! But in this example of mine, I immediately see that the issue can be resolved even now by split the bonus, but Fortunejack refuses to do so! Also, the fact that before the bonus there were no betting limits speaks of casino fraud!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "September 15, 2023, 06:23:20 PM",
      "body": "@OP there might be a way for you,i would suggest you to request support to issue the freebet in another crypto currencyI believe FJ limits are currency based and other cryptos should not have such low limits ,  unless they have specifically targeted your account limits over all cryptos (unlikely))Please try this and dont tell support why u are requesting specifically",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eoveriero",
      "created_time": "September 15, 2023, 07:07:34 PMLast edit: September 16, 2023, 09:52:49 PM by Mr. Big",
      "body": "Quote from: rohang on September 15, 2023, 06:23:20 PM@OP there might be a way for you,i would suggest you to request support to issue the freebet in another crypto currencyI believe FJ limits are currency based and other cryptos should not have such low limits ,  unless they have specifically targeted your account limits over all cryptos (unlikely))Please try this and dont tell support why u are requesting specificallyFor all cryptocurrencies, the maximum bet size has been reduced. Just checked.I also liked the option of dividing the bonus into small parts by 2usdt, I’m sure that the bookmaker’s employees can easily do this! Just like the other two options that I suggested earlier. The bookmaker has already been offered 3 options to solve this problem. But so far he doesn’t want to do this and I sincerely don’t understand why!All that remains is to hear the answer from the bookmaker’s representative. Yesterday and today he was online, but has not yet joined our conversation. Also today I wrote him a private message. I look forward to his comments and help in solving the problem.This \"freemoney\" available for 7 days. Now i have 4 DaysI asked the casino if you could divide the bonus into small parts and they replied that they could not do anything and said that they were so good, and that the provider was bad, he did it all!I would like to ask everyone a question - why do I place bets on Fortunejack, and if problems arise, then they do not bear responsibility and all the blame is shifted to the provider, about whom I know nothing!?On all possible sites dedicated to casinos, I will put one star for Fortunejack! But I will write that please transfer this unit to your provider! Of course, your reputation and rating will drop very much, but don’t think about it, this is for your provider!I will continue to wait for a response from a representative of the bookmaker Fortunejack. But if there is no clear answer, I will strive for Fortunejack to receive an red flag, with a warning about bonus fraud! But you understand, this is a flag specifically for your provider, Fortunejack itself is not to blame for anything! \"The casino is good, but the sports betting provider is a scammer\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 16, 2023, 05:35:14 AM",
      "body": "Is there no other game where you can spend the free bonus such as slots or house games?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godzilliy",
      "created_time": "September 16, 2023, 10:05:56 AM",
      "body": "I have quite a lot of experience interacting with bookmakers, and I can definitely say that if a bookmaker or provider has limited your account, then you will not receive any bonuses in the future either!1) If Fortunejack claims that the bonuses are awarded by the provider itself, then you should not have received any bonuses since the moment you were limited! And if you do receive them, then the bonus is awarded by Fortunejack. This means he can divide the allocated bonus into small parts without any problems!2) If the bonuses are awarded by the provider and he awarded them to you, it means that he did not limit you in any way! And Fortunejack himself made the bet limit! And he simply lies that the provider is to blame for everything.Of course, such a small amount that it’s hard to believe that everything was played out so cunningly. But if you imagine how many players will be deceived in this way in the future, then this can grow into a very large amount!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "September 16, 2023, 04:04:23 PM",
      "body": "Quote from: Eoveriero on September 14, 2023, 02:50:31 PMbet limit for EPL, ManchesterCity - ~snip~Have you tried other sports event? Occasionally, the max bet limit varies in different sports event.Quote from: NotATether on September 16, 2023, 05:35:14 AMIs there no other game where you can spend the free bonus such as slots or house games?I have quoted the terms of the cashback bonus above. The \"free money\" bonus from the 3rd deposit cashback is only available to use in sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eoveriero",
      "created_time": "September 16, 2023, 04:45:23 PM",
      "body": "Quote from: Mahdirakib on September 16, 2023, 04:04:23 PMQuote from: Eoveriero on September 14, 2023, 02:50:31 PMbet limit for EPL, ManchesterCity - ~snip~Have you tried other sports event? Occasionally, the max bet limit varies in different sports event.Quote from: NotATether on September 16, 2023, 05:35:14 AMIs there no other game where you can spend the free bonus such as slots or house games?I have quoted the terms of the cashback bonus above. The \"free money\" bonus from the 3rd deposit cashback is only available to use in sports betting.This FreeMoney can only be used for sport bettingI tried different sports. the limit was very low in all of them.I'm shocked. I wrote a message in the Fortunejack topic. I wrote a private message to their representative. I also wrote a letter in support of Fortunjack, in which I invited their representative to join our conversation. I can see from his activity that he comes to the forum, but continues to ignore it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "September 16, 2023, 06:34:16 PM",
      "body": "Quote from: Eoveriero on September 16, 2023, 04:45:23 PMQuote from: Mahdirakib on September 16, 2023, 04:04:23 PMQuote from: Eoveriero on September 14, 2023, 02:50:31 PMbet limit for EPL, ManchesterCity - ~snip~Have you tried other sports event? Occasionally, the max bet limit varies in different sports event.Quote from: NotATether on September 16, 2023, 05:35:14 AMIs there no other game where you can spend the free bonus such as slots or house games?I have quoted the terms of the cashback bonus above. The \"free money\" bonus from the 3rd deposit cashback is only available to use in sports betting.This FreeMoney can only be used for sport bettingI tried different sports. the limit was very low in all of them.I'm shocked. I wrote a message in the Fortunejack topic. I wrote a private message to their representative. I also wrote a letter in support of Fortunjack, in which I invited their representative to join our conversation. I can see from his activity that he comes to the forum, but continues to ignore it!I  would suggest to keep pushing this on their ANN thread as well as  their socials,  Limiting you is fine but they owe you that bonus and should offer alternatives if sports freebet is not possible.FYI , they have a pretty active discord where some admins/staff (ADante,Tokash) are active so i would advise to try  to talk to them there directly as well",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "September 16, 2023, 08:00:25 PM",
      "body": "I am posting updated links to the images you have posted. They are not showing in threads directly from the prnt.sc website therefore I have uploaded them elsewhere in order for them to appear here.--------------------Quote from: Eoveriero on September 16, 2023, 04:45:23 PMThis FreeMoney can only be used for sport bettingI tried different sports. the limit was very low in all of them.I'm shocked. I wrote a message in the Fortunejack topic. I wrote a private message to their representative. I also wrote a letter in support of Fortunjack, in which I invited their representative to join our conversation. I can see from his activity that he comes to the forum, but continues to ignore it!I am not yet stating my position on this scam accusation until I look in to matter further but after reading your posts I do have a question. Now that you are stating FortuneJack are ignoring you and by that you mean there is no solution or resolution in sight, what do you intend to do next?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZuitaBuild",
      "created_time": "September 17, 2023, 03:18:20 AM",
      "body": "FortuneJack is scamming a lot of people,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eoveriero",
      "created_time": "September 17, 2023, 08:01:01 AM",
      "body": "Quote from: JollyGood on September 16, 2023, 08:00:25 PMI am posting updated links to the images you have posted. They are not showing in threads directly from the prnt.sc website therefore I have uploaded them elsewhere in order for them to appear here.https://i.postimg.cc/3JzsJFxM/Eoveriero1-Copy.png--------------------https://i.postimg.cc/rwWvdRDD/Eoveriero2-Copy.pngQuote from: Eoveriero on September 16, 2023, 04:45:23 PMThis FreeMoney can only be used for sport bettingI tried different sports. the limit was very low in all of them.I'm shocked. I wrote a message in the Fortunejack topic. I wrote a private message to their representative. I also wrote a letter in support of Fortunjack, in which I invited their representative to join our conversation. I can see from his activity that he comes to the forum, but continues to ignore it!I am not yet stating my position on this scam accusation until I look in to matter further but after reading your posts I do have a question. Now that you are stating FortuneJack are ignoring you and by that you mean there is no solution or resolution in sight, what do you intend to do next?Maybe I was too hasty in accusing him of fraud. I was very angry, the time after which my bonus will disappear is ticking. My conclusion is based on the answers from semi-robots from technical support. For a final conclusion, I need to wait for a response from a Fortunejack representative. I can also assume that the company representative did not leave his comment due to the fact that it is the weekend and people who can solve this problem are simply not in touch. I can also assume that Fortunjack himself does not know that a similar problem may arise with the bonus, that it cannot be used due to coincidences of factors.The final conclusion can be made after the comments of the Fortunejack representative! I am sure that such a large casino will not hide because of 279.6USD. I'm sure I'll hear an answer within the next week.You ask what I will do if the bookmaker does not answer or does not consider it necessary to solve my problem?!1. I know that on the Bitcointalk forum there is an opportunity to give a company a red flag if fraud is proven. + I will gather a group of victims and this will be a collective complaint about fraud!2. I will write complaints on other sites like AskGamblers and the like. All this will be accompanied by negative reviews with a minimum rating.3. I will create a template for action for new victims! They won’t have to search like I did and think about what to do. This template will list the sequence of actions and all forums where you will need to leave a complaint and open a dispute.Nowadays there are a huge number of casinos! Especially if we are talking about casinos with cryptocurrency, this means that users are advanced and can choose which casino to play in. A casino with a low rating will be immediately ignored for selection. And I promise that if Fortunjack does not resolve this issue, then the rating will be as low as possible!Will I contact any gambling regulators? Of course not! I read the rules of the casino, and it turns out that the casino has the right to do whatever it wants with your money and any action is prescribed and permitted by the rules with which we agree! By the way, this is one of the reasons why there are so many scammer casinos and it is impossible to close them. But the reputation of the casino is much more valuable! It is the reputation of the casino that has been working for many many years.I can write a lot about what will happen if... I’m just waiting for an answer from Fortunejack’s representative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 17, 2023, 11:28:27 AM",
      "body": "Quote from: Eoveriero on September 17, 2023, 08:01:01 AM[...]You ask what I will do if the bookmaker does not answer or does not consider it necessary to solve my problem?!1. I know that on the Bitcointalk forum there is an opportunity to give a company a red flag if fraud is proven. + I will gather a group of victims and this will be a collective complaint about fraud!2. I will write complaints on other sites like AskGamblers and the like. All this will be accompanied by negative reviews with a minimum rating.3. I will create a template for action for new victims! They won’t have to search like I did and think about what to do. This template will list the sequence of actions and all forums where you will need to leave a complaint and open a dispute.Nowadays there are a huge number of casinos! Especially if we are talking about casinos with cryptocurrency, this means that users are advanced and can choose which casino to play in. A casino with a low rating will be immediately ignored for selection. And I promise that if Fortunjack does not resolve this issue, then the rating will be as low as possible!Will I contact any gambling regulators? Of course not! I read the rules of the casino, and it turns out that the casino has the right to do whatever it wants with your money and any action is prescribed and permitted by the rules with which we agree! By the way, this is one of the reasons why there are so many scammer casinos and it is impossible to close them. But the reputation of the casino is much more valuable! It is the reputation of the casino that has been working for many many years.I can write a lot about what will happen if... I’m just waiting for an answer from Fortunejack’s representative.You don't need to file a \"class action\" to raise a flag. If you have a case and the DTs find your evidences are compelling and reasonable [some will prefer to have it beyond doubt], they'll support. For the time being, I agree that the best way is to wait and see if they'll response, there's a chance it's just a... glitch, or probably multiple things simply coincided.I read correctly that your \"normal\" bets are also limited? Not only the bets with Free Money? Is it possible that they're asking for KYC? It's quite a known practice for a platform to limit someone's bet during a KYC process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "September 17, 2023, 12:03:31 PM",
      "body": "Quote from: ZuitaBuild on September 17, 2023, 03:18:20 AMFortuneJack is scamming a lot of people, Do you have any evidence to back up your claim? It is very easy to post about allegations but can you provide evidence to demonstrate if what you are stating is even true?Quote from: Eoveriero on September 17, 2023, 08:01:01 AMMaybe I was too hasty in accusing him of fraud. I was very angry, the time after which my bonus will disappear is ticking. My conclusion is based on the answers from semi-robots from technical support. For a final conclusion, I need to wait for a response from a Fortunejack representative. I can also assume that the company representative did not leave his comment due to the fact that it is the weekend and people who can solve this problem are simply not in touch. I can also assume that Fortunjack himself does not know that a similar problem may arise with the bonus, that it cannot be used due to coincidences of factors.The final conclusion can be made after the comments of the Fortunejack representative! I am sure that such a large casino will not hide because of 279.6USD. I'm sure I'll hear an answer within the next week.If you are assuming you did not receive a reply from FortuneJack because of the weekend and you are sure you will hear from them within the next week, you should probably consider refraining from writing here until then or unless there is a specific need. Hopefully the matter will conclude in the way it should with complete fairness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eoveriero",
      "created_time": "September 18, 2023, 05:15:04 PM",
      "body": "Quote from: holydarkness on September 17, 2023, 11:28:27 AMQuote from: Eoveriero on September 17, 2023, 08:01:01 AM[...]You ask what I will do if the bookmaker does not answer or does not consider it necessary to solve my problem?!1. I know that on the Bitcointalk forum there is an opportunity to give a company a red flag if fraud is proven. + I will gather a group of victims and this will be a collective complaint about fraud!2. I will write complaints on other sites like AskGamblers and the like. All this will be accompanied by negative reviews with a minimum rating.3. I will create a template for action for new victims! They won’t have to search like I did and think about what to do. This template will list the sequence of actions and all forums where you will need to leave a complaint and open a dispute.Nowadays there are a huge number of casinos! Especially if we are talking about casinos with cryptocurrency, this means that users are advanced and can choose which casino to play in. A casino with a low rating will be immediately ignored for selection. And I promise that if Fortunjack does not resolve this issue, then the rating will be as low as possible!Will I contact any gambling regulators? Of course not! I read the rules of the casino, and it turns out that the casino has the right to do whatever it wants with your money and any action is prescribed and permitted by the rules with which we agree! By the way, this is one of the reasons why there are so many scammer casinos and it is impossible to close them. But the reputation of the casino is much more valuable! It is the reputation of the casino that has been working for many many years.I can write a lot about what will happen if... I’m just waiting for an answer from Fortunejack’s representative.You don't need to file a \"class action\" to raise a flag. If you have a case and the DTs find your evidences are compelling and reasonable [some will prefer to have it beyond doubt], they'll support. For the time being, I agree that the best way is to wait and see if they'll response, there's a chance it's just a... glitch, or probably multiple things simply coincided.I read correctly that your \"normal\" bets are also limited? Not only the bets with Free Money? Is it possible that they're asking for KYC? It's quite a known practice for a platform to limit someone's bet during a KYC process.all bets for all sports limited. No ask KYC process.Today I received another response from Fortunejack in which they refuse to help me. They also wrote that from today they will deprive my account of the opportunity to use bonuses! This is apparently the last word on which they don’t leave me a chance to use my cashback at all.Also, a representative from Fortunjack visits the site every day, but refuses to comment on the situation. Although I already wrote in private messages and in the topic and also by email to Fortunejack.Fortunejack offered me a bonus, after fulfilling the conditions for the bonus, he simply deprived me of the bonus! Fortunejack uses bonus scams!Starting today, I am going to create a request to issue Fortunjack a red flag and I ask all victims to join the complaint!!!I also ask experienced users to explain how this is done! Because I’m not very good at this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}