{
  "id": "topic_5448541",
  "title": "elevates",
  "author": "elevates",
  "created_time": "April 12, 2023, 01:45:21 PM",
  "content": "A new day and a new bank fraud happened in India. As per my understanding, cooperative banks are regulated by the RBI. RBI being a regulator could not detect such a big fraud under its nose. You need to read this article to understand how much a bank can play with the money of its depositors.Just imagine if such a level of fraud was done by local crypto exchanges. Every mainstream media would have covered it. They would have blamed the exchange & the crypto community for all the wrongdoing. They always forget one thing before doing their media trial which is checking the facts. Do you know how many Banking frauds have happened in the past?Biggest Banking Frauds In the last 10 years, there were 10 big banking frauds. These are the ones which were big. Think about those frauds that were of small amounts.  Such banking frauds in countries that are considered the first world, would have destroyed the reputation of a bank. That does not happen in India because Banks are everything and the government is never incorrect for most citizens.Why Indians still believe cryptocurrency is fraudBitcoin & other crypto have been projected by mainstream media as a commodity to get rich quickly after 2017 ATH. In 2018 scammers and those doing illegal activities started using it as a medium to earn INR. The government, RBI picked it up as illegal without even doing research and stamped it as not safe for Indians. This is why still a big majority is not interested in Bitcoin or other cryptos. RBI will only do what the government likes and where its interest lies. They will allow such fraud and when questioned they would say \"We were aware but we were unable to prove it\". It is a never ending cycle that might get broken by Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448541",
  "comments": [
    {
      "author": "pawanjain",
      "created_time": "April 12, 2023, 04:50:16 PM",
      "body": "This is a really good point. These banks be like they are god and they want to have total control over everything but cannot do so because of bitcoin.This is the foremost reason why they hate cryptocurrencies but what about the flaws with their own system.If we look at the history then we can observe several flaws in the traditional financial system yet they want to ban crypto usage in India.Another major reason is the media as mentioned in OP. It's true that a majority of Indians still believe everything what's mentioned in the news.Although the trend is changing recently and people are shifting towards news obtained from social media but the fact is that the first impression of cryptocurrencies has already been implicated badly on people by the mainstream media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "April 13, 2023, 03:05:39 AM",
      "body": "A lot has been improved and a lot needs to be improved in the Indian Banking sector. I agree if such fraud was caught on an Indian cryptocurrency exchange then the coverage of Indian media would have been tenfold. Bank fraud would happen in the future too due to corruption within the banking system. A lot has changed since 2014 now we are hearing about bank frauds but before that time we would rarely read or hear that Banks also committed fraud. The reason why Indians do not trust cryptocurrency is because of its volatility and uncertainty. Another reason is that we Indians are very reluctant in accepting anything new. It would take time for Indians to understand the true potential of cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "April 13, 2023, 04:14:47 AM",
      "body": "do not worry my friend, mudiji will fix it all..  the cost of petrol and gas will be soon increased more and that will recover it all.also, elections are next year, no news broadcast would dare show any thing..that might jeopardize the winning plan u know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}