{
  "id": "topic_5440778",
  "title": "LowRezStudios",
  "author": "LowRezStudios",
  "created_time": "February 22, 2023, 03:21:46 AMLast edit: February 27, 2023, 09:21:02 PM by LowRezStudios",
  "content": "Hello bitcoiners!We over at LowRezStudios would love to know the best place to post art.On the home page of the forum, we tried CTRL+F and typed in \"art\", to no avail of any art related board. Are you guys open to adding a dedicated place for art? Is that dedicated place the Off-Topic board?Thank you and God bless.<3EDIT: Thank you everyone who answered.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440778",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "February 22, 2023, 03:25:56 AM",
      "body": "Art related to what? So you want to sell art service or do your project has anything to do with cryptocurency. If no option is correct from the above, off topic is the place since everything goes there.If you are selling art services, create topic in service board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "February 22, 2023, 03:39:41 AM",
      "body": "I think you should explain in more detail what you mean. If you have an art-related project, perhaps like an NFT, you can go to the altcoin announcements section.I tried to search with your project name. several sources related to the game project. but I'm still not sure what you mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 22, 2023, 03:42:56 AM",
      "body": "I assume you're going to post art for the purpose of selling graphics design services or something similar.If so, post on the Service Announcements section instead: https://bitcointalk.org/index.php?board=84.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "February 22, 2023, 03:43:40 AM",
      "body": "If your art doesn't have any relation with Bitcoin, post it on Off topic section.If your art have Bitcoin theme and doesn't have any intention to sell it, post it on Bitcoin Discussion section.If you want to sell your art, you can post it on Goods or Collectibles sections.If you're offering art service, you can post in on Service discussion section.If you mean art is NFT, you can post it on Altcoins section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "February 22, 2023, 03:49:08 AM",
      "body": "Quote from: LowRezStudios on February 22, 2023, 03:21:46 AMHello bitcoiners!We over at LowRezStudios would love to know the best place to post art.On the home page of the forum, we tried CTRL+F and typed in \"art\", to no avail of any art related board. Are you guys open to adding a dedicated place for art? Is that dedicated place the Off-Topic board?Thank you and God bless.Bitcoin Forum is a huge marketplace to promote all kinds of art, NFT, services and projects. You can promote your art on any of the marketplace boards below. But if your service is physical then you can promote Goods & Collectibles or you can promote your Art on the service.ServicesGoodsDigital goodsCollectibles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "February 22, 2023, 09:31:54 AM",
      "body": "Quote from: LowRezStudios on February 22, 2023, 03:21:46 AMwould love to know the best place to post art.It all depends on which type of art you're referring to here, if it's all about bitcoin art works  then it's welcome on the forum's Meta, beginners and help or bitcoin discussion boards, but if the purpose of your art is to advertise your business or organization then you need to use the service announcement board for doing that.Quote from: LowRezStudios on February 22, 2023, 03:21:46 AMOn the home page of the forum, we tried CTRL+F and typed in \"art\", to no avail of any art related board. There's no board specifically assigned to that.Quote from: LowRezStudios on February 22, 2023, 03:21:46 AMAre you guys open to adding a dedicated place for art?There may not be a dedicated place for arts but just as being said earlier, you need to define the purpose of your art with the content before finding a suitable board it may fit in.Quote from: LowRezStudios on February 22, 2023, 03:21:46 AMIs that dedicated place the Off-Topic board?Every off topic or threads posted on the wrong board ended up here, but i can tell you that we've got alot of art contest thread nit ended up being on off topic because they were always on point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "February 22, 2023, 03:58:49 PM",
      "body": "Quote from: LowRezStudios on February 22, 2023, 03:21:46 AMHello bitcoiners!We over at LowRezStudios would love to know the best place to post art.From the google search I found an youtube channel as mentioned here so based on the contents posted there the appropriate section to post your arts are off topic.If the reasons are different and have something to do with bitcoin or providing service the answer is already posted by @Jawhead999",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LowRezStudios",
      "created_time": "February 27, 2023, 07:22:31 PMLast edit: February 27, 2023, 09:19:46 PM by LowRezStudios",
      "body": "Quote from: Little Mouse on February 22, 2023, 03:25:56 AMArt related to what? So you want to sell art service or do your project has anything to do with cryptocurency. If no option is correct from the above, off topic is the place since everything goes there.If you are selling art services, create topic in service board.Thank you!Quote from: Jawhead999 on February 22, 2023, 03:43:40 AMIf your art doesn't have any relation with Bitcoin, post it on Off topic section.If your art have Bitcoin theme and doesn't have any intention to sell it, post it on Bitcoin Discussion section.If you want to sell your art, you can post it on Goods or Collectibles sections.If you're offering art service, you can post in on Service discussion section.If you mean art is NFT, you can post it on Altcoins section.Double thank you! lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}