{
  "id": "topic_5404976",
  "title": "OgNasty",
  "author": "OgNasty",
  "created_time": "July 02, 2022, 10:01:26 PM",
  "content": "Mr Beast makes a joke about Bitcoin in new video. You can see it around the five minute mark in the below link. It’s a lighthearted joke but it still hurts. Lol. Remember it wasn’t too long ago Mr Beast was doing a video with Coinbase and giving away Bitcoin to his fans. Enjoy!Mr Beast - I DIDNT EAT FOOD FOR 30 DAYShttps://youtu.be/vaIgyRoUkQI",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404976",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 02, 2022, 10:23:07 PM",
      "body": "A time is coming when it would turn to eating carb food daily with other nutrients needed for weightier body, maybe bitcoin would hit over $100000 by that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 02, 2022, 10:32:59 PM",
      "body": "I have noticed that a lot of people from outside of crypto have been making fun of it recently, something that didn't happen in 2018. This means that a lot more people are aware of crypto these days than before. This mocking from wider public could be somewhat demoralizing to Bitcoiners, but it won't last long, because people will lose interest. And then during the next big bull run Bitcoiners will be laughing at people who are laughing at them now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "niceli",
      "created_time": "July 02, 2022, 10:50:58 PM",
      "body": "Lmao, is he wrong tho?  I think it is actually quite good, because it shows that he is following bitcoin  and considering his coinbase deal, I think he probably owns some as well. This dude probably worths tens of millions of dollars and him being interested in bitcoin is not weird neither. He is like 20 something, quite young so for investment he might choose bitcoin. Hence, even though he still has a lot of money, he may have lost some in bitcoin this year, and its a joke showing proof of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 02, 2022, 10:52:41 PM",
      "body": "punchline of video, for those that didnt watch:he done a 30day without eating challenge and charted his weight loss and compared the down chart to bitcoin pricesas for those disheartened or thinking its bad news about the price correcting down to value.. the ATH price was never a amount of stable value that should have remained.it was not an amount everyone should have bought in at.. it was one of this cycles BUBBLE high. a temporary blip of absurdly massive speculation above value.. it was a premium too many people think the price should have been at $70k and anything below that as bad..its actually the reverse. the LOW is the important number. going so high so fast so extreme is not a good sign. people shouldnt be buying the high. going high so fast should be the shocking bad news time where people need to stop buying and back away in fear..the correction is a good sign and a good opportunity. the underlying value does rise.. but not to the extent and speed of the speculative temporary bubble ATH'si find it funny how loads of people call it a CRASH or a down market or a recession.. no. its actually a correction from a bubble. being back at value is a good thing. ..imagine the chart like watching the retail price of an iphone depending on the seasons. where it goes stupidly high in peak seasons and discounts in the sales season.. never buy iphone at its peak price. and celebrate when you see the price come down in discount season.yes each years new version of the iphone will be more expensive value than previous.. but never then wait for the peak season premium price to buy it, celebrate the 'on-sale' /discount season to buy oneseeing the price of iphones coming down is a good thing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "July 02, 2022, 11:32:46 PM",
      "body": "Is the human body strong in 30 days without eating? just to attract the audience including me to capture the screen just to see the joke. Maybe in 2 to 3 days, the body will be weak due to decreased glucose and glycogen production, and the muscles will be like an old grandpa. It's hard to make fun of back when we weren't as rich as Beast but at least for the Bitcoin bull run, we can chuckle in the comments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 03, 2022, 02:31:00 AM",
      "body": "piggybacking on Mr Beast's bad joke with 2010 humor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minor Miner",
      "created_time": "July 03, 2022, 03:35:32 AM",
      "body": "Quote from: hatshepsut93 on July 02, 2022, 10:32:59 PMI have noticed that a lot of people from outside of crypto have been making fun of it recently, something that didn't happen in 2018. This means that a lot more people are aware of crypto these days than before. This mocking from wider public could be somewhat demoralizing to Bitcoiners, but it won't last long, because people will lose interest. And then during the next big bull run Bitcoiners will be laughing at people who are laughing at them now.Their mocking it, and their gloating when the price of bitcoin plummets, but surely their joy will not last long, the bear season will have to end and we will have the opportunity to do it against them.  Some people who laugh at bitcoin because they hate people who got rich on bitcoin and they think they missed something and now they feel ashamed for not being equal to bitcoin holders. Once bitcoin is mass accepted they will take down the video soon they will be ashamed of what they did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 03, 2022, 03:37:53 AM",
      "body": "Quote from: Minor Miner on July 03, 2022, 03:35:32 AMTheir mocking it, and their gloating when the price of bitcoin plummets, but surely their joy will not last long, the bear season will have to end and we will have the opportunity to do it against them.  Some people who laugh at bitcoin because they hate people who got rich on bitcoin and they think they missed something and now they feel ashamed for not being equal to bitcoin holders.Jeebus dude, he just made a very light joke about the price. Don't be too negatively affected by it. I'm a huge long-term bitcoin bull and I make jokes like this all the time.Quote from: Minor Miner on July 03, 2022, 03:35:32 AMOnce bitcoin is mass accepted they will take down the video soon they will be ashamed of what they did.Sure, he's going to take down a video he spent effort on and make a lot of money with just so he can hide his \"bitcoin go down\" joke. Get a grip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 03, 2022, 05:06:36 AM",
      "body": "Not a fan but not eating for 30 days is really challenging. Except he eats chocolates and in 14th day he ate Gordon Ramsay's burger which they shaved his head. Well that's the whole spoiler. The mention of BTC is not really something that is discussed in the video but yep he is mocking what the price had become.  I once saw a video of him years ago which was also posted in a thread. Mr. Beast have featured BTC many times I guess.Him having 97M subscribers can make him win a government position so this is guy is already rich, he is financially stable and does invest probably on stock market alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "July 03, 2022, 05:19:43 AM",
      "body": "Quote from: bittraffic on July 03, 2022, 05:06:36 AMNot a fan but not eating for 30 days is really challenging. Except he eats chocolates and in 14th day he ate Gordon Ramsay's burger which they shaved his head. Well that's the whole spoiler. The mention of BTC is not really something that is discussed in the video but yep he is mocking what the price had become.  I once saw a video of him years ago which was also posted in a thread. Mr. Beast have featured BTC many times I guess.Him having 97M subscribers can make him win a government position so this is guy is already rich, he is financially stable and does invest probably on stock market alone.Haven't really watched the full video yet but the content of the video of not eating for 30 days really is hard. I once did a diet called OMAD or \"One Meal a Day\" and it was hard especially for the first 3-7days as you'll feel too much hunger even after eating once a day.Anyways, you're correct the mention of bitcoin on the video isn't really a focus on it. It was somehow used as reference or comparison on the weigh lost chart of MrBeast. There's nothing really wrong about it and no offensive things has been said against bitcoin. Also, he is correct on this one since that is what the current crypto market looks like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 03, 2022, 06:52:42 AM",
      "body": "It's no joke! That's a hard truth in 2022. Bitcoin is indeed going down like crazy due to the bullish cycle. Mr. Beast is actually pretty heavily invested in bitcoin and he had made couple of videos on bitcoin earlier as well. Watch these videos: https://www.youtube.com/watch?v=qzD4fcd-FBYhttps://www.youtube.com/watch?v=-6nDPQNbEKsIt only hurts to see the truth that our bitcoin net worth is really really down at this moment. But I still believe in \"to the moon...\" statement!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "July 03, 2022, 12:09:22 PMLast edit: July 03, 2022, 01:22:54 PM by Leviathan.007",
      "body": "For the people who could watch the video so far, during this youtube video, a YouTuber named Mr beast tried the challenge of not eating anything for 30 days and compared the situation with the bitcoin and made fun of it. The whole story shows us how bitcoin is getting famous every day and many YouTubers and even the people who are out of the bitcoin and cryptocurrency world still know bitcoin even of the fun facts from funny videos like this one. I guess that's a big difference especially if you compare it to 2018 when the market also fell down to lower prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 03, 2022, 12:50:03 PM",
      "body": "Quote from: Leviathan.007 on July 03, 2022, 12:09:22 PMFor the people who could watch the video so far, during this youtube video, a YouTuber named Mr beast did the challenge of not eating anything for 30 days  You didn't watch the video, right?He failed, he only managed to get 14 days, he lost the challenge, so before explaining it to others do watch it yourself, all of it not just the title.Quote from: Minor Miner on July 03, 2022, 03:35:32 AMTheir mocking it, and their gloating when the price of bitcoin plummets, but surely their joy will not last long, the bear season will have to end and we will have the opportunity to do it against them.  Some people who laugh at bitcoin because they hate people who got rich on bitcoin and they think they missed something and now they feel ashamed for not being equal to bitcoin holders. Once bitcoin is mass accepted they will take down the video soon they will be ashamed of what they did.Bruh, you're just overreacting.What, I'm not allowed to make jokes about bitcoin now?Rather than the people who are making jokes hating the ones owning coins I feel like the ones that are holding coins are full of anger cause they are losing money right now and they are grabbing anyone who isn't singing bullish patriotic sounds by the throat.Go out and have some fresh air, and if you can't take a joke maybe this investment game is not for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "July 03, 2022, 01:20:31 PM",
      "body": "Quote from: OgNasty on July 02, 2022, 10:01:26 PMMr Beast makes a joke about Bitcoin in new video. You can see it around the five minute mark in the below link. It’s a lighthearted joke but it still hurts. Lol. Remember it wasn’t too long ago Mr Beast was doing a video with Coinbase and giving away Bitcoin to his fans. Enjoy!Mr Beast - I DIDNT EAT FOOD FOR 30 DAYShttps://youtu.be/vaIgyRoUkQILmao I checked it after you mentioned here. I usually watch Mrbeast's videos, but today I missed it. Thanks for sharing the link and timestamp.Really it proves that Mrbeast follows cryptos regularly and invest in Bitcoins.Not only he but also many friends of mine are taunting me about the price lol. As I always supported Bitcoins in these bear market, but they are the ones who always taunt me about holding the coins, when my asset is in red.Nevermind time will come , and again Bitcoins will rise towards 100k USD. Then these youtubers again to gain some fame will make hype about the same.Let's see what happens next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "July 03, 2022, 03:07:02 PM",
      "body": "Quote from: hatshepsut93 on July 02, 2022, 10:32:59 PMI have noticed that a lot of people from outside of crypto have been making fun of it recently, something that didn't happen in 2018. This means that a lot more people are aware of crypto these days than before. This mocking from wider public could be somewhat demoralizing to Bitcoiners, but it won't last long, because people will lose interest. And then during the next big bull run Bitcoiners will be laughing at people who are laughing at them now.Bitcoin just needs a reversal of trends to shut these offenders up.  They should make the best of their insult while they are on it.  But once the Bitcoin market is reversed, let us see who is talking  .  They might eat their words and change a few and start praising Bitcoin once again.Quote from: Nrcewker on July 03, 2022, 01:20:31 PMQuote from: OgNasty on July 02, 2022, 10:01:26 PMMr Beast makes a joke about Bitcoin in new video. You can see it around the five minute mark in the below link. It’s a lighthearted joke but it still hurts. Lol. Remember it wasn’t too long ago Mr Beast was doing a video with Coinbase and giving away Bitcoin to his fans. Enjoy!Mr Beast - I DIDNT EAT FOOD FOR 30 DAYShttps://youtu.be/vaIgyRoUkQILmao I checked it after you mentioned here. I usually watch Mrbeast's videos, but today I missed it. Thanks for sharing the link and timestamp.Really it proves that Mrbeast follows cryptos regularly and invest in Bitcoins.Not only he but also many friends of mine are taunting me about the price lol. As I always supported Bitcoins in these bear market, but they are the ones who always taunt me about holding the coins, when my asset is in red.Nevermind time will come , and again Bitcoins will rise towards 100k USD. Then these youtubers again to gain some fame will make hype about the same.Let's see what happens next.I used to watch his every video but was turned off when I noticed most of them are just staged especially the giving x amount of money. Btw, just let them (your friends) tease you, their fondness of teasing you will eventually stop for sure, and by that time you will be the one telling them \" I told you guys\" with a smirk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 03, 2022, 03:26:40 PM",
      "body": "Quote from: Charles-Tim on July 02, 2022, 10:23:07 PMA time is coming when it would turn to eating carb food daily with other nutrients needed for weightier body, maybe bitcoin would hit over $100000 by that time.  Maybe he is referring to some kind of long-term investment and they already know how bitcoin will eventually increase its price in the next years to come. In that case, I think they already have their share of investment in the crypto market, they just don't want to be transparent with it because of critics that will gonna ruin their career once something bad happened with the crypto market. Nevertheless, that joke is just one way to give your fans some ideas that you are aware of the bitcoins market situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 03, 2022, 05:38:56 PM",
      "body": "Quote from: yazher on July 03, 2022, 03:26:40 PMMaybe he is referring to some kind of long-term investment and they already know how bitcoin will eventually increase its price in the next years to come. In that case, I think they already have their share of investment in the crypto market, they just don't want to be transparent with it because of critics that will gonna ruin their career once something bad happened with the crypto market. Nevertheless, that joke is just one way to give your fans some ideas that you are aware of the bitcoins market situation. I checked and apparently Mr Beast invested $1.5 million into Bitcoin sometime prior to September 2021, but didn't specifcy when it seems (didn't acknowledge the current value of his investment back then). It doesn't look like he was attacking Bitcoin at all, as OP says it was a lighthearted joke at most. As a YouTuber who makes somewhere between $1m and $15m a year, I very much doubt he would of panic sold such a small position in Bitcoin at least. I imagine he would of otherwise referenced selling if he had.Bare in mind this is a YouTuber who will do contests that give away up to $1m on a regular enough basis, so seems more likely he'd be averaging in further to his investment if it's down imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "July 03, 2022, 07:19:20 PMLast edit: July 08, 2022, 08:42:09 PM by Ultegra134",
      "body": "Quote from: Minor Miner on July 03, 2022, 03:35:32 AMQuote from: hatshepsut93 on July 02, 2022, 10:32:59 PMI have noticed that a lot of people from outside of crypto have been making fun of it recently, something that didn't happen in 2018. This means that a lot more people are aware of crypto these days than before. This mocking from wider public could be somewhat demoralizing to Bitcoiners, but it won't last long, because people will lose interest. And then during the next big bull run Bitcoiners will be laughing at people who are laughing at them now.Their mocking it, and their gloating when the price of bitcoin plummets, but surely their joy will not last long, the bear season will have to end and we will have the opportunity to do it against them.  Some people who laugh at bitcoin because they hate people who got rich on bitcoin and they think they missed something and now they feel ashamed for not being equal to bitcoin holders. Once bitcoin is mass accepted they will take down the video soon they will be ashamed of what they did.Why are we so serious about it? Trust me, MrBeast has plenty of money and has no interest in mocking Bitcoin. He's literally making millions by going viral with his every video, while having multiple channels racking up millions of views every day. I even joke about Bitcoin with friends or groups, despite my money having lost more than 2/3 of their value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "July 03, 2022, 07:50:14 PM",
      "body": "I watch his videos but not yet this one. If it's a joke that's very light about the movement of bitcoin, he just said it out of his mouth and nothing serious about it. We're happy when bitcoin was mentioned in a series or movies. And when a big YouTuber mentions it, somehow negatively and lightly, it's not a problem because of its current situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}