{
  "id": "topic_5405158",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "July 04, 2022, 03:53:28 PM",
  "content": "There are so many reasons why users merit a post. Here is BlackHatCoiner meriting policy..QuoteMerit distribution.1-2 meritsIf your reply deserves a “like” or if I agree with it.If you reply to someone properly and shortly.If I want to thank you.3-5 meritsIf you ask something that will bring constructive discussion.If I learn something from you that I didn't know before.If you correct someone (including me) in a post that has made a technical mistake.If you reply constructively and smartly.6+ meritsIf you create a useful thread for a certain subject.If there's an excellent writeup.If your post really assisted me.Now my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405158",
  "comments": [
    {
      "author": "Mpamaegbu",
      "created_time": "July 04, 2022, 04:09:20 PM",
      "body": "I like the way BlackHatCoiner tabulated it but the problem would be if that user is going to always remember how they compartmentalized them at each merit giving opportunity.Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMThat you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins?I believe this option may be the last users have contemplated for worthy posts. They would rather splash enough merit on it if it saved their lives or assisted them greatly. May be for other worthy course, they would give sats. I haven't thought of sending anyone sats in place of merit myself, anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2022, 05:03:13 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMIf your reply deserves a “like” or if I agree with it.Although most of people do that, I also try to merit posts which I don't agree with if the post is useful for people who share that opinion. But basically, anyone can merit any post they want. You just can babuse the system (trading merits)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 04, 2022, 05:04:34 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? There are many impressive post here on bitcointalk that I have awarded merits because of how impressed I was with either the compusure or the information been passed across, or some other factors like me just feeling generous, however sending someone randomly bitcoins because I wasn't satisfied with what i gave them as merits to be honest is something that I have never considered doing, and it is definitely something rare for someone to do. I am not saying it is bad but I am saying it is not common. I have never done it but it is not something that I cannot do. Many as you have mentioned it now, perhaps one day i might.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "July 04, 2022, 05:14:56 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?No i have never done that and i would not do that, for me it has to stop at meriting the post, if you are so impressed by the post then you can send as much merits as you have on the post, prolly exhaust what you have, and if you do not have sufficient merits you can report the post to threads where unmerited and under-merited posts are being reported for consideration, if all of that isn't enough, you can bookmark the post and give merits to it when you have some smerits. But sending Bitcoins is not something i'd do. Mind you also that it's not all users that have their Bitcoin address in their profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 04, 2022, 06:22:48 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?When i first saw your oost from the beginning I thought it was all talking about meriting a post considering the quoted aspect of your from a member's adopted meriting pattern, now here on the forum I've seen alot of users whose wallet address appears on their profile, they do that not to beg but in cases whereby someone may want to anonymously send them bitcoin in appreciation for a well performance of any kind, a user may also have his personal reason for revealing his address on public as long as it does no harm on them, if you feels like leaving your address or sending to a user is your personal choice amd I don't think there's anything bad about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "July 04, 2022, 08:09:43 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMHere is BlackHatCoiner meriting policy..Now my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?Haven't gone through the speculative nature to which BlackHatCoiner awards merit, I think it's reasonable as such and from the fact that, people could actually come up with the idea of buying merits (which I won't agree that it happens, I don't support it and neither do the forum) it stretches to what length these merits are valued by those who needs it.I can't say I would do that nor have I ever had the intention but, I could donate to a just course if am moved. Other than that, I merit users as I see fit. After all, the smerits is of no use to me and as such, there is no use holding them. The forum way of appreciating a post is merit and so, merit is what they would get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 04, 2022, 08:22:01 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?The idea of donation is not as popular now as it used to be during the early days of the forum and Bitcoin. Members were more likely to donate to constructive replies/posts and to the forum as bitcoin's value was a lot lower and less popular.I have personally never actually donated to a user on the forum, but I've went to someone's profile and read through their post history in search of other good posts to merit because I stumbled on a post of theirs which was very educative (especially if it's not a user I'm used to)For more established users, I do not often visit their profile as I'm used to quality content from such users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "July 04, 2022, 08:23:43 PM",
      "body": "What I seen in some post and merit might not what another person see and merit Post. To render merit to user depends on the explanation of the users or the body composition of the article, by given you what you want. Secondly responding to a question that is unknown to users can equally attract a user who is filled with Smerit to exhaust it smerit for you. Really different persons have it regulations and it point someone make and it likes it before given a merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 04, 2022, 09:05:17 PM",
      "body": "I don't think you should give a merit point if you like someone's posts or agree with your ideas, but if you think their post is useful and deserves those points.As for the number, it varies according to the merits you have and whether you are a merit source or not.Personally, I give between 3 to 10 points, but mostly it is 4 or 6.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "July 04, 2022, 09:19:21 PM",
      "body": "Having a good post doesn’t requires us to give them bitcoin as a token of appreciation, some merit will do and that could encourage the user to be more creative and do more quality post in the future. There’s no pointing system in merit, you can give any merit to that user as long as you are willing to. Let’s be more appreciative and help users to reach their goals, giving merit is very easy so let’s spread it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "July 04, 2022, 10:59:42 PM",
      "body": "I don't have merit distribution policy like BlackHatCoiner. I usually simply give 1 merit in most cases. I don't have any specific reason why I don't give more. Maybe it's old habbit from early days of merit system when I had very limited number of sMerits. But I must admit that I send merits too rarely.I never thought simply meriting post isn't enough and I have to send him some BTC as appreciation. I'm not even sure that majority of users have Bitcoin addresses in their profiles. Though, I remember sending some tips to user who helped me a bit and also for another user who provided free design service. But both these things happened before merit system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 05, 2022, 07:28:01 AM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?I'd probably do that if I'm really well off and retired already. But alas, really not there yet. Not to mention that I very rarely see a topic where I actually get to have some sort of \"life changing\" knowledge to the point that I'd actually send in money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 05, 2022, 01:57:04 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PM That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?I doubt, highly doubt, I personally have learnt a lot from different posts on this forum, I do well to merit the user if at that time I have smerit available, but on that part of sending a user some satoshies(bitcoin) for their well thought posts, this idea have never occurred to me, and I've never received Bitcoin on account of this from any user either.If you ask me why users no longer think along this line, I did tell you its because Bitcoin have become really expensive and very scarce, though am not sure, but ive heard people say that when Bitcointalk and bitcoin were still very young, users used to gift each other Bitcoins for good posts, even to the ton of 50 Bitcoins at a go, but during this period, Bitcoin was worthless and no body knew Bitcoin will become this big today.So this day that Bitcoin have become really expensive and hard to earn, i believe users prefer spending their smerit on good posts rather than spending their Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 05, 2022, 07:03:47 PM",
      "body": "Each person has been using different criteria during sending merits. It won't be stuck with few rules and there are also no rules from forum ends. So according to you if someone deserves merit you may send it. But at least make sure the post isn't spamming post at all. As a merit source, I send merit if the post is useful for the forum users, doesn't matter if I learned or not. I didn't visit anyone's profile for sending Bitcoin at all. Keep in mind, that spreading merits is better than hoarding that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 05, 2022, 07:36:31 PM",
      "body": "Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?When I first joined this forum back in 2011, tipping with Bitcoin was fairly common.  I've both sent and received many tips for Bitcoin posts.  Before everyone had signature campaigns littering their signatures, users used to place their Bitcoin address.  It wasn't as stingy as only tipping people who helped educate you either.  I've sent and received bitcoins for funny jokes, or just thanks for being a grounded person.  Over the years we saw less and less tipping, and now it is basically nonexistent.  I think the rising transaction costs with the block wars pretty much brought an end to tipping.  Back near the end of 2011, you could tip someone a BTC with no transaction fee and it was a $2 cost.  By the end of 2017, you'd have paid a $75 transaction fee just to tip a satoshi.  Hence why Bitcoin went from being billed as a p2p currency to a store of value.  Now nobody sends each other anything, but number go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "July 05, 2022, 07:38:53 PM",
      "body": "Firstly, BlackHatCoiner did well to draft what guides him in issuing merits. He might not always follow his policy, but making it available also teaches members his perception of a quality post. I think I have to agree with him. If something of that nature could be generated for merit sources as a guide to issuing merits, it could make sense.Quote from: Davidvictorson on July 04, 2022, 03:53:28 PMNow my question is, have you learned so much from a post, a reply, or were you well so impressed with the user that you weren't just satisfied with meriting the post. That you actually went ahead to click to their profile, copied their bitcoin address, and then sent them some bitcoins? Or would you ever do this?I stumbled on a thread and understood that in the early days of this forum, it is easy to be gifted bitcoin from a random user. These days such gesture has stopped. Could it be that they didn't know the worth of bitcoin then, now everyone is very careful with their bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "July 05, 2022, 10:25:14 PM",
      "body": "Everyone has a way of meriting a post, it could be a post, or a reply, though the manner they do it depends on the individual. A member could merit a post because he likes what the user post or replies and it could be that a person would merit a post for the effort even without learning anything but personally, I can merit a post even if it is from 3 years as so long as I learn something new or important, that is my way of judging a post or reply in term of merit. Exactly the quote you brought to your post, he is a merit source and has focused on the technical aspect of bitcoin, you can't learn all of bitcoin in a day, we all learn every day. About sending a bitcoin as a way of honouring someone's effort, I don't think I'm buoyant enough to that right now,   Maybe in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "July 06, 2022, 06:37:28 AM",
      "body": "Quote from: OgNasty on July 05, 2022, 07:36:31 PMWhen I first joined this forum back in 2011, tipping with Bitcoin was fairly common. <***>By the end of 2017, you'd have paid a $75 transaction fee just to tip a satoshi.  Hence why Bitcoin went from being billed as a p2p currency to a store of value.  Now nobody sends each other anything, but number go up.Thanks for sharing and that would had been a lovely experience to have, imagine just receiving some Bitcoin (not minding how small it is) for your post been useful. Maybe that could had been more productive then the merit system. I always wondered what the function of us having an option to input our Bitcoin address on our profile was doing in our profile sitting since I haven't seen any usefulness of it. Theymos should probably look into making this a thing, like selling the idea to the forum, it could be an alternative to meriting and we could use lighten network for less fee.OP I think the only time I have been so impressed was when I was trying to understand the trust system and a user came out with an infographic explanation that give me everything I needed to know and was so impressed that I wrote them directly.  And as for the meriting system above I don't buy into it, I can't merit you for liking your post but I can merit for your effort irrespective of my stand on the topic but again that's the users guidelines and that's fine if it works out for him/her.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 06, 2022, 07:28:08 AM",
      "body": "It really depends on how much sMerits you have, I usually merit when I learn something from the post but I don't have enough meri9to share whenever I wanted but users who are merit source or have huge chunk of sMerits to spend may have different policies but its okay to give as much as you can unless you're abusing it, and don't forget on few cases merits reversed by theymos if I remember it correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}