{
  "id": "topic_5425153",
  "title": "xanto",
  "author": "xanto",
  "created_time": "December 02, 2022, 01:54:26 PM",
  "content": "Hi everyone,guysI had an idea to create a group chat for members of this forumPeople here are familiar with cryptocurrencies and know what they are dealing withWhat if we create a small chat in telegram and share trading tips with each other?Not only analyze the market,but also communicate,share interesting stories about how someone got into cryptocurrencyI haven't seen such a suggestion on this forum and i would like to implement itI believe people and i think that in such difficult times we have to stick together somehowWhat do you think?I may not be able to make it because people on this forum have become mean lately,but i want to try Write in personal messages if you have an idea or a desire to implement itDon't be shy",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425153",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 02, 2022, 02:00:00 PM",
      "body": "It may lead to buying and selling signals. In one way or the other, it may lead to some old members on the group to find it easy to scam  new people that are joining the group.Also this forum is enough to post what is in your mind about cryptocurrencies, this forum brings transparency which is better. You can create a thread on this forum instead about the coins, tokens and trading patterns of your interest to see people's opinions and advices about it.If it is telegram group, I can never join.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xanto",
      "created_time": "December 02, 2022, 02:36:36 PM",
      "body": "Quote from: Oshosondy on December 02, 2022, 02:00:00 PMIt may lead to buying and selling signals. In one way or the other, it may lead to some old members on the group to find it easy to scam  new people that are joining the group.Also this forum is enough to post what is in your mind about cryptocurrencies, this forum brings transparency which is better. You can create a thread on this forum instead about the coins, tokens and trading patterns of your interest to see people's opinions and advices about it.If it is telegram group, I can never join.Why?I suggested telegram as a platform for communicationEveryone would have access to it quickly and from their smartphone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "December 02, 2022, 02:59:08 PM",
      "body": "It's okay to create whatever discussion group you want and openly invite some people to join you there regardless of whether you invite people from other forums or social media. Actually, there are lots of discussion groups out there that might be created by certain people or groups, paid or free, but I have no intention of joining.If you talk about bad members, I guess anywhere you will find bad members. Even you should know that telegram is actually a haven for scammers. So maybe you need to spread awareness about the potential risks that might arise through your discussion group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 02, 2022, 03:04:35 PM",
      "body": "Nothing to be shy about here, but frankly, this is simply not necessary because BTT is already a community where anyone can share their views at different sections of choice depending on what they want to convey. Except that we can't receive instant messages on our gadgets like Telegram and others. Still, one could subscribe to any thread of interest and would receive prompt messages from the Telegram notifier if need be for that.This is not to discourage your idea entirely, but to encourage you that you might still create the group for the interested members, while the notifier would be able to convey all messages promptly to gadgets inasmuch as the targeted audiences are quoted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "December 02, 2022, 03:06:38 PM",
      "body": "Quote from: xanto on December 02, 2022, 01:54:26 PMHi everyone,guysI had an idea to create a group chat for members of this forumPeople here are familiar with cryptocurrencies and know what they are dealing withWhat if we create a small chat in telegram and share trading tips with each other?If you're talking about creating for the members of this forum, i will say we dont need one because i personally dont like spending much time in trading but if you're talking about creating a telegram for the forum user who are day trader that may work. However, 80% of this forum reputable user sees telegram as scam paradise.Quote from: xanto on December 02, 2022, 01:54:26 PMNot only analyze the market,but also communicate,share interesting stories about how someone got into cryptocurrencyI haven't seen such a suggestion on this forum and i would like to implement itI believe people and i think that in such difficult times we have to stick together somehowWhat do you think?This is what Wall Observer is used for though the discussions are mainly monitoring and discussing changes in the price of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 02, 2022, 03:52:39 PM",
      "body": "In case you missed it, the forum has an unofficial discord server, see: https://bitcointalk.org/index.php?topic=5247383.0I know it's not telegram, but at least in discord you can block DMs from strangers. I say it's a must feature since scams DMs from crypto communities are a lot more prevalent in my experience.Quote from: xanto on December 02, 2022, 01:54:26 PMPeople here are familiar with cryptocurrencies and know what they are dealing withIf you want the opinion of bitcointalk people, taking the discussions here is still a hundred times better. One, more people will see it. Two, you'll have less worries about scammers/trollers impersonating a member from here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "December 02, 2022, 04:16:32 PM",
      "body": "Quote from: Potato Chips on December 02, 2022, 03:52:39 PMIn case you missed it, the forum has an unofficial discord server, see: https://bitcointalk.org/index.php?topic=5247383.0I know it's not telegram, but at least in discord you can block DMs from strangers. I say it's a must feature since scams DMs from crypto communities are a lot more prevalent in my experience.Quote from: xanto on December 02, 2022, 01:54:26 PMPeople here are familiar with cryptocurrencies and know what they are dealing withIf you want the opinion of bitcointalk people, taking the discussions here is still a hundred times better. One, more people will see it. Two, you'll have less worries about scammers/trollers impersonating a member from here.Yes we already have a discord server. But back when I joined it, I find it quite boring and dead. I mean no one was interested to talk there and it was just there for the sake of discord. The things mentioned in the OP are quite good, but again as he is talking about telegram, then it’s completely impossible. Telegram is the place of scammers. If you just create a group and share the link publicly, the group will be flooded with promotional messages. I appreciate the effort by OP, but to be honest it’s practically not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "December 02, 2022, 04:26:43 PM",
      "body": "Quote from: xanto on December 02, 2022, 02:36:36 PMWhy?I suggested telegram as a platform for communicationEveryone would have access to it quickly and from their smartphoneThe forum already have the official discord channel. You can start your own unofficial global channel if you like people here is not active on social media chat apps because forum is just our hobby while chatting about trading is not an efficient way to kill time social media apps. I’d rather charting with friends rather than discuss with same people here in the forum the same topic here on the social media apps.I believe some local boards has there own local telegram channel dedicated for Bitcointalk. You can try to create unofficial group but don’t expect much that user here will join there and become active. There post here is being paid for the same content they will same on telegram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 02, 2022, 04:51:18 PM",
      "body": "There is enough crypto communication already ongoing here in the forum, and as for trading, it is not a bad idea if there are interested people. I know many crypto traders already have one or two trading signal chat from telegram or discord which they follow. An addition won't hurt if the information they will get has quality. Perhaps, like-minded traders as you will most likely find it interesting provided it is well moderated,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 02, 2022, 04:57:20 PM",
      "body": "Quote from: Nrcewker on December 02, 2022, 04:16:32 PMThe things mentioned in the OP are quite good, but again as he is talking about telegram, then it’s completely impossible. Telegram is the place of scammers. If you just create a group and share the link publicly, the group will be flooded with promotional messages. I appreciate the effort by OP, but to be honest it’s practically not possible.OP can have a good plan which may be hijack later by the telegram people or op also has the plan to turn that for telegram pay group. Pay group is not getting that kind of promotion here because people get to scam others often so the trust is reduced and when you talk about such people don't get in except newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "December 02, 2022, 05:09:45 PM",
      "body": "I don't think, people will join you in that chat room, because many people have learned from their mistakes by joining other social media on the name of spreading the good news of cryptocurrency that made them to ended up in the hands of scammers. If truly, you have something good to contribute for the development of the crypto users, I guess this is the best platform to share it so that the family will look into it, if it will favour the users or not because we have smart members here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xanto",
      "created_time": "December 02, 2022, 05:25:30 PM",
      "body": "Guys,i'll answer all at onceWhy does everyone think of telegram as a scammer's paradise these days?I don't want to charge anyone and was not going to in the futureIt's just the largest community of people who are engaged in cryptocurrency and it is here that you have to offer itI don't want to sell or offer anything to anyoneOnly friendly communication",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 02, 2022, 05:46:39 PM",
      "body": "That is why we have many sections of this forum and every sections has its own function, i believe there is no questions and chats that has not been shared here in as much as you keep reading through all the various sections then you could find one instead of creating telegram group chat.Disadvantage of creating such group which likely leads to so many things;1. Scam2. Spamming3. Sharing non crypto related contents4. Faking a reputable member profile 5. Group might be hack or hijack6. Unauthorized users could joining the group without permission.and etc, which i found not necessary for we to create another group out from this forum. Basically this forum have served it all for you to create post ask question and share all manner of tips which you wanted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "December 02, 2022, 05:57:11 PM",
      "body": "You think this forum isn't enough with you to create your post and share all forms crypto related issues?bear with me that you are trying to endanger yourself by creating a room for people to scam you so easily which will results to unwanted personal messages from many users. Hey man lot can be done here if you only locates the right sections of your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "December 02, 2022, 06:35:15 PM",
      "body": "Quote from: Oshosondy on December 02, 2022, 02:00:00 PMIt may lead to buying and selling signals. In one way or the other, it may lead to some old members on the group to find it easy to scam  new people that are joining the group.Also this forum is enough to post what is in your mind about cryptocurrencies, this forum brings transparency which is better. You can create a thread on this forum instead about the coins, tokens and trading patterns of your interest to see people's opinions and advices about it.If it is telegram group, I can never join.I think the same, in telegram there is not a reputation or flag system in place, and while it is not foolproof at least it is something, this forum is precisely the platform that we can use to give each other support, besides I think the forum format works better for this purpose, telegram is simply too chaotic and it is the equivalent of a group of people shouting across the room with each person wanting to talk about something different, the forum keeps our thoughts and conversations organized and it is easier to keep track of what everyone is saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sulendra12",
      "created_time": "December 02, 2022, 08:41:44 PM",
      "body": "Quote from: xanto on December 02, 2022, 05:25:30 PMGuys,i'll answer all at onceWhy does everyone think of telegram as a scammer's paradise these days?Because it does.I have gotten so many impersonators pm'ed trying to be a team of \"reputable\" swaps and exchanges telling people to do something for them.Also with so many bots you can find for their own benefit in every channels you can find about cryptocurrency, you will find your channel swarmed with full of bots. Of course you can hire moderators to fight against these bots but still it doesn't avoid the fact that there will be more bots coming.Quote from: xanto on December 02, 2022, 05:25:30 PMI don't want to charge anyone and was not going to in the futureYour suggestion is great and I do appreciate that. But telegram is not the way and I also would not recommend thatBecause people would prefer to talk with few peoples that they already familiar with or with other application they use which is not telegram of course.Quote from: xanto on December 02, 2022, 05:25:30 PMIt's just the largest community of people who are engaged in cryptocurrency and it is here that you have to offer itI don't want to sell or offer anything to anyoneOnly friendly communicationYou can try to make it and no one is going to stop you from doing that.But just make sure to actually fully-moderate the channel because you will always get some unwanted guests from time to time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "December 02, 2022, 08:43:37 PM",
      "body": "Quote from: xanto on December 02, 2022, 01:54:26 PMWhat if we create a small chat in telegram and share trading tips with each other?Not only analyze the market,but also communicate,share interesting stories about how someone got into cryptocurrencyI haven't seen such a suggestion on this forum and i would like to implement itI believe people and i think that in such difficult times we have to stick together somehowWhat do you think?I may not be able to make it because people on this forum have become mean lately,but i want to try Write in personal messages if you have an idea or a desire to implement itDon't be shy I don't think anybody will stop you from creating Telegram group, but let me be honest with you if you think you are going to drop the Telegram group link on the forum here and you think people will join, then you are wrong, i don't think people in the forum will join. You might get people outside the forum to join your group and make discussion, but just few forum members will join.If you want the forum members to make contributions to your post, then you should start the conversation within the forum, anything outside the forum am sure most people won't be interested.We all know that Telegram is full of scammers, I don't know how you are going to handle that because am sure their are lot's of people that will be sending group members personal messages claiming they are group admin and having intention to scam the group member, I don't know how you are going to stop that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "December 02, 2022, 09:18:01 PM",
      "body": "At the very least, I will not support the creation of a Telegram chat. We are all aware that Telegram is a safe haven for scammers. If you create a Telegram chat, a lot of scams will take place because it is not moderated or an official channel. So it's best not to do it in the first place. If necessary, you may communicate with anyone via forum PM in any way. I believe this is an old idea that was rejected by the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "December 02, 2022, 09:46:33 PM",
      "body": "You can do that on this platform here and it can still be resourceful to help everyone who is interested to follow but telegram can restrict people because of the money or frees that will be charged. You can say it is free to win people over to you and after that you go back to collecting fees for your telegram service so people will be doubtful about your offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}