{
  "id": "topic_5430978",
  "title": "Voltraiser",
  "author": "Voltraiser",
  "created_time": "December 22, 2022, 11:10:28 AMLast edit: December 22, 2022, 05:35:00 PM by Voltraiser",
  "content": "Greetings! Dear friends, I am pleased to present to your attention the first absolutely unique, unparalleled author's collection of portrait images \"Antonio Spiegel in 10,000 militarized universes\", which is dedicated to the fictional character Antonio Spiegel, who lives in worlds where an integral attribute of each individual is a weapon (or objects ready to become such). This collection of images was created specifically for subsequent mint in NFT and sale in the relevant markets.Naturally, you are all concerned about the question:what is unique about this collection and why does it have no analogues? The thing is that the layers from which all 10,000 images are assembled are made according to the author's method of three-layer polygonal overlay specially developed by me. Developing this method of creating an image, I pursued the goal of making a way that would allow, while maintaining the general style of drawing, to create attribute layers as diverse as possible both in terms of shades and in terms of detail, thereby bringing maximum uniqueness and diversity. According to the data available to me, there is currently no other NFT collection of images published and traded on all major NFT marketplaces that would be created by this method. Therefore, in front of you is an absolutely 100% unique product that has absolutely no exact analogues on the market – that is, in fact, this collection is a new word in the field of digital fine art as such in principle. By purchasing images from this collection, buyers can be completely sure that they will have a real rarity among many other images of digital fine art.What is the method of three-layer polygonal overlay, with which the presented collection was created? In general, it consists of the following: each layer, combined into a single pictorial composition, in turn is created from three other sublayers superimposed polygonally at a certain angle, forming a single integral image, when individually they themselves are disparate parts that convey only individual characteristics of the main layer; I cannot fully disclose the angle of overlap and other technical nuances of creating image layers, due to the fact that this information is strictly confidential and is a production secret. In total, 3287 general layers and 90 VIP layers were created for this collection, which allowed for an extremely high level of uniqueness of images in relation to each other, even for images that are part of the most numerous common edition!Each picture from the presented collection has 10 attributes: 1.\"Background\" 2.\"Confetti\" 3.\"Item on the right\"4.\"Item on the left\" 5.\"Clothes\" 6.\"Head\" 7.\"Lips, mustache, beard\" 8.\"Eyes, Eye accessories\" 9.\"Hair, headwear\" 10.\"Item in hand\" The layers of the listed attributes are mostly painted in 7 main colors (except for the \"head\" attribute), but some layers have their shades.And the whole collection consists of two parts – basic and premium, which in turn are divided into several editions acting according to the degree of rarity:1.Common edition: the very first segment of the collection in terms of number, has 4576 images that do not have any rare properties. This segment is designed for the main audience of buyers.2.Uncommon edition: the second most numerous segment of the collection, has 2910 pictures that have one rare property. This segment is already aimed at an advanced audience of buyers.3.Rare edition: the third most numerous segment of the collection, has 1405 images that have two rare properties. This segment is already designed for true connoisseurs of the collection.4.Epic edition: the fourth most numerous segment of the collection, has 634 pictures that have three rare properties, or one very rare property. This segment completes the basic part of the collection. This segment is designed for special connoisseurs of the collection.5.Legendary edition: it is the first segment of the premium part of the collection and the fifth most numerous, it has 311 images that have four rare properties, or two very rare properties. This segment is designed for the most serious connoisseurs of the collection.6.Extra legendary edition: it is the second segment of the premium part of the collection and the sixth in number, has 104 images that have five rare properties, or three very rare properties, or one extremely rare property, 50 images of this segment are created entirely by hand. This segment is designed for collection partners.7.Super legendary edition: it is the third segment of the premium part of the collection and the seventh in number, has 50 images that have six rare properties, or four very rare properties, or two extremely rare properties, all images of this segment are created entirely by hand. This segment is designed for strategic partners of the collection.8.Exclusive edition: the highest segment of the entire collection, consists of 10 pictures, each picture is created entirely manually and from a special set of VIP layers; for each attribute, only absolutely unique layers are used (except for the \"Head\" attribute), which are not in the pictures of the previous segments of the collection (i.e. only strictly defined ones were used to create each picture layers created and selected for it). This segment is intended for the owner of the collection and his team.Regardless of the distribution by segments of the collection, each picture is made at the highest level of quality and is absolutely unique in relation to each other.I am ready to fully give ownership of this collection of images and give up all copyrights regarding its creation in favor of someone who fulfills the conditions proposed by me, which I will announce to everyone who writes to me in private messages.Receiving this collection, the new owner will have:- all 10,000 images in .png format files- all 10 001 metadata files in the format .json required for publication on NFT marketplaces and minting on the Ethereum network.- the opportunity to declare yourself the author of this collection and declare it during the advertising campaign.- my personal advisory support on all technical issues related to the collection, except for issues related to the creation of sublayers and main layers of images.Otherwise, I am also ready to consider the possibility of transferring all 3287 common layers and 90 VIP layers from which this collection was created.The transaction for the transfer of the collection will take place on the secure transactions website escrow.webmoney, which will act as a certified guarantor of the transaction. If for some reason you are not satisfied with the participation of the specified guarantor of the transaction, you can propose the candidacy of another guarantor, which will be considered by me and if it meets all the necessary requirements, it will be chosen instead of the escrow.webmoney service.You have the opportunity to get acquainted with some copies of the presented collection (which will be shown in a reduced scale for security purposes) at these links:1. https://imgur.com/a/z1ZGWji  2. https://imgur.com/a/rUrTTlK  3. https://imgur.com/a/7Cwe0cB 4. https://imgur.com/a/ahcExIG 5. https://imgur.com/a/twzSfYk 6. https://imgur.com/a/QNqkRbg 7. https://imgur.com/a/QxckOrl 8. https://imgur.com/a/FpHKMX8 9. https://imgur.com/a/kRJbRz9 10. https://imgur.com/a/kRJbRz9This video demonstrates the presence of all 10,000 images in the collection: https://drive.google.com/file/d/1X0bij2f2Hf5TBEDv5Br8iWC2HCck92Sw/view?usp=share_linkSend your questions about the collection and suggestions about getting it into ownership in private messages. Good luck and great success to all!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430978",
  "comments": []
}