{
  "id": "topic_5477605",
  "title": "Latviand",
  "author": "Latviand",
  "created_time": "December 12, 2023, 05:17:43 PM",
  "content": "If you're not yet familiar with the situation, Binance only have 90 days to operate in my country (the Philippines) and given that I've stored my hoard of bitcoin there for a long time already, I'm a bit panicky as to where I should store it (ironic that I'm like that when I'm a staunch believer that I don't care if I lose my bitcoins) so my question is, what alternative wallet or exchanges I can store my bitcoins, wallets would be appreciated and some of my irl crypto friends already recommended me two wallets and an exchange and hopefully they're going to be the same as your recommendations so I can finalize my decision.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477605",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 12, 2023, 05:40:01 PM",
      "body": "Binance is an exchange. Why store bitcoin on an exchange. Not your key not your coin. Store your coins on noncustodial wallet.Use passport hardware wallet for bitcoinElectrum for small amountTrezor hardware for altcoins and bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "December 12, 2023, 05:59:28 PM",
      "body": "Quote from: Latviand on December 12, 2023, 05:17:43 PMwhat alternative wallet or exchanges I can store my bitcoins<...>The only real alternative for storing your bitcoins is your personal, non-custodial (preferably open source) wallet. Why are you even asking such a question? You should already have enough experience to know that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 12, 2023, 06:21:14 PM",
      "body": "Quote from: Latviand on December 12, 2023, 05:17:43 PMIf you're not yet familiar with the situation, Binance only have 90 days to operate in my country (the Philippines) and given that I've stored my hoard of bitcoin there for a long time already, I'm a bit panicky as to where I should store it (ironic that I'm like that when I'm a staunch believer that I don't care if I lose my bitcoins)Have you ever lost bitcoin due scammy exchange? I am asking because people usually don't care (or to put it better they think they don't care) until it actually happens to them. Quote from: Latviand on December 12, 2023, 05:17:43 PMso my question is, what alternative wallet or exchanges I can store my bitcoinsAn obvious choice is a hardware wallet, preferably open source one like Trezor. And please forget about storing your bitcoin in another CEX as that's just an \"accident\" waiting to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 12, 2023, 06:39:01 PM",
      "body": "Kucion and OKX  i saw a thread about this in our local, they are saying that these two including Bybit do have a p2p exchange where you can also trade going to your account/gcash. there are several alternatives for us so binance may not be your option for cashing out since that's what we worry about.its another KYC to submit though but i think its still worth the trouble especially when you need them if Binance is blocked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 12, 2023, 09:07:31 PM",
      "body": "I highly suggest using exchanges for trading and absolutely not as a means of storage.Assuming it's for general use case, other reputable CEX should work like bybit, kucoin,etc. yes? and In case you're interested who has obtained a license, I found a nice list, see: List of Licensed Virtual Currency Exchanges in the PhilippinesIn addition, perhaps you're interested on talking about this with your locals on Pilipinas board?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 13, 2023, 02:00:21 AM",
      "body": "Good riddance, indeed! You're now trying to find an alternative wallet, hopefully a much better one, because Binance will be kicked out. That's a blessing in disguise. Thanks to the Philippine government you're now forced to quit a very bad practice. If you're feeling panicky now that you're finally leaving Binance, you should have felt more panicky before when you're keeping your funds there. Do you trade all those \"hoard of bitcoin\" that you're storing in Binance? If not, don't consider another centralized exchange. Surely, you must have already heard of hardware wallets and Electrum and BlueWallet and so on. If you trade but only a small portion of your funds, then keep only your trading funds in an exchange and the rest in a self-custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 13, 2023, 04:06:14 AM",
      "body": "Quote from: Latviand on December 12, 2023, 05:17:43 PMsome of my irl crypto friends already recommended me two wallets and an exchange and hopefully they're going to be the same as your recommendations so I can finalize my decision.If they're referring to local exchanges we won't be able to name the same service at all. For example, if you are an Indonesian, the exchange recommendation is going to be different than your usual Kraken, Poloniex, etc recommendation. You should probably ask this on your local board if you want to compare how the members here feel about your friends' recommendations. On the other hand, why won't you just give us names instead? I don't see the point of waiting whether people will recommend you the same service or not if you want to check reviews, to begin with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "December 13, 2023, 09:04:48 AM",
      "body": "You can move your Bitcoins to a private wallet as mentioned by several other members. You can also move your funds to exchanges such as KuCoin, Bybit, MEXC or others.But it's best to keep your Bitcoins in a private wallet and only send them to an exchange if you want to trade them.You can buy a hardware wallet to store Bitcoin and other altcoins. It will be safer and more comfortable for you because you won't worry about anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "December 13, 2023, 12:44:05 PMLast edit: December 13, 2023, 01:05:40 PM by Latviand",
      "body": "Quote from: michellee on December 13, 2023, 09:04:48 AMYou can move your Bitcoins to a private wallet as mentioned by several other members. You can also move your funds to exchanges such as KuCoin, Bybit, MEXC or others.But it's best to keep your Bitcoins in a private wallet and only send them to an exchange if you want to trade them.You can buy a hardware wallet to store Bitcoin and other altcoins. It will be safer and more comfortable for you because you won't worry about anything.Of all that have replied to this thread, you're the only one that did offer alternatives thanks for that and to answer your opinions on how I store my crypto, it's none of your business plus I've said it already that I don't care too much about my bitcoin losing, I've said it on other threads long ago, I don't like to be tied down too much managing my bitcoin stash so I do this stuff but I guess I'll change my ways slowly if that bitcoin becomes helpful to me especially if I plan to have a family in the future. Hardware wallets are a strong consideration to me too but I like the convenience of being stored in exchanges so I can quickly sell off parts of my investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptoswiss",
      "created_time": "December 14, 2023, 02:42:02 AM",
      "body": "Anyone have an opinion or, better still, an experience about Etoro or Swissquote ?These are traditional brokers who also offer cryptos in addition to classic ETF/stock/CFD style products. Personally I would feel more reassured as they have been around for a while. Particularly in view of what's happened with Binance, the others are likely to follow the same fate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 14, 2023, 04:07:37 AM",
      "body": "We can suggest the best noncustodial wallet which isWindows system electrum sparrow Android samurai walletISO Blue walletMAC electrumwhat is better exchange, it is better to ask your local board, as you have local board that have more information about crypto exchaneg that have license to operate in the Philippines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "December 14, 2023, 05:29:13 AM",
      "body": "Quote from: Latviand on December 12, 2023, 05:17:43 PMIf you're not yet familiar with the situation, Binance only have 90 days to operate in my country (the Philippines) and given that I've stored my hoard of bitcoin there for a long time already, I'm a bit panicky as to where I should store it (ironic that I'm like that when I'm a staunch believer that I don't care if I lose my bitcoins) so my question is, what alternative wallet or exchanges I can store my bitcoins, wallets would be appreciated and some of my irl crypto friends already recommended me two wallets and an exchange and hopefully they're going to be the same as your recommendations so I can finalize my decision.Another country where Binance is operating without license and is not getting forced to shutdown, I guess? If that's the case, I am sure Binance might temporarily halt service in your country and will eventually resume after obtaining proper license. But why are you holding your bitcoin in an exchange? You are risking yourself of losing all your funds. I know you said you don't care, but if the amount is large enough, you will start caring when you won't be able to access your funds. Now is the perfect time to move your funds from an exchange to a \"self custodial wallet\". Now do your research on those kinds of wallet and chose the one that you think is the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "December 14, 2023, 01:58:57 PM",
      "body": "Quote from: Latviand on December 12, 2023, 05:17:43 PMIf you're not yet familiar with the situation, Binance only have 90 days to operate in my country (the Philippines) and given that I've stored my hoard of bitcoin there for a long time already, I'm a bit panicky as to where I should store it (ironic that I'm like that when I'm a staunch believer that I don't care if I lose my bitcoins) so my question is, what alternative wallet or exchanges I can store my bitcoins, wallets would be appreciated and some of my irl crypto friends already recommended me two wallets and an exchange and hopefully they're going to be the same as your recommendations so I can finalize my decision.I thought we agreed to keep bitcoin on personal wallet where you can have access to only with your private keys. Binance is a custodial third person platforms and it's not recommended in the first place, what I will advice you is to move your coins off the exchange regardless of whether they will operate in your country or not. Keep you funds off the exchange to be safe from any threat to your investment in bitcoin.I will recommend you withdraw your bitcoin to external wallet like electrum wallet. The wallet is light and safe software wallet or better use a hardware wallet like ledger. But if you want an exchange, I think Okex is a good choice to buy and sell but not recommended for keeping your coins, you can use Kucoin as well but they don't have liquidity as big as Okex but still, not a recommend place to store your bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 15, 2023, 04:04:05 AM",
      "body": "Quote from: Antotena on December 14, 2023, 01:58:57 PMI will recommend you withdraw your bitcoin to external wallet like electrum wallet. The wallet is light and safe software wallet or better use a hardware wallet like ledger. But if you want an exchange, I think Okex is a good choice to buy and sell but not recommended for keeping your coins, you can use Kucoin as well but they don't have liquidity as big as Okex but still, not a recommend place to store your bitcoin.Okex became OKX and now requires mandatory identity verification, same as Kucoin, so they are unlikely to work in the Philippines if Binance doesn't work.Withdrawing Bitcoin from platforms is necessary, but I can understand if he wanted to leave some low liquidity altcoin or tokens, as it is difficult to find a suitable wallet for them and follow updates, but this brings us back to the main point, which is not to invest in these currencies, or at least for it to be a short-term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "December 15, 2023, 04:38:14 AM",
      "body": "Quote from: michellee on December 13, 2023, 09:04:48 AMYou can move your Bitcoins to a private wallet as mentioned by several other members. You can also move your funds to exchanges such as KuCoin, Bybit, MEXC or others.But it's best to keep your Bitcoins in a private wallet and only send them to an exchange if you want to trade them.You can buy a hardware wallet to store Bitcoin and other altcoins. It will be safer and more comfortable for you because you won't worry about anything.Agreed on all of your suggestions for using a private wallet and for the exchange suggestions except MEXC as a Binance alternative. On Kucoin and Bybit, we can speculate that both of them have a chance to be the next biggest exchange in the cryptospace, however, MEXC be careful, I reckon. I do not have any proof that they selectively scam people but I would not trust this exchange over Kucoin and Bybit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 15, 2023, 06:26:38 PM",
      "body": "Quote from: Latviand on December 13, 2023, 12:44:05 PMbut I like the convenience of being stored in exchanges so I can quickly sell off parts of my investments.Each to their own i guess. Your keys, your coins, and you can store it anywhere you like. You say you do not care about losing your BTC's, and i am surprised why you say so, because nobody wants to lose money. The reason why users here would still say say not your keys, not your coins and tell you that you shouldn't store your coins in an exchange, even if you have said you do not care, is because of newbies reading this topic. Like me, i would never recommend an exchange as a wallet for storing coins, only self custodial and open source wallets should be used to store BTC, examples are Electrum, BlueWallet and Sparrow wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 16, 2023, 02:37:38 AM",
      "body": "Quote from: Z-tight on December 15, 2023, 06:26:38 PMQuote from: Latviand on December 13, 2023, 12:44:05 PMbut I like the convenience of being stored in exchanges so I can quickly sell off parts of my investments.Each to their own i guess. Your keys, your coins, and you can store it anywhere you like. You say you do not care about losing your BTC's, and i am surprised why you say so, because nobody wants to lose money.The reason why users here would still say say not your keys, not your coins and tell you that you shouldn't store your coins in an exchange, even if you have said you do not care, is because of newbies reading this topic. Like me, i would never recommend an exchange as a wallet for storing coins, only self custodial and open source wallets should be used to store BTC, examples are Electrum, BlueWallet and Sparrow wallet.To each their own, yes, but people can only say that until they lost everything. Words are cheap. I understand if one is keeping a little amount in an exchange for easy and quick trade whenever necessary, but if you're keeping everything there and you say you don't care, I highly doubt it. Unless it's an amount that's too small that you won't be losing a second of sleep if it's lost, you sure care about losing your precious and hard-earned Bitcoin.But if the intention is to be able to \"quickly sell off parts of my investments\", why keep everything on an exchange? Keep that part you intend to quickly sell if the price target is hit and keep the rest in a non-custodial open-source wallet. You don't have to buy a hardware wallet if you don't like it. You actually don't have to spend to safekeep your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 17, 2023, 10:07:42 PM",
      "body": "Send your funds from them to your wallets first. Because it's likely that other exchanges that are not established locally might also be flagged just as Binance. And if you're into storing your crypto, exchanges aren't the way to go because you're not going to do well with them and there can be a much worse situation than them closing down the users from specific areas. As we used to say, they're not providing you with your private keys so that's a no-no if they're going to be used as storage just as you have described it. What's even alarming is that you said that you've been doing this for a long time, don't wait until an unfortunate thing happens to the new exchange where you're planning to deposit and keep it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arjunmujay",
      "created_time": "December 17, 2023, 10:25:41 PM",
      "body": "no one can guarantee an exchange to last long. except those that are legal and licensed in your country.I would suggest moving your assets on binance to your own wallet.can use electrum for bitcoinfor non bitcoin you can use trust wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}