{
  "id": "topic_5413306",
  "title": "thefatron",
  "author": "thefatron",
  "created_time": "September 12, 2022, 05:31:00 PM",
  "content": "Hello, I am new to crypto and apologise for these overly simple questions. I understand that computing the hash's for the blockchain is important as the overall network will always have more computing power than one computer so it would be near impossible to create fake blockchains but how would this be possible anyway if you can not create someones digital signature for a message? Why cant digital signatures be used on their own? Thanks for taking the time to read this post, Cheers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413306",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "September 12, 2022, 05:42:45 PM",
      "body": "Can you provide a bit of clarity to your question, so someone can give an answer to it?You seem to be inquiring about mining, with the talk on computing power and creating a fake blockchain? If you asking why there's a need to use high computing power to validate blocks and why don't the network trust a digital signature, then you need to do a bit of research on how blocks are validated, and it doesn't have to do with \"someone's\" digital signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 12, 2022, 05:43:09 PM",
      "body": "It's how the chain is designed to make blocks every 10 minutes and keep it as consistent as possible without using timestamps. It eliminates a need for trust more than most alternative implementations too and allows you to know you have the full chain (what if a transaction doesn't reach someone but they expect to pay you with its outputs). Addresses are hashes of public keys but that's mainly done to increase security (by adding additional algorithms) and compression as the hash that's paid is fewer bytes than a public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 12, 2022, 05:52:25 PM",
      "body": "Quote from: thefatron on September 12, 2022, 05:31:00 PMHello, I am new to crypto and apologise for these overly simple questions. I understand that computing the hash's for the blockchain is important as the overall network will always have more computing power than one computer so it would be near impossible to create fake blockchains but how would this be possible anyway if you can not create someones digital signature for a message? Why cant digital signatures be used on their own? Thanks for taking the time to read this post, Cheers.You've made a mix of terms then asked something that may or may not be related, I don't know. As said, please ask clearer; maybe even ask more questions instead of assuming things.However, I will try to answer:1. A message can be signed, hence one person (actually his wallet) can sign a message with a digital signature.The only thing is that (in Bitcoin world) one has to sign it with the private key of an address, not with something random, and this will allow people acknowledge the address is indeed his.2. I am not sure what you mean by using digital signature on their own. Isn't using their own local wallet (even offline) good enough?Maybe the way people use digital signatures to certify owning addresses here could help: https://bitcointalk.org/index.php?topic=996318.msg60584851#msg60584851",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thefatron",
      "created_time": "September 12, 2022, 08:03:52 PM",
      "body": "Thank you for your responses, I apologise, I have done a fair amount of research my question was just poor. What I am asking is if you can not create someones signature for their transaction how can you compute fake blocks for the chain? Cheers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 12, 2022, 08:24:15 PM",
      "body": "Quote from: thefatron on September 12, 2022, 08:03:52 PM I apologise, I have done a fair amount of research my question was just poor. What I am asking is if you can not create someones signature for their transaction how can you compute fake blocks for the chain? I am not sure I have understood you correctly. But I think your question is \"How signatures are verified?\".When you broadcast a transaction to the network, you broadcast a hash, a signature and a public key. For verifying your transaction, nodes don't need to recreate your signature at all.  Nodes generate a hash using your public key and your signature through some mathematical calculations. If the hash generated by them matches the hash broadcast by you, the transaction is verified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 12, 2022, 09:29:55 PM",
      "body": "Quote from: thefatron on September 12, 2022, 08:03:52 PMI apologise, I have done a fair amount of research my question was just poor. What I am asking is if you can not create someones signature for their transaction how can you compute fake blocks for the chain? I think that somebody may have been misleading you.There are no such things like fake blocks: a block has to be accepted by the majority of nodes in order to get into the blockchain (if this doesn't happen, that block will get ignored by the majority). No miner would risk that.Maybe you were reading about the 51% attack? In that case somebody has to have more than half of the miners, but will still make correct blocks, not fake.You may have to explain even more what you think the fake blocks are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thefatron",
      "created_time": "September 12, 2022, 09:54:09 PM",
      "body": "I do apologise for being so difficult. I suppose what I am struggling with is if you cant fake someones transaction what do you gain from manipulating the block chain? Or is this where I'm missing the point and mining isnt about mitigating the threat of individuals creating fake blocks but more just a means of having to use a network to govern it?I can see how difficult I'm being now, that doesnt read well, cheers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 12, 2022, 10:01:24 PM",
      "body": "Quote from: thefatron on September 12, 2022, 08:03:52 PMI apologise, I have done a fair amount of research my question was just poor. What I am asking is if you can not create someones signature for their transaction how can you compute fake blocks for the chain? Your question is based on a false premise. You can not spend someonelse's coins unless you know their private keys needed to sign the transaction (I believe this is what you mean by computing fake blicks).When you create a transaction and broadcast it to the network, other nodes will validate it and if it's not signed with the appropriate private key, they will reject it for being invalid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 12, 2022, 10:14:56 PM",
      "body": "Quote from: thefatron on September 12, 2022, 09:54:09 PMI suppose what I am struggling with is if you cant fake someones transaction what do you gain from manipulating the block chain? Or is this where I'm missing the point and mining isnt about mitigating the threat of individuals creating fake blocks but more just a means of having to use a network to govern it?I will simplify it so I may not be 100% correct but, let's try - you will have to try to think of two chains of events happening in paralel.Let's say a malicious player send a transaction of 1M BTC. And at this point he starts his paralel \"business\" of attacking Bitcoin, i.e. he starts mining blocks, but he doesn't tell everybody about them, only to his (many) miners.At some point the 1M BTC transaction is confirmed and he quickly trades that and cashes it in. (As a note you should read at the end: only confirmed transactions matter and even then, on big amounts the businesses may wait for 6 confirmations, which is one hour; this makes the scenario harder to be implemented, hence even more unlikely).Now, the trick is that \"the world\" always considers as valid the longest chain. This is how Bitcoin consensus works. And meanwhile, in a closed environment, he mined more blocks (in the past hour, let's say) than the rest of the network, the blocks are correct, and this will become the \"correct\" chain, since it's longer. Even more, in this closed environment, he has made and confirmed another transaction spending the same 1M BTC, but sending to himself.The world will use the new blockchain, the old one will be forgotten and our guy has cached in 1M BTC he didn't spend....Just the thing is that there are so many miners now that trying to do this would cost far too much.This was the 51% attack.Another way of \"faking\" can be transaction malleability attack. But that not possible on Bitcoin blockchain, period.Another way of \"faking\" can be persuading people consider unconfirmed transactions as good, then double spend them (which is possible as long as they are not confirmed). But this is not an attack, this is taking advantage of newbies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thefatron",
      "created_time": "September 12, 2022, 10:22:00 PM",
      "body": "ok thank you very much, youve been very patient and have gotten me there, thanks again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 12, 2022, 11:20:21 PM",
      "body": "Quote from: thefatron on September 12, 2022, 09:54:09 PMI do apologise for being so difficult. I suppose what I am struggling with is if you cant fake someones transaction what do you gain from manipulating the block chain? Or is this where I'm missing the point and mining isnt about mitigating the threat of individuals creating fake blocks but more just a means of having to use a network to govern it?I can see how difficult I'm being now, that doesnt read well, cheers.I didn't understand you well but I think you mean is to fake someone's transaction or fooled someone with a fake blockchain transaction.I think this will not happen, fake transactions could be dropped by any node that receives them, and they will not go to the mempool to be added to the next block. The comment above was right, there should be at least 5-6 confirmations before the transaction becomes legitimate that comes from the blockchain.  I hope this is what you meant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "September 13, 2022, 06:03:54 AM",
      "body": "Quote from: thefatron on September 12, 2022, 05:31:00 PMHello, I am new to crypto and apologise for these overly simple questions. I understand that computing the hash's for the blockchain is important as the overall network will always have more computing power than one computer so it would be near impossible to create fake blockchains but how would this be possible anyway if you can not create someones digital signature for a message? Why cant digital signatures be used on their own? Thanks for taking the time to read this post, Cheers.Firstly, you need to realize one simple thing: in consensus mechanisms such as Proof-of-Work (PoW), there are no such concepts as \"fake\" or \"wrong\" blockchain. If a block has proof attached to it that some energy had been spent to give this block birth, it is valid in the eyes of the network; namely, full nodes, which verify that consensus rules are being followed, will tell their peers that it is okay to accept this block. The chain which has the most work attached to it is called the \"longest\" chain and, in most cases, will be accepted as mutually-agreed truth. Despite being valid to the network, other chains get discarded as having less cumulative work. They are neither \"wrong\" nor \"fake\" - they simply have lost the race and are no longer significant.Secondly, digital signatures can be used on their own, and actually, they are being actively used wherever there is a need to verify the authenticity of data. But in monetary networks such as Bitcoin, you can't use them without blockchain because there would be no way to check if a signer doesn't cheat trying to \"double spend\" his signed message. A signer could have created an unlimited number of such transactions by signing the same coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}