{
  "id": "topic_5401912",
  "title": "5W-KILO",
  "author": "5W-KILO",
  "created_time": "June 09, 2022, 09:36:45 AM",
  "content": "Guys what's the real reason behind the relish of Litecoin from Korean exchanges like Upbit and Bithumb? I am sure most have heard about this news already but cant figure out the real reason behind the delisting.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401912",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "June 09, 2022, 11:15:36 AM",
      "body": "Quote from: 5W-KILO on June 09, 2022, 09:36:45 AMGuys what's the real reason behind the relish of Litecoin from Korean exchanges like Upbit and Bithumb? I am sure most have heard about this news already but cant figure out the real reason behind the delisting. Not only Upbit and Bithumb. Another 3 exchanges announced to delist Litecoin (LTC) after liteCoin developers rolled out the Mimblewimble Extension Block protocol. https://cryptonews.com/news/five-south-korean-crypto-exchanges-delist-litecoin-following-mimblewimble-upgrade.htmAccording to Binance academy, the Mimblewimble protocol is a blockchain design that employs a novel way of structuring and storing transactions. It’s a different implementation of a Proof of Work (PoW) blockchain that allows for increased privacy and better network scalability.https://academy.binance.com/en/articles/what-is-mimblewimble",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "June 09, 2022, 11:19:14 AM",
      "body": "Litecoin encoded privacy stuff into their contract and its against some country and/or exchange policy. I think they would bounce back. Happened to Monero too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "June 09, 2022, 11:59:43 AM",
      "body": "Quote from: Jaered on June 09, 2022, 11:19:14 AMLitecoin encoded privacy stuff into their contract and its against some country and/or exchange policy. I think they would bounce back. Happened to Monero tooI haven't checked the story, but if this is true, then mostly it's the one reason why exchanges are delisting them. It's just uncanny though that LTC are encoding privacy stuff when it's supposed purposed is to be a little brother to BTC.And as we all know of, exchanges such as in Korea are very strict as far as privacy coins. The local authorities are not allowing crypto's that are privacy centric such as Monero which has been de-listed years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CuriousGeorge",
      "created_time": "June 09, 2022, 12:45:37 PM",
      "body": "Mimble wimble was the main reason. this is making litecoin can be called as privacy coin and those exchange sites are fully compliance with the regulation in korea. that's why they didn't wanna put their service into the big risk to be shutdown by the regulators. They are choosing to delist litecoin. I thought that if that was the best decision by those exchange sites. Their service are far important rather than still allowing the coin that can't comply with the regulation to be traded on their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "popeye95",
      "created_time": "June 09, 2022, 01:20:10 PM",
      "body": "Quote from: CuriousGeorge on June 09, 2022, 12:45:37 PMMimble wimble was the main reason. this is making litecoin can be called as privacy coin and those exchange sites are fully compliance with the regulation in korea. that's why they didn't wanna put their service into the big risk to be shutdown by the regulators. They are choosing to delist litecoin. I thought that if that was the best decision by those exchange sites. Their service are far important rather than still allowing the coin that can't comply with the regulation to be traded on their platform. Korea is quite 'control' about online identity. They have strong and robust laws on the internet front: cyber law, strict ID cards for online accounts, libel cases over the internet,... Anything that tries to be anonymous, protect users' privacy and data will not allow by their law. So it isn't hard to see Litecoin got delisted from the Korean exchange because of that. The same will for any cryptocurrencies start trying to be more private about users' data in their development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 09, 2022, 01:23:40 PM",
      "body": "Quote from: Kavelj22 on June 09, 2022, 11:15:36 AMQuote from: 5W-KILO on June 09, 2022, 09:36:45 AMGuys what's the real reason behind the relish of Litecoin from Korean exchanges like Upbit and Bithumb? I am sure most have heard about this news already but cant figure out the real reason behind the delisting. Not only Upbit and Bithumb. Another 3 exchanges announced to delist Litecoin (LTC) after liteCoin developers rolled out the Mimblewimble Extension Block protocol. https://cryptonews.com/news/five-south-korean-crypto-exchanges-delist-litecoin-following-mimblewimble-upgrade.htmAccording to Binance academy, the Mimblewimble protocol is a blockchain design that employs a novel way of structuring and storing transactions. It’s a different implementation of a Proof of Work (PoW) blockchain that allows for increased privacy and better network scalability.https://academy.binance.com/en/articles/what-is-mimblewimbleProbably, Korean exchanges are not allowed to list those coins/tokens who are getting more private, and with this update of Litecoin, those exchanges can't afford to list them anymore or else they will face problems too. It's good that Litecoin increase their privacy network, its just that some countries don't want this to happen, I'm sure LTC will still be available in some exchanges and this can still be a good one. LTC will rise again eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "June 09, 2022, 02:05:57 PM",
      "body": "Not an legal expert but implementing mimblewimble for Litecoin might have turned it into a privacy coin in regard to Korean legislation and to save themselves from legal difficulties, Korea registered exchanges might have delisted it. The same could be true for some other legislation. Mimblewimble would make the transactions anonymous hence difficult for the law enforcement to track.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "June 09, 2022, 03:26:06 PM",
      "body": "Quote from: 5W-KILO on June 09, 2022, 09:36:45 AMGuys what's the real reason behind the relish of Litecoin from Korean exchanges like Upbit and Bithumb? I am sure most have heard about this news already but cant figure out the real reason behind the delisting. 1. Korean have a law that restricts privacy-centric cryptocurrency due to money laundering issues.2. LTC has been planned and is now activated Mimblewimble/MWEB[1].3. CEX's aware of such urgency that LTC will bring so they just delisted it.Basically, Mimblewimble is an OPT-IN feature, those who want to transact privately will be happy to do so, on the other hand, those who don't or are required by KYC/AML policy can do a regular transaction just fine. Ideally, if the centralised exchange is bothered by the new feature of LTC, they still can only accept regular Litecoin transactions. In that way, there is nothing different between now and then.Unfortunately for whatever reason the centralised exchange over there barely bothered about it, instead they simply just ban it.[1] https://www.litecoin.net/news/mweb-has-officially-activated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "June 09, 2022, 04:52:55 PM",
      "body": "Privacy coins are some country's greatest enemy when it comes to new technology like the blockchain, you have to be fully transparent to such countries and any Anonymous stuff will be seen as a threat to them, this is normal as we've seen the same happen to Monero (XMR) before and it passed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 09, 2022, 05:15:46 PM",
      "body": "Quote from: 5W-KILO on June 09, 2022, 09:36:45 AMGuys what's the real reason behind the relish of Litecoin from Korean exchanges like Upbit and Bithumb? I am sure most have heard about this news already but cant figure out the real reason behind the delisting. After a long time we see some news about Litecoin but sadly its on the negative side however the implementation of the system may encourage the users to use this for transaction due to better privacy but as mentioned by lot others if a coin is having high level privacy then government will not allow them to grow further in that country so that is the reason for delisting maybe more exchanges will follow as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "devil2man",
      "created_time": "June 09, 2022, 06:36:30 PM",
      "body": "The answer is very simple with the latest protocol adopted mimblewimble litecoin becomes like monero a privacy coin with anonymous transactions and the laws in Korea are very strict about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "June 09, 2022, 06:45:20 PM",
      "body": "Quote from: devil2man on June 09, 2022, 06:36:30 PMThe answer is very simple with the latest protocol adopted mimblewimble litecoin becomes like monero a privacy coin with anonymous transactions and the laws in Korea are very strict about it.You are right, the adoption of a privacy system in transactions on Litecoin greatly affects the social sphere, it is possible that there will be lots of undetected transactions that will have an impact on taxes in a country (Indonesian case study). Sooner or later, I'm sure one by one exchange in each country will also delist Litecoin (LTC).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "June 09, 2022, 06:45:24 PM",
      "body": "WoW that's news to me... LTC finally stopped copying BTC and becoming something else. Who cares what those Korean exchanges do anyway? They probably don't list Monero neither but guess what, Monero is still around.LTC is on the right path but Monero has already been doing the privacy thing.Maybe BTC will upgrade MW too and LTC is only testing it for BTC? It happened with segwit before, maybe it is happening again...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "June 09, 2022, 10:20:53 PM",
      "body": "Quote from: devil2man on June 09, 2022, 06:36:30 PMThe answer is very simple with the latest protocol adopted mimblewimble litecoin becomes like monero a privacy coin with anonymous transactions ~Litecoin MWEB and Monero technical underlying are different, you can't quite compare both of them. And I doubt the LTC MWEB upgrade is on a par with Monero privacy/anonymity feature.Quote from: MAAManda on June 09, 2022, 06:45:20 PMYou are right, the adoption of a privacy system in transactions on Litecoin greatly affects the social sphere, it is possible that there will be lots of undetected transactions that will have an impact on taxes in a country (Indonesian case study). Sooner or later, I'm sure one by one exchange in each country will also delist Litecoin (LTC).Do note that Mimblewimble/MWEB on Litecoin is not by-default. It is Opt-in a.k.a optional. So, it is possible for the centralized exchange only accept a non-MWEB transaction.Quote from: mindrust on June 09, 2022, 06:45:24 PMMaybe BTC will upgrade MW too and LTC is only testing it for BTC? It happened with segwit before, maybe it is happening again...There is already some discussion about it here: Bitcoin and MimbleWimble. But it seems doesn't generate any traction, there isn't any MW BIP, after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "June 09, 2022, 10:31:06 PM",
      "body": "The question is, why Litecoin Foundation chooses this path?For sure they know the repercussions of their act, that they will be delisted even if their intention is not to be a privacy based coins, but still the risk is there?There are a lot of questions here, unfortunately, expect that they might suffer a price fall because of this implementation and subsequent delisting from known exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "June 09, 2022, 10:35:56 PM",
      "body": "Quote from: vv181 on June 09, 2022, 10:20:53 PMQuote from: devil2man on June 09, 2022, 06:36:30 PMThe answer is very simple with the latest protocol adopted mimblewimble litecoin becomes like monero a privacy coin with anonymous transactions ~Litecoin MWEB and Monero technical underlying are different, you can't quite compare both of them. And I doubt the LTC MWEB upgrade is on a par with Monero privacy/anonymity feature.Quote from: MAAManda on June 09, 2022, 06:45:20 PMYou are right, the adoption of a privacy system in transactions on Litecoin greatly affects the social sphere, it is possible that there will be lots of undetected transactions that will have an impact on taxes in a country (Indonesian case study). Sooner or later, I'm sure one by one exchange in each country will also delist Litecoin (LTC).Do note that Mimblewimble/MWEB on Litecoin is not by-default. It is Opt-in a.k.a optional. So, it is possible for the centralized exchange only accept a non-MWEB transaction.It could be Opt-in, but I guess exchanges when they hear MWEB knows that it could still be category be a private centric coins, hence the immediate delisting.And this is just the beginning, yeah, maybe other countries who has a local exchange might soon delist it. And it seems this could do more harm that good for Litecoin in the future. But I guess this is the path that they wanted, as I remember, Charlie Lee, the founder of Litecoin say about this way back 2019.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 11, 2022, 11:23:10 AM",
      "body": "Quote from: Johnyz on June 09, 2022, 01:23:40 PMQuote from: Kavelj22 on June 09, 2022, 11:15:36 AMQuote from: 5W-KILO on June 09, 2022, 09:36:45 AMGuys what's the real reason behind the relish of Litecoin from Korean exchanges like Upbit and Bithumb? I am sure most have heard about this news already but cant figure out the real reason behind the delisting. Not only Upbit and Bithumb. Another 3 exchanges announced to delist Litecoin (LTC) after liteCoin developers rolled out the Mimblewimble Extension Block protocol. https://cryptonews.com/news/five-south-korean-crypto-exchanges-delist-litecoin-following-mimblewimble-upgrade.htmAccording to Binance academy, the Mimblewimble protocol is a blockchain design that employs a novel way of structuring and storing transactions. It’s a different implementation of a Proof of Work (PoW) blockchain that allows for increased privacy and better network scalability.https://academy.binance.com/en/articles/what-is-mimblewimbleProbably, Korean exchanges are not allowed to list those coins/tokens who are getting more private, and with this update of Litecoin, those exchanges can't afford to list them anymore or else they will face problems too. It's good that Litecoin increase their privacy network, its just that some countries don't want this to happen, I'm sure LTC will still be available in some exchanges and this can still be a good one. LTC will rise again eventually. First, Litecoin is not the only cryptocurrency that enjoys a high degree of privacy and protection on the network, but it is perhaps the last crypto to be added to the list of this type of cryptocurrencies.Secondly, as far as I know, the latest update on the Litecoin network does not mean canceling the old version, and users can choose between the regular network and the new version after the update.On the other hand, I do not rule out the validity of your analysis that these platforms are not ready to deal with this type of network due to the policies adopted by them or imposed on them by the policies of countries in which they operate within the frameworks of their laws.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "June 11, 2022, 11:36:15 AM",
      "body": "I too had heard about Litecoin introducing a new anonymity protocol, but didn't expect it to involve delisting. But it probably won't affect anything. It was rightly said that XMR was in exactly the same situation but not only on Korean exchanges but all over the world including USA and now Monero is doing very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "June 11, 2022, 02:46:58 PM",
      "body": "Quote from: btc_angela on June 09, 2022, 10:35:56 PMQuote from: vv181 on June 09, 2022, 10:20:53 PMDo note that Mimblewimble/MWEB on Litecoin is not by-default. It is Opt-in a.k.a optional. So, it is possible for the centralized exchange only accept a non-MWEB transaction.It could be Opt-in, but I guess exchanges when they hear MWEB knows that it could still be category be a private centric coins, hence the immediate delisting.And this is just the beginning, yeah, maybe other countries who has a local exchange might soon delist it. And it seems this could do more harm that good for Litecoin in the future. But I guess this is the path that they wanted, as I remember, Charlie Lee, the founder of Litecoin say about this way back 2019.If we view the original translated news from Korea:Quote from: https://www.news1.kr/articles/?4705945The reason why the exchanges made this decision is because there is a clause in the Specific Financial Information Act (Special Act) that prohibits the handling of cryptocurrencies that cannot identify transfer records, so-called 'dark coins'. The purpose is to prevent money laundering in advance, as there are many cases of money laundering through dark coins. Quote from: https://www.news1.kr/articles/?4705945Upbit delisted Litecoin, saying, \"According to the Special Act, exchanges must check whether the transmission records can be verified for digital assets with anonymous transmission technology, and take appropriate measures if anonymous transmission technology is found.\" explained the background.I don't know if there is a loss in translation or if there are other clauses that thoroughly regulate any cryptocurrencies that contains a single bit of anonymity technology, but judging from the two snippets above, I still see there is no reason for exchange to delist LTC since most users can still use the regular transaction just fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}