{
  "id": "topic_5470108",
  "title": "mandown",
  "author": "mandown",
  "created_time": "October 12, 2023, 05:25:59 PMLast edit: October 12, 2023, 05:47:26 PM by mandown",
  "content": "Spk Yeni halka arzı onayladı.:  Mevcut Sermaye: 150.000.000Yeni Sermaye: 205.000.000Lot Sayısı: 55.000.000 adetBireysele Eşit dağıtım.Satış Fiyatı : 15,78 TL üzerinden satışa sunulacakmış.Kısaltma : #vrgyoDiğer bilgiler geldiğinde konuyu güncelleyeceğim. Gyo'ları seviyorum %40 yapmadan düşüyor  sonra ufak ufak oynuyorum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470108",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "October 13, 2023, 03:37:21 PM",
      "body": "çok yeni kurulmuş bir firma, ki bu yüzden finansal tablolarına bakmak fazla bir şey ifade etmeyebilir. yeni başladıkları iş var, emlak sektörünün birkaç yıl boyunca iyi olmayacağı ön görülüyor. ha biz alıp çorba paramıza bakarız orası ayrı. yumurta tavuk ilişkisi olarak bakmak gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 15, 2023, 03:15:13 PM",
      "body": "55 milyon lot hissenin %70’i bireysel yatırımcıya %20’si yerli kurumsala ve %10’u yabancı kurumsala dağıtılacak. Kurumsal yatırımcı sayısı bireysel yatırımcı sayısından çok daha az olduğu için çok daha fazla hisse düşmekte. Bireysel yatırımcı azıcık hissesi ile 2-3 tavan bile gitse ancak çorba parası çıkıyor ama kurumsal için durum farklı 10-100 bin gibi blok hisse alabiliyorlar. Kurumsal yatırımcı ilk tavandan 10 bin lot hisse satmış olsa 15.7 bin kazanmış olacak, bizim için 1-3 tavan hiç bir anlam ifade etmezken kurumsal yatırımcılar için çok daha değerli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "October 15, 2023, 04:24:59 PM",
      "body": "Quote from: ZekiBeyy on October 15, 2023, 03:15:13 PM55 milyon lot hissenin %70’i bireysel yatırımcıya %20’si yerli kurumsala ve %10’u yabancı kurumsala dağıtılacak. Kurumsal yatırımcı sayısı bireysel yatırımcı sayısından çok daha az olduğu için çok daha fazla hisse düşmekte. Bireysel yatırımcı azıcık hissesi ile 2-3 tavan bile gitse ancak çorba parası çıkıyor ama kurumsal için durum farklı 10-100 bin gibi blok hisse alabiliyorlar. Kurumsal yatırımcı ilk tavandan 10 bin lot hisse satmış olsa 15.7 bin kazanmış olacak, bizim için 1-3 tavan hiç bir anlam ifade etmezken kurumsal yatırımcılar için çok daha değerliYine de iyi sayılır bence çünkü 2-3 tavandan daha fazla gidiyorlar ve bir şeyler bırakabiliyor. Kurumsallar için gerçekten daha değerli olmuş. Ekmeğin büyük kar kısmı onlarda kalmış. Fiyat olarak düşük olması ve katılımcı sayısının da yüksek olmasından dolayı kimse satmıyor gözü bile görmüyor. Gittikçe gidiyorlar anlayacağımız yani. Bunda da aynı şeyin olacağını düşünüyorum. Yanılmıyorsam Reeder'da olduğu gibi olacaktır. Daha önce ismini duyduğum bir firma değil. Halka arzlardaki katılımcının bu kadar yüksek olmasından dolayı beklediğimiz tavanlar gelecektir. O yüzden buna da bir miktar katılım sağlarım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 15, 2023, 04:30:39 PM",
      "body": "dostlar bu haftanın yıldızı tab gıda olacağı için vera konsept gyo'ya katılım bence beklenilenden çok daha düşük olacak. 4 milyon kişi katılsa kağıt üstünde 9-10 lot gibi düşecek ama dediğim gibi hem katılımcı sayısı daha az olur hem de verilen para az olur. (150-200 lira veremeyecek mi insanlar demeyin babuşlar.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 15, 2023, 04:59:36 PM",
      "body": "Quote from: flyingcarpet on October 15, 2023, 04:24:59 PMQuote from: ZekiBeyy on October 15, 2023, 03:15:13 PM55 milyon lot hissenin %70’i bireysel yatırımcıya %20’si yerli kurumsala ve %10’u yabancı kurumsala dağıtılacak. Kurumsal yatırımcı sayısı bireysel yatırımcı sayısından çok daha az olduğu için çok daha fazla hisse düşmekte. Bireysel yatırımcı azıcık hissesi ile 2-3 tavan bile gitse ancak çorba parası çıkıyor ama kurumsal için durum farklı 10-100 bin gibi blok hisse alabiliyorlar. Kurumsal yatırımcı ilk tavandan 10 bin lot hisse satmış olsa 15.7 bin kazanmış olacak, bizim için 1-3 tavan hiç bir anlam ifade etmezken kurumsal yatırımcılar için çok daha değerliYine de iyi sayılır bence çünkü 2-3 tavandan daha fazla gidiyorlar ve bir şeyler bırakabiliyor. Kurumsallar için gerçekten daha değerli olmuş. Ekmeğin büyük kar kısmı onlarda kalmış. Fiyat olarak düşük olması ve katılımcı sayısının da yüksek olmasından dolayı kimse satmıyor gözü bile görmüyor. Gittikçe gidiyorlar anlayacağımız yani. Bunda da aynı şeyin olacağını düşünüyorum. Yanılmıyorsam Reeder'da olduğu gibi olacaktır. Daha önce ismini duyduğum bir firma değil. Halka arzlardaki katılımcının bu kadar yüksek olmasından dolayı beklediğimiz tavanlar gelecektir. O yüzden buna da bir miktar katılım sağlarım. Hocam yinede iyi sayılır derken dağıtım tablosunu incelediniz mi? 3.3 milyon katılım olması durumunda 12 lot (189 lira) hisse almış olacağız bu süreçte 3 gün ardı ardına tavan gitmiş olsa kazancınız 62,5 lira olacak 5 tavanda ise 115 lira olacak şimdi bir daha düşünün iyi mi olduğunu. Kurumsalada hisse dağıtıldığı için çok fazla tavan gitme durumu olmuyor maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "October 15, 2023, 05:03:25 PM",
      "body": "Quote from: ZekiBeyy on October 15, 2023, 04:59:36 PMQuote from: flyingcarpet on October 15, 2023, 04:24:59 PMQuote from: ZekiBeyy on October 15, 2023, 03:15:13 PM55 milyon lot hissenin %70’i bireysel yatırımcıya %20’si yerli kurumsala ve %10’u yabancı kurumsala dağıtılacak. Kurumsal yatırımcı sayısı bireysel yatırımcı sayısından çok daha az olduğu için çok daha fazla hisse düşmekte. Bireysel yatırımcı azıcık hissesi ile 2-3 tavan bile gitse ancak çorba parası çıkıyor ama kurumsal için durum farklı 10-100 bin gibi blok hisse alabiliyorlar. Kurumsal yatırımcı ilk tavandan 10 bin lot hisse satmış olsa 15.7 bin kazanmış olacak, bizim için 1-3 tavan hiç bir anlam ifade etmezken kurumsal yatırımcılar için çok daha değerliYine de iyi sayılır bence çünkü 2-3 tavandan daha fazla gidiyorlar ve bir şeyler bırakabiliyor. Kurumsallar için gerçekten daha değerli olmuş. Ekmeğin büyük kar kısmı onlarda kalmış. Fiyat olarak düşük olması ve katılımcı sayısının da yüksek olmasından dolayı kimse satmıyor gözü bile görmüyor. Gittikçe gidiyorlar anlayacağımız yani. Bunda da aynı şeyin olacağını düşünüyorum. Yanılmıyorsam Reeder'da olduğu gibi olacaktır. Daha önce ismini duyduğum bir firma değil. Halka arzlardaki katılımcının bu kadar yüksek olmasından dolayı beklediğimiz tavanlar gelecektir. O yüzden buna da bir miktar katılım sağlarım. Hocam yinede iyi sayılır derken dağıtım tablosunu incelediniz mi? 3.3 milyon katılım olması durumunda 12 lot (189 lira) hisse almış olacağız bu süreçte 3 gün ardı ardına tavan gitmiş olsa kazancınız 62,5 lira olacak 5 tavanda ise 115 lira olacak şimdi bir daha düşünün iyi mi olduğunu. Kurumsalada hisse dağıtıldığı için çok fazla tavan gitme durumu olmuyor maalesef. Yok @ZekiBeyy o manada dememiştim aslında. Başlangıçta olduğu gibi çok fazla arz gelmiyor o yüzden hiç yoktan iyidir anlamında demek istedim. Yoksa kurumsala dağıtılmasını tabi ki istemiyorum. Halka dağıtsınlar ki az da olsa herkesin eline bir şey geçsin. Yazdığımı tekrar okuyunca o anlama çıkmış biraz ama öyle demek istemedim yani hiç yoktan iyidir demek istedim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "October 15, 2023, 09:56:28 PM",
      "body": "Yine çorba parası kovalayacağız anlaşılan, 100-200 lira için yaptıklarımıza bakın ya, bi yandan üzülüyorum bi yandan da 100-200 lira bir şeyler için harcarım diye giriyorum, nerde o 500-1000 kazandıran halka arzlar.Halka Arz büyüklüğü yüksek olan firmaların halka arz olması lazım, para kazanalım üç beş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 18, 2023, 05:13:41 PM",
      "body": "daha önce burada yazdığım gibi ben halka arzlara 2 hesaptan katılım sağlıyorum. bunlardan birisini akbank üzerinden gerçekleştiriyordum ve bir baktım ki vera'nın halka arzı orada yok. şöyle bir haber mevcut: https://www.referansturk.com/vera-gyo-halka-arz-alamiyorum-gorunmuyor-neden-diye-soranlar-dikkat-3-banka-listede-yok-haber-69811akbank, finansbank ve teb üstünden vera'nın halka arzına katılmak mümkün değil. bu da katılım sayısını belki etkileyebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 19, 2023, 07:40:25 AM",
      "body": "Quote from: gospodin on October 18, 2023, 05:13:41 PMdaha önce burada yazdığım gibi ben halka arzlara 2 hesaptan katılım sağlıyorum. bunlardan birisini akbank üzerinden gerçekleştiriyordum ve bir baktım ki vera'nın halka arzı orada yok. şöyle bir haber mevcut: https://www.referansturk.com/vera-gyo-halka-arz-alamiyorum-gorunmuyor-neden-diye-soranlar-dikkat-3-banka-listede-yok-haber-69811akbank, finansbank ve teb üstünden vera'nın halka arzına katılmak mümkün değil. bu da katılım sayısını belki etkileyebilir.Hocam zaten twitterda millet 300 tl düşer hesabı konuşuyorsa ben 2x yatırıyorum ne olacak 300tl 4 gün kitli olsun 3-5 hisse fazla alalımBirde bu işe fena alıştım halka arz gelmeyince canım sıkılıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 25, 2023, 06:57:58 AM",
      "body": "Vera GYO ile kısa özet bir bilgi geçeyim:Bireysel yatırımcıya 38.5 milyon lot dağıtıldı toplam katılım 3.878.174 kişi en fazla 10 lot dağıtıldı. Bireysel dağıtım çok önemli değil esas önemli olan kurumsal yatırımcılar. Yurt içi kurumsal için 11 milyon lot ayrıldı katılan kurumsal sayısı 99 yani kurumsal başına en az 111.111 hisse demek tabi eşit katılım sağlandı ise diğer türlü bazı kurumsal yatırımcılar daha az lot almış olur bazılarıda daha fazla lot almış olur. Yurt dışı kurumsal yatırımcı sayısı 5 olmasına rağmen ayrılan lot sayısı 5.5 milyon yani her bir yurt dışı kurumsal için 1.1 milyon lot demek oluyor. İşin özeti şudur bizim elimizde 10 lot var (157 TL) 2-3 gün tavan gitmiş olsa bizler için anlamsız olsa bile kurumsal yatırımcılar için öyle olmuyor. Özellikle yurt dışı kurumsal yatırımcı için ilk tavandan satmış bile olsa yaklaşık 1.735.000 lira kazanç sağlamış olacaklar. Bu nedenle bu şirketin çok fazla tavan yapmasını beklemiyorum, eğer garanti yatırımcı iseniz bu şirketten fazla tavan yapmasını beklemeyin derim. Kısa sürede tavan bozacağını düşünüyorum sonrasında yine tavan görebilir elbette ama ardı ardına soluksuz çok fazla tavan görmesini beklemiyorum. (YTD)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "October 25, 2023, 05:32:10 PM",
      "body": "Quote from: ZekiBeyy on October 25, 2023, 06:57:58 AMVera GYO ile kısa özet bir bilgi geçeyim:Bireysel yatırımcıya 38.5 milyon lot dağıtıldı toplam katılım 3.878.174 kişi en fazla 10 lot dağıtıldı. Bireysel dağıtım çok önemli değil esas önemli olan kurumsal yatırımcılar. Yurt içi kurumsal için 11 milyon lot ayrıldı katılan kurumsal sayısı 99 yani kurumsal başına en az 111.111 hisse demek tabi eşit katılım sağlandı ise diğer türlü bazı kurumsal yatırımcılar daha az lot almış olur bazılarıda daha fazla lot almış olur. Yurt dışı kurumsal yatırımcı sayısı 5 olmasına rağmen ayrılan lot sayısı 5.5 milyon yani her bir yurt dışı kurumsal için 1.1 milyon lot demek oluyor. İşin özeti şudur bizim elimizde 10 lot var (157 TL) 2-3 gün tavan gitmiş olsa bizler için anlamsız olsa bile kurumsal yatırımcılar için öyle olmuyor. Özellikle yurt dışı kurumsal yatırımcı için ilk tavandan satmış bile olsa yaklaşık 1.735.000 lira kazanç sağlamış olacaklar. Bu nedenle bu şirketin çok fazla tavan yapmasını beklemiyorum, eğer garanti yatırımcı iseniz bu şirketten fazla tavan yapmasını beklemeyin derim. Kısa sürede tavan bozacağını düşünüyorum sonrasında yine tavan görebilir elbette ama ardı ardına soluksuz çok fazla tavan görmesini beklemiyorum. (YTD)Halka arzların içine kurumsalları soktuklarında işler iyi olmuyor. Dediğiniz gibi özellikle yurt dışı kurumsal yatırımcı asıl karı alıyor. Biz de elimizdekinin üç beş bir şey getirmesini bekler dururuz. Bu şirketin çok fazla tavan yapmasını ben de beklemiyorum yine de belli olmuyor. Şu sıralarda garanti yatırımcı kavramını yitirilmiş ne gelirse alıp bekleme dönemine girmiş herkes. Çevremdekiler bu şekilde alıp bekliyorlar şirkete bile bakmadan. Ben de çıktığımda çok mu erken çıktım garanticilik de iyi olmuyor bazen diye düşünüyorum. Yine de ufak ufak diye diye kar bırakmaları güzel oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "October 25, 2023, 08:13:01 PM",
      "body": "Açıkçası çok birşey bırakacağını beklemiyorum. Fakat yinede ne olacağı bilinmez. Bunun dışında Türkiye'de bilmediğimiz bir hareketlilik mi var. Sınırdışı operasyon falan mı olacak acaba. Bugün bütün hisse senetleri felaket bir şekilde dibi gördü. Birşeyler olaxak gibi fakat. Ya da bugün Tayyip Erdoğan konuşmuştu ondan kaynaklı olabilir mi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "October 26, 2023, 04:36:52 AM",
      "body": "Quote from: zonefloor on October 25, 2023, 08:13:01 PMAçıkçası çok birşey bırakacağını beklemiyorum. Fakat yinede ne olacağı bilinmez. Bunun dışında Türkiye'de bilmediğimiz bir hareketlilik mi var. Sınırdışı operasyon falan mı olacak acaba. Bugün bütün hisse senetleri felaket bir şekilde dibi gördü. Birşeyler olaxak gibi fakat. Ya da bugün Tayyip Erdoğan konuşmuştu ondan kaynaklı olabilir mi? Tayyip Erdoğan’ın açıklamalarından sonra ABD’de bazı açıklamalar yapıldı. Sanırım bundan kaynaklı borsadan parasını çeken çekene. Güvensiz ortamda savaşa girme ihtimalleri ile birlikte bu borsa kırmızıya boyandı. Umarım savaşa katılmayız. İki devletli diplomatik çağrılara devam etmek gerekiyor bence. Borsada bugün ki hareket çok önemli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 02, 2023, 07:47:49 AM",
      "body": "Quote from: ZekiBeyy on October 25, 2023, 06:57:58 AMVera GYO ile kısa özet bir bilgi geçeyim:Bireysel yatırımcıya 38.5 milyon lot dağıtıldı toplam katılım 3.878.174 kişi en fazla 10 lot dağıtıldı. Bireysel dağıtım çok önemli değil esas önemli olan kurumsal yatırımcılar. Yurt içi kurumsal için 11 milyon lot ayrıldı katılan kurumsal sayısı 99 yani kurumsal başına en az 111.111 hisse demek tabi eşit katılım sağlandı ise diğer türlü bazı kurumsal yatırımcılar daha az lot almış olur bazılarıda daha fazla lot almış olur. Yurt dışı kurumsal yatırımcı sayısı 5 olmasına rağmen ayrılan lot sayısı 5.5 milyon yani her bir yurt dışı kurumsal için 1.1 milyon lot demek oluyor. İşin özeti şudur bizim elimizde 10 lot var (157 TL) 2-3 gün tavan gitmiş olsa bizler için anlamsız olsa bile kurumsal yatırımcılar için öyle olmuyor. Özellikle yurt dışı kurumsal yatırımcı için ilk tavandan satmış bile olsa yaklaşık 1.735.000 lira kazanç sağlamış olacaklar. Bu nedenle bu şirketin çok fazla tavan yapmasını beklemiyorum, eğer garanti yatırımcı iseniz bu şirketten fazla tavan yapmasını beklemeyin derim. Kısa sürede tavan bozacağını düşünüyorum sonrasında yine tavan görebilir elbette ama ardı ardına soluksuz çok fazla tavan görmesini beklemiyorum. (YTD) Daha önce yukarıdaki mesajımda özet geçmiştim tahmin ettiğim gibi 4. Gününde tavan yapmasına ve tavanda 16 milyon lot olmasına rağmen tavan bozdu. Daha önce dediğim gibi tavan bozmasındaki en büyük etkenin yabancı kurumsal yatırımcıların olduğunu düşünüyorum. Beş yabancı kurumsal yatırımcıya 5.5 milyon not hisse verilmiştir. 99 yerli kurumsala ise 111.111 hisse verildi. Yabancı kurumsal firmalara neden bu kadar çok dağıtım yapıldı bilemiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 02, 2023, 08:10:10 AM",
      "body": "Bu gün tavan bozan Vera Konsept Gayrimenkul Yatırım Ortaklığı A.Ş. ile yol ayrımına gelindiğine dair ilk mesajını verdi. Verilen bu mesajı değerlendirip buortaklığın sonlanması gerekiyor. Bu gün bozmamış olsaydı iyi olurdu bu kağıdı yarın satacaktım aslında. Bir gün erken geldi. Ortamın gerginliği de fiyat konusunda epey etkili olmaya başladı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "November 02, 2023, 11:37:11 AM",
      "body": "Lan az daha gitseydi ev alacaktım verdiği parayla, napalım şansımıza küselim başka bir halka arza artık.Şaka gibi vallaha 60-70 lira para verdi tabi satabilene, bende şuan 50 lira kar gözüküyor satabilirsem bu fiyata, yarına 50 lirayı da alırlar elimden Millet dilenci gibi 50-100 ne koparırsam peşine düştü galiba, valla üzücü şu durum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 02, 2023, 12:23:33 PM",
      "body": "Tamamen eşit dağıtım olmayan halka arzların düşme sebebi kurumsal yatırımcılar çünkü kurumsal yatırımcı sayısı daha az olmakla birlikle ayrılan pay adedi fazla oluyor fakat Vera Konsept GYO nedense kurumsal 5 yatırımcıya yüklü miktarda lot vermiş durumda (5.500.000/5). Kurumsal yatırımcıya ya daha dengeli pay verecekler yada 1-6 ay süreyle satamazsınız şartı koyacaklar veya küçük yatırımcı bu tarz arzlara katılmayarak tepki gösterecek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 03, 2023, 07:06:49 AM",
      "body": "Vera Konsept Gayrimenkul Yatırım Ortaklığı A.Ş. nin halka arz sayfasını incelediğimde 1 yıl ihraççı, 1 yıl ortakların hisse satmama taahhüdü bulunuyor acaba diyorum yabancı aracı kurumlar ile anlaşarak bunların üzerindenmi hisse satışında bulundular. Neden yabancı 5 kurumsala 5.5 lot hisse ayırıldı anlam veremiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 04, 2023, 06:20:17 AM",
      "body": "devre kestiği anda satıp çıktım. ha 50 lira vermiş ha 150 lira hiçbir anlamı yok. sizlere bir hatırlatma yapayım:şayet devre kestiği zaman hangi fiyattan satmak istediğinizi bilemiyorsanız fiyat olarak o günkü tavan fiyatını yazın. devre kesme bittiği anda fiyat yukarı çıkarsa o anki en fiyattan gidecektir. düşerse de sizin verdiğiniz bir yerlerden ya da daha yüksekten gidebilir. (alıcı olursa.) bu dediğim %5'lik ilk ayak için geçerli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}