{
  "id": "topic_5405202",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "July 05, 2022, 01:05:16 AMLast edit: July 29, 2022, 11:16:49 PM by Abiky",
  "content": "A while ago, Jack Dorsey proposed a new solution to truly decentralize the web. He calls it \"Web5\". Apparently, this will be Web 3.0's successor powered by the Bitcoin blockchain itself. From a maximalist point of view, this would mean Bitcoin will be used for everything you do around the web. It will act not only as a currency, but also as a platform for decentralized applications, ownership registry, decentralized identities, and more. Isn't this what Ethereum and other copycat smart contract platforms (BNB, Cardano, TRON...) are doing? If so, then \"Web5\" would be no different than \"Web 3.0\" itself. It could be a catch phrase to lure as much investors into Jack Dorsey's little project.What do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? Do you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0? Your input will be greatly appreciated. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405202",
  "comments": [
    {
      "author": "vv181",
      "created_time": "July 05, 2022, 06:15:09 AM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMWhat do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? Do you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0?I perceive it as rather a mockery. There are no such things as decentralised when some platform contains decentralised wording in their scheme/project to block/censor token access or some user within specific countries. Also, some communities are in favour that the foundation on some projects is taking over or stealing a whale account as Solend itself does, for the sake of project longevity they claimed. After all, in an essence, web3.0 doesn't even exists yet rather is simply a buzzword to make hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 05, 2022, 08:42:48 AM",
      "body": "Is it really needed to have that progress of going up to web5 or so on? Bitcoin can already be used for everything right now and who would use web5? Still we, the bitcoin adopters that have been doing good even if we're just web1, web2, web3 or whatever you call that web.We're all good with the current state that we have, we all need is the continuous growth for bitcoin and everyone who doesn't know it yet has to be informed and educated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 05, 2022, 09:07:55 AM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMA while ago, Jack Dorsey proposed a new solution to truly decentralize the web. He calls it \"Web5\". Apparently, this will be Web 3.0's successor powered by the Bitcoin blockchain itself. From a maximalist point of view, this would mean Bitcoin will be used for everything you do around the web. It will act not only as a currency, but also as a platform for decentralized applications, ownership registry, decentralized identities, and more. Isn't this what Ethereum and other copycat smart contract platforms (BNB, Cardano, TRON...) are doing? If so, then \"Web5\" would be no different than \"Web 3.0\" itself. It could be a catch phrase to lure as much investors into Jack Dorsey's little project.What do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? Do you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0? Your input will be greatly appreciated. Thank you. Web3 protocol is just being formed. The developers tell us they are talking about a blockchain-based decentralized internet and that all data will be stored on decentralized nodes.But most decentralized nodes are located on centralized servers. All important data is located on centralized servers. I don't believe in this technology because it is based on centralized technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "July 05, 2022, 10:43:35 AM",
      "body": "Are we already done with web3? i know the crypto community are still awaiting the ground breaking web3 has to offer base on what we have read so far by promoters and bloggers online. Now web5 is on the picture! i really can not say since i haven't witness any practical usage, for now it all sound like a catch phrase until it is proven not to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "July 05, 2022, 10:49:20 AM",
      "body": "Probably just a buzz-word, ever since we have such terms as web3 and others, they have to think of a new one to continue with the hype. But I guess it's just start from it's root, with some minimal improvement.So yeah, this is probably just another catch phrase, to attract and wake up the interest of investors again, regardless if we are in a bear or bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 05, 2022, 11:19:38 AM",
      "body": "I think I’ll wait for web 5s or maybe, web 6. I have been using web 2 since I don’t know when but its battery life is no good anymore. I can’t go everywhere carrying a powerbank with me it is pretty tiring.I’ve seen the design of web5, it is pretty too damn big. After the previous CEO’s death, Dorsey couldn’t manage to make the necessary improvements on the company so far.If they remake the web2.0 with a bigger battery, I am sold. Would preorder this in a second.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 05, 2022, 05:30:04 PM",
      "body": "From my perspective only a phrase marketing.To be honest, the problem with Web2 to Web3 is the migration, most of users who is using \"Web3\" only from Crypto side. People are still stuck in Web2 and they think just using Web2 is already enough.Since, they all know cryptocurrency is a little bit complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "July 07, 2022, 01:02:22 AM",
      "body": "Quote from: ryzaadit on July 05, 2022, 05:30:04 PMFrom my perspective only a phrase marketing.To be honest, the problem with Web2 to Web3 is the migration, most of users who is using \"Web3\" only from Crypto side. People are still stuck in Web2 and they think just using Web2 is already enough.Since, they all know cryptocurrency is a little bit complicated.Web 3.0 hasn't been thoroughly adopted by people worldwide, yet they're proposing a new version that will truly decentralize everything. I think we should wait a little longer until Web 3.0 matures before thinking of its successor. Based on what Jack Dorsey said about Web5, I think the only way it'll work is by using Bitcoin's Lightning Network. Otherwise, the main chain will become so clogged, TX fees will be ridiculously high. How to make people abandon the old Web 2.0 in favor of Web 3.0 is an excellent question. Crypto/Blockchain tech is just starting to blossom, so anything could happen in the future. Just my opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 07, 2022, 02:57:58 AM",
      "body": "I don’t care what they call it. I just hope they figure out a way to get new users to care about Bitcoin again. It’s starting to feel like nobody owns Bitcoin outside of fund managers these days. You can walk into a bar and nearly everyone will have some shitcoin with a crazy use case to pitch you but nobody owns Bitcoin. It’s viewed as a coin you need to buy shitcoins, but with the popularity of USDT & USDC, people don’t even need BTC for that anymore. Call it web69 if you want… If people can’t login to their Facebook accounts with a signed Bitcoin message before they can connect a metamask, you can kiss goodbye the next generation of Bitcoiner… Our toxic leaders are dragging us down the path of the Beta tape & 8-track. I hope the first mover crypto advantage and decentralized talking points can hold up long term because the toxic maximalism won’t.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "July 07, 2022, 08:30:37 AM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMWhat do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? Do you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0? Your input will be greatly appreciated. Thank you. The question is whether the Bitcoin network itself allows what other mainstream networks do, call it about Smart-Contracts. Otherwise, I'm not sure that Web 5.0 will actually exist in the future.Quote from: vv181 on July 05, 2022, 06:15:09 AMAfter all, in an essence, web3.0 doesn't even exists yet rather is simply a buzzword to make hype.I agree with you, it's the same as Metaverse, for now it's just a buzzword to increase hype. But that doesn't mean it won't happen in the future, as far as I know, there are already some really serious projects in Web 3.0 development, for example the Solcial project, they aim to create decentralized social media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 07, 2022, 03:20:48 PM",
      "body": "To be realistic, internet and web technologies can thrive in an environment where majority of the things are available for free. That's why internet is adopted by the mass. If all of a sudden a segment of internet requires money to do some activities, it will fail miserably. So Dorsey's web5 sounds like a niche segment within internet, that will be accessed and used by some niche segment of people. Will never be able to reach to the mass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cogsmachine",
      "created_time": "July 08, 2022, 04:56:54 PM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMect.What do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? Do you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0? Your input will be greatly appreciated. Thank you. Web 3 will become Web 4,5,6, ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 09, 2022, 11:06:49 PM",
      "body": "Do we really understand first what Web 3 is? I doubt it, so why they are inventing like something new that it's predecessor is not even clear for the majority?So for me, and to be honest, no one really care, if Web 3.0 for them means DAO, NFT then so be it. Maybe what's clear for them is to make money. Just like what bitcoin is the beginning, everyone is really into the background, the open source the people behind, the technology. But once it found it's way to make money for ordinary people, then they totally forget about it's root.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "July 10, 2022, 01:37:06 AM",
      "body": "Quote from: OgNasty on July 07, 2022, 02:57:58 AMI don’t care what they call it. I just hope they figure out a way to get new users to care about Bitcoin again. It’s starting to feel like nobody owns Bitcoin outside of fund managers these days. You can walk into a bar and nearly everyone will have some shitcoin with a crazy use case to pitch you but nobody owns Bitcoin. It’s viewed as a coin you need to buy shitcoins, but with the popularity of USDT & USDC, people don’t even need BTC for that anymore. Call it web69 if you want… If people can’t login to their Facebook accounts with a signed Bitcoin message before they can connect a metamask, you can kiss goodbye the next generation of Bitcoiner… Our toxic leaders are dragging us down the path of the Beta tape & 8-track. I hope the first mover crypto advantage and decentralized talking points can hold up long term because the toxic maximalism won’t.I concur. The whole crypto/Blockchain space is being driven away from its original purpose, as VCs (venture capitalists) and big exchanges accumulate most of Bitcoin's circulating supply. How can the next iteration of the Web be decentralized if equality is missing from the system? You can see how ETH is aiming to sacrifice decentralization/equality in favor of fast transaction speeds and low fees. With a PoS version of ETH, whales, big exchanges, and VCs will win.I just hope the same doesn't happen to Bitcoin or it will be the end of decentralization for good. The community needs to stand in defense of decentralization for the benefit of the whole crypto/Blockchain space. Let's just focus on improving Web 3.0 and then we can talk about Web5. Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 10, 2022, 04:16:46 PM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMA while ago, Jack Dorsey proposed a new solution to truly decentralize the web. He calls it \"Web5\". Apparently, this will be Web 3.0's successor powered by the Bitcoin blockchain itself. From a maximalist point of view, this would mean Bitcoin will be used for everything you do around the web. It will act not only as a currency, but also as a platform for decentralized applications, ownership registry, decentralized identities, and more. Isn't this what Ethereum and other copycat smart contract platforms (BNB, Cardano, TRON...) are doing? If so, then \"Web5\" would be no different than \"Web 3.0\" itself. It could be a catch phrase to lure as much investors into Jack Dorsey's little project.What do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? Do you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0? Your input will be greatly appreciated. Thank you. Just trying to get more attention nothing else, since web 3.0 itself is still in the beginning stages of implementation then how can someone can promote the project as Web 5 and we don't know what it is actually since we are still in 2.0 so its just an exaggeration to create hype and get fame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "July 10, 2022, 04:35:25 PM",
      "body": "I don't fully understand what web3 is, and I even less understand what web5 is. I think this technology is still a long way off, because cryptocurrency is still in its infancy and is not much in demand in everyday life. A lot of people, probably even all people, are satisfied with the usual Internet. Blockchain is useful, but there are many cases where it is not necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoperkele",
      "created_time": "July 10, 2022, 08:01:40 PM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMJust a buzzword for now.I would like to know how Dorsey even thinks it should work. Just saying that something is decentralized or is powered by blockchain doesn't really say anything. You need to build it first as not even tech for something like that exist. Not one that would justify \"powering\" it by blockchain what ever that even means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "July 10, 2022, 08:18:09 PM",
      "body": "Quote from: fzkto on July 10, 2022, 04:35:25 PMI don't fully understand what web3 is, and I even less understand what web5 is. I think this technology is still a long way off, because cryptocurrency is still in its infancy and is not much in demand in everyday life. A lot of people, probably even all people, are satisfied with the usual Internet. Blockchain is useful, but there are many cases where it is not necessary. I'm totally confused by the world web3 snd this is my first time to hear about such. I will like to read round to understand and know what web3 is all about, at times it good to read and make research maybe it's something that i know but due to the position of the worlds that is what is making me to be confused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 10, 2022, 08:22:14 PM",
      "body": "Quote from: Abiky on July 05, 2022, 01:05:16 AMWhat do you think? Is Web5 really a catch phrase? Or is it completely different from Web 3.0? I think we need to know the difference between web 3.0 and web 5.0 to be able to tell if it is only a catchphrase.Web 3.0 – The Semantic (Read-Write-Execute) WebQuoteWeb 3.0 is the advanced wave of information technology for websites and smartphones, focusing on delivering a data-driven and interactive web through machine-based information processing. The semantic web’s ultimate aim is to build more knowledgeable, connected, and accessible websites.Read more here[1]Web 5.0 – The Intelligent / Emotional (Symbiotic) WebQuoteTo put it succinctly, the Internet of Things (IoT) means that everything in your life, I mean everything, can speak to each other about you, in front of you, behind your back, and without any care or sympathy. With an emphasis on selling, purchasing, and influencing you. It was amusing to wake up to a kitty cat-shaped robot, but Web 5.0 would go beyond that. The arrival of smart devices that predict your needs based on your habits without including many clues foreshadows what is to come with the Intelligent Web. Symbiotic web programs will be able to interpret evidence on a more complex level, both emotionally and intellectually. This is the Web, which exists in complete coexistence with daily life, operating without thought and organically interacting with what we do.From the given explanation we can say that Web 5.0 different from Web 3.0 in many ways.  Web 5.0 take advantage of emotional intelligenceRead more here[1]So say, Web 3.0 is way different from Web 5.0.  Web 3.0 is more focus on the read-write-execution and still at a development stage while Web 5.0 is way more complex that takes advantage of emotional intelligence.  I don't think that it is only a catchphrase but rather that person took advantage of technology in early development and forcibly attached himself to it by announcing a project called web5.Quote from: Abiky on July 05, 2022, 01:05:16 AMDo you think we may be too early to replace \"Web 3.0\" even when the world is stuck with Web 2.0? Your input will be greatly appreciated. Thank you. It is too early to replace Web 3.0 because its technology is far from perfect.  Besides Web 5.0 requires a lot of experimentation and we all know how complex it is to integrate emotional intelligence into an application. Web 5.0 probably requires a fully developed Web 3.0 to function well.[1] https://status200.net/what-is-web-5-0-a-brief-introduction-to-world-wide-web-1-0-5-0/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}