{
  "id": "topic_5535600",
  "title": "CryptSafe",
  "author": "CryptSafe",
  "created_time": "March 18, 2025, 01:55:04 PM",
  "content": "News has it that North Korean Government holds 13,562 Bitcoin making the government the third largest Bitcoin holders in the world and this Bitcoin according to the news source is gotten as a result of the state sponsored Lazarus group whose job is tasked with the responsibility of hacking major Crypto holders and the last of their target was bybit which was the biggest hack so far in the history of Crypto inception. Does this mean that the North Korean Government is deliberately avoiding to buy Bitcoin for their national reserve or what? As the hack linking to this group called the Lazarus points towards them being sponsored by the government and after that their hacks, they convert it to Bitcoin and keep it as a reserve and they ranking the third largest Bitcoin holders in the world. This accumulation is directly not linked to purchase or seizures by the government as it has not been heard anywhere that the government made an announcement of a purchase or seizures but rather gotten from hacks. Is it worth it that a government would act this way instead of being fair and just, they rather choose to accumulate Bitcoin in such manner and claim to be a wealthy nation.  Are they really leading by example or they are encouraging hacks and theft amongst their nationals or what because that is what  I could think of now that would likely play out in the future.SOURCE",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5535600",
  "comments": [
    {
      "author": "Agbamoni",
      "created_time": "March 18, 2025, 02:02:13 PM",
      "body": "If i understand you so well, you are literally saying the Korean government is sponsoring the Lazarus groups who keeps hacking exchanges, or you are just asking to be sure? That will be a false accusation because no government will publish any news that they are in support of cybercrime. If investigations is done and they have to trace all the money stolen from these CEX exchanges down to the Lazurus group, then the Korean government will be causing a conflict between nations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 18, 2025, 02:06:17 PM",
      "body": "Google tells me that the hacker group in the article (Lazarus Group) is allegedly run by North Korean government. Considering the source is US justice department, I wouldn't use that as a strong reason. So speculation on how much bitcoin the government of NK has is a bit weird based on this weak link.With that said, if it is true then it is a weird and funny way of accumulating bitcoin at a governmental level and I hope it doesn't become like a trend because if others like Chinese or US government start doing it then centralized services will be in a lot of trouble Although at the same time it could be a good thing because that would push people to migrate to decentralized services like DEX and that's a push we'd welcome",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 18, 2025, 02:20:32 PM",
      "body": "Quote from: Agbamoni on March 18, 2025, 02:02:13 PMIf i understand you so well, you are literally saying the Korean government is sponsoring the Lazarus groups who keeps hacking exchanges, or you are just asking to be sure? That will be a false accusation because no government will publish any news that they are in support of cybercrime. If investigations is done and they have to trace all the money stolen from these CEX exchanges down to the Lazurus group, then the Korean government will be causing a conflict between nations. From the source, it was clearly captured on their website and not a direct statement from me. It can be called a rumour or news if you wish to know and not an accusation. Maybe you didn't really understand what you read here. It is true that Government's frowns at cybercrime and it is their responsibility to fight against it which is expected but when seeing such rumours or news, it isn't welcoming and if found to be truth then the government isn't encouraging her citizens  and the world frowns at such act.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "March 18, 2025, 02:33:52 PM",
      "body": "Here South Korea basically hacked Bybit exchange and took 1.4 billion dollars and held Bitcoin, I think it is basically a short-term Bitcoin holding. But El Salvador has basically been holding Bitcoin since 2021, and they are currently holding 1 Bitcoin per day, currently El Salvador has 6119.18 Bitcoin. They can also be called DCA method Bitcoin, and South Korea basically took their Bitcoin and dollars and deposited Bitcoin illegally, I do not trust their holding and they can decide to sell Bitcoin at any moment. In this case, El Salvador has been holding Bitcoin for a long time and their Bitcoins are definitely full long-term holdings. Report of Arkham",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "March 18, 2025, 02:35:49 PM",
      "body": "without explicit proofs or confirmations provided by government these are just pure speculations. at least to me, even if they have (or it appears to have) a strong connection with their government I would not directly think that their government has coins because of...moreover we don't know what is their public policy on that argument. I don't think they will ever support this technology or the group involved in these hackings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "March 18, 2025, 03:01:12 PM",
      "body": "Quote from: CryptSafe on March 18, 2025, 02:20:32 PMQuote from: Agbamoni on March 18, 2025, 02:02:13 PMIf i understand you so well, you are literally saying the Korean government is sponsoring the Lazarus groups who keeps hacking exchanges, or you are just asking to be sure? That will be a false accusation because no government will publish any news that they are in support of cybercrime. If investigations is done and they have to trace all the money stolen from these CEX exchanges down to the Lazurus group, then the Korean government will be causing a conflict between nations. It is true that Government's frowns at cybercrime and it is their responsibility to fight against it which is expected but when seeing such rumours or news, it isn't welcoming and if found to be truth then the government isn't encouraging her citizens  and the world frowns at such act.What truth? The highest form of crime is done by the government, don't you know? The media and internet will let you believe what they want you to believe because they are controlled by the governments. This could be a rumor or the truth but still people won't believe even if it is the truth because they still have this mentality that the government is against crime. Like as @Pooya87 already stated \"considering the source is US justice department\", it is more likely to be a rumour",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "March 18, 2025, 03:02:14 PM",
      "body": "Quote from: Agbamoni on March 18, 2025, 02:02:13 PMIf i understand you so well, you are literally saying the Korean government is sponsoring the Lazarus groups who keeps hacking exchanges, or you are just asking to be sure? That will be a false accusation because no government will publish any news that they are in support of cybercrime. If investigations is done and they have to trace all the money stolen from these CEX exchanges down to the Lazurus group, then the Korean government will be causing a conflict between nations. Until now there is no evidence that Lazarus is a hacker supported by the North Korean government. But most of the media may misinterpret this group only from North Korea and not created by its government for this purpose. Indeed, the US also suspects that the funds from this hack are being used by North Korea to finance their weapons program, which poses a serious threat to global security. There are still many possibilities but the prediction may be right or wrong. But for the time being, Korea has even refused to make BTC a strategic reserve of the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 18, 2025, 03:07:29 PM",
      "body": "Quote from: CryptSafe on March 18, 2025, 01:55:04 PMNews has it that North Korean Government holds 13,562 Bitcoin making the government the third largest Bitcoin holders in the world and this Bitcoin according to the news source is gotten as a result of the state sponsored Lazarus group whose job is tasked with the responsibility of hacking major Crypto holders and the last of their target was bybit which was the biggest hack so far in the history of Crypto inception. Congratulations to North Korean Government for this achievement, but it's more accurately to congratulate Kim Jong Un about that.He will have more money to enjoy his luxurious life while his citizens will continue to live with sanction and poverty. He won't solve any issue to improve living conditions of his citizens, while doing many immoral activities like hacking through Hazarus group and damage many projects and people life globally because of his selfishness and greediness.I hope that his regime in North Korean will end soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "March 18, 2025, 03:07:40 PM",
      "body": "If the ones who stole thos bitcoins are the hacer grpup then i'm not sure if those bitcoins belong to the korea government. I mean the hackers are the ones who have the private keys so at any moment they can run away with those coins.And if they make ir public then the World will try to recover those coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "March 18, 2025, 03:07:58 PM",
      "body": "Quote from: CryptSafe on March 18, 2025, 01:55:04 PMDoes this mean that the North Korean Government is deliberately avoiding to buy Bitcoin for their national reserve or what? As the hack linking to this group called the Lazarus points towards them being sponsored by the government and after that their hacks, they convert it to Bitcoin and keep it as a reserve and they ranking the third largest Bitcoin holders in the world. This accumulation is directly not linked to purchase or seizures by the government as it has not been heard anywhere that the government made an announcement of a purchase or seizures but rather gotten from hacks. Is it worth it that a government would act this way instead of being fair and just, they rather choose to accumulate Bitcoin in such manner and claim to be a wealthy nation.  Are they really leading by example or they are encouraging hacks and theft amongst their nationals or what because that is what  I could think of now that would likely play out in the future.I think that it's less likely they will hold the Bitcoin and instead do something like strengthen the KPW (North Korea Won). I'm sure other nations around the world would be trying to find a way to buy that Bitcoin should it be for sale, and I dare say that enemies of North Korea don't want them to own it (and may even go to the lengths of taking action to prevent them from benefiting from Bitcoin's appreciation, could be why market activity/sentiment has changed so much since the hack whilst nothing has technically been sold yet, just swapped from ETH to BTC).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "March 18, 2025, 03:15:02 PM",
      "body": "Quote from: Agbamoni on March 18, 2025, 03:01:12 PMLike as @Pooya87 already stated \"considering the source is US justice department\", it is more likely to be a rumour Perhaps Pooya87 isn't saying that what ever that is from the US justice department is a lie or isn't true but considering the fact that US government likes to pin crimes on government which they do not like and pretend to be clear that is the most important point. The US might do worst yet wouldn't get to our hearing, NK might be aware of the criminal hack gang yet with it's anonymous and might not be able to do anything about it, but if true they are sponsors to this group then NK more but the smartest country ever LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 18, 2025, 03:28:56 PM",
      "body": "Quote from: pooya87 on March 18, 2025, 02:06:17 PMWith that said, if it is true then it is a weird and funny way of accumulating bitcoin at a governmental level and I hope it doesn't become like a trend because if others like Chinese or US government start doing it then centralized services will be in a lot of trouble Although at the same time it could be a good thing because that would push people to migrate to decentralized services like DEX and that's a push we'd welcome The warning existed a long time and it repeatedly appears sparsely with incidents in cryptocurrency market.Reminder: do not keep your money in online accounts. If the attacking method becomes a new trend from governments, this reminder will be cited more but like history shows, it will be forgotten by many people later when that trend cools down.People who take that reminder into account for their practice, and understand importance of \"It's your keys, it's your coins\", apply it for their practice, will store their bitcoin safer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "March 18, 2025, 03:33:11 PM",
      "body": "For clarity, the writer was only speculating and the article didn't say if the stolen Bitcoin was going to be used for create a Bitcoin reserve.Here's my opinion. Just because the US government took a decisive step to create a Bitcoin reserve, does not mean any nation stacking up Bitcoin wants to do same. North Korea is currently under western sanctions for its nuclear weapon programme. The stolen Bitcoin/crypto might be to circumvent the bans and to fuel its nuclear weapon agenda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "March 18, 2025, 03:36:06 PM",
      "body": "We're in a system which controlled by US, that's why the news about China, North Korea and Russia mostly related about bad thing. Just because North Korea is very private and hard to get their information, it doesn't mean you can just justify Lazarus is a part of North Korea's government.US is actually the biggest country who fund Israel, people should view US as bad country since they're a big part of Israel, this is a fact instead of them accuse North Korea supporting Lazarus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "March 18, 2025, 03:40:37 PM",
      "body": "Quote from: seoincorporation on March 18, 2025, 03:07:40 PMIf the ones who stole thos bitcoins are the hacer grpup then i'm not sure if those bitcoins belong to the korea government. I mean the hackers are the ones who have the private keys so at any moment they can run away with those coins.And if they make ir public then the World will try to recover those coins. We are talking about North Korea and I don't think anything is possible without the government noticing in that country so if Lazarus is actually from North Korea then they should be under the government. I don't think North Korea can afford to hold something because they don't really have much to generate income like other countries so they probably spent the hacked funds already to keep the Kim comfortable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "March 18, 2025, 03:47:27 PM",
      "body": "Quote from: CryptSafe on March 18, 2025, 01:55:04 PMNews has it that North Korean Government holds 13,562 Bitcoin making the government the third largest Bitcoin holders in the world and this Bitcoin according to the news source is gotten as a result of the state sponsored Lazarus group whose job is tasked with the responsibility of hacking major Crypto holders and the last of their target was bybit which was the biggest hack so far in the history of Crypto inception.is anyone investigating this group or is their government really just has that impunity and no one can touch them or hold them accountable? surely the international laws should be looking into this, no?QuoteDoes this mean that the North Korean Government is deliberately avoiding to buy Bitcoin for their national reserve or what? if we all could acquire bitcoin without having to actually buy it with our money, wouldn't that be great? although it would be unethical to do so the way north korea is doing it but i am saying that it only makes sense they would use this method",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "March 18, 2025, 03:51:39 PM",
      "body": "Quote from: CryptSafe on March 18, 2025, 01:55:04 PMNews has it that North Korean Government holds 13,562 Bitcoin making the government the third largest Bitcoin holders in the world and this Bitcoin according to the news source is gotten as a result of the state sponsored Lazarus group whose job is tasked with the responsibility of hacking major Crypto holders and the last of their target was bybit which was the biggest hack so far in the history of Crypto inception. Does this mean that the North Korean Government is deliberately avoiding to buy Bitcoin for their national reserve or what? As the hack linking to this group called the Lazarus points towards them being sponsored by the government and after that their hacks, they convert it to Bitcoin and keep it as a reserve and they ranking the third largest Bitcoin holders in the world. This accumulation is directly not linked to purchase or seizures by the government as it has not been heard anywhere that the government made an announcement of a purchase or seizures but rather gotten from hacks. Is it worth it that a government would act this way instead of being fair and just, they rather choose to accumulate Bitcoin in such manner and claim to be a wealthy nation.  Are they really leading by example or they are encouraging hacks and theft amongst their nationals or what because that is what  I could think of now that would likely play out in the future.SOURCE [/quote]Ordinarily I'm surprised myself to read that the Korean government are the brain behind this Lazarus group, like it's a state sponsored attack against a business organization, I've not seen concrete proof on this allegations actually but then the question i Will like to ask is if, before now, the the Korean government has declared that they have such amount of Bitcoin reserve in their coffers or we are just suddenly seeing Such humongous amount of Bitcoin reserve by the Korean government ever since the the Bybit incident happened?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "March 18, 2025, 03:54:09 PM",
      "body": "I saw this news some hours ago with a huge surprise, but still, I am no fan of North Korea, if they like they should amass more Bitcoin, no praise here, it's an ill-gotten Bitcoin wealth that should be viewed as non-existent, no thanks to Lazarus group. It's so painful that Ben Zhou would be looking helplessly as evil people are openly flaunting his money as their wealth, that's one of the major cons of decentralised systems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "March 18, 2025, 03:56:50 PM",
      "body": "Quote from: pooya87 on March 18, 2025, 02:06:17 PMWith that said, if it is true then it is a weird and funny way of accumulating bitcoin at a governmental level and I hope it doesn't become like a trend because if others like Chinese or US government start doing it then centralized services will be in a lot of trouble Although at the same time it could be a good thing because that would push people to migrate to decentralized services like DEX and that's a push we'd welcome Just has you have said earlier it is not true, there is no any credible or reliable news outlets that have actually reported any of this news, the only thing we have seen is the Lazarus group are from North Korea which is also been spread by US intelligence and been from a country doesn’t mean that they are sponsored by the government until there is an evidence to that. Even this propaganda that North Korea bitcoin holdings have grown is still fake to me because the news started spreading immediately after the bybit hack and the investigation that Lazarus Group is behind it, of all this news one thing they haven’t shown is a North Korea bitcoin address that confirms receiving any bitcoin or even shows the wallet balance to confirm it has added numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}