{
  "id": "topic_5449220",
  "title": "Justtoons",
  "author": "Justtoons",
  "created_time": "April 17, 2023, 10:47:40 PMLast edit: April 17, 2023, 11:24:08 PM by Justtoons",
  "content": "My people, una weldone oooo na una boy JUSTTOONS. I hail from Edo state and I say make I come greet the hux.  Actually, I just dey reason today, I come say this wan wey everytime na only how to make money with crypto and Bitcoin we dey always dey discuss. I come say make I still try ask una this better question, wey be say      \"APART FROM CRYPTO, WHICH OTHER THING UNA TAKE DEY EARN MONEY\" The question use style make small sense like we know how this our good good country be, wey everywhere just like like say no tomorrow.     But as Nigerians, our slogan is to survive no matter what....lol abeg I no fit laugh we dey try... Even God know sef and he dey pity us.      So make una try use this opportunity, take share with everyone for this our board which other way una take dey make money to take survive apart from crypto.    For me, I get hand work, I get some small small online business and I be animator. I dey make cartoons take dey collect small small change and I still dey draw.. Abeg make we discuss my country people. I dey wait for una own oooo",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449220",
  "comments": [
    {
      "author": "Clark Anderson",
      "created_time": "April 18, 2023, 04:54:41 AM",
      "body": "This question get how e take dey, but it's not really bad. I actually earn from many things apart from crypto, which includes my business, I sell and rent already made wedding gowns and I work for some companies online write emails for them and getting paid in dollars. It's actually a nice source of income for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 18, 2023, 05:45:44 AM",
      "body": "This one na beta tori you just yan my brother, because as eh stands now eh good make person get like 3 to 5 extra source of income to enable us to survive for we contri. So the ways wey I don see our contri people dey make money online include the following wey I go discuss below.1. Blogging or Youtubing: because this one happens to be one of the easiest way way some youths dey take collect small small change monthly to carry hold body by creating valuable contents online wey people go watch and in return they get paid base on the number of views wey dem go get.2. Affiliate marketing: Because another ways way I don see some youths getting small small cash steady na through affiliate marketing e.g digitstem & expertnaire 3. Freelancing: And another one be wetin dem dey call freelancing, wey get to do with offering online services for platforms such as \"Fiverr\" & \"Upwork\", and then get paid small small money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "April 18, 2023, 12:36:52 PM",
      "body": "The truth be say even if everibody for this naija board reply to this your thread you fit nor still see watin you dey find.I get different skills when I take dey hustle from Communtiy manager to frontend web developer to Graphics designer and some other things when I dey do although I nor monetize them. since you don already get skill (animating) all you need now for you to look for how you go take develop yourself to the extent say nah people go dey look for you and more importantly you stil gat learn how to sell your skills because to get the skill alone nor be everything because we also get people when they the same niche with you when be beast for the matter so you gat learn how to present your work so that ee go enter your client eyes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 18, 2023, 02:10:30 PM",
      "body": "OP this talk na correct one so. You see as e be now, man no suppose base in one source of income though. Like 4 to 5 sources of income supposed dey open dey bring in money but as the country dey now things really spoil but anyways, on to digital levels, man dey collect daily bread from there.Aside say na Crypto here we dey do so, mate, other skills wey man fit learn or already learn dey wey go put food for table. Agent or middle man parol dey fetch income very well, supply hustle too dey settle some bills, resales of equipment to na another one wey person fit take hold one corner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "April 18, 2023, 11:18:41 PM",
      "body": "Quote from: Justtoons on April 17, 2023, 10:47:40 PM     \"APART FROM CRYPTO, WHICH OTHER THING UNA TAKE DEY EARN MONEY\" The question use style make small sense like we know how this our good good country be, wey everywhere just like like say no tomorrow.     But as Nigerians, our slogan is to survive no matter what....lol abeg I no fit laugh we dey try... Even God know sef and he dey pity us.We dey regard bitcoin as side hustle wey go fit compensate for us when our main source of income no dey available. Anyone wey view am as full time hustle fit no enjoy am as so as time goes on. For Naija, bitcoin dey among wetin many Nigerians dey into to dey get something chop from as better work neva come for them. Of all the side hustles wey dey, I hear say Naija boys like to dey partake in Forex trading too, I hear say risk full that one too. Digital marketing dey, YouTube TV dey, Freelancers dey too etc. Them plenty but anyone wey you fit out your head for na him you go join before full time work go come show.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeCsc",
      "created_time": "April 19, 2023, 01:40:35 AM",
      "body": "Op, Aside crypto me dey learn soft development now sha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "April 19, 2023, 06:41:11 PM",
      "body": "This country na country wey be say you no go fit survive with one source of income, if you depend on one source of income your eyes go red because Nigeria as a country go show you shege.To me normally, I never really dey make money from this forum though, but outside this forum anything wey involve business(legal business) wey go bring money I dey like involve myself, I dey into land agency, I dey do welding and fabrication too, and I dey into music too, I dey play drums for events, na so I dey take survive...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}