{
  "id": "topic_5398020",
  "title": "Snack_Token",
  "author": "Snack_Token",
  "created_time": "May 10, 2022, 10:44:52 AM",
  "content": "Crypto Snack is pleased to announce that they have signed a sponsorship deal with the prestigious La Liga football club RCD Espanyol.Partnering with Crypto Snack, RCD Espanyol will become the FIRST La Liga club to accept payments in cryptocurrencies, bringing the efficiency of digital assets further into the world of sports. Next season, Espanyol fans will be able to buy tickets, merchandise, and food/beverages with SNACK, Bitcoin, Ethereum and a select number of other well-known crypto tokens.Crypto Snack, with its headquarters in Barcelona, is the world’s fastest growing iGaming token and an ideal partner for traditional sports franchises and other businesses. SNACK is listed on several major crypto exchanges, as well as with the largest coin processor on the market, CoinsPaid.Mao Ye Wu, CEO of RCD Espanyol, “the sponsorship agreement offers huge advantages both on and off the pitch, and for both Pericos and all soccer fans who visit our fantastic facilities. With this step, we become pioneers in a field that is not the future, but already the present” In the words of Crypto Snacks CEO Stuart “It is an absolute honour for the Crypto Snack team and community to partner with one of the biggest and most well-known clubs in Europe. The partnership opens the club up to a whole new market place and allows Espanyol fans a fun, efficient way to support their team through the use of SNACK and other cryptocurrencies. For Crypto Snack, the chance to partner with a club that views cryptocurrencies as the future was very special. RCDE understands the value of not just SNACK, but the whole crypto community.  It is very exciting for current and future SNACK holders to be able to use their tokens to buy their new Espanyol kit, a season ticket, or match day experience. With the backing of our holders, the broader crypto community, and Espanyol’s fans, the sky is the limit for RCD Espanyol and the SNACK token.”This press release is authored by Crypto Snack.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398020",
  "comments": []
}