{
  "id": "topic_5407080",
  "title": "Dave1",
  "author": "Dave1",
  "created_time": "July 21, 2022, 01:09:06 AMLast edit: July 21, 2022, 02:32:31 AM by Dave1",
  "content": "Samsung recently has announced that it has started to produce it's new 3 nm (nanometer) mining chips. So there is a big improvement, as the mining chip would come on with increased performance of up to about 23% and 45% more energy-efficient.QuoteOptimized 3nm process achieves 45% reduced power usage, 23% improved performance and 16% smaller surface area compared to 5nm process.The leaders of Samsung Foundry Business and Semiconductor R&D Center are holding up three fingers as a symbol of 3nm celebrating the company’s first ever production of 3nm process with GAA architecture.What do you think about this news? specially about the timing that we are in a bear market (perhaps though the release will be in the next bull run?) And once is full gear and has been released will miners move to this new technology? And how about their marketing it with cheaper and greener?Edit added the link: https://news.samsung.com/global/samsung-begins-chip-production-using-3nm-process-technology-with-gaa-architecture",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407080",
  "comments": [
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 21, 2022, 02:01:49 AM",
      "body": "Link to their PR announcement please?Nothing you quoted alludes to their 3nm process being used for mining chips. Unless they're planing on following what TSMC does and are using mining chips to fine tune their production processes odds are more valuable devices are 1st in line for the new node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 21, 2022, 09:13:31 AM",
      "body": "Besides, I don't see Samsung of all companies entering the ASIC industry anyway, so the \"mining\" aspect of the chip is questionable - it is most like NOT crypto mining.Quote from: NotFuzzyWarm on July 21, 2022, 02:01:49 AMLink to their PR announcement please?Nothing you quoted alludes to their 3nm process being used for mining chips. Unless they're planing on following what TSMC does and are using mining chips to fine tune their production processes odds are more valuable devices are 1st in line for the new node.I recall Samsung does not have their own foundry, so how would that help them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 21, 2022, 09:39:25 AM",
      "body": "depends on who actually owns the machine that physically made the chips. not who is using the chipsin many cases over the last decade. the inventor of the machine capable of making smaller chips, sells the machines that do it to many industries. so although samsung may use its machine/chips for phones. the machine that does it can be mass produced and sold to its competitors which ends up being in a factory(foundry) where asic chips are then made on the machinethese machines are very expensive usually multiple billions and i mean mega billions to be built. so this is usually where different 'end product' companies 'rent' the machines for a few days/weeks/months/a season to get their chip designs made in batches, and then use them chips in a separate factory for their own products to have the tech, without the huge multibillion equipment cost of buying the machine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 21, 2022, 10:36:03 AM",
      "body": "The semiconductor industry has always been building mega feats regarding nanoscale levels. I remember that AMD made 7 nm processors before, and the industry research is on 3 nm already. That's amazing if you think about it. The manufacturing level that they have and the engineering design are good since you can fit more and more parts in a minor chip. More powerful. It doesn't directly affect the cryptocurrency market yet because it's still in the prototype phase. Once it launches, that's going to be one of the things to look out for. Maybe that's a sign already that they are moving into the mining area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 21, 2022, 11:26:27 AM",
      "body": "This has been discussed a few times already: https://bitcointalk.org/index.php?topic=5405138And a few other threads are around about it if you search.In the end it will eventually make mining more efficient, but for the most part it's going to take a while for the chips to get the final design, tested, manufactured, and then into miners. And then the big players get their miners 1st. It's sadly going to be a long time until miners built with these get into the hands of people like us here.But tech does keep progressing. The larger question is what will the costs be by the time we can get our hands on some of them.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 21, 2022, 01:40:27 PM",
      "body": "Looks like the main idea is to produce the chip and not the miner. Not sure if they will sell their chips to Antminer or if they will sell them to a new provider. If i were in their shoes i would create a new mining company apart from samsung for the miners production.Let's follow this news closely because i'm sure Bitmain will not stay there just watching.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "July 21, 2022, 02:17:53 PM",
      "body": "Quote from: Dave1 on July 21, 2022, 01:09:06 AM\"Snipped\"This topic had been talked about already having a similar thread https://bitcointalk.org/index.php?topic=5405138.msg60507526#msg60507526",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 21, 2022, 02:43:18 PM",
      "body": "Quote from: seoincorporation on July 21, 2022, 01:40:27 PMLooks like the main idea is to produce the chip and not the miner. Not sure if they will sell their chips to Antminer or if they will sell them to a new provider. If i were in their shoes i would create a new mining company apart from samsung for the miners production.Let's follow this news closely because i'm sure Bitmain will not stay there just watching.They more likely gonna do it since they might get a competition later. technology such as this one might not last lost to be exclusive in one company most of the time the other companies might get leak information and produce their own chip and they are the ones to sell to the miner's company to produce more power sufficient processors for mining cryptocurrencies. Seriously this news brings us more previews of the future of computers, it took them only 2 years to produce new ones. Our world is really fast when it comes to computer evolutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 21, 2022, 03:09:38 PM",
      "body": "If it is one to go buy then Samsung has achieved a mile stone but if it's not then this publication should not deceive the populace. Come to talk of it, mining with app directly from phone show's how reliable and. Environmental friendly the app would be. Then it means that the greatest challenge of mining has been settled being it the energy consumption and environmental degradation. This means that mining would be environmental friendly now as against it's back drop. But however, does this really mean that you can mine any Coin with the Samsung mining phone or otherwise because there are other mineable coin on blockchain. So OP I think you should update us to know more in this development. This is a big achievement by Samsung company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 21, 2022, 03:50:16 PM",
      "body": "Quote from: seoincorporation on July 21, 2022, 01:40:27 PMLooks like the main idea is to produce the chip and not the miner. Not sure if they will sell their chips to Antminer or if they will sell them to a new provider. If i were in their shoes i would create a new mining company apart from samsung for the miners production.Let's follow this news closely because i'm sure Bitmain will not stay there just watching.samsung is an end-product company. usually there is another company behind them that makes the fabricators(the chip machines that make the chips)one that fabricator makes one, they usually make more and sell the machines for multiple bilions to other companies where other companies rent out the machines to end product businesses to use the machine in their rental time to batch produce whatever chip template the fabricator is handed. whomever is the fabricator. they would need to price the rental slots in at the right price else places like bitmain wont rent out time to make asics on these.usually smart product makers wait a few seasons/batches where the fabricator has started getting money in via other corporations, which then reduces the rental costs. so dont expect a winter 2022 batch being 3nm bitmain chips..anyways a lower nm means less electric overall. but electric is not a significant chunk of cost for the most economical asics farmstake the $0.04c electric regions.the 2021 gen of bitmain asics were 110thash at 3.25kwhEG$12k hardware = 0.69 an hour (cost spread over 2 years)13cent electric an hour=$0.82 an hour cost. (16% electric 84% hardware)so even if they can make the chips use 45% as much electric. .. if the physical chips are more then an 8th higher than the cost of last gen chips. the math makes them less economicalEGelectric =13cent -45% =~$7centif hardware goes up to $0.75 an hour from 0.69 = $13,125 hardware (not spread over two years)yep if hardware becomes just $1k-$2k more than last gen. then its not cheaper to mine for the most economical minershowever it does play better for the people with higher electric grid costs, but then they are not as efficient anyways but their percentage of electric:hardware moves in their favourEG$0.12 grid cost per kw = $0.39 per hour asic electric cost.. vs the 0.69 hardware ($1.08 (36%:64%))so bringing their electric down from 39cent to 22cent brings their cost down to 91cent which if hardware cost was equal to last gen is a 16% overall cost saving",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Easteregg69",
      "created_time": "July 21, 2022, 03:55:23 PMLast edit: July 21, 2022, 09:40:39 PM by mprep",
      "body": "I am down to 18 nm here. Old Intel PC. Cuda Cores en mass.Middle finger up!How would you invent a new chip? By leveling and see what comes in.I wonder what I miss out on. If I don't buy the stocks and don't use the chip.Since it's not Honda.You end up making chips if your to dirty to walk naked. I assume.I will let you win in Ludo.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 21, 2022, 08:18:40 PM",
      "body": "Um, apparently others here seem unaware that Samsung DOES have their own Foundries and have been producing chips for their internal use as well as for outside customers for decades... The 1st three Foundries to get the EUV lithography equipment needed to produce chips under 7nm were in this order Intel, TSMC, & Samsung followed by Global Foundries and a company in Japan. AFAIK those are the only 5 companies on the planet that have EUV litho gear.Samsung has made mining ASICs for Canaan, MicroBT and are a 2nd source for Bitmain's chips.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 21, 2022, 09:05:26 PM",
      "body": "Quote from: Dave1 on July 21, 2022, 01:09:06 AMSamsung recently has announced that it has started to produce it's new 3 nm (nanometer) mining chips. Chips, not mining chips!Quote from: franky1 on July 21, 2022, 03:50:16 PM~ random drivelWhat mining are you talking about, mining was supposed to be dead at 30k, remember? Quote from: franky1 on April 17, 2022, 03:29:38 AMhowever bitcoins 'value' sits at a bottomline value of $30k(including the hardware costs) because right now the cheapest you cam mine bitcoin anywhere on the planet is about $30k.I wonder how yous still got the nerve to show up on these topics and pretend you have a clue what you're talking about!Quote from: CryptSafe on July 21, 2022, 03:09:38 PMCome to talk of it, mining with app directly from phone show's how reliable and. Environmental friendly the app would be. Mining with an app from a phone is reserved for scam coins.Mining with a phone will never be a thing because once the rewards will be meaningful somebody will create an ASIC for that algorithm and mine with one as much as others do with 1 million phones, what protects most shitcoins from ASICs is that their rewards are so small there is no point building ASICs for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "July 21, 2022, 09:11:08 PM",
      "body": "Are there so far any chips for mining that are branded with samsung? So far I have never seen that and could only imagine that they produce under another name. But if they now have 3nm I think they would use 5+nm for mining, if even.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 22, 2022, 02:15:44 AMLast edit: July 22, 2022, 02:32:54 AM by NotFuzzyWarm",
      "body": "Quote from: hZti on July 21, 2022, 09:11:08 PMAre there so far any chips for mining that are branded with samsung? So far I have never seen that and could only imagine that they produce under another name. But if they now have 3nm I think they would use 5+nm for mining, if even. The Canaan A921 using chips from Samsung was the 1st 7nm miner to market beating Bitmain by almost 6 months. Not sure if they did the chips for the A10x series but AFAIK they make the chips for Canaan's A11xx and A12xx miners. They made the chips for MicroBT's M10 & M20 series and I'd think probably the M3x series as well. As I said above, last year they also became a 2nd-source supplier for Bitmain after TSMC slashed mining chip production to free up production for more valuable chips.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 22, 2022, 03:47:18 AMLast edit: July 22, 2022, 04:03:25 AM by franky1",
      "body": "Quote from: stompix on July 21, 2022, 09:05:26 PMQuote from: franky1 on July 21, 2022, 03:50:16 PM~ random drivelWhat mining are you talking about, mining was supposed to be dead at 30k, remember? Quote from: franky1 on April 17, 2022, 03:29:38 AMhowever bitcoins 'value' sits at a bottomline value of $30k(including the hardware costs) because right now the cheapest you cam mine bitcoin anywhere on the planet is about $30k.I wonder how yous still got the nerve to show up on these topics and pretend you have a clue what you're talking about!i wonder what website you use these days where they use guestimates of equipment from 5 years ago to cost out the network this year (your posts using the cambridge silly example)yep you think the network is over 180TW electric usage, due to them guessing by using outdated asics and ATH network hashrate of last year rather than actual daily hashate added per day ... reality of 2022 is under 60TWoh and guess what.. bitmain hardware this month for 2022 summer batch asics is hardware of under ~$6k to buy one asic, instead of $12k to buy one just couple months ago, thus mining costs are much lower this month then just a couple months agotry to keep up. (and i can predict you want more drama of you quoting an exact price to a cent to pretend that because i rounded it must mean you are smarter..nope. just means your being anal in a topic thats about next gen chips. not last batch asic hardware)if you cant understand that i specifically mention which batch or year gen of hardware i speak of is because yep things change. whats next for you.. will you try and quote a post from 2012 where i mention that the network is 100% GPU mining and try to cause drama to suggest that im saying that 2022 is gpu mining because i said '100%' sometime, in some post.. .. no.. things change.. CATCH UPcosts have come down since april.. do you understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}