{
  "id": "topic_5425316",
  "title": "netinfra",
  "author": "netinfra",
  "created_time": "December 03, 2022, 08:03:11 PM",
  "content": "Buenas, pregunto a los expertos en estas lides. Hace tiempo que estaba al margen de las compras y en general del bitcoin y ahora he ido a comprar donde antes compraba y veo que ya plego por la correa de la UE de querer fiscalizar a todos los traders. Total que he ido mirando en las tipicas webs de compras tipo bit2me y demas y todas te piden mas papeles que hacienda. Como es normal pues como que no me apetece ceder todos estos datos a cualquiera y menos para comprar algunas decimas de bitcoin, es que va en contra de la filosofia de esto. He mirado la plataforma que he puesto en el titulo y me he creado cuenta pero veo que no es que abunden demasiados traders en ella y los  precios que ofertan tampoco es que sean del otro mundo. Queria preguntar si me podeis indicar webs fiables y sobretodo que no te pidan documentacion para poder hacer un poco de trapicheo. En mi caso no tradeo nada simplemente utilizo el poco saldo que tengo si quiero comprar algo en internet o donacion y poco mas. No soy un adicto a esto en absoluto.Saludos.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425316",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "December 04, 2022, 12:34:30 AM",
      "body": "Podrías probar con Bitso.Esta plataforma nos permite comprar criptos con diferentes formatos de pago y también podemos hacer trading con algunas de las criptos mas populares. Personalmente a mi me ha funcionado muy bien esa plataforma, y puedes usarla sin dar tus credenciales, pero eso te limitará el uso a cantidades pequeñas, si quieres mover cantidades mas grandes entonces tendrás que pasar por el proceso de KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "netinfra",
      "created_time": "December 04, 2022, 04:24:24 AM",
      "body": "Gracias compañero, esta tampoco la conocia, mirare de hacerme un user y vere. Por cierto en este mismo foro en la seccion inglesa he visto un hilo (disculpa al compañero si no lo nombre  pero es que ahora no me acuerdo de su nick) donde apuntaba a una web para comprar tambien criptomonedas que me ha resultado muy similar a la que empleaba yo en su momento. Por no pedir no te piden ni que te hagas un user, es de sede suiza, eso si si el volumen es mas alto entonces si que piden documentacion. Se llama mtpelerin.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 04, 2022, 09:55:30 AM",
      "body": "No estoy muy puesto en el tema de las compras en plataformas sin KYC hoy por hoy, y en todo caso, hay que estar muy pendiente de los límites exentos y a la posibilidad de que lo instauren en el momento menos esperado. Entiendo que la idea no obstante es sacarlos del Exchange una vez adquiridos, y practicar la autocustodia.Hay un hilo reciente sobre Exchanges sin KYC que podrías echarle un vistazo, leyendo tanto los sugeridos como las opiniones posteriores acerca de algunos de ellos:  Current list of exchanges without KYC . El hilo fue creado hace dos meses, pero aun así alguno de los listados podría haber cambiado las condiciones en el ínterin.En lo relativo al site que citas, tienen un hilo informativo en el foro, pero está inactivo desde hace años. Este post es interesante al respecto, dado que cita la experiencia de compra de un usuario en la plataforma en agosto de este año (usar google translator o afín). El autor indica que la plataforma está preparada para el KYC, pero que, para el importe que probó, le pidió un móvil, un email, y una prueba de propiedad de la dirección BTC receptora.Nota: Otra opción son los cajeros de algunas redes, y hasta ciertos límites, con un fee más alto que en los Exchanges eso sí.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "netinfra",
      "created_time": "December 04, 2022, 12:19:06 PMLast edit: December 04, 2022, 12:49:03 PM by netinfra",
      "body": "Muchas gracias DdmrDdmr, efectivamente todo lo autogestiono yo en local, en mi caso no hago tradeo de ningun tipo. Echare un vistazo a todos los links que sugieres que seguro que alguna informacion sera actual a lo que busco. Corroboro la secuencia de accion que relatabas del user que compro en mtpelerin, totalmente vigente. Como lo hice ayer ya por la noche, supongo que hasta el lunes me toca esperar para que finalmente me remitan el correo con los datos para ingresarles el monto en fiat de la compra que efectue pero es exactamente igual al relatado. No se si en la segunda compra ya no te haran depositar una porcion de bitcoins hacia su cartera. Me costo mas los fees que no lo que pedian (0,50 €), en fin. Sobre el tema de los cajeros tambien era una opcion que tengo hay pendiente, cerca de donde vivo hay alguno, algun dia de estos pasare por curiosidad a ver como va el tema.Saludos.editado: he mirado el hilo donde cuenta su experiencia el usuario aleman, muy bueno y certero en todo lo que comenta, y a falta de testearlo esta claro que lo que realmente buscaba era getbittr.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 04, 2022, 02:48:19 PM",
      "body": "Epa! Se ve que eres un usuario por encima de la media, es decir, con experiencia en las lides, en todo caso, si te evitas el KYC cómo solucionas el P2P, si es el caso, a veces la personas huyen del KYC con la plataforma pero terminan dando más información a un tercero que creen desconocido, y luego,si no es P2P con que llegas ( capital) al exchange, si no involucras Fiat te salvas algo de privacidad.Entonces evalúa bien que es lo que buscas, privacidad y/o anonimato y esas dos van de la mano con la seguridad de tus activos, tres características de las criptos que se confunden siempre como una sola.Las ToS son algo que tienes que asumir Leer!!  Y sin importar que te digan no KYC, estás siempre caminando por la delgada línea que suceda. Entonces es importante asumir que si sucede, cómo vas a proceder? a la entrega de información o que se pierdan esos euros, si!  todos piensan \"bitcon x precio\" y la volatilidad, etc.Pero el verdadero riesgo no es la inversión en si misma sino donde tienes tus BTC ( criptos ) a veces hay más riesgo en eso que en el mismo valor del activo.En todo caso en los tiempos que vivimos hay que saber moverse en esta lides, por lo que mi recomendación ( hoy en día); Reminder: do not keep your money in online accountshttps://bitcointalk.org/index.php?topic=5421039.0En todo caso entre solo para decirte, bienvenido al Foro en su tablero Local Español (LE).Aquí siempre hay diversidades de opiniones, pocas pero las hay...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 04, 2022, 04:09:13 PM",
      "body": "Quote from: netinfra on December 04, 2022, 12:19:06 PM<...> Sobre el tema de los cajeros tambien era una opcion que tengo hay pendiente, cerca de donde vivo hay alguno, algun dia de estos pasare por curiosidad a ver como va el tema.<...>En lo relativo a los cajeros, tenemos un par de hilos en el foro local al respecto, aunque creo que apenas se han focalizado en las tarifas de operaciones de compra: ¿2022 - El año de los Bitcoin ATMs en España ?sobre shitcoins.club y la interrupción del servicio (con KYC para todo importe) Los cajeros ATM Bitcoin ya superan las 6.000 unidades en activoEn todo caso, si quieres ver algo de información preliminar acerca del que puedas tener más a mano, en esta página deberías poder localizarlo:https://coinatmradar.com/Luego te puedes dirigir a la página web del proveedor en cuestión, aunque sea por curiosear lo que ofrecen, las condiciones y los fees asociados, que probablemente estén muy por encima de los Exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "netinfra",
      "created_time": "December 04, 2022, 05:12:27 PM",
      "body": "@famososMuertos Gracias por la bienvenida, soy un nomada absoluto en mentalidad y sin ninguna ligadura a nada. Sobre el tema que comentabas de huir de tener tus coins online fue lo primero que tuve claro cuando empece mi incursion en esto. Por ahi en el historial tenia guardado un valor que me ha dejado plasss plasss, era la cotizacion 1Btc =264€ (joder que epoca). Nunca he estado involucrado en el tema del tradeo, simplemente como comente tener un pequeño saldo para pagar productos online o donaciones y sin ninguna pretension mas. Y sobre el anonimato/privacidad la linea esta claro que es mas delgada que la aguja de un alfiler y puedo tolerar y lo tolero porque no queda mas remedio que puedan pedirte un movil o cuenta bancaria para el intercambio/confirmacion pero que me pidan dni, selfie, y demas... no es mi camino en absoluto, intentare evitarlo siempre, ninguna necesidad. @DdmrDdmr Por ahi heche algun vistazo, si puedo hacer mis pequeñas compras en alguna de las web mencionadas evitare tambien los cajeros que de seguro que en tema fees tambien estaran subidos de vuelta. Muchas gracias por las recomendaciones. Siguiendo el hilo del chaval aleman, el ultimo post que data de relativamente poco tiempo comentaba que estan mandando emails (los de getbittr) diciendo que de los 3 bancos donde operaban, dos ya les han censurado las cuentas para el tema y tan solo le queda una perteneciente al Reino Unido. Vemos que esto va de mal en peor. Al final se tendra que incursionar en lo que realmente es underground y no por tentaciones inconfesable sino para encontrar algo libre del sistema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "December 05, 2022, 07:27:27 PM",
      "body": "Cada dia se cierra mas y mas la posibilidad de conseguir sin dejar \"ningun rastro\".Desconocia esas alternativas que comentaste y comentaron.Revise un par de hilos, y resulte yendome por las ramas y termine mirando unos hilos de mineria y despues acusaciones sobre/entre mineros.Quote from: netinfra on December 04, 2022, 05:12:27 PMSiguiendo el hilo del chaval aleman, el ultimo post que data de relativamente poco tiempo comentaba que estan mandando emails (los de getbittr) diciendo que de los 3 bancos donde operaban, dos ya les han censurado las cuentas para el tema y tan solo le queda una perteneciente al Reino Unido. Vemos que esto va de mal en peor. Al final se tendra que incursionar en lo que realmente es underground y no por tentaciones inconfesable sino para encontrar algo libre del sistema. Respecto a esto podriamos hacer un paralelismo/analogia con la famosa frase. \"Del polvo venimos al polvo vamos\"Del foro venimos al foro vamos. Cada dia nos acercamos mas a volver a tener que usar un foro entre conocidos. Salvo los DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "netinfra",
      "created_time": "December 05, 2022, 10:36:46 PM",
      "body": "Quote from: darxiaomi on December 05, 2022, 07:27:27 PM...Del foro venimos al foro vamos. Cada dia nos acercamos mas a volver a tener que usar un foro entre conocidos. Salvo los DEX.Sin duda una formula ideal el intercambio directo pero imagino que eso es sinonimo de confianza total entre los miembros cosa que es complicado conseguir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 06, 2022, 09:25:35 AM",
      "body": "Quote from: netinfra on December 03, 2022, 08:03:11 PM<…>Queria preguntar si me podeis indicar webs fiables y sobretodo que no te pidan documentacion para poder hacer un poco de trapicheo. En mi caso no tradeo nada simplemente utilizo el poco saldo que tengo si quiero comprar algo en internet o donacion y poco mas. No soy un adicto a esto en absoluto. Un aspecto más a comentar en este sentido, y con foco a los usos operativos prácticos, es la posibilidad de realizar compras de vales a modo de ticket regalo en algunas sites mediante pagos en criptomonedas. Es algo útil y práctico, a fecha de hoy (a saber lo que va a durar) sin KYC, y puede ser una manera interesante de gastar sin tener que \"descambiar\", a falta (desafortunadamente) de una oferta más amplia de sitios donde puedas realizar un pago directo en cripto que no requiere identificarse o que no quede ligado a una cuenta de usuario en la entidad destino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "netinfra",
      "created_time": "December 06, 2022, 09:58:38 AM",
      "body": "@DdmrDdmr. Desconocia completamente esa formula, con una mirada rapida en https://www.bitrefill.com/buy/amazon_es-spain/?hl=es he visto que se puede comprar cheques regalos de amazon con BTC y canjearlos en saldo para comprar sus productos (habria que ver donde esta el limite o que productos son elegibles). Suena bien.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 06, 2022, 10:13:50 AM",
      "body": "Quote from: netinfra on December 06, 2022, 09:58:38 AM<...>Esa es la plataforma del estilo que primeo me viene a la mente. Además, aunque sea poco, hay unas cuantas opciones de compra que te retornan el 1% a modo de saldo btc adicional en la cuenta. Los fondos los puedes cargar y tener algo de liquidez en la cuenta, o gestionar pago a pago.Técnicamente, Bitrefill permite el pago hasta con fiat, por lo que no sé ni siquiera si el código de compra puede dar una pista de la forma de pago utilizada. En este sentido, uno podría ponderar que los ticket regalo a mostrar en mano en tienda, sin enlace a cuentas ni a tarjetas de fidelización, son la opción más segura. En el comercio que enlazas (Amazon), si bien mucha gente lo utiliza allí, siempre queda en el fondo de la mente si se puede llegar a ligar el hecho de que el ticket regalo fue pagado en origen con bitcoin. Otra cosa es si esto se llega a explotar en su caso, que a fecha de hoy, lo dudo.Por último, citar que los pagos en comercios con tickets regalo creo que se equiparan al uso de efectivo. Amazon creo que te pide el DNI si realizar compras por más de 3K € en un ejercicio contable (año), agregando todos los métodos de pago, dado que creo que se lo ha de pasar a Hacienda. Ej/ https://www.rankia.com/foros/fiscalidad/temas/3431008-amazon-pide-nif-por-haber-superado-umbral-compras-reembolsos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "netinfra",
      "created_time": "December 06, 2022, 11:10:24 AM",
      "body": "Me imagino que si la gente utiliza la cabeza y no abusa de esta formula no parece que pueda presentar asi de entrada ningun problema burocratico a posteriori. Otra cosa es lo que comentas sobre si hay o no anonimato total de la moneda utilizada para comprar esos cheques. La cuestion practica es que parece ser por las opiniones que dice la gente que si les funciona. Y los productos que se pueden adquirir via cheques son los que se venden/envian propiamente desde amazon (bastantes en principio).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 06, 2022, 02:05:40 PM",
      "body": "Quote from: darxiaomi on December 05, 2022, 07:27:27 PMCada dia se cierra mas y mas la posibilidad de conseguir sin dejar \"ningun rastro\".No solo en cuanto a bitcoin, hoy en día lo que hacemos está más controlado que nunca. Quote from: DdmrDdmr on December 06, 2022, 10:13:50 AMTécnicamente, Bitrefill permite el pago hasta con fiat, por lo que no sé ni siquiera si el código de compra puede dar una pista de la forma de pago utilizada. En este sentido, uno podría ponderar que los ticket regalo a mostrar en mano en tienda, sin enlace a cuentas ni a tarjetas de fidelización, son la opción más segura. SíQuote from: DdmrDdmr on December 06, 2022, 10:13:50 AMEn el comercio que enlazas (Amazon), si bien mucha gente lo utiliza allí, siempre queda en el fondo de la mente si se puede llegar a ligar el hecho de que el ticket regalo fue pagado en origen con bitcoin. Otra cosa es si esto se llega a explotar en su caso, que a fecha de hoy, lo dudo.A día de hoy tal vez no, pero hay un sistema de facturación electrónica que en teoría será obligatorio para julio de 2024, con el que hacienda conocerá de cada factura emitida en el momento de emitirse, y que parece que algunas grandes empresas ya están usando. La cuestión es qué datos darán en esa facturación, pues si tu vas a una tienda de alimentación y pagas en efectivo, no le pasaran tu nombre a hacienda al reportar esa transacción, pero seguramente si pagas con tarjeta sí, o si pagas en un sitio como Amazon, donde tal vez no has dado tu DNI pero tienen varios datos tuyo, como nombre email y domicilio.  Esto en España, pero entiendo que es una tendencia mundial, la de las haciendas de tener el máximo de datos posible en tiempo real.O sea que yo no confiaría mucho en que Amazon no le vaya a pasar los datos de los españoles a hacienda a partir del año que viene. Quote from: DdmrDdmr on December 06, 2022, 10:13:50 AMPor último, citar que los pagos en comercios con tickets regalo creo que se equiparan al uso de efectivo. Amazon creo que te pide el DNI si realizar compras por más de 3K € en un ejercicio contable (año), agregando todos los métodos de pago, dado que creo que se lo ha de pasar a Hacienda. No es exactamente así. El modelo 347 se tiene que presentar cuando tú adquieres bienes o servicios por más de 3.005,06 € anuales. Da igual que sea en una transacción que en muchas. Y da igual que sea en efectivo, cheques regalo o pagos con tarjeta. Si pasas de esa cantidad en un año, Amazon te detecta que eres la misma persona y por tanto te pide el DNI, pero si por ejemplo vas a El Corte Inglés y pagas en efectivo a lo largo de un año por encima de esa cantidad sin pedir factura, no van a saber que has sobrepasado la cantidad anual, y por tanto no lo van a presentar. Quote from: netinfra on December 06, 2022, 11:10:24 AMMe imagino que si la gente utiliza la cabeza y no abusa de esta formula no parece que pueda presentar asi de entrada ningun problema burocratico a posteriori. Otra cosa es lo que comentas sobre si hay o no anonimato total de la moneda utilizada para comprar esos cheques. La cuestion practica es que parece ser por las opiniones que dice la gente que si les funciona. Y los productos que se pueden adquirir via cheques son los que se venden/envian propiamente desde amazon (bastantes en principio).Me parece que llegas un poco tarde al tema compañero, por lo anteriormente expuesto. A día de hoy, si tú tienes un cheque regalo de 100€ en Amazon o El Corte Inglés, hacienda no puede saber de donde viene, porque Bitrefill es una empresa sueca, que se dedica a esto admitiendo diversas formas de pago. La empresa que emite los cheques está en otro país, y hacienda no va a enviar un requerimiento a dos paises para averiguar de donde vienen 100€.Ahora bien, si alguien tiene bastante bitcoin sin declarar, cambiar 2.900€ en cheque regalo en Amazon y otros tantos en las varias sites que permita Bitrefill, se arriesga a que si le hacen una investigación, le van a pedir explicaciones y tal vez sí que envíen requerimientos. A esto sumadle la próxima puesta en marcha de los CBDCs y la demonización del bitcoin por esto precisamente, pues nos van a vender que los CBDCs son ideal y el bitcoin es el demonio, a lo que mucha gente responderá dando palmas con las orejas. Ayer abrí un hilo al respecto de esto, pues ahora nos quieren vender que los CBDCs son respetuosos con la privacidad:LMAO: Lagarde says Euro CBDC seeks to 'ensure high standars of privacy'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 06, 2022, 05:23:08 PM",
      "body": "Quote from: Don Pedro Dinero on December 06, 2022, 02:05:40 PM<…>Sí, lo del modelo 347 es como dices. Salía por la puerta cuando me puse a elaborar el post, y no acabé de reflejarlo de la manera que quería. También incluye información explícita si el cúmulo de pagos en efectivo supera los 6K €, pero vamos son importes elevados, aunque a tener en cuenta por si alguien se vuelve loco comprando tarjetas regalo, y gastándolas en una misma cuenta donde uno está identificado como sería el caso de Amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}