{
  "id": "topic_5405304",
  "title": "Symmetrick",
  "author": "Symmetrick",
  "created_time": "July 05, 2022, 07:18:10 PMLast edit: November 30, 2023, 01:03:11 AM by Symmetrick",
  "content": "ㅤ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405304",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "July 05, 2022, 07:23:28 PM",
      "body": "Quote from: Ratimov on July 05, 2022, 07:18:10 PMThis is another good example of how critics in the past become investors in the future. When you read another bitcoin negative from some big investor, be it a company or an individual, chances are that soon bitcoin will become part of his business. Money talks.  Goldman Sachs' stock is already 25% off the highs so you know they're looking to capitalize on any moneymaking opportunities they can get.  With Celsius, they'll be jumping into crypto pretty heavily, but I'm sure they own plenty of digital assets already.  I've actually been looking at Goldman Sachs lately as an investment, as being 25% off the highs, scooping up cheap assets, and having a P/E ratio below 6 has the stock beginning to look attractive.  If we don't go into the recession (the government would be right for once) I think GS would be a pretty good buy here.  That's a big \"if\" though, since right now I think the only people who don't think we're going into recession is the people who said we wouldn't have inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 05, 2022, 08:02:11 PM",
      "body": "\"We are the Borg Bitcoin. You will be assimilated. Resistance is futile.\"It really seems to be coming down to that. People see other people using BTC, and it's advantages and potential profits and want to get in on it.Even if they did not like it or support it at 1st, they don't want to be left out.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 05, 2022, 08:33:39 PM",
      "body": "If you read many of the comments on new technologies like the internet when it first came out, they were mostly criticisms about how it can not work and the old system being better,This forms part of the 'diffusion of innovation model', which explains how new concepts are accepted. It's a slow process with the vast majority being against it at first, but they eventually join in with the late majority and laggards, especially when it was a great innovation to start with.Brands like Goldman Sachs which are motivated by profits would no doubt jump on the train when the market turns up. I would not be too surprised if they criticize it at a later time if it keeps dipping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "groupsepehr",
      "created_time": "July 05, 2022, 08:42:15 PM",
      "body": "if there is one company that hurt world is Goldman Sachs so i dont know what to say . i heard the bought similar company around the word like https://www.khabaronline.ir/news/1569882/%D8%A2%DB%8C%D8%A7-%D9%BE%D8%A7%DB%8C%D8%A7%D9%86-%D8%B9%D9%85%D8%B1-%D8%A8%DB%8C%D8%AA-%DA%A9%D9%88%DB%8C%D9%86-%D9%86%D8%B2%D8%AF%DB%8C%DA%A9-%D8%A7%D8%B3%D8%AA that located in middle east",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 05, 2022, 09:12:14 PM",
      "body": "Quote from: Ratimov on July 05, 2022, 07:18:10 PMThis is another good example of how critics in the past become investors in the future. When you read another bitcoin negative from some big investor, be it a company or an individual, chances are that soon bitcoin will become part of his business. I believed,  these are some of the new businessmen, Investors or companies that causes the bear market in bitcoin. They first believed that bitcoin is a scam  so it is used only for Scammers to scam people but ironically, when they see that bitcoin is not the way they thought of it and governments, industries, individuals are using it to become millionaires and billionaires. So they come in with their business wealth to buy a lot bitcoin. I have seen and heard of people criticizing bitcoin as a fraudulent means of people mostly the youth to defraud people in the society. As of now, that notion of calling bitcoin as a means of defrauding people is dieing down. Because people have started seeing that bitcoin is not for fraud but just like a fiat currency for exchanging goods and services on the internet. And all those people that are saying bitcoin will come to an end because of the bear market as of now is making a very big mistake. As for me I see bitcoin as just like my fiat currency which is fluctuating with dollar every month or year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 05, 2022, 09:35:18 PM",
      "body": "you are always going to get silly comments even from people that use it.take the internet, it has only been truly popular for most households for about 20-25 years.yet even this year people use the internet all the time while still calling it out as \"its just a place for trolls, people that make cat videos/memes and people to post pictures of what they ate that day\"yet they still use it themselves to book vacations, to speak to their friends and to do numerous other things. .. you wont stop the bad sentiments so ignore them. the funnier part is that if it wasnt interesting, used, worthy. it would not be mentioned at all..i have no interest at all in insect farms. so i dont bother even taking a second to look into lifespans of insects or the price of the insect display cases or the type of soil needed for antfarms.. it just has no interest for me.yet when you see people research or discuss or look into it and be intrigued enough to have an opinion on something.. then it shows that its worth something atleast to many people. dont worry about the haters. . just know and care about the utility of bitcoin..EG i personally never want to own an antfarm and hate the idea of seeing insects inside the place i live. but even i understand that insects are what pollinate the plants that feed us and animals and keep us alive. EG people will shout how they hate the internet but they know their lives now would be different without itbitcoin isnt going to disappear. people are going to use it. so relax about the hate speech. give them time. they will start to see the utility even if they take too long being ignorant to it, or even if they stil call it out as bad while they themselves use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "July 05, 2022, 10:21:43 PM",
      "body": "QuoteThe longer bitcoin grows, the less haters it has. Yesterday's bitcoin haters start doing business with bitcoin tomorrowHow're they supposed haters? I guess someone's probably envious or jealous of something he doesn't have but sees it sufficiently in others. If maybe he seems to be a bit skeptical on the new digital concept rather that mere fiat,maybe these ideology would change overtime (just as it has).N/B This dude lives in affluence which invariably means he's the kind that could help rehabilitate this other dude called BTC.Quote2020: Bitcoin is not a real asset Maybe it took 'em a decade to realize the motive.Sandra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 06, 2022, 12:00:00 AM",
      "body": "\"If you can't beat them, join them\" - Goldman Sachs' seems to like this. They started to hate Bitcoin, but I think there are also some reason why they telling it to public before, maybe they are just accumulating lot of cheap Bitcoins before, that's why they intend to spread some FUD and buy cheap Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 06, 2022, 12:11:22 AM",
      "body": "heres another opinionif you found some rare mineral on a piece of land. and you know it may be on your neighbours land too but no where else..would you be the one saying \"hey neighbour, i got a secret, your land is worth billions\" or would you be like \"neighbour, um let me do you a favour, your having a tough time, your land is worthless heres some cash to move away from your land, its worthless\"many savvi scrupulous businesses would sway people away because if they hype up something. they create the very competitors they want to avoid. they dont want to shoot themselves in foot pushing the price up before they get a chance to buy-in first themselves",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "July 06, 2022, 12:43:13 AM",
      "body": "Quote from: Ratimov on July 05, 2022, 07:18:10 PMThis is another good example of how critics in the past become investors in the future. When you read another bitcoin negative from some big investor, be it a company or an individual, chances are that soon bitcoin will become part of his business. It was Andrew Smith who said, \"People fear what they don't understand\" I'll add \"and they try to demonize it\". One thing is for sure 2022 is the year were the magic with bitcoin is happening. We are seeing big institutional investors wanting to get a piece of the bitcoin pie. It seems to me that they are taking advantage of the bearish market. They are slowly but steadily setting the tone for mass adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "July 06, 2022, 01:30:51 AM",
      "body": "The journey of Goldman Sach started as being a fudder to becoming a centralized lending platform. But why they did start with  fud is to start buying cheap. They've probably been buying BTC way before they started spreading fud. Jaime Dimon journeys this path too until he utilized blockchain for his company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 06, 2022, 01:36:18 AM",
      "body": "Great thread, Ratimov.I mean they are just a bunch of retards you know? Or you can call them better than those who are selling at these prices.Maybe they didn't understand the technology earlier as compared to the rest of us but yea, they are on it now and will invest more than what we can invest in our favorite asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 06, 2022, 02:32:09 AM",
      "body": "They are like JP Morgan.In September 2017: Bitcoin is a fraudIn July 2021: PMorgan Becomes The First Big Bank To Give Retail Clients Access To BitcoinI don't know how to do this but if anyone can make a chart like this one, for JP Morgan and Goldman Sachs, that will be great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullius",
      "created_time": "July 06, 2022, 02:32:41 AM",
      "body": "IMO, Goldman Sachs’ entrance to the market is bearish for Bitcoin.  They will do their best to extract profits in central bank shitcoins (“dollars”) any way they can—and they are quite talented at what they do.Retail buyers with moons in their eyes get excited by institutional money.  I ask if Bitcoin is ready for it yet—if the BTC market is yet robust enough from adoption and usage to sustain the onslaught of highly-capitalized professional traders who account PnL in USD, without destabilizing.  Such participants have already changed the market sufficiently to yield the benefit of killing off magical TA lines, such as faith in 200 WMA as a quasi-mystical Bitcoin Bottom.  At least, that is better for Bitcoin in the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 06, 2022, 02:58:30 AM",
      "body": "Goldman Sachs is not the first and will not be the last of course who change their hostile attitudes towards Bitcoin, there are many big business people who were haters of Bitcoin and then turned into supporters or at least invested in Bitcoin, not only businessmen but also big companies like PayPal that were rejecting Bitcoin Then she turned to accept it fully.My point of view is that businessmen are not haters or lovers, but rather look at things, do they give them profits or not, regardless of whether they like it or hate it, so when they make sure that Bitcoin will give them a lot of profits, they will not be slow to buy it even if they hate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "July 06, 2022, 03:45:24 AM",
      "body": "Banking/Bankers don't really tend to be lovers or haters of anything except fiat opportunities that come to fruition or events that cause or lead to the loss of fiat respectively.  Anything else is just a smokescreen to get your emotions involved, .i.e., fud, panic sell, etc., which typically isn't in your best interest in business matters.  At the end of the day, business is business",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 06, 2022, 06:08:13 AM",
      "body": "Quote from: tranthidung on July 06, 2022, 02:32:09 AMThey are like JP Morgan.That's what I was thinking. They are not the only ones. We could find more, but what I think it shows is that bitcoin is unstoppable, which is worth remembering in these bearish times. I'm not sure I like the involvement of these institutions very much, as it was supposed to be the kind of institutions that Satoshi wanted to run away from when he created bitcoin. The thing is that there is nothing we can do about it, bitcoin is freely traded and these institutions can buy it just like any other. If they offer it to their customers, they help adoption to some extent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "July 06, 2022, 07:03:43 AM",
      "body": "Really surprising how Goldman Sachs made a 360 degree turn towards crypto currencies in such little time. In 2018 the bank opened their first crypto trading desk, only to close it shortly after. In 2020 they still are heavily against it and saying it's not a real asset class, but in 2021 they are reopening own trading desk. As such a big investment bank it's all about making money, so as soon as a trading team is not generating enough revenues they will drop it. Also there might be some branches of the bank who are pro cryptos all along. I think the bank mainly tries to make money based on commission  and will go into everything that their clients want to invest in. Similar to the 2008 mortgage crisis where in the years before the bank was heavily selling credit default swaps to their clients. They were pitching two sides of the trade to their investors so they would buy either the long or the short contract and the bank is left without any exposure and only makes money from selling their products.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 06, 2022, 08:36:05 AMLast edit: July 06, 2022, 09:05:47 AM by franky1",
      "body": "Quote from: Mauser on July 06, 2022, 07:03:43 AMReally surprising how Goldman Sachs made a 360 degree turn towards crypto currencies in such little time.goldman sachs does not technically own $2b of btc (~100k btc)it paid $2b to celsius, where celcius bought (im guessing) ~100k coins and put about X coins into its customer custodian locks of its sidechain to make the customers whole again.and the done a \"lock\"/escrow with G.sachs for the remaining coin as collateral for the future. G.sachs does not currently 'own' them its a more of a partnership lock of potential future release of celsius defaults on fiat repaymentsthe customer \"liquidation\" of celsius assets is now protected by a near 5x collateral with G.sach",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}