{
  "id": "topic_5419294",
  "title": "Pterosaur",
  "author": "Pterosaur",
  "created_time": "November 03, 2022, 11:10:29 AM",
  "content": "I think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. Any Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419294",
  "comments": [
    {
      "author": "yazher",
      "created_time": "November 03, 2022, 12:09:49 PM",
      "body": "Well! if you smell some kind of problems in your investment, you need to move right away before the price will drop and you won't get another chance to save your money. This is because if a number of people will find out about the problem, they will gonna move to another altcoin too and the price will also drop will gonna causing negative earnings in your investment and might affect your total amount of capital. There are multiple choices out there for you, why not choose the best altcoins without such kinds of problems?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 03, 2022, 12:49:48 PM",
      "body": "Not a Solana investor, but I understand your concern. However, if you see some issues, then better stop investing and wait till the project settles down.Recently it was hack or involved in a huge amount of money being lost to this cyber actors. So that is a black eye already and it not just happen one time, twice to be exact and everything was drain. And so I heard this new issue on there side. Not a financial advise, but it's better to stir away from Solana for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "November 03, 2022, 01:10:43 PM",
      "body": "Quote from: Pterosaur on November 03, 2022, 11:10:29 AMI think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. Any Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?Solana is a good ecosystem but Sometimes Solana network becomes slow due to some problems.  So it often scares investors. And since the crash of popular coin Luna, every coin now has a fear factor to invest in. So now it is not right to invest high amount of money in any coin. I have no investment in solana right now.  And still I don't plan to invest in sol.  Now I think it is safe to invest only in Bitcoin and Ethereum. But since investing in cryptocurrency is risky, BTC and ETH cannot be guaranteed 100% profitable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "November 03, 2022, 01:58:21 PM",
      "body": "Quote from: coinerer on November 03, 2022, 01:10:43 PMQuote from: Pterosaur on November 03, 2022, 11:10:29 AMI think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. Any Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?Solana is a good ecosystem but Sometimes Solana network becomes slow due to some problems.  So it often scares investors. And since the crash of popular coin Luna, every coin now has a fear factor to invest in. So now it is not right to invest high amount of money in any coin. I have no investment in solana right now.  And still I don't plan to invest in sol.  Now I think it is safe to invest only in Bitcoin and Ethereum. But since investing in cryptocurrency is risky, BTC and ETH cannot be guaranteed 100% profitable It's not a matter of slowness, what we're talking about here is that it's outage many times. I remember correctly it happened 9 times this year and this is unacceptable for a top project like solana. It can be funny that Solana is leading the list of blockchains with the most problems right now. As an investment, there is always a risk. Diversify your portfolio with different investments, not only invest all your money in cryptocurrencies but also invest in gold, stocks...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "November 03, 2022, 02:03:08 PM",
      "body": "Quote from: coinerer on November 03, 2022, 01:10:43 PMQuote from: Pterosaur on November 03, 2022, 11:10:29 AMI think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. Any Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?Solana is a good ecosystem but Sometimes Solana network becomes slow due to some problems.  So it often scares investors. And since the crash of popular coin Luna, every coin now has a fear factor to invest in. So now it is not right to invest high amount of money in any coin. I have no investment in solana right now.  And still I don't plan to invest in sol.  Now I think it is safe to invest only in Bitcoin and Ethereum. But since investing in cryptocurrency is risky, BTC and ETH cannot be guaranteed 100% profitable Not a single cryptocurrency guarantees 100% profit, including BTC and ETH. But BTC and ETH have much more chances to be profitable than Solana, and also, much more reliable than Solana. Luna there is no comparison with them and of course, you need to carefully consider any investment. Not only twice, like OP, but many times.If OP already has thoughts about changing Solana to other altcoin, then it seems that he has already mentally made a decision and expects to suffer his fears, in the comments of other users to finally make sure of his decision. I have a question for OP, and for which altcoin he wants to change Solana in his portfolio? Will it be so that he will buy something even worse?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "November 03, 2022, 03:10:18 PM",
      "body": "If they are not addressing the issues and they are not updating their platform then you can leave Solana its good that you monitor the status of the project you're investing in, I don't have Solana invited to invest but cannot keep up with so many coins already in my portfolio, if you're investing you should always monitor, or you either leave it or trade it to a better coin in the market, that is why I concentrate my portfolio on coins that have proven their worth in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "November 03, 2022, 03:30:48 PM",
      "body": "Quote from: m2017 on November 03, 2022, 02:03:08 PMQuote from: coinerer on November 03, 2022, 01:10:43 PMQuote from: Pterosaur on November 03, 2022, 11:10:29 AMI think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. Any Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?Solana is a good ecosystem but Sometimes Solana network becomes slow due to some problems.  So it often scares investors. And since the crash of popular coin Luna, every coin now has a fear factor to invest in. So now it is not right to invest high amount of money in any coin. I have no investment in solana right now.  And still I don't plan to invest in sol.  Now I think it is safe to invest only in Bitcoin and Ethereum. But since investing in cryptocurrency is risky, BTC and ETH cannot be guaranteed 100% profitable Not a single cryptocurrency guarantees 100% profit, including BTC and ETH. But BTC and ETH have much more chances to be profitable than Solana, and also, much more reliable than Solana. Luna there is no comparison with them and of course, you need to carefully consider any investment. Not only twice, like OP, but many times.Bitcoin and Ethereum are definitely profitable but Solana on the other hand is never comparable with Bitcoin and Ethereum. Everyone believes that bitcoin will never be a scam because it is the first cryptocurrency coin and all cryptocurrency markets depend on bitcoin. If bitcoin is a scam then the whole cryptocurrency world will be destroyed. But if solana is a scam then crypto may see some negative impact but it will be only temporary.  So solana can never be fully trusted.  And it will not work for smart people to invest big amount there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "November 03, 2022, 04:16:56 PM",
      "body": "Quote from: Pterosaur on November 03, 2022, 11:10:29 AMI think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. The problem never got solved since last year. I meant if people didn't even aware about the fact that if solana was also facing so many outages that was making the blockchain became offline. I remember the developers have said about there would be an update to fix it but that never happened. Hetzner has been taking the right decision as the solana developers were always making BS promise. 1k validators are almost 66% from total validators. That's a very bad thing to see that happened with solana. Quote from: Pterosaur on November 03, 2022, 11:10:29 AMAny Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?Im holding some solana. I have been switching my bag since last year once solana reached the peak price. Im not even interesting to hold this altcoin anymore but only use a few as speculation only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 03, 2022, 04:59:04 PM",
      "body": "The thing about Hetzner is that they already inform their users way long ago before they started kicking off any cryptocurrency-related usage. Solana is not the one who is affected, all cryptocurrency-related platform that relies on Hetzner are now breaking the terms and conditions. Since by the time it is already enforced, it won't be long time for the impacted users are migrating to another cryptocurrency-friendly hosting.If the recent validators getting offline greatly impacts the ecosystem, then you should see the big picture in regard to the centralization of the chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Liz Truss",
      "created_time": "November 03, 2022, 09:44:04 PM",
      "body": "With everything happening to Solana, you're still thinking of leaving your funds with Solana?, that's a big red flag and it's a warning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "November 03, 2022, 09:53:18 PM",
      "body": "Quote from: Pterosaur on November 03, 2022, 11:10:29 AMI think I need to think twice before investing in Solana, I haven't seen a blockchain project that's plague with problems like Solana, many other projects passed some challenges in the past but this Solana issue is never going to be fixed it seems.1,000 Solana Validators are offline because Hetzner, a cloud service provider has blocked all Solana network activity on it's servers. Any Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?I have commented yesterday with the same topic, Solana and this is what I've said.Quote from: blockman on November 02, 2022, 07:53:30 PMWhile that is technical jargon, I don't know about them. What makes me think that Solana's future might be affected is due to hacking.(https://seekingalpha.com/article/4546458-solana-one-hack-too-many)(https://www.theverge.com/2022/8/3/23290149/solana-ecosystem-blockchain-attack-hack-wallets-phantom-slope-supply-chain)If you're no longer seeing the good things about the project, it's better for you to start moving and putting your money somewhere where you're thinking that it's the best project for you. There have been some clues already that the project will not do good anymore based on those problems that popped but it doesn't mean that it's value would drop quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "November 03, 2022, 10:58:59 PM",
      "body": "Quote from: coinerer on November 03, 2022, 01:10:43 PM....Now I think it is safe to invest only in Bitcoin and Ethereum.Ethereum is not that safe either https://www.coindesk.com/business/2022/08/26/ethereum-could-get-kicked-off-cloud-host-that-powers-10-of-crypto-network/Let's be fair here. We cannot single out Solana in this case because there are also many blockchain projects whose servers are under the control of centralized platforms like Hetzner or Amazon. They have their own terms and they can terminate their service once they're convinced TOS has been violated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CuriousGeorge",
      "created_time": "November 03, 2022, 11:38:52 PM",
      "body": "Quote from: Liz Truss on November 03, 2022, 09:44:04 PMWith everything happening to Solana, you're still thinking of leaving your funds with Solana?, that's a big red flag and it's a warningSometime the investor like him may not know which would become potential coin to invest. I guess he can learn from what happened in solana may destroy the solana itself. The problem never got solved. So many people were also complaining about that in the various channels. They were asking responsibility from the developers. Solana might not a decentralized blockchain even if it has lots of nodes. The problem is another POS blockchain other than solana was also having the same problem. Look at BSC, this blockchain is also being controlled even by a few nodes. Solana is having greater amounts of nodes compared with BSC. The problem is when will the developers will be patching the problem that is always coming for solana and shutdowns its blockchain temporary?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "November 03, 2022, 11:46:05 PM",
      "body": "Quote from: Pterosaur on November 03, 2022, 11:10:29 AMAny Solana investors here? Do you think its a good idea to switch bags from Solana to another top altcoins?Are young going all-in on Solana? Actually, you can do diversification if you are concerned about investing in Solana. There are lots of worthy coins out there that you can also consider putting up some money on while having a current investment in Solana.Since everything is speculative, we don't know what will happen in the future therefore you really need to see to do some actual actions to see the result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "November 04, 2022, 06:06:50 AM",
      "body": "Quote from: yazher on November 03, 2022, 12:09:49 PMWell! if you smell some kind of problems in your investment, you need to move right away before the price will drop and you won't get another chance to save your money. This is because if a number of people will find out about the problem, they will gonna move to another altcoin too and the price will also drop will gonna causing negative earnings in your investment and might affect your total amount of capital. There are multiple choices out there for you, why not choose the best altcoins without such kinds of problems?This problem about solana is not new but it was already reported before and yet some users choose to stay thinking it will be fixed soon but I am surprised that this problem still exist. I guess that is enough for this coin. There are still lots of good coins out there which don't have a problem like this but if ever they experienced any, their developers are then taking an immediate action because they know what it can cause to them.There is a new project being introduced here last time and said to be better than solana. I think the title of that thread was solana killer. Maybe the op want to check that out if he want something similar like solana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "November 04, 2022, 06:11:16 AM",
      "body": "I'm an investor of solana before, but decided to sell because when there's an outage it really affect its price, hence I switched to other coins that I think is much worthy to hold for long term.If you have doubt then dont invest as there are many coins out there that can be your option.Moreover it's also advisable to diversify, but be careful on choosing what coins to invest in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "November 04, 2022, 06:23:49 AM",
      "body": "With so many problems that you are already aware of from the project, why ask other people for their opinions, you are right by paying attention to all aspects of the project and it would be better if the irregularities and problems that arise are also your consideration to start with other coins, don't wait until a bigger problem appears before you get out because if that happens your assets may already be in red condition",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "November 04, 2022, 06:54:47 AMLast edit: November 04, 2022, 07:05:17 AM by CryptoYar",
      "body": "I had invested in this project in the previous bull run but exited after a short-term profit.Right now I think the big players who were supporting this project ( like Almeda research ) are now supporting other layer 1 projects. Like aptos and sui. Many developers are currently giving priority to these two layer 1 blockchains instead of solana. Hence I think it's time to consider other altcoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "November 04, 2022, 07:28:23 AM",
      "body": "The choice is yours to decide whether to change mind or not, as a matter of fact it's your investment and no one should detects for you what to do or not because if you should take any advice over here and went against whom then do you blame for making you take the wrong decision. So if you perceived danger then you should file your case out from such investment and moved on to which you are comfortable with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}