{
  "id": "topic_5433336",
  "title": "KupaCrypto",
  "author": "KupaCrypto",
  "created_time": "January 07, 2023, 05:44:00 AM",
  "content": "I think with the way the boys are playing now, there is an assurance of Manchester United finishing this season in the top four position, but winning s trophy is something that is also necessary. Looking at the trophies Manchester United still have a chance of winning, There are still much in contention for the premier League, they play Barcelona next month in the uefa Europa League, they are still in the FA cup, and even the caraoba cup, so for the league it will take only an arsenal slip off for Manchester United to catch them , but I think Manchester United have a chance of winning a trophy more with the Europa League and the FA cup.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433336",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "January 07, 2023, 07:42:34 PM",
      "body": "I don’t think it’s possible he wins the EPL this campaign but they certainly have a shot at winning the FA Cup or Europa League. I know a Manchester United fan at my work & he is happy with the new coach. It’s all about progress & Ten Hag is definitely making progress.They must finish in the first four places of the EPL, this will give them Champions League football which always helps attract the best players in Europe. That is a must to keep improving then maybe next campaign 2023/24 they have a chance to win the EPL after so many years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 07, 2023, 10:17:05 PM",
      "body": "Quote from: DeathAngel on January 07, 2023, 07:42:34 PMI don’t think it’s possible he wins the EPL this campaign but they certainly have a shot at winning the FA Cup or Europa League. I know a Manchester United fan at my work & he is happy with the new coach. It’s all about progress & Ten Hag is definitely making progress.They must finish in the first four places of the EPL, this will give them Champions League football which always helps attract the best players in Europe. That is a must to keep improving then maybe next campaign 2023/24 they have a chance to win the EPL after so many years. yes with the way they play now I know many Manchester United fans will be optimistic, because they now play with Identity, even when they don't play well they have the mindset to win and that's very important, that winning mentality must be in a team, it's a good one, let's sit and watch them take a shot at trying to win the Europa League and the FA cup, maybe it will just be the beginning of trophies returning to the theatre of dreams again after a long time of playing football without a trophy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}