{
  "id": "topic_5445295",
  "title": "MCVXYZ",
  "author": "MCVXYZ",
  "created_time": "March 17, 2023, 04:17:56 PMLast edit: March 18, 2023, 09:46:05 AM by MCVXYZ",
  "content": "Today I was thinking about what are the good,hidden effects of bitcoin's rise in society...As I understand the first and the most important thing is - the will to educate yourself. no doubt that  who were previously not interested for example in trading have now taken an interest in this field, with some even making it a full-time job, even my friends, some of them were soccer players and didn't even know anything about economics. it also has forced people to think critically about money and how it works, sparking debates and discussions about the role of government in the economy.When trader analyzes the situation he is not only think about economy,but politics.Moreover, Bitcoin's technology, blockchain, has been hailed as a game-changer in various industries, from finance to logistics, and even politics. This has led to an increase in interest in technology and its impact on various sectors, leading to more people educating themselves on technology-related subjects.So my advice for beginners is that not to waste time and start educating yourselves right now. bitcoin is not just an  asset but new way to encourage yourself and gather energy to read right things everyday about: how money works,politics,history,trading,social-cultural activities and etc.It would be interesting from old members to share their experience: what did you get beside s the financial wealth? Did all of these things change the way you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445295",
  "comments": [
    {
      "author": "AbuBhakar",
      "created_time": "March 17, 2023, 04:23:33 PM",
      "body": "Significant effect of Bitcoin rise on what? I like to commend you for the bravery of admitting about your previous post content are useless.The only significant effect I’m thinking was the increase of my portfolio and at the same time the increase of interest for Bitcoin investment which make the price pump more. Technically speaking increase of price means everyone is enjoying the Bitcoin experience due to the profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "March 17, 2023, 04:29:12 PM",
      "body": "Start from zero do you mean starting your posting fresh or channelling those energies to learning about Bitcoin and how it can in some point better your way of living. If you have decided to learn and acquire knowledge, that to some point will be achieved, with your stay in this forum I believe you know the right places to get the exact information you need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "March 17, 2023, 04:43:07 PM",
      "body": "Most time I have to agree that we are all gamblers looking for profits for our efforts,  a lot of forks have made some form of development,  and that is good enough remarked and luck has also played a vital role in all of this. Having basic knowledge and skills saves a lot of time and effort including your resources,  bitcoin/cryptocurrency have provided a lot of windows for individuals to take advantage of, trading is one of such aspect that has engaged a lot of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MCVXYZ",
      "created_time": "March 17, 2023, 04:51:07 PM",
      "body": "Quote from: AbuBhakar on March 17, 2023, 04:23:33 PMThe only significant effect I’m thinking was the increase of my portfolio and at the same time the increase of interest for Bitcoin investment which make the price pump more. Technically speaking increase of price means everyone is enjoying the Bitcoin experience due to the profit.Its not only about price but the will to occupy new fields, master new skills and etc..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "March 17, 2023, 05:12:56 PM",
      "body": "Bitcoin has had a profound impact on many people's lives beyond just financial wealth, with its potential to change the way we think about money, technology, and community.some early Bitcoin investors have become more financially independent, allowing them to pursue their passions and interests without being tied to a traditional 9-to-5 job. This has led to increased freedom and flexibility in their lives. The effects of Bitcoin's rise can be far-reaching and can have a significant impact on an individual's personal growth and development. However, as with any investment, it's essential to do your research and make informed decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 17, 2023, 05:21:49 PM",
      "body": "Quote from: MCVXYZ on March 17, 2023, 04:17:56 PM what did you get beside s the financial wealth? Did all of these things change the way you think?Financial awareness. On average, most people live their lives without any worry as to how money works and only bother on how to file their taxes. I unsurprisingly have not gained financial wealth or freedom from bitcoin yet, cause I am still stacking sats, but I have learnt a lot on how the financial world ticks and what I have been doing wrong for so many years. I am also reading more financial books to acquire more knowledge. Yes, it definitely has changed the way I think. Which should be same for everyone that actually apply themselves here.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 17, 2023, 05:24:41 PM",
      "body": "Quote from: MCVXYZ on March 17, 2023, 04:17:56 PM  Today I was thinking about how can I start from zero, how to use all of these things positively and continue to educate myself, because I feel that someday it will give more freedom in economic activities. Maybe that's exactly why I find the whole thing so hard to understand the exact direction you are really pointing at.QuoteIt would be interesting from old members to share their experience: what did you get beside s the financial wealth? Did all of these things change the way you think?Your level of understanding towards something will definitely change the way you think and view everything under that category. The way I thought and viewed bitcoin before and the way I view it now are no longer the same. Back then, I saw it as a get-rich-quick scheme, but currently, it's far more than that. So I can proudly say it has impacted the way I think positively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "March 19, 2023, 03:55:47 PM",
      "body": "Quote from: MCVXYZ on March 17, 2023, 04:51:07 PMQuote from: AbuBhakar on March 17, 2023, 04:23:33 PMThe only significant effect I’m thinking was the increase of my portfolio and at the same time the increase of interest for Bitcoin investment which make the price pump more. Technically speaking increase of price means everyone is enjoying the Bitcoin experience due to the profit.Its not only about price but the will to occupy new fields, master new skills and etc..Yes, while we are still the early generation, now is the right moment to improve our skills about bitcoin because in the future we will only get benefits both financially and other things from what we learn. Because studying bitcoin is the same as we learn many things like OP said.Especially now that the era of technology continues to develop, all information is quickly conveyed to many people, so I don't think it's necessary to wait a long time to master new skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 19, 2023, 04:37:35 PM",
      "body": "Quote from: MCVXYZ on March 17, 2023, 04:17:56 PMIt would be interesting from old members to share their experience: what did you get beside s the financial wealth? Did all of these things change the way you think?Financial wealth not sure. But learnings that I could thank off on crypto are way important. There are so many things I understand and enjoy with this industry not only by making money online but having some friends and colleague discuss this kind of stuff. Moreover, its become one of my source of income that helps me to ease the problem on financial. Very thankful that I have found this forum and knew cryptocurrency such ad Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}