{
  "id": "topic_5456653",
  "title": "Gatyre1",
  "author": "Gatyre1",
  "created_time": "June 17, 2023, 11:15:04 AM",
  "content": "RaiseX is a trading corporation established in 2012 by an experienced team of Fidelity invest ex-workers. The company united the most promising analysts, traders and stock market professionals. In the last 5 years the company also started working with the crypto direction, creating unique and profitable trading strategies.Today RaiseX provides more than 2000 traders with strategies, trading signals and trade copying features. Traders and entrepreneurs that work with us can be assured of the high quality of provided services and full transparency between the company and traders.We provide our traders with:- Features and mechanics to copy our trades- High Quality guidance and educational materials- Best trading strategies- Strong networking clubLast month, during May 2023 We publicly made 400% in profitsCheck out our website: https://raisex.co/Join our trading club on telegram: https://t.me/+m_dYhGyljZ8xOTZi",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456653",
  "comments": [
    {
      "author": "BreDvarD",
      "created_time": "June 18, 2023, 11:27:40 AM",
      "body": "I would like to express my deepest gratitude to RaiseX Co for their exceptional signals. With their guidance, I have achieved significant financial gains in the cryptocurrency market lately. Thank you for your invaluable support David!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PancherSh",
      "created_time": "June 19, 2023, 02:16:36 PM",
      "body": "I am writing to extend my sincerest appreciation to RaiseX for their exceptional signals, which have proven instrumental in generating substantial profits for me. The accuracy and reliability of their signals have greatly contributed to my success in market. Thank you for your invaluable services and unwavering commitment to customer satisfaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aptekary",
      "created_time": "June 20, 2023, 02:16:59 PM",
      "body": "Quote from: Gatyre1 on June 17, 2023, 11:15:04 AMRaiseX is a trading corporation established in 2012 by an experienced team of Fidelity invest ex-workers. The company united the most promising analysts, traders and stock market professionals. In the last 5 years the company also started working with the crypto direction, creating unique and profitable trading strategies.Today RaiseX provides more than 2000 traders with strategies, trading signals and trade copying features. Traders and entrepreneurs that work with us can be assured of the high quality of provided services and full transparency between the company and traders.We provide our traders with:- Features and mechanics to copy our trades- High Quality guidance and educational materials- Best trading strategies- Strong networking clubLast month, during May 2023 We publicly made 400% in profitsCheck out our website: https://raisex.co/Join our trading club on telegram: https://t.me/+m_dYhGyljZ8xOTZiI just wanted to give a big shoutout to RaiseX for their epic signals! I've made some serious cash thanks to their awesome guidance. You guys rock!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 20, 2023, 11:29:26 PM",
      "body": "Quote from: Gatyre1 on June 17, 2023, 11:15:04 AMRaiseX is a trading corporation established in 2012 by an experienced team of Fidelity invest ex-workers. The company united the most promising analysts, traders and stock market professionals. In the last 5 years the company also started working with the crypto direction, creating unique and profitable trading strategies.Really, why are you lying? Your so-called trading signal company's domain name isn't even 2 months old, and you claim it was established in 2012. How does that work? Code:Domain:raisex.coRegistrar:Hosting Concepts B.V. d/b/a Registrar.euRegistered On:2023-05-05Expires On:2024-05-05Updated On:2023-05-10QuoteToday RaiseX provides more than 2000 traders with strategies, trading signals and trade copying features. More liesQuoteLast month, during May 2023 We publicly made 400% in profit What a stupid joke",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MidnightWolf",
      "created_time": "June 21, 2023, 02:36:43 PM",
      "body": "Hey, just wanted to say thnx to David for his awesome work. I've made some serious cash thanks to their accurate and reliable signals. Big thanks to the whole team for helping me level up my crypto game!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AngellSky",
      "created_time": "June 22, 2023, 02:00:24 PM",
      "body": "The trading signals are truly HQ, been following for 2 weeks and im at 30% PNL already",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "atjiat",
      "created_time": "June 23, 2023, 02:35:29 PM",
      "body": "Tried different signal channels and communities, this one seems like the best one yet, got +550$ in just a week guys",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gatyre1",
      "created_time": "June 23, 2023, 02:37:10 PM",
      "body": "Quote from: atjiat on June 23, 2023, 02:35:29 PMTried different signal channels and communities, this one seems like the best one yet, got +550$ in just a week guysI take advantage of a good opportunity with RaiseX, which provides more than 2,000 traders with strategies, trading signals and copy trade features.  This is important especially when there is no great experience in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BreDvarD",
      "created_time": "June 25, 2023, 02:36:12 PM",
      "body": "I have little experience of cooperation, but I have already made sure that traders and entrepreneurs who cooperate with this platform can be sure of the high quality of the services provided and full transparency between the company and the traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gatyre1",
      "created_time": "June 25, 2023, 03:29:48 PM",
      "body": "Quote from: PancherSh on June 19, 2023, 02:16:36 PMI am writing to extend my sincerest appreciation to RaiseX for their exceptional signals, which have proven instrumental in generating substantial profits for me. The accuracy and reliability of their signals have greatly contributed to my success in market. Thank you for your invaluable services and unwavering commitment to customer satisfaction.we are glad to see feedback from our users and always provide updated products for traders - signals to buy and sell assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fedrey",
      "created_time": "June 29, 2023, 02:03:32 PM",
      "body": "To date, a lot of resources offer such offers for traders and reviews may not always reflect the real state of affairs.  You have to explore everything yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PancherSh",
      "created_time": "June 30, 2023, 02:02:19 PM",
      "body": "Quote from: Gatyre1 on June 25, 2023, 03:29:48 PMQuote from: PancherSh on June 19, 2023, 02:16:36 PMI am writing to extend my sincerest appreciation to RaiseX for their exceptional signals, which have proven instrumental in generating substantial profits for me. The accuracy and reliability of their signals have greatly contributed to my success in market. Thank you for your invaluable services and unwavering commitment to customer satisfaction.we are glad to see feedback from our users and always provide updated products for traders - signals to buy and sell assets.I don't have a very high level of experience in trading yet, so I started by copying the trades of experienced traders. At least it will benefit me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aptekary",
      "created_time": "July 01, 2023, 09:22:21 AM",
      "body": "I'm just getting started with the platform, but I'm already seeing some advantages over the competition, especially when you get the highest quality, up-to-date offline and online analytics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gatyre1",
      "created_time": "July 02, 2023, 12:50:31 PM",
      "body": "Quote from: Aptekary on July 01, 2023, 09:22:21 AMI'm just getting started with the platform, but I'm already seeing some advantages over the competition, especially when you get the highest quality, up-to-date offline and online analytics.Every member of our community can be sure of positive results.  Before opening a deal, we check it according to 27 criteria.  Our main trading strategy is based on price action, smart money and insights.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PancherSh",
      "created_time": "July 04, 2023, 02:52:11 PM",
      "body": "Convinced that every trader wants to have a positive experience, and their trading strategy with the participation of Raise X will be combined with the experience of experienced analysts of the department when involving artificial intelligence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gatyre1",
      "created_time": "July 05, 2023, 04:39:26 PM",
      "body": "Quote from: BreDvarD on July 03, 2023, 03:05:43 PMDefinitely in some cases I try to learn from those traders who show good results and Raise X creates the best crypto community with the involvement of such professionals and it makes it easy for people to follow their trades and investments, getting valuable information.We provide the highest quality up-to-date off-chain and on-chain analytics. Raise X makes the best crypto community and enables people to effortlessly follow their trades and investments, gaining valuable insights.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BreDvarD",
      "created_time": "July 06, 2023, 06:00:03 AM",
      "body": "Those who are interested in trading and want to use the service, be sure to get acquainted with the project team.  This will make sure that the prospect of a good income is real.  The Raise X team led by David Hoffman, our CEO, Oscar Hoffman, our CTO and Ben Yun, our COA.  They bring a wealth of experience from their time to value in investments and extensive knowledge of the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PancherSh",
      "created_time": "July 07, 2023, 04:25:26 AM",
      "body": "David, I can't put into words how glad I am that I saw your Instagram profile and later started working with you. You helped me solve some important financial problems. Thanks to your team, my monthly cash flow has doubled. Moreover, I have become more conscious in life thanks to the thoughts that you publish. I really hope that our cooperation will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gatyre1",
      "created_time": "July 08, 2023, 04:17:10 AM",
      "body": "Quote from: PancherSh on July 07, 2023, 04:25:26 AMDavid, I can't put into words how glad I am that I saw your Instagram profile and later started working with you. You helped me solve some important financial problems. Thanks to your team, my monthly cash flow has doubled. Moreover, I have become more conscious in life thanks to the thoughts that you publish. I really hope that our cooperation will continue.stay with us and you will get more information about daily trading signals and the possibility of access to the VIP club of traders",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}