{
  "id": "topic_5512656",
  "title": "Russlenat",
  "author": "Russlenat",
  "created_time": "October 10, 2024, 07:19:34 AM",
  "content": "That's what he said. QuoteNEW YORK — U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler said he thinks it's unlikely that bitcoin (BTC) or other cryptocurrencies will ever be widely used as a form of payment and, instead, will continue to be seen as more of a store of value.Speaking at an event at NYU School of Law in Manhattan on Wednesday, Gensler responded to a question from an attendee about what the value of cryptocurrency – which was created to be separate from any government – would be to its users if totally brought into the regulatory fold.Gensler said that the agency is \"merit neutral\" and the investing public will get to decide – \"through disclosures\" if there's a utility for any given cryptocurrency.\"But I did teach this stuff up at MIT and so forth, so I'm just going say this – these debates literally go back to Plato and Aristotle,\" he said. \"This is 3,000 years of history. Hundreds of great nations, thousands of nation-states – we tend to have one currency per geographic economic state. We tend even not to have bimetallism.\"source :https://www.coindesk.com/policy/2024/10/09/sec-chair-gary-gensler-on-crypto-its-unlikely-this-stuff-is-gonna-be-a-currency/What do you guys think about this? We know only two countries have declared Bitcoin as legal currency--El Salvador (the most famous one) and the Central African Republic. If they've done it and their economies haven't seen any major issues, like a spike in crime, then why does the SEC chair say it's unlikely for Bitcoin to become a currency?By \"currency,\" it doesn’t necessarily mean the main currency--fiat will definitely stick around. The point is that people should have more options, not just seeing Bitcoin as a \"store of value\" (which I agree with), but it could also be used as legal tender so we can enjoy Bitcoin even more!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5512656",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "October 10, 2024, 07:36:07 AM",
      "body": "Do we really need those title legal tenders or something else for bitcoin to be great? To me, the answer is NO.As long as anyone who decides to make use of bitcoin as a point of payment and the service provider accepts bitcoin too without being penalized by its government, I think we are good, and in some countries, even in the US, where you can also use bitcoin for the exchange of goods and services, it's already considered a means of payment by those users how they classify it shouldn’t be a problem again. No matter how good and popular Bitcoin is and will become, it's not everyone that will accept it as a legal tender, which is normal, but as long as it's allowed to be used for a legal business transaction, that's okay with me, even if it's considered to be only a store of value, removing the currency category.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 10, 2024, 07:38:43 AM",
      "body": "He's not wrong, but not entirely correct.That's true Bitcoin is unlikely to become a currency, but he did mention \"cryptocurrency\" after Bitcoin, which is wrong because there are stable coins that could become a currency in the future. Some coins with cheap fees like Litecoin or Doge are possible too.Of course the country and the stores can accept Bitcoin as an alternative payment, but I doubt people would prefer to use Bitcoin to buy daily needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 10, 2024, 07:52:25 AM",
      "body": "Quote from: Plaguedeath on October 10, 2024, 07:38:43 AMwhich is wrong because there are stable coins that could become a currency in the future.I agree with your statement, for example, in the Philippines, the government’s Social Security System (SSS) has started accepting USDT (Tether) as a form of payment. This shows how stablecoins are gradually gaining acceptance in official institutions, providing a convenient digital option for people to make payments and manage their finances.Philippines adopts USDT for social security paymentsAs for Bitcoin's status in the country, it's not considered a legal tender or currency, but exchanges are regulated. So, I guess it's fine for it to remain classified as property, like it is in the US, as long as laws are put in place to protect holders of that property.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "October 10, 2024, 07:55:24 AM",
      "body": "Quote from: Plaguedeath on October 10, 2024, 07:38:43 AMHe's not wrong, but not entirely correct.That's true Bitcoin is unlikely to become a currency, but he did mention \"cryptocurrency\" after Bitcoin, which is wrong because there are stable coins that could become a currency in the future. Some coins with cheap fees like Litecoin or Doge are possible too.Of course the country and the stores can accept Bitcoin as an alternative payment, but I doubt people would prefer to use Bitcoin to buy daily needs.Totally. BTC would be used for reserves and such, LTC may be a currency due to its cheapness and TPS, and so on. Only time will tell how things will escalate, alongside with CDBC being developed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "October 10, 2024, 08:15:03 AM",
      "body": "Quote from: Ever-young on October 10, 2024, 07:36:07 AMDo we really need those title legal tenders or something else for bitcoin to be great? To me, the answer is NO.As long as anyone who decides to make use of bitcoin as a point of payment and the service provider accepts bitcoin too without being penalized by its government, I think we are good, and in some countries, even in the US, where you can also use bitcoin for the exchange of goods and services, it's already considered a means of payment by those users how they classify it shouldn’t be a problem again. It is true that we do not need prior permission or government approval to use bitcoin as a payment method. As long as there is agreement and consent between both parties, we can use bitcoin as currency in our transactions. But I will not do so because if a dispute arises during the transaction, we will not be protected by the government or even be fined if we go to court. That is not a wise idea.Quote from: Ever-young on October 10, 2024, 07:36:07 AMNo matter how good and popular Bitcoin is and will become, it's not everyone that will accept it as a legal tender, which is normal, but as long as it's allowed to be used for a legal business transaction, that's okay with me, even if it's considered to be only a store of value, removing the currency category.To be fair, bitcoin is not absolutely perfect and is not suitable as a payment method due to barriers such as transaction fees and processing speed. Even if it is legalized as a payment method, I doubt people will use it more to pay everyday bills instead of fiat. Maybe i'm like you, I don't care much about whether it can become a currency or a payment method, what I care about is as long as it is legal and benefits people then it doesn't matter what it becomes. It has been used as an investment for over 15 years and has benefited many people greatly, why should we change that when everyone is happy with it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "October 10, 2024, 08:26:20 AM",
      "body": "Quote from: Russlenat on October 10, 2024, 07:19:34 AMWhat do you guys think about this? We know only two countries have declared Bitcoin as legal currency--El Salvador (the most famous one) and the Central African Republic. If they've done it and their economies haven't seen any major issues, like a spike in crime, then why does the SEC chair say it's unlikely for Bitcoin to become a currency?By \"currency,\" it doesn’t necessarily mean the main currency--fiat will definitely stick around. The point is that people should have more options, not just seeing Bitcoin as a \"store of value\" (which I agree with), but it could also be used as legal tender so we can enjoy Bitcoin even more!IMHO for now regardless of whether or not bitcoin will eventually be considered legal tender in the end it won't close the fact that they are still very useful.  The reason when bitcoin is believed to be a legal tender or not now depends on the beliefs and advantages that are owned so that by looking at something like this we should definitely be aware when someone or a country that makes bitcoin a means of payment is certain they benefit from it but when there is a country that does not recognize bitcoin as a means of payment they will also not be harmed because they are maintaining the electability of the system that already exists in their country especially for large countries like the USA with the strength of their dollar of course this will not be easy to recognize bitcoin as one of the legal means of payment. As long as in the end bitcoin continues to develop and provide its benefits I don't care whether it is used as a legal means of payment or just remains a commodity because the most important thing is that bitcoin still exists and its existence is not considered illegal it will be much more important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "October 10, 2024, 08:44:09 AM",
      "body": "Quote from: Raflesia on October 10, 2024, 08:26:20 AMQuote from: Russlenat on October 10, 2024, 07:19:34 AMWhat do you guys think about this? We know only two countries have declared Bitcoin as legal currency--El Salvador (the most famous one) and the Central African Republic. If they've done it and their economies haven't seen any major issues, like a spike in crime, then why does the SEC chair say it's unlikely for Bitcoin to become a currency?By \"currency,\" it doesn’t necessarily mean the main currency--fiat will definitely stick around. The point is that people should have more options, not just seeing Bitcoin as a \"store of value\" (which I agree with), but it could also be used as legal tender so we can enjoy Bitcoin even more!IMHO for now regardless of whether or not bitcoin will eventually be considered legal tender in the end it won't close the fact that they are still very useful.  The reason when bitcoin is believed to be a legal tender or not now depends on the beliefs and advantages that are owned so that by looking at something like this we should definitely be aware when someone or a country that makes bitcoin a means of payment is certain they benefit from it but when there is a country that does not recognize bitcoin as a means of payment they will also not be harmed because they are maintaining the electability of the system that already exists in their country especially for large countries like the USA with the strength of their dollar of course this will not be easy to recognize bitcoin as one of the legal means of payment. As long as in the end bitcoin continues to develop and provide its benefits I don't care whether it is used as a legal means of payment or just remains a commodity because the most important thing is that bitcoin still exists and its existence is not considered illegal it will be much more important. And then again, BTC won't be illegal everywhere, it's still going to be great and used overall, somewhere more, somewhere - not as much, but the innovation and adoption will be pushing forward, step by step.Or maybe central govs will push for CDBC, who knows what is on their mind, other than to control what they can get their hands on",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 10, 2024, 09:17:12 AM",
      "body": "Quote from: Russlenat on October 10, 2024, 07:19:34 AMThat's what he said. QuoteNEW YORK — U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler said he thinks it's unlikely that bitcoin (BTC) or other cryptocurrencies will ever be widely used as a form of payment and, instead, will continue to be seen as more of a store of value.Speaking at an event at NYU School of Law in Manhattan on Wednesday, Gensler responded to a question from an attendee about what the value of cryptocurrency – which was created to be separate from any government – would be to its users if totally brought into the regulatory fold.Gensler said that the agency is \"merit neutral\" and the investing public will get to decide – \"through disclosures\" if there's a utility for any given cryptocurrency.\"But I did teach this stuff up at MIT and so forth, so I'm just going say this – these debates literally go back to Plato and Aristotle,\" he said. \"This is 3,000 years of history. Hundreds of great nations, thousands of nation-states – we tend to have one currency per geographic economic state. We tend even not to have bimetallism.\"What do you guys think about this?This guy has said it out loud already and I share his view a little. He is referring to the fiat way of currency with disregard to the fact that Bitcoin and altcoins are Crypto+Currency. They are already viable means of payment and there is nothing the Fiat currencies and Gold are doing that cryptocurrency can't do, it only needs more adoption and legalization by countries.Let's be thankful that he already called it a \"store of value\" but I challenge him, Bitcoin can do whatever fiat currency can do. The only issue here is that countries will not want to accept it as their reserve and others, and Bitcoin is dependent on the internet. What if a war or disaster breaks and the internet is not accessible? The risk is high to entirely depend on cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "October 10, 2024, 09:19:48 AM",
      "body": "While Bitcoin does face challenges to everyday transactions due to volatility and regulatory hurdles. At the same time, Bitcoin has already become legal tender in some regions, such as El Salvador. More companies are accepting crypto for payment, most especially when stablecoins have come to be a bridge between crypto and fiat, serving to fix the problem of volatility. While in general Bitcoin community are against stablecoins but this could be the entry point for Bitcoin to become currency. Moreover calling Bitcoin simply a \"store of value\" greatly minimizes its growing use for worldwide remittances, DeFi, and cross-border payments. Even as Gensler stresses one geographic region per currency historically, the growth of digital assets proves that there is a need for choices in a region, especially when that region's home currency is unstable. Rather than ruling out the use of Bitcoin for payments, it is more realistic to admit that Bitcoin would go through evolution in the role of payment and store of value depending on the region and specific use cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 10, 2024, 10:49:59 AM",
      "body": "Quote from: Iranus on October 10, 2024, 08:15:03 AMTo be fair, bitcoin is not absolutely perfect and is not suitable as a payment method due to barriers such as transaction fees and processing speed. Even if it is legalized as a payment method, I doubt people will use it more to pay everyday bills instead of fiat. The main reason why Bitcoin might not used widely as a currency is because of its volatility. I assume that people use fiat for daily transactions because the value doesn't fluctuate like cryptocurrencies. But this doesn't mean that these price variations cannot be managed. Transaction fees become a problem only when the mempool is attacked by ordinals, making it go high. Maybe the price of Bitcoin might become more stable in the future, but for now, it's best used as an asset or investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 10, 2024, 10:55:09 AM",
      "body": "This dude is very anti-crypto and a fool. Bitcoin has already become a currency. People in El Salvador use it all the time. Not only El Salvador, people anywhere use it every day. Why would anyone even say something likes this unless he is an enemy of crypto? Too bad Kabala voters like this guy a lot. This should be a serious warning to all the people who think about voting Kabala. If you are a crypto supporter, Trump is the only way to move forward.Elect Trump, let him fire this clown, and the crypto ship goes to the moon!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "October 10, 2024, 11:00:27 AM",
      "body": "Quote from: Russlenat on October 10, 2024, 07:19:34 AMThat's what he said. QuoteNEW YORK — U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler said he thinks it's unlikely that bitcoin (BTC) or other cryptocurrencies will ever be widely used as a form of payment and, instead, will continue to be seen as more of a store of value.Speaking at an event at NYU School of Law in Manhattan on Wednesday, Gensler responded to a question from an attendee about what the value of cryptocurrency – which was created to be separate from any government – would be to its users if totally brought into the regulatory fold.Gensler said that the agency is \"merit neutral\" and the investing public will get to decide – \"through disclosures\" if there's a utility for any given cryptocurrency.\"But I did teach this stuff up at MIT and so forth, so I'm just going say this – these debates literally go back to Plato and Aristotle,\" he said. \"This is 3,000 years of history. Hundreds of great nations, thousands of nation-states – we tend to have one currency per geographic economic state. We tend even not to have bimetallism.\"source :https://www.coindesk.com/policy/2024/10/09/sec-chair-gary-gensler-on-crypto-its-unlikely-this-stuff-is-gonna-be-a-currency/What do you guys think about this? We know only two countries have declared Bitcoin as legal currency--El Salvador (the most famous one) and the Central African Republic. If they've done it and their economies haven't seen any major issues, like a spike in crime, then why does the SEC chair say it's unlikely for Bitcoin to become a currency?By \"currency,\" it doesn’t necessarily mean the main currency--fiat will definitely stick around. The point is that people should have more options, not just seeing Bitcoin as a \"store of value\" (which I agree with), but it could also be used as legal tender so we can enjoy Bitcoin even more!What to expect from him? He's well known anti crypto, its like he want to make sure that he can influence other people so that the adaption of this coin will not happen to US.Mark Cuban criticize him thru strict regulations he made https://www.benzinga.com/analyst-ratings/analyst-color/24/10/41205634/mark-cuban-slams-gary-gensler-for-making-crypto-regulations-so-difficult-if-he-had-So expect that if officials like him still in that position bitcoin or crypto would never became a currency since they are the one would provably stop this to happen. That's why I would like to see Trump win in this election so that they can eliminate this guy then see if there's good development will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "October 10, 2024, 11:06:12 AM",
      "body": "Quote from: Russlenat on October 10, 2024, 07:19:34 AMThat's what he said. Quote\"But I did teach this stuff up at MIT and so forthIf you knew of Gensler for a long time, you will no longer believe in his sayings that are all bullshits. He told many bullshits negatively against Bitcoin and this market before it came to a time when he was forced to approve Bitcoin Spot ETFs in his nation.By mentioning about MIT and his time there, there is another drama with his lectures in MIT in the past that have conflicting opinion with what he said as a SEC Chairman. Again it shows that this man is untrustworthy and his values change with time and positions he works at.QuoteWhat do you guys think about this?why does the SEC chair say it's unlikely for Bitcoin to become a currency?By \"currency,\" it doesn’t necessarily mean the main currency--fiat will definitely stick around.Bitcoin is not a currency and doesn't need to be a currency. Discussions about it will appear repeatedly from the past till present to future but I don't see Bitcoin as a currency.End the fuld \"Bitcoin as money\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "October 10, 2024, 11:09:28 AM",
      "body": "Quote from: Russlenat on October 10, 2024, 07:19:34 AMWhat do you guys think about this? We know only two countries have declared Bitcoin as legal currency--El Salvador (the most famous one) and the Central African Republic. If they've done it and their economies haven't seen any major issues, like a spike in crime, then why does the SEC chair say it's unlikely for Bitcoin to become a currency?By \"currency,\" it doesn’t necessarily mean the main currency--fiat will definitely stick around. The point is that people should have more options, not just seeing Bitcoin as a \"store of value\" (which I agree with), but it could also be used as legal tender so we can enjoy Bitcoin even more!It's understandable, I mean they still have the US dollar is still very strong in the world economy. And as you can see, it's more of 3rd world country that is adopting Bitcoin as means of legal tender or it's population using it regardless of the status or what their government is staying, whether pro, anti or in the grey area.So not surprised by it, and I think majority of us are already very happy on what Bitcoin is. Could also be a hedge against inflation and then a sound money as most of us have financial freedom already, and thanks to BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "October 10, 2024, 11:46:52 AM",
      "body": "Even though none of us like Gary for what he has done for the crypto industry. But we should be realistic and accept the fact that turning bitcoin into a currency is a difficult task and the chances of it happening are almost zero. Look what we did with bitcoin, Satoshi created bitcoin to be a peer to peer currency, but from the beginning, we turned it into an investment, we were attracted by its volatility and felt happy to make a profit from it. And now we want it to become a currency? The main reason we are here is because of the profits that bitcoin brings, there is no greater reason than that. I wonder if Bitcoin becomes stable and becomes a currency how many people will continue to stick with Bitcoin? If we are being honest with each other, I believe that not many people will be happy if bitcoin becomes stable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "October 10, 2024, 11:56:59 AM",
      "body": "Quote from: BALIK on October 10, 2024, 11:46:52 AMEven though none of us like Gary for what he has done for the crypto industry. But we should be realistic and accept the fact that turning bitcoin into a currency is a difficult task and the chances of it happening are almost zero. For a country like the USA, it's difficult, but in general, it’s not impossible if a country is willing, and El Salvador is living proof of that. However, I don’t think we should take his statement too seriously. Investors in the US are probably fine with Bitcoin’s current status. As long as they can use it and the government acknowledges it, they likely don’t expect it to become a legal currency like the USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "October 10, 2024, 12:25:37 PM",
      "body": "Quote from: stadus on October 10, 2024, 11:56:59 AMFor a country like the USA, it's difficult, but in general, it’s not impossible if a country is willing, and El Salvador is living proof of that. However, I don’t think we should take his statement too seriously. Investors in the US are probably fine with Bitcoin’s current status. As long as they can use it and the government acknowledges it, they likely don’t expect it to become a legal currency like the USD.Many people know Bitcoin is an ideal digital currency, but I feel that the world will oppose it a lot because it cannot have full control because of the decentralized system. Actually, I don't care too much about his statement because he doesn't support crypto. Can it be a currency? I didn't think that far. But with the current conditions having had a huge space even the government benefiting from taxes, I think Bitcoin and crypto have shifted into a money industry. If the world government still believes in the centralized system, then the decentralized system will always be rejected because it will harm them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "October 10, 2024, 02:50:10 PM",
      "body": "Quote from: stadus on October 10, 2024, 11:56:59 AMQuote from: BALIK on October 10, 2024, 11:46:52 AMEven though none of us like Gary for what he has done for the crypto industry. But we should be realistic and accept the fact that turning bitcoin into a currency is a difficult task and the chances of it happening are almost zero. For a country like the USA, it's difficult, but in general, it’s not impossible if a country is willing, and El Salvador is living proof of that. However, I don’t think we should take his statement too seriously. Investors in the US are probably fine with Bitcoin’s current status. As long as they can use it and the government acknowledges it, they likely don’t expect it to become a legal currency like the USD.We keep mentioning El Salvador because it is the first and so far only country to consider bitcoin as a legal currency. But I wanted to ask, is anyone here from El Salvador or knows what's going on there? Are they really using bitcoin to replace fiat money in everyday payments or do they still use fiat and just consider bitcoin as an investment like us? If you follow the news about them, you will see that Nayib just wants to buy more bitcoin every day and consider it as a strategic reserve instead of encouraging people to use bitcoin as an alternative currency to fiat. So I'm really skeptical about what's going on there.I don't care what Gensler says, but I have long since stopped believing that bitcoin will ever become a global payment method. I don't think governments would be happy with that idea, especially a power like the United States when they want the world to depend even more on their dollars. But as long as the United States does not accept it, this idea is unlikely to become a reality .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "October 10, 2024, 03:34:43 PM",
      "body": "He's wrong because his brain is stuck in the blockchain architecture, which was never meant to scale to be a mainstream mechanism for everyday value transfer.The market is clearly evolving away from blockchain though: L2 networks, defacto centralized architectures like ETH, consumers choosing apps and ETFs, etc. Although a lot of products still \"pray at the church of blockchain\", I don't see this going on for much longer--it's just a silly waste of time.What he doesn't understand is that some of us are working on digital currencies that can handle every single everyday transaction on the planet and do so 100x cheaper and faster than today's credit card transactions.Only by making something 10x+ cheaper/faster/better can you complete with established technologies. Bitcoin and other blockchain-based cryptos were never going to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}