{
  "id": "topic_5447381",
  "title": "cryptobizman",
  "author": "cryptobizman",
  "created_time": "April 03, 2023, 12:16:54 PMLast edit: April 05, 2023, 04:34:13 PM by cryptobizman",
  "content": "useless, people not motivated to start projects in here..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447381",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "April 03, 2023, 06:39:02 PM",
      "body": "I think you should post more specific information about what you would like to work on with people if you'd like anyone to consider taking the time to talk more with you. Also, no one can trust that you are legitimate or serious as you are still very new here, so I would suggest openly communicating with people on this thread and providing more information instead of writing your telegram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 03, 2023, 09:47:10 PM",
      "body": "Quote from: cryptobizman on April 03, 2023, 12:16:54 PMGood day gentlemen,I'm looking for a developer and team members to work with me on a crypto project.I am open for all kinds of ideas, be it meme-coins, platforms or mlm-systems. I am especially interested in promoting a crypto project (e.g. Liquidity and Exchange platforms) using affiliate marketing.This way new customer streams can be reached quickly and the users benefit from it.The goal is to create a global crypto project that attracts investors, users and traders from all possible countries.For further questions and information, Telegram: cryptobizmanThanks a lot!Best regardsI'd like to know if you're an investor or a middleman because you do not have any idea what your project is going to be, you did not even mention where funding will come from is it out of your pocket or you will do crowdfunding.What role will you be playing, are you a developer, and what projects have you done in the past, this is for people who you invited to think that you are capable to bring out a global crypto project, tell more about yourself before you ask people to join you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "April 04, 2023, 08:21:24 AM",
      "body": "How can someone know if it's a very big project or not even if you don't explain the details of your project or include a link to the website or whitepaper. If we see from the post you gave as it is now people think even you are just a braggart or a scammer because it is not clear what you are saying about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "April 04, 2023, 02:44:30 PM",
      "body": "Let me get this straight, OP you're a promoter, you're looking for teams and developers with their big ideas? Wouldn't you be better off ignoring whether it will be a huge or small projects while you can charge a fee for your services?Let's say I have a project idea, maybe I'll contact you after some development milestones, because a promoter isn't needed at the start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 04, 2023, 08:05:19 PM",
      "body": "Quote from: moneystery on April 04, 2023, 08:21:24 AMHow can someone know if it's a very big project or not even if you don't explain the details of your project or include a link to the website or whitepaper. If we see from the post you gave as it is now people think even you are just a braggart or a scammer because it is not clear what you are saying about.if you take a closer look at what he wrote, it seems that the OP is looking for a project where he would join and be part of the team, or possibly promote a crypto project. As he says, he is open to all kinds of ideas.it also seems that the importance and success of the idea itself are not a priority for him, given that he is adaptable to everything. maybe it's just my opinion, but someone who thinks about MLM or meme coin seems to me like someone who would like easy money without much responsibility.Quote from: cryptobizman on April 03, 2023, 12:16:54 PMI am open for all kinds of ideas, be it meme-coins, platforms or mlm-systems. I am especially interested in promoting a crypto project (e.g. Liquidity and Exchange platforms) using affiliate marketing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 07, 2023, 09:55:33 AM",
      "body": "Quote from: cryptobizman on April 03, 2023, 12:16:54 PMuseless, people not motivated to start projects in here..It's your post that is useless if you're looking for a project to promote then go to the altcoin bounty projects and apply as a bounty hunter, if you happen to be a developer, you will give detailed information about the kind of project that you want to work with, your role that you are going to play and most important your capability make a project go mainstream, but you're looking for a project to just become a team member without offering something to give to the project.If I'm a developer I will ignore this, better develop a skill, so that you can offer something to a project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}