{
  "id": "topic_5427850",
  "title": "Forocoches Fan Token",
  "author": "Forocoches Fan Token",
  "created_time": "December 11, 2022, 04:32:43 PMLast edit: December 11, 2022, 04:55:17 PM by Forocoches Fan Token",
  "content": "Forocoches Fan Token!Habéis escuchado bien, después de tantos meses preparando el proyecto, programando el token y estudiando las diferentes formas de llevarlo a cabo, hoy es el día en el que mi equipo y yo os vamos a presentar nuestro trabajo.Llega por fin el token que va a revolucionar el mercado. Características:- FCFT estará disponible en la red de BSC.-288.288.288 tokens. -Destinaremos un porcentaje de nuestros tokens a gamberradas para viralizar nuestro projecto.-Para nosotros, shures desde hace años, contaremos con la comunidad para tomar decisiones sobre  el futuro del token. (Votaciones semanales sobre donativos, trolleadas  públicas, etc...)¿Cómo funciona FCFT?FCFT es la abreviatura de Forocoches Fan Token; cada transacción realizada con dicho token bien sea de compra o de venta genera automáticamente una comisión del 10% que se divide en varias partes:- Liquidez= 3%- Marketing, caridad= 3%- Recompensas holders en B.USD= 2%- Buy Back y quema de tokens= 2%Liquidez Bloqueada Sabemos que en este tipo de proyectos hay riesgo de rug-pulls por eso bloquearemos la liquidez para ser totalmente transparentes, así nadie podrá manipular esos fondos evitando asi desastres.VisiónNuestro objetivo es conseguir tener una criptomoneda que perdure en el tiempo, que sea influyente y sobre todo que represente a una brillante comunidad. PRE-SALEPara este tipo de proyectos a gran escala, las pre-sale son casi obligatorias. Al no disponer de fondos destinados a la liquidez inicial nos vemos forzados a realizar este acto para que el token triunfe y no sea un fracaso. Destinaremos la pre-sale para aportar esta liquidez al token en su lanzamiento.OBJETIVOS:❌ Sacar página web.❌  500 personas telegram❌  Publicar contrato❌ 100 Holders❌ TOP 10 diario en Coinsniper.❌ TOP 10 diario en Watcher.guru.❌ Listarse en Coingecko❌ Listarse en CoinMarketCap (necesitamos 1,000 holders)❌ Listarse en exchange pequeño (Gate.io, Hotbit...)❌ Lisatrse en exchange grande (KuCoin...)Estáis preparados?Telegram: https://t.me/forocochesfantokenTwitter: https://twitter.com/ForocochesToken?t=wOutmJsrWrw69qO7cIWcmA&s=08",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427850",
  "comments": []
}