{
  "id": "topic_5511143",
  "title": "Botnake",
  "author": "Botnake",
  "created_time": "September 29, 2024, 08:15:01 AM",
  "content": "For a change, since most of us here recommend not storing Bitcoin on an exchange because of the \"not your keys, not your coins\" principle, let's flip the script. Although using a hardware wallet is advised, it’s not 100% foolproof either—sometimes we make mistakes, like our devices getting compromised, often due to user errors.So, let’s have a little debate to test everyone's knowledge here: defend why we should store our Bitcoin on an exchange instead of a hardware wallet. Enjoy!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5511143",
  "comments": [
    {
      "author": "Hazink",
      "created_time": "September 29, 2024, 08:22:32 AM",
      "body": "One of the reasons and excuses most people use to store their bitcoin in an exchange is because they believe they are avoiding the fee they are to pay when sending it out for trade since they can just directly trade it to any pairs of their choice in the exchange they use for storage.  The excuse of being too lazy to be held responsible for your own safety is the belief that the exchange has a higher security compared to how well they can handle holding their exchange, and that is partial to the fake promise that some exchanges give that they will pay back for any loss that is caused by their own action. I refuse to pretend but just pointed out a few excuses that most people use to leave their bitcoin in an exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "September 29, 2024, 08:29:01 AM",
      "body": "Most exchanges offer some sort earnings program these days, so earning interest on your coins might be a good reason to store them on exchange. For example those 0.15% you get for BTC on Kraken are totally worth the risk imho (/s)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 29, 2024, 08:35:20 AM",
      "body": "After this, we can talk about how rape can be good in some cases and how it's beneficial to the victim.There is no way to defend storing bitcoin with a custodian where trust is required. One could make comparisons between having bitcoin on an exchange and having control over it yourself in a non-custodial wallet. However, this isn't a defense of centralized exchanges. Some features of centralized exchanges include simplicity to use, quick access to liquidity, and a big number of crypto and fiat trading pairs.You can still find liquidity and trading pairs elsewhere and without using a CEX as a wallet to store your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "September 29, 2024, 08:36:15 AM",
      "body": "Let’s talk about the bright side of holding your Bitcoin on an exchange... Why?Well, reputable exchanges have top-notch security, meaning your assets are in safe hands. Plus, some exchanges even offer insurance to cover a portion of your funds, which is a solid backup. It makes sense to keep your Bitcoin there because if an exchange is running profitably, they’ll do whatever it takes to maintain a good reputation and win the trust of traders. That means employing a solid internal control system to safeguard your assets, so your funds are well-protected.Now, what about the downsides of keeping your Bitcoin in a hard wallet? There's the risk of losing the hardware wallet, misplacing the key, or even damage from unexpected events like floods or fires. And let’s not forget, we’ve heard stories about criminals breaking into homes to force someone to send their Bitcoin to a specific address. If your Bitcoin is on an exchange, it's not as easy for them, and the exchange could actually assist in tracing where those coins are headed, thanks to their robust system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 29, 2024, 08:38:01 AM",
      "body": "Cold or offline storage is different from storing coins on a hardware wallet. Some hardware wallets are cold wallets while some wallets like paper wallet and airgapped device wallets are cold storage if you generate their keys on an airgapped wallet. Hardware wallet like Ledger Nano can be said not to be a cold wallet because of how it is sharing people's seed phrase online with third parties.Quote from: Botnake on September 29, 2024, 08:15:01 AMSo, let’s have a little debate to test everyone's knowledge here: defend why we should store our Bitcoin on an exchange instead of a hardware wallet. Enjoy! I have no reason to store my coins on exchanges. I move them all to non-custodial wallet. Quote from: HeRetiK on September 29, 2024, 08:29:01 AMMost exchanges offer some sort earnings program these days, so earning interest on your coins might be a good reason to store them on exchange. For example those 0.15% you get for BTC on Kraken are totally worth the risk imho (/s)0.15% APR? That is daily profit of $0.041 if you have $10000 on savings. Which is $15 profit annually. That is not worth it at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "September 29, 2024, 08:48:08 AM",
      "body": "Quote from: _act_ on September 29, 2024, 08:38:01 AM0.15% APR? That is daily profit of $0.041 if you have $10000 on savings. Which is $15 profit annually. That is not worth it at all.If that’s the rate, it’s really not attractive. The whole point of keeping our Bitcoin on an exchange is if we believe it’s safer than a cold wallet.It’s not much different from a bank with low interest rates, but the good thing about storing crypto is that it’s protected from inflation. The longer you hold, its value can grow...as long as you truly trust the exchange to keep it secure. Hopefully, you won't experience a \"Mt. Gox\" situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 29, 2024, 08:54:48 AMLast edit: September 29, 2024, 10:57:06 AM by PX-Z",
      "body": "Features like trading features, availability, trading rates, withdrawal rates are the only thing you can think for comparison in exchanges why you want to use that instead of the other. While storing coins is debatable, as some trades in large volume, well, as long you don't store all your money in an exchange, and knows the risks while doing it, that is good. Making exchange as alternative to a non-custodial wallet or cold wallet is the worst thing someone may do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 29, 2024, 10:04:48 AM",
      "body": "At least if I lose my coins, it was caused by my own stupidity instead of other people stupidity.It's really possible to control ourselves, we can do anything we want and we know what the consequence for doing that. While we don't even know what other people are doing and on their mind, you have zero influence to control other people.Quote from: freedomgo on September 29, 2024, 08:36:15 AMAnd let’s not forget, we’ve heard stories about criminals breaking into homes to force someone to send their Bitcoin to a specific address. If your Bitcoin is on an exchange, it's not as easy for them, and the exchange could actually assist in tracing where those coins are headed, thanks to their robust system.If the criminals know you own Bitcoin, it means you have a bad privacy concern.Either your coins in CEX or hardware wallet, it's the same, they will force you to send all of your coins to their non custodial wallet, mix them, and then they can't trace it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "September 29, 2024, 10:16:20 AM",
      "body": "To avoid transaction fees that are sometimes very unreasonable when the network is congested, when we are in a hurry to sell because of urgent needs, and also when we want to sell because the price is high, this becomes more practical because our coins are already on the exchange, but still the exchange is not a safe place and it is highly not recommended to put funds there unless we can afford to lose them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 29, 2024, 10:36:24 AM",
      "body": "Quote from: Botnake on September 29, 2024, 08:15:01 AM defend why we should store our Bitcoin on an exchange instead of a hardware wallet. Enjoy! The first thing that comes to mind, ignoring all the negatives, is simplicity for the end user. Exchanges handle the technical aspects of security and often provide a user-friendly interface, making it easier for beginners to create accounts. They typically require only a username and password for access, a familiar procedure for most internet users nowadays. In contrast, self-custody and hardware wallets, while quite straightforward in most cases, still require a bit more technical knowledge to set up. Users generally need to install software, connect their device, generate seed keys, write them down, set a PIN and other security measures, make test transactions to verify the process, etc... I think this can be a significant barrier for beginners who lack technical expertise or are unwilling to invest the time in learning new things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 29, 2024, 10:39:48 AM",
      "body": "Quote from: Botnake on September 29, 2024, 08:15:01 AMAlthough using a hardware wallet is advised, it’s not 100% foolproof either—sometimes we make mistakes, like our devices getting compromised, often due to user errors.You did not leak your private key when broadcast your transaction with a hardware wallet, it is safer than other methods.QuoteFor a change, since most of us here recommend not storing Bitcoin on an exchange because of the \"not your keys, not your coins\" principleSo, let’s have a little debate to test everyone's knowledge here: defend why we should store our Bitcoin on an exchange instead of a hardware wallet. Enjoy! Debate is not necessary. Rather than debate, read what is advised and absorb it is better.Reminder: do not keep your money in online accountsNewbies - Read before using exchanges or investingNot your keys, not your coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "September 29, 2024, 11:45:03 AM",
      "body": "Quote from: FatFork on September 29, 2024, 10:36:24 AMI think this can be a significant barrier for beginners who lack technical expertise or are unwilling to invest the time in learning new things.This is true, especially for investors who aren’t putting in big money—just small amounts consistently. They find it safer to use an exchange since it’s easier to understand, like for older individuals who might be interested in investing in Bitcoin but don’t have the patience to learn the technical aspects of creating and securing a wallet. So, exchanges work best for them.It's understandable where people’s doubts come from, given the past hacks on exchanges. But as Bitcoin becomes more popular and adoption increases, exchange security is also improving. So, as long as you trust the right exchange, storing your Bitcoin there can be a reasonable option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "September 29, 2024, 11:59:23 AM",
      "body": "Quote from: Botnake on September 29, 2024, 08:15:01 AMFor a change, since most of us here recommend not storing Bitcoin on an exchange because of the \"not your keys, not your coins\" principle, let's flip the script. Although using a hardware wallet is advised, it’s not 100% foolproof either—sometimes we make mistakes, like our devices getting compromised, often due to user errors.So, let’s have a little debate to test everyone's knowledge here: defend why we should store our Bitcoin on an exchange instead of a hardware wallet. Enjoy! I actually can't find any reason tbh. The amount of exchange hacks that happen makes me not trust them at all. Yes, hardware wallets are not completely secure either but in most cases, it would require some carelessness on user's part for compromise to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "September 29, 2024, 12:00:16 PM",
      "body": "I still won't encourage strong Bitcoin on any centralised exchanges but since you ask for it.There are few benefits of storing Bitcoin on an exchange and the top on my list is staking dividends, I believe that centralised exchanges have the best staking rewards, either for ALTs or stable coins or Bitcoin, I've use Binance for staking in the past and it was smooth as promised. Another one is taking trading shots, sometimes we can be far away from home and we all know that hardware wallets are more safer in our safes than moving them around, if a trading signal comes right into your home you won't be able to move funds out into your exchange to trade since you aren't with the hardware wallet.Leaving funds on exchange makes trading snappier, but there is a safer route about this, always leave behind some money on centralized exchange for trading purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "September 29, 2024, 12:17:03 PM",
      "body": "You need to know that nothing is perfect or absolutely safe, each method will have its own advantages and disadvantages. But I can assure you that it is much better to protect our assets ourselves than to depend on a third party. There will be risks when we protect our assets ourselves but we will have full control over them, we can do anything with them and anytime we want. It's our property, why do we have to ask other people's permission?Meanwhile, if you rely on a third party, you will face more problems like: they can seize your assets by freezing your account and giving silly reasons that you can do nothing but accept. Not to mention, sometimes they make mistakes like us and cause our property to be lost but they don't want to take responsibility, they give thousands of reasons and what can you do with them? One more thing: it's funny how many people say they don't trust anyone, not even their parents or closest relatives, but they trust centralized exchanges (strangers).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 29, 2024, 12:20:29 PM",
      "body": "Exchangers make trading seamless, no need to transfer between wallets or deal with complicated addresses. Another point is convenience, having your Bitcoin on an exchange means you can quickly react to market movements without the delays of moving funds back and forth. This can be especially advantageous for active traders who want to capitalize on price fluctuations. Lastly, many exchanges offer additional features like staking, lending, or earning interest on your holdings, which can enhance your overall investment strategy. A hardware wallet is great for long-term storage but sometimes having that accessibility and potential for growth on an exchange makes sense!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelockg",
      "created_time": "September 29, 2024, 12:36:50 PM",
      "body": "Quote from: Botnake on September 29, 2024, 08:15:01 AMSo, let’s have a little debate to test everyone's knowledge here: defend why we should store our Bitcoin on an exchange instead of a hardware wallet. Enjoy! sugar coat what's bad to become good and some naive person comes to this thread and reads the caption caption of the thread as \" Storing BTC in an exchange is better than storing in a hard wallet. goes on to read tte replies without considering it's a flip and what next? That builds his bases for certain conclusion.Most of the things that look like a plus while using an exchange are designed to encourage you to buy and sell as often as necessary. If you've ever compared holding your asset in an exchange or a hard wallet, it's quite easier to do a lot of things to the one in an exchange and even though your intention is possibly to hold for long, if care is not taken, you might either run into easily converting it to fiat or using it for trading due to some potential incentive that comes with it. Except you have a reason to give that suggests that keeping your coin in an exchange is better than having full control of your asset in an hard wallet, there's no point painting black as white.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "September 29, 2024, 02:03:42 PM",
      "body": "Quote from: Botnake on September 29, 2024, 08:15:01 AMFor a change, since most of us here recommend not storing Bitcoin on an exchange because of the \"not your keys, not your coins\" principle, let's flip the script. Although using a hardware wallet is advised, it’s not 100% foolproof either—sometimes we make mistakes, like our devices getting compromised, often due to user errors.I don't think it's necessary to pretend on this issues cause I believe everyone knows the advantage of storing ones crypto in a hard wallet and the benefits of doing so cannot be emphasized it's also applicable to sn exchange too because on some occasion people tend to sote BTC in sn exchange why because they feel it's easier to be transferred, but then for me I don't want to be biased in my judgement to say choose this nor that for storing but it depends on one's choice and whatever decisions one take in regards to that shouldn't be a problem whereas everyone have their different perspective on how they think and go about with things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "September 29, 2024, 02:34:29 PM",
      "body": "Quote from: Pmalek on September 29, 2024, 08:35:20 AMAfter this, we can talk about how rape can be good in some cases and how it's beneficial to the victim.There is no way to defend storing bitcoin with a custodian where trust is required. One could make comparisons between having bitcoin on an exchange and having control over it yourself in a non-custodial wallet. However, this isn't a defense of centralized exchanges. Some features of centralized exchanges include simplicity to use, quick access to liquidity, and a big number of crypto and fiat trading pairs.You can still find liquidity and trading pairs elsewhere and without using a CEX as a wallet to store your coins. It's a very maximalist point of view IMO. If you hold a small bag, there is no benefit in using a cold wallet over a CEX actually. Because you will spend many fees and time for sending and withdrawing your cryptos each time you want to make some trades. In addition you will miss investment plans offered by the exchanges, and if you are a newbie you can be hacked or lose your funds because of bad handling sadly. Cryptos are not user friendly unfortunately, so it's not a sin to let your funds on a reputed exchange if you don't hold much money or if you are not tech savvy enough IMO, it's better than nothing at least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}