{
  "id": "topic_5401360",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "June 04, 2022, 03:29:23 PM",
  "content": "The argument that bitcoin should run on a POS network started after top organizations like WEF suggested to lobby 50 key miners to move bitcoin to POS and make change the code not the planet campaign possible. WEF said on their tweet that “change in the way bitcoin is coded could almost eliminate its environmental impact\". However, the campaign spearheaded by Ripple co-founder Chris Larsen is expected to fail since some people argue that nodes controls the network not miners because nodes validates and miners propose blocks. Through 51 percent attack the miners can get hold of the network and control the network but, it's unlikely to launch the 51 percent attack said an article on  Investobia as the miners with such hashrate power can get more profits from rewards than launching the attack, More people during the Oslo Freedom forum stated their view about Pow to bitcoin. Bitcoin needs to have outside contact with the real world that's why the energy is required to mine bitcoin. On the other hand, the price of owning a hash is expensive and it removes the middle class from being able to purchase the hash unlike POS that allows more people to stake on the network. While the price of hash remains high it helps the bitcoin from excaping the 51% attack. Below are some definitions stated on the use of pow on bitcoind during the WEFORUM1) So anything that lives on top of this #Bitcoin network will be better than the legacy system that it replaces. And it is only because of PoW that you’re able to have this immutable ledger and all the other layers for financial and economical freedom. Said Darin Feistein2)Energy serves a very important role. It minimizes human governance. If you remove the energy component, you’re recreating the legacy system but on a blockchain. Said; Lyn Alden3) PoW allows everyone to decide on the correct ledger state with no human oversight or governance.PoS is just a fancy way of referring to shareholder governance or a stakeholder-led system where ownership in the system determines authority in the system. Said; Nic Carter.Regarding the energy consumption of mining bitcoin which was a key point of the Forum's discussion, I think miners should consider working with Oil and Gas companies on wasted energy to reduce flaring. Source:https://bitcoinmagazine.com/markets/greenpeace-seeks-to-change-bitcoin-codehttps://bitcoinmagazine.com/technical/proof-of-work-vs-proof-of-stake-why-bitcoin-wont-changehttps://www.oilandgasiq.com/decarbonization/articles/us-oil-producers-turn-to-crypto-mining-to-reduce-flaring",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401360",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 04, 2022, 03:42:57 PM",
      "body": "Your topic title is contradictory to its content, you have a good content which is in support of PoW which is better than PoS. Chain reorg and other form of attack can be more possible on PoS. What is happening recently is that some miners are moving towards using clean energy for mining purpose. Yet, bitcoin mining seem to still be profitable as the price increases more in long term.We can see many news about using gases that are wastes to mine bitcoin if converted to electricity, which is a clean form of energy provided for mining, but there are still other means like solar, hydroelectric and other means clean energy can be generated. It is very possible that bitcoin miners could be using 90% or more of clean energy for bitcoin mining by 2030 to end the so called 'bitcoin is not environmentally friendly'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 04, 2022, 04:00:39 PM",
      "body": "One thing I am very sure about Bitcoin is that it will surely undergo changes before the last bitcoin will be mined. It will undergo changes to enhance massive adoption .But the method of these changes to avoid a major hard fork is what I am not sure about.The energy consumption and its alleged effects on the environment is not the major issue about Bitcoin PoW protocol. To me the major issue is security of the system. Any changes will give room to vulnerability, bugs and eminent collapse of the network. But before then, let's all miners join the green energy bandwagon and different kind of scalability protocols would be introduced in the future. Bitcoin will remain bitcoin but the process of mining and securing bitcoin might change with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "June 04, 2022, 08:59:47 PM",
      "body": "Quote from: Accardo on June 04, 2022, 03:29:23 PMtop organizations like WEFThat particular appeal to authority holds no sway in this place.\"Top organisations\" in fiat do not inherit the same status here.  They wield no power and have no say.  Tantamount to nothing.  If anything, being a \"top organisation\" in fiat is seen by many here as a negative.  In the same way as rats are seen as the \"top scavengers\" in a sewer system.Bitcoin was specifically designed to resist outside influences.  It remains unmoved by, and detached from, the mindless bleating of those who aren't participants within the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 04, 2022, 11:09:11 PM",
      "body": "The only way Bitcoin would switch to PoS is if most members of Bitcoin community would want it. Right now the support for such change has single digit percentages. With no indication that it would grow. So, these \"top organizations\" are free to propose whatever they want, but nothing will come out of it, so they might as well stop. Even if switching to PoS was an objectively good idea, why not wait for Ethereum to do it first and put the security of PoS to the test? Bitcoin is too precious to do reckless experiments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 05, 2022, 04:44:22 AM",
      "body": "Quote from: DooMAD on June 04, 2022, 08:59:47 PMQuote from: Accardo on June 04, 2022, 03:29:23 PMtop organizations like WEFThat particular appeal to authority holds no sway in this place.\"Top organisations\" in fiat do not inherit the same status here.  They wield no power and have no say.  Tantamount to nothing.  If anything, being a \"top organisation\" in fiat is seen by many here as a negative.  In the same way as rats are seen as the \"top scavengers\" in a sewer system.Bitcoin was specifically designed to resist outside influences.  It remains unmoved by, and detached from, the mindless bleating of those who aren't participants within the network.Maybe someone should tell these guys that Bitcoin Core protocol changes are made with BIPs, not with code.You can't just debate out a bunch of protocol changes and commit them just like that. You have to participate in the BIP writing process, and then in the activation process for miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 05, 2022, 06:10:05 AM",
      "body": "Quote from: Accardo on June 04, 2022, 03:29:23 PMThe argument that bitcoin should run on a POS network started after top organizations like WEF suggestedActually the PoS nonsense started when the biggest shitcoin called etherum started brainwashing people into thinking the flawed protocol called PoS which had failed 10 years ago, is a good replacement for PoW. So a lot of newbies started running with it!Quoteto lobby 50 key miners to move bitcoin to POS and make change the code not the planet campaign possible.It's a good news that enemies of bitcoin are idiots who don't understand how bitcoin works. QuoteHowever, the campaign spearheaded by Ripple co-founder Chris LarsenIn other words the owner of a centralized shitcoin is at the head of a nonsense.Quoteis expected to failIt's not even a thing to fail or succeed. Nobody gives a shit about their noise.Quotesince some people argue that nodes controls the network not miners because nodes validates and miners propose blocks.It's a failure before it even starts simply because it's a stupid argument. It's like lobbying that the security system you have installed in your house is weak so you should remove it and remove your doors, windows and locks too and replace them with a plastic sheet. QuoteThrough 51 percent attack the miners can get hold of the networkYou first have to gain 51% of the hashrate and nobody can gain that much power due to the way it is distributed around the world.QuoteRegarding the energy consumption of mining bitcoin which was a key point of the Forum's discussion, I think miners should consider working with Oil and Gas companies on wasted energy to reduce flaring. The real question is why some organizations are focusing on bitcoin this much whereas there are hundreds of other industries that are wasting more energy per day than bitcoin ever consumed in its entire life.So if anything, those industries should first start doing what you suggested and when they stopped wasting energy we",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "June 05, 2022, 06:47:11 AM",
      "body": "Not how it works. You won't be able to lobby a single miner because you can't do anything with your ASICs on a pure POS Crypto. I'm sure there would be tons of resistance to this and it is not an issue that we have to solve at all. Ethereum has had plans to shift to POS since years ago and there were tons of delay through the entire process. You would definitely face a lot more pushback from Bitcoin community, primarily because the mining industry is far bigger than most crypto and that the community isn't particularly fond nor did they endorse POS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 05, 2022, 07:15:10 AM",
      "body": "Top billionaires who wants to control the world gathers in WEF. If BTC goes POS, gone are the day where it will be decentralized. The act of wanting to change the code itself is already an act of controling us.  These leaders are too thick. But too afraid that the countries that are rich of gas and oil starts mining BTC for they will not be top leaders soon when their fiat wealth dissolves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 05, 2022, 09:17:48 AM",
      "body": "'Top organizations' automatically and instantly lose all of my interest, trust and respect.  I can not generalize, but most of them are dirtier than a pig after playing in the mud.WEF promotes centralization.  They have an agenda of their own.  Is this turtle looking Klaus Schwab not part of it?  And is 'Welcome to 2030, you own nothing and you will be happy' not part of all of this?  Are they not trying to remove the right to privacy and property from us?About any authority you name has a problem with Bitcoin's existence.  They run these campaigns pretending to want the better of the world.  Bitcoin's energy use and 'pollution' has been overly debated already and besides well paid manipulative articles on the Internet, there is no way they can convince me Proof of Stake is better for Bitcoin.Proof of Stake means end of decentralization.  That is where they turn to other campaigns to support changes ultimately destroying what Bitcoin was supposed to be.  Fuck that and fuck them!  We are part of a financial revolution, my friend.  Most of us hold no respect for WEF or other authorities and such organizations.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sklopan",
      "created_time": "June 05, 2022, 10:01:03 AM",
      "body": "I wonder if some of these companies will increase? Considering that bitkion is quite confidently walking the planet and becoming more and more popular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "June 05, 2022, 10:03:35 AM",
      "body": "why would it have to change something good? this current bitcoin system is the best system in the world, at least here we won't see dictators deciding things alone, each person can take their money and buy mining equipment and mine bitcoin and as there are thousands of people around the world mining that stopped us of seeing people being dictators saying which way bitcoin should go.... we saw examples in 2017 when the evil team at BCH decided for themselves that they had to have changes in the path that bitcoin should take and see that to this day this BCH hasn't even gotten far. We cannot enter the bankrupt system ( system of the \"mercenaries\" rich ) of many altcoins, where even a simple twitter from the creator is enough for the altcoin to increase in price a lot. I would be very happy if in my country there was a system like bitcoin to choose the president of my country, oh heavens I would be living in a true democracy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "June 05, 2022, 10:32:02 AM",
      "body": "Perhaps Proof of Stake will be an important, much needed change. But the reason behind doing this is obviously driven by  green reasons (which I support - we need to save our planet and ourselves). However the underlying problem of people's greed and our reliance on fossil fuels is the real issue. Everything else is a temporary fix.What we really need is a way to obtain sufficient clean electricity. Once we have that, mining becomes a non-issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 05, 2022, 11:40:50 AM",
      "body": "if(fantasy dream) gold cost only $2 to mine in your own back yard with only a spoon and a coffee filter. gold would not be worth $1.8k on the market. it would be worth only $2.20-$5.00however in reality.. golds mining cost is (from most efficient) $900+. and the speculative(profit) game of supply/demand gives a market price of $1.5k-$1.9kbitcoins mining cost is(from most efficient) about $25k. and the speculative(profit) game of supply/demand gives a market price of $28k-$70kethereum(while PoW) mining cost is(from most efficient) about $800. and the speculative(profit) game of supply/demand gives a market price of $1.7k-$4kwhere as ethereum(whenPoS) will be a cost of $0.70-$2 and a speculative(profit) of $2+so expect ethereum market price to crash when it 'detonates'there is a reason they called the PoS event detonation (a devastating explosive event)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 05, 2022, 12:03:14 PM",
      "body": "Even very powerful organizations are highly unlikely to possess enough resources and be willing to sacrifice so much money to attempt hijacking mining (the 51% attack, I mean) to attempt setting their own rules. If they want a POS Bitcoin, they are free to make a clone and make it POS, which will join the line of shitcoins out there. They can try to popularize it, pour funds into making it appealing, convince some other companies to start using their product. They will likely fail eventually, but they're welcome to try. Bitcoin, however, will remain POW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 05, 2022, 12:04:56 PMLast edit: June 05, 2022, 12:17:01 PM by franky1",
      "body": "Quote from: kryptqnick on June 05, 2022, 12:03:14 PMEven very powerful organizations are highly unlikely to possess enough resources and be willing to sacrifice so much money to attempt hijacking mining (the 51% attack, I mean) to attempt setting their own rules. If they want a POS Bitcoin, they are free to make a clone and make it POS, which will join the line of shitcoins out there. They can try to popularize it, pour funds into making it appealing, convince some other companies to start using their product. They will likely fail eventually, but they're welcome to try. Bitcoin, however, will remain POW.ethereum is possibly able to achieve the 'detonation' because its the official ethereum software release candidates that contain the code for the detonation(from the offcial ethereum dev team) that ramps up the PoW difficulty to absurdly high levels that GPU's wont ever be able to mine ethereum. thus forcing nodes to PoS mine to get blocks moving.(when majority of merchants/services/exchanges are using such software)however the WEF would have to take control of the bitcoin core repo of github and convince everyone to download a WEF inspired release candidate of bitcoin core with its alterations.... and have enough of those nodes. (where the important nodes include it)such as the merchants/exchanges/services running those nodes. .. else its just another fork creating another altcoin... but even if all the major exchanges ran the WEF variant.. the exchanges could also run the standard un-updated current core release too. thus forcing the fork of an altcoin.the only reason ethereum did not detonate months ago is they did not have majority adoption of the versions that included the detonation code. but they are hoping if they release new versions of same software, where people are forced to update due to new features/bug fixes thus forced to have the detonation code in their node",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "June 05, 2022, 12:17:57 PM",
      "body": "No matter how much arguments you put in favour of bitcoin as a proof of stake everything would end at just one argument which is that a person having higher captial will be able to control the whole Staking segment compared to someone who doesn't have that much. Some might argue that in POW person having more money can put up larger hardware but the thing is that price of hardware won't fluctuate that much in a matter of 5 years if a person puts up mine 5 years later he will still get it at the same price and better technology same can't be said true for staking though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoSable",
      "created_time": "June 06, 2022, 04:01:01 AM",
      "body": "They have been arguing about it all the time since last decadegotta find another wayfor being green and eco-friendly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 06, 2022, 05:24:11 AM",
      "body": "Quote from: CryptoSable on June 06, 2022, 04:01:01 AMThey have been arguing about it all the time since last decadegotta find another wayfor being green and eco-friendlyEven if the miners will have 100% green energy, the \"TOP ORGANIZATION\"  will not achieve what they are after.   They are suggesting BTC to be POS. But once BTC becomes POS, it will be the end of it. Its a wonder how Vitalik agreed to turn ETH to POS when he has the knowledge to see it.Like Nic Carter said, having more shares means you get to be the board member to decide things that will happen in the network. They want this market back to the old ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "June 06, 2022, 03:36:57 PM",
      "body": "Quote from: cabron on June 06, 2022, 05:24:11 AMQuote from: CryptoSable on June 06, 2022, 04:01:01 AMThey have been arguing about it all the time since last decadegotta find another wayfor being green and eco-friendlyEven if the miners will have 100% green energy, the \"TOP ORGANIZATION\"  will not achieve what they are after.   They are suggesting BTC to be POS. But once BTC becomes POS, it will be the end of it. Its a wonder how Vitalik agreed to turn ETH to POS when he has the knowledge to see it.Like Nic Carter said, having more shares means you get to be the board member to decide things that will happen in the network. They want this market back to the old ways.I understand the dangers of running a PoS protocol on bitcoin. I have been read and understand many things and according you, you said board members can decide on what happens in the network if they have more stake than others. IWhile I understand this, I want to ask why other coins running on PoS are still in existence, they should have been hijacked before now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}