{
  "id": "topic_5442770",
  "title": "Steeley",
  "author": "Steeley",
  "created_time": "March 05, 2023, 12:05:24 AM",
  "content": "There are a couple of moderately interesting developments with PCGS: 1. They graded some Satori coins. They chose to actually grade them too versus going the route of ICG which just verifies that it is authentic2. A Denarium was graded for the first time. So, this bumps the the coins they are willing to grade up to 5 (Cas, Lealana, BTCC, Satori, Denarium). I heard they rejected quite a few others, including CI coins. 3. There was some reluctance in the past with Buyer Funded / Unfunded coins. I tried to get a couple of Lealana Buyer Funded graded last year and they were rejected. PCGS recently graded a ton of Buyer funded coins. Steeley",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5442770",
  "comments": [
    {
      "author": "2stout",
      "created_time": "March 05, 2023, 02:43:39 AMLast edit: March 06, 2023, 01:17:14 AM by 2stout",
      "body": "Could be wrong, but it appears these are the crypto coins that PCGS grades:https://www.pcgs.com/coinfacts/category/world-coins/decentralized-currency/cryptocurrency/203113(7- Casascius, Lealana, BTCC, MoonBits, Denarium, Satori, Titan)What's frustrating is something like this should have gotten an official announcement as most are probably still under the impression that the only crypto coins PCGS grades are Casascius, Lealana, and BTCC.  Also, how in the hell CI isn't up there but Titan is???  Also, I can confirm that my CI submission was rejected as they stated they don't grade this maker yet and that was a little over a month and a half ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Steeley",
      "created_time": "March 05, 2023, 02:53:04 AM",
      "body": "2stout: Wow. I didn't see the Moonbits and Titans. This is definitely surprising in light of them not grading CI coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "March 05, 2023, 03:25:42 AM",
      "body": "it cracks me about the lealana buyer funded - it really does. every single lealana is buyer funded - whether the holo says it or not. Smoothie never funds the coins, he has the buyer directly fund them prior to shipment (these dont get the \"buyer funded\" holo) and then they can fund them after they received them (these get the \"buyer funded\" holo). Personally, I rather fund them when I get them vs before he ships them - just in case they go missing - then the loss is less.It would be different if smoothie actually funded them but he does not - they are all \"buyer funded\" whether the holo says it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "March 05, 2023, 03:41:08 AM",
      "body": "Quote from: MoparMiningLLC on March 05, 2023, 03:25:42 AMit cracks me about the lealana buyer funded - it really does. every single lealana is buyer funded - whether the holo says it or not. Smoothie never funds the coins, he has the buyer directly fund them prior to shipment (these dont get the \"buyer funded\" holo) and then they can fund them after they received them (these get the \"buyer funded\" holo). Personally, I rather fund them when I get them vs before he ships them - just in case they go missing - then the loss is less.It would be different if smoothie actually funded them but he does not - they are all \"buyer funded\" whether the holo says it or not. You are beating a dead horse as you just say it over and over and nobody agrees or disagrees really.... Personally, regardless of that opinion, NON-buyer funded will always command a higher premium, as the buyer paid extra for smoothie's personal verification and shipping. Regardless I think any coins from Smoothie/Lealana are in high-demand whether or not they are BF, as they will indeed be worth a fortune someday regardless IMO, but only time will tell if this actually comes true ofc. I actually have never bought any buyer-funded coins from smoothie. I like my coins with PGP certs etc etc... Provenance will be key someday as well I think but who knows... Fakes may fuck things all up, but again, nobody can predict the future...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "March 05, 2023, 03:59:11 AM",
      "body": "You know all about beating dead horses? you do it on a million subjects here and in truth most everyone does.Though I dont feel that I am beating a dead horse - I have had conversations with people just this week that thought Smoothie actually personally funded the coins... There are people that just don't get it.  So,  I will keep saying it - all his coins are buyer funded - the ones that don't say it still are though.In the end, I am simply stating the truth.And I do understand people are willing to pay more for one without the \"buyer funded\" text - not me though. And in my opinion anyone willing to pay more for a buyer funded lealana just because it does not say it is buyer funded is an idiot - there is no difference other than the hologram.One simply needs to use the laser etched address on the coin and verify the funds personally. edit: to be clear, my point is that all that matters is verifying if the address/key are the ones smoothie applied. If so, any value assigned to a coin simply because it doesn't say \"buyer funded\" is asinine. The provenance is the same for both",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "March 05, 2023, 04:28:16 AM",
      "body": "Quote from: MoparMiningLLC on March 05, 2023, 03:59:11 AMYou know all about beating dead horses? you do it on a million subjects here and in truth most everyone does.Lol. no need to attack man, feel free to point out my problems as you don't reply apparently lol... Anyhow, just stating my opinion, they are like assholes we all have one remember? Cheers I am out, time will tell I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "March 05, 2023, 04:34:14 AM",
      "body": "Quote from: owlcatz on March 05, 2023, 04:28:16 AMQuote from: MoparMiningLLC on March 05, 2023, 03:59:11 AMYou know all about beating dead horses? you do it on a million subjects here and in truth most everyone does.Lol. no need to attack man, feel free to point out my problems as you don't reply apparently lol... Anyhow, just stating my opinion, they are like assholes we all have one remember? Cheers I am out, time will tell I guess. I never attacked - simply stating you telling me to stop beating a dead horse is like the pot calling the kettle black - you do it, I do it, everyone does - especially when they are right.I stated mine as well  dont worry man, still love you (no homo)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krogothmanhattan",
      "created_time": "March 05, 2023, 10:18:57 AM",
      "body": "You can add also my coins to that list of rejected coins     PCGS is the only grader that has jumbo capsules that can encapsulate my coins and I took a shot at it and after waiting probably close to 6 months they were sent back ungraded.   I am curious to find out what criteria they use to accept or reject when it comes to crypto coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slimzak",
      "created_time": "March 05, 2023, 04:31:00 PM",
      "body": "From the list of coins provided by steeley, it looks like pcgs are currently only grading the coins they believe are unlikely to turn out to be scam coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krogothmanhattan",
      "created_time": "March 05, 2023, 04:49:24 PM",
      "body": "Quote from: slimzak on March 05, 2023, 04:31:00 PMFrom the list of coins provided by steeley, it looks like pcgs are currently only grading the coins they believe are unlikely to turn out to be scam coins   Wish what you are saying was true..but why are they doing titan? When there is a very big issue with Titan 2fA coins?       https://www.pcgs.com/coinfacts/category/world-coins/decentralized-currency/cryptocurrency/203113   Or are they not aware of this thread about Titan? https://bitcointalk.org/index.php?topic=5369583.0   And its very hard to say who will be a scammer and who wouldn't....especially after what we went thru with ColdSkam...never saw them coming in a million years!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slimzak",
      "created_time": "March 05, 2023, 05:12:13 PM",
      "body": "Quote from: krogothmanhattan on March 05, 2023, 04:49:24 PMQuote from: slimzak on March 05, 2023, 04:31:00 PMFrom the list of coins provided by steeley, it looks like pcgs are currently only grading the coins they believe are unlikely to turn out to be scam coins   Wish what you are saying was true..but why are they doing titan? When there is a very big issue with Titan 2fA coins?       https://www.pcgs.com/coinfacts/category/world-coins/decentralized-currency/cryptocurrency/203113   Or are they not aware of this thread about Titan? https://bitcointalk.org/index.php?topic=5369583.0   And its very hard to say who will be a scammer and who wouldn't....especially after what we went thru with ColdSkam...never saw them coming in a million years! Valid point!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "March 05, 2023, 06:47:40 PM",
      "body": "Quote from: slimzak on March 05, 2023, 05:12:13 PMValid point!Absolutely ... 💯Pinging @Elianite - Do you have any info about this, or can you reach out PCGS? Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Steeley",
      "created_time": "March 06, 2023, 12:59:14 AMLast edit: March 06, 2023, 01:21:15 AM by Steeley",
      "body": "Quote from: krogothmanhattan on March 05, 2023, 04:49:24 PMQuote from: slimzak on March 05, 2023, 04:31:00 PMFrom the list of coins provided by steeley, it looks like pcgs are currently only grading the coins they believe are unlikely to turn out to be scam coins   Wish what you are saying was true..but why are they doing titan? When there is a very big issue with Titan 2fA coins?       https://www.pcgs.com/coinfacts/category/world-coins/decentralized-currency/cryptocurrency/203113   Or are they not aware of this thread about Titan? https://bitcointalk.org/index.php?topic=5369583.0   And its very hard to say who will be a scammer and who wouldn't....especially after what we went thru with ColdSkam...never saw them coming in a million years! Their criteria is a bit of a mystery. Krog coins should make it at some point though. We'll see. They obviously are moving slow and will add others. Also, on another note, I just found out they also grade coins for Niue. So, the miner coin and the bitcoin coin are in their population report.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "polymerbit",
      "created_time": "March 06, 2023, 02:22:15 AM",
      "body": "I was at their offices a few weeks ago. It's clear they are crypto friendly. I can confirm PCGS grades crypto banknotes as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "March 06, 2023, 02:36:59 AM",
      "body": "Quote from: polymerbit on March 06, 2023, 02:22:15 AMI was at their offices a few weeks ago. It's clear they are crypto friendly. I can confirm PCGS grades crypto banknotes as well. Does anyone know what form to use for crypto? Is it the Worldcoin.pdf? Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "March 06, 2023, 02:41:41 AM",
      "body": "Quote from: owlcatz on March 06, 2023, 02:36:59 AMQuote from: polymerbit on March 06, 2023, 02:22:15 AMI was at their offices a few weeks ago. It's clear they are crypto friendly. I can confirm PCGS grades crypto banknotes as well. Does anyone know what form to use for crypto? Is it the Worldcoin.pdf? ThanksYep, even though I find it easier to use the online submission form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montreal1",
      "created_time": "March 09, 2023, 09:33:06 PM",
      "body": "Quote from: polymerbit on March 06, 2023, 02:22:15 AMI was at their offices a few weeks ago. It's clear they are crypto friendly. I can confirm PCGS grades crypto banknotes as well. never knew this was a thing but that's good to hear, I'll have to submit some",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "March 10, 2023, 04:16:49 AM",
      "body": "Quote from: Steeley on March 05, 2023, 12:05:24 AMThere are a couple of moderately interesting developments with PCGS: 1. They graded some Satori coins. They chose to actually grade them too versus going the route of ICG which just verifies that it is authentic2. A Denarium was graded for the first time. So, this bumps the the coins they are willing to grade up to 5 (Cas, Lealana, BTCC, Satori, Denarium). I heard they rejected quite a few others, including CI coins. 3. There was some reluctance in the past with Buyer Funded / Unfunded coins. I tried to get a couple of Lealana Buyer Funded graded last year and they were rejected. PCGS recently graded a ton of Buyer funded coins. SteeleyI have personally called NGC out for not grading crypto tokens, sheesh when will the best grading company finally come to their senses, EH? Years ago they told me that they weren't \"real coins\" back in 2018, and then shortly after they started grading those big Mac coins from McDonald's hahaha 😆",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minerjones",
      "created_time": "March 10, 2023, 12:59:52 PM",
      "body": "PCGS is now grading Casascius bars!!!   I submitted this for another collector",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}