{
  "id": "topic_5440231",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "February 17, 2023, 11:48:12 PM",
  "content": "QuoteWarren Buffett’s Berkshire Hathaway has added to its already-massive holding of Apple stock. In a filing today, the conglomerate revealed that it expanded its stake in Apple by over $3 billion during Q4 2022. AAPL remains Berkshire’s single largest equity investment.Feb. 14th 2023With this expansion, Berkshire Hathaway’s stake in Apple is now worth over $137 billion. The shares owned by Buffett’s conglomerate represent 5.8% of total AAPL shares outstanding, according to data compiled by StreetInsider.Its investment in Apple is Berkshire’s largest holding, representing 39% of disclosed assets for Q4 2022. It also received a $210.6 Million dividend check from Apple in Q4 2022.At the same time, Berkshire also decreased its holdings in TSMC, one of Apple’s most important supply chain partners. TSMC is the chip fabricator on all of the Apple Silicon chips used in iPhone, Mac, iPad, and more. Berkshire only made its initial investment in TSMC in Q3 2022.According to today’s filings, Berkshire reduced its stake in TSMC by a whopping 86%, dropping from 60 million shares down to 8.29 million shares valued at $617.7 million.In fact, Berkshire only increased its holdings in three companies: Apple, Paramount, and construction materials company Louisiana-Pacific.Warren Buffett on AAPLWhile Buffett avoided investing in technology for decades, he shifted his strategy after he started viewing Apple as a lifestyle brand with high consumer loyalty. The conglomerate began buying the stock in 2016 and has since grown its stake to over $100 billion.At one point, Buffett even said that he would “love to own 100%” of Apple. This, of course, is impossible, but it signals how solid of an investment he thinks Apple is. Tim Cook has said that Apple is “thrilled to have Warren and Berkshire as a major investor,” and he’s always “greatly admired” the investor.Despite being a major investor, however, Buffett only switched from a flip phone to the iPhone with the launch of the iPhone 11. He traveled to California to meet with Cook, who “spent hours trying to move me up to the level of the average two-year-old.”And let us not forget the time Apple partnered with Berkshire Hathaway on a bizarre iPhone game: “Warren Buffett’s Paper Wizard.”https://9to5mac.com/2023/02/14/warren-buffetts-berkshire-aapl-stock/....It seems as if the Oracle of Omaha is throwing his enormous financial clout behind AAPL. While simultaneously reducing his exposure to taiwan based TSMC semiconductor.They say they increased their stake in apple by a factor of $3 billion in 4th quarter 2022. With the price chart for AAPL during this timeline being quite interesting. Given apple's known issues with obtaining semiconductors from its suppliers, does this move by Buffett signal those supply chain difficulties are about to be resolved? If anyone would care to question or second guess this investment move by Buffett, I would be curious to know what their opinions are.I would be curious to know what opinion most have of apple and its products. For whatever reason apple apparently being one of the more polarizing figures in the technology industry.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440231",
  "comments": [
    {
      "author": "jackg",
      "created_time": "February 18, 2023, 12:05:38 AM",
      "body": "Increasing investments in paramount and apple might be a \"don't buy the news, buy its competition\".Viacom (paramount) was greatly undervalued back in 2020, the CEO unleashed a tactic back in 2021 which was quite badly judged but it collapsed the stock and made them rename (the collapse was because half the stocks market cap was taken as a loan to cover an expansion into becoming a streaming service). They still seem like they're a solid company and make solid returns. The issue with them is likely that investors don't care about what they'll get in 10 years, they care about what they can get now (also paramount seemed to have loans they were paying 8% interest on which isn't too reliable - I think the majority was 3-4% though - this info was gleamed from a bond exchange 2 years ago, things might have changed).TSMC facing issues would likely make apple bring chip production in-house (or at least within the neighbourhood) they'd probably get a decent chunk of profits from it either way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "February 18, 2023, 01:43:01 AM",
      "body": "QuoteWith this expansion, Berkshire Hathaway’s stake in Apple is now worth over $137 billion.WOW.  Though I've been an admirer of Buffett's for years I never really kept an eye on what Berkshire Hathaway had in its portfolio--and I figured doing that would be fruitless since he's the type of investor whose holdings don't have a high level of turnover.  That is an eye-popping amount of stock for him to own, no matter what the company is.QuoteIt also received a $210.6 Million dividend check from Apple in Q4 2022.Jesus, can you imagine?  Sure, that's not Buffett himself receiving that money but I think it's great to be getting income like that which you can plow into more shares or other investments.QuoteWhile Buffett avoided investing in technology for decades, he shifted his strategy after he started viewing Apple as a lifestyle brand with high consumer loyalty. The conglomerate began buying the stock in 2016 and has since grown its stake to over $100 billion.Not sure I agree with that viewpoint 100%, but I get why Buffett would view Apple that way.  Honestly I would never have guessed that he would have thrown so much money into a tech company even if it seems to be masquerading as a \"lifestyle brand\".  That phrase better describes Coca-Cola I think (but I know they're a beverage maker primarily).  Good for Buffett.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 18, 2023, 05:20:58 AM",
      "body": "I am really surprised that he didn’t buy more of the battered down stocks like Tesla, Netflix, Facebook, etc during the horrible Q4 they all had. He bought more Apple which didn’t really dip that much. He probably ended up with a higher average price for Apple since the stock is still fairly expensive.And how much upside is there really? Not much. But I guess 1% of a billion is still a lotOf money. Either way, he was one of the few investors which did OK in 2022 unlike most funds which were at a loss. So he clearly knows what he is doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 18, 2023, 01:28:42 PM",
      "body": "I do not care about the news about AAPL, it is a giant company in the United States and has become an obsession for many middle-class people who will buy its products no matter how bad they become, so investing in them is not a big problem.As for why he decided to reduce investments in TSMC, is this because of the CHIPS Act? Which was signed into law on August 9, 2022, and the main goal is to enhance the competitiveness of the United States, as many manufacturers are now forced to convert to the United States?Read more https://en.wikipedia.org/wiki/CHIPS_and_Science_ActBringing semiconductor manufacturing back to the United States will change a lot of investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "February 18, 2023, 07:43:36 PM",
      "body": "Quote from: Husires on February 18, 2023, 01:28:42 PMI do not care about the news about AAPL, it is a giant company in the United States and has become an obsession for many middle-class people who will buy its products no matter how bad they become, so investing in them is not a big problem.As for why he decided to reduce investments in TSMC, is this because of the CHIPS Act? Which was signed into law on August 9, 2022, and the main goal is to enhance the competitiveness of the United States, as many manufacturers are now forced to convert to the United States?Read more https://en.wikipedia.org/wiki/CHIPS_and_Science_ActBringing semiconductor manufacturing back to the United States will change a lot of investment.I speculated this because there's something like ~300 billion that the government is providing to private companies to aid in semiconductor research. Though, it's entirely a gamble given how much further TSMC is in chip development. Apple would not have decided to invest their resources into Iphone development using TSMC unless they were market leaders.Perhaps more grim, I'm also thinking it's because the prospects of a Chinese invasion seem more and more probable, at which point TSMC becomes worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "February 18, 2023, 08:28:58 PM",
      "body": "Interesting move. Apple has had difficulties getting their chips from outside suppliers, and at the same time Berkshire Hathaway reduced their investments on TSMC. Does Buffett knows something that we don't? For one, Taiwan is in a pretty bad position because of China and US, but that doesn't really affect chip production at all, just the tensions between these countries which might spark into something bigger. Or it could be because of the recent move by the US gov't to bring the foundries to its land and be a competitor to TSMC. Whatever the case is, it must be compelling for Buffett to move that much in a single instance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 19, 2023, 07:50:47 PM",
      "body": "Quote from: Gyfts on February 18, 2023, 07:43:36 PMI speculated this because there's something like ~300 billion that the government is providing to private companies to aid in semiconductor research. Though, it's entirely a gamble given how much further TSMC is in chip development. There is a problem with semiconductors, which is that the tools that are used to draw these circuits belong to the United States of America, and the machines used in the United States can affect the companies that produce them and thus affect TSMC.I believe that as a direct result of that law, TSMC will more than triple its investment in a giant American factory to $ 40 billion, as its factories in Arizona will produce 3 nm and 4 nm chips used for iPhone processors.Source: https://www.bbc.com/news/business-63883047The company will need an arm in the United States to operate, so I think someone like Warren Buffett will invest there.Do not forget that the problem between Taiwan and China and the principle of one China will make someone like Warren Buffett think about not risking his investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "February 19, 2023, 08:09:14 PM",
      "body": "Quote from: Hydrogen on February 17, 2023, 11:48:12 PMIt seems as if the Oracle of Omaha is throwing his enormous financial clout behind AAPL. While simultaneously reducing his exposure to taiwan based TSMC semiconductor.They say they increased their stake in apple by a factor of $3 billion in 4th quarter 2022. With the price chart for AAPL during this timeline being quite interesting. Given apple's known issues with obtaining semiconductors from its suppliers, does this move by Buffett signal those supply chain difficulties are about to be resolved? If anyone would care to question or second guess this investment move by Buffett, I would be curious to know what their opinions are.I would be curious to know what opinion most have of apple and its products. For whatever reason apple apparently being one of the more polarizing figures in the technology industry.When you're at Warren Buffett's level of power, as he has said many times before - he's rather limited where he can put the huge mountains of cash that he's sitting on. If he decides to make an offer on a company, unless it is done privately - usually by family owned operations - then the share prices will tend to get bid up so far as to make the deal unworkable. Plus I guess he's identified Apple as being similar in brand status as Coca Cola, which he famously raves about any chance he gets, in that customers are very loyal but also locked into the ecosystem the company has built around it. That's quite valuable really and it's a company that is giving him a lot of cash back to play with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "February 19, 2023, 11:41:04 PMLast edit: February 20, 2023, 12:47:52 AM by STT",
      "body": "Buffet wouldnt smile on that dividend because he knows the idea of that type of income is only a benefit for government taxes.  The best gains are capital appreciation and perhaps share buy backs and similar.I've held both these for a decade but of the two I'd have thought TSMC the better value and where Hathaway would move.  However Buffet does like high margin stocks, brand names and such and perhaps his deputies have decided  this meets the bill.   It will be a decision with his lieutenants as I think its arranged, all the tech investment is attributable to the next generation of investment made by them.   The big railway purchase a while back was his and similar old school stocks, easily arguable good value decisions I dont think he chose to buy IBM and thats not a new name but he never did before did he ?QuoteTed Weschler, one of Warren Buffett’s two investment lieutenants, grew his retirement account from $70,000 to more than $260 million in less than 30 years.The astronomical returns were achieved by investing in stocks of under-the-radar small-cap firms and other underappreciated opportunities. However, when it comes to managing money for Berkshire Hathaway, Weschler is limited as to what he can achieve https://www.cnbc.com/2021/09/11/buffetts-stock-picking-lieutenant-has-a-proven-track-record-but-his-hands-are-tied-at-berkshire.htmlQuotemake apple bring chip production in-houseEasier said then done, I believe both IBM and Intel sub contract some work to TSMC because nobody does it better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}