{
  "id": "topic_5452134",
  "title": "big_daddy",
  "author": "big_daddy",
  "created_time": "May 09, 2023, 06:00:30 PM",
  "content": "I'm starting this topic about Technical Analysis (TA) & Macro Fundamental Analysis as someone who has been involved in the cryptocurrency space for a while, I've seen firsthand how volatile and unpredictable the market can be.That's why I want to share my own perspective on how to navigate this complex market using both technical and fundamental analysis. I want to make it clear that I'm not a financial advisor and anything I write is purely my own opinion and not financial advice.My goal is to help others understand the market movements by breaking down technical analysis and macro fundamental analysis in a simple and easy-to-understand way. So, whether you're a seasoned trader or a newcomer to the crypto space, I hope that this discussion will be valuable to you.Let's dive in and explore the world of crypto analysis together",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452134",
  "comments": [
    {
      "author": "big_daddy",
      "created_time": "May 09, 2023, 06:03:04 PM",
      "body": "Despite the recent barrage of negative news surrounding Binance, the US defaulting on their debt, and ETH dumping, the technical outlook for BTC charts is quite interesting at present. A false break has been created on the 4-hour chart, and an ideal level re-test from above has occurred on the critical daily wedge (orange wedge on the daily chart). This false break signals a trend reversal, and the subsequent re-test from above essentially confirms it. Moreover, the previous high in price has been surpassed, further indicating the possibility of an uptrend in the hourly chart. However, there are always two sides to the coin, and several levels are likely to resist the upward trend. The question of how high it will go is uncertain. Since the CPI will be published tomorrow and the market tends to slow down before significant news such as inflation readings, I would not force a trade.Nevertheless, there is a reason to look for a long position at the light-gray level on the 1-hour chart (27640), and possibly another pierce/false break of the daily wedge. If another false break occurs at the daily wedge, the current price levels will become unstable in terms of an uptrend. While a downside is possible, it is likely for tomorrow, and today we could gain some relief from the poor BTC price performance over the weekend.If a decline occurs, I believe that 27126 will provide support since there is no fundamental reason for such a large breakout unless the market is pricing in a worse CPI or the possibility of stagflation signs emerging from tomorrow's CPI data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 09, 2023, 09:16:58 PM",
      "body": "I really appreciate the effort that you put in compiling the post. Your technical analysis seems genuine and I would also go with 27126 or 27095 as support levels. The price of Bitcoin is surely aiming towards upper positions and it can in a sense cross the barrier of $30k once again. But, there are some hurdles in the way of that price range.Although, your technical analysis is very good but still things are currently not favoring Bitcoin because of those high transaction fees that are mostly caused by introduction of BRC-20 and ordinals. If the fee remains such high than there are chances that the Bitcoin's value will go further down than that support levels.I don't think that the Ordinals protocol is going down anytime soon. If the situation remains like this then the network will be highly congested and the fees will be very high and because of those high fees many people will dump the Bitcoin on exchanges by bulk selling. And, if that happens then the price will be highly affected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big_daddy",
      "created_time": "May 10, 2023, 10:44:40 AM",
      "body": "I'm pretty confident in my analysis and I totally agree with you that the Bitcoin price is looking up. We could see it break the $30k mark again soon, but yeah, there are a few obstacles we might have to tackle first.I hear you about the transaction fees being a pain in the butt right now. It's mostly because of the BRC-20 and ordinals, but I'm still feeling pretty positive about the market. Even if the fees stay high, I don't think it'll completely tank the price. I don't think it'll be anything too catastrophic.Let's just wait and see what happens after the CPI results are announced in a couple of hours from now. I'm still feeling good about my prediction, though!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "May 10, 2023, 01:05:34 PM",
      "body": "I do really appreciate your TA in Bitcoin. I agree that if we combined technical analysis and fundamental analysis increases probability of winning a trade. Since your bias is longing base on your TA in the chart, I would say that if the price will reach 30k zone but only swept liquidity there's a possibility that next movement of the price will go back to $22k to $23k since there's a huge gap there for rebalancing and a strong demand zone. I'm using a weekly timeframe for that.Currently there's a drastic move to the upside in Btcusdt chart, and possibly the price will retrace to $27700 before the price to continue. I hope we all can join the ride if the market movement is really going to the upside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 10, 2023, 01:37:56 PM",
      "body": "Quote from: big_daddy on May 09, 2023, 06:00:30 PMThat's why I want to share my own perspective on how to navigate this complex market using both technical and fundamental analysis. I want to make it clear that I'm not a financial advisor and anything I write is purely my own opinion and not financial advice.Everyone of us is also trying towards giving the best approach we could in what we are doing and there's no certainty of end result to what we are doing as a positive outcome, we are taking individual risk towards every economic development aspects of what we do and the steps we take, and everything fall under risk at the end.Quote from: big_daddy on May 09, 2023, 06:00:30 PMMy goal is to help others understand the market movements by breaking down technical analysis and macro fundamental analysis in a simple and easy-to-understand way.That's very good of you to do, we need both both the physical and mental aspect of ourselves to determine the trend for a market a d the strategies we apply for them as well to a long way in he kind of result we get from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big_daddy",
      "created_time": "May 11, 2023, 07:36:36 AM",
      "body": "The CPI results are out and it's not too shabby. It's come in at 4.9% instead of the 5.0% that was expected. The core readings stayed put where they were predicted to be, so that's pretty much on par with what everyone was thinking.But what does that mean for us? Well, the price is currently hovering around the first resistance level, so it's not really time to jump in just yet. We don't wanna risk getting burned, especially when we're still waiting to see how things will develop.That being said, my prediction of an uptrend formation is still looking pretty good. I need more confirmations on the short term charts, and then start looking for some long setups. If we can develop a good uptrend here, then we definitely wanna ride that wave and make some gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big_daddy",
      "created_time": "May 12, 2023, 10:16:22 AM",
      "body": "Woow  what's going on with imgur links?Do you guys have problems with that service or it's just me being unlucky here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "May 12, 2023, 10:28:59 AM",
      "body": "Quote from: big_daddy on May 12, 2023, 10:16:22 AMWoow  what's going on with imgur links?Do you guys have problems with that service or it's just me being unlucky here?Everything went crazy for me today as far as imgur links are concerned.Now I see that the last image I uploaded (in this post) is displayed normally. I used the talkimg.com service that was created by joker_josue. It seems that is a better solution.You can find more in his ANN thread TalkImg.com - Image hosting for BitcoinTalk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big_daddy",
      "created_time": "May 12, 2023, 10:58:06 AM",
      "body": "Appreciate that, will take a deep lookI hate when those links expire, cause of course I don't have that screenshoot anymore",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "May 12, 2023, 11:57:04 AM",
      "body": "Quote from: big_daddy on May 11, 2023, 07:36:36 AMThe CPI results are out and it's not too shabby. It's come in at 4.9% instead of the 5.0% that was expected. The core readings stayed put where they were predicted to be, so that's pretty much on par with what everyone was thinking.But what does that mean for us? Well, the price is currently hovering around the first resistance level, so it's not really time to jump in just yet. We don't wanna risk getting burned, especially when we're still waiting to see how things will develop.That being said, my prediction of an uptrend formation is still looking pretty good. I need more confirmations on the short term charts, and then start looking for some long setups. If we can develop a good uptrend here, then we definitely wanna ride that wave and make some gains.  What's your projection for the U.S. CPI during the months coming ahead? Will it continue to go down and give the Federal Reserve an opportunity to \"ease\"/pause their rate hikes? Will the U.S. have a \"soft landing\"? Or will we see more 25 BPS hikes?The low unemployment data makes me believe that the Federal Reserve will not either ease or pause because doing it will definitely make inflation surge again. It happened during 1976 when Volcker, the Fed Chairman during that time, eased rates prematurely, then he was forced to raise rates more aggressively during 1977 to 1980 bringing recession in the country.I'm merely an arm chair economist who likes to discuss, debate, and learn about different topics about Economics and Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptolists",
      "created_time": "May 12, 2023, 12:39:24 PM",
      "body": "I've been working with technical analysis for close to two decades. While many think we are close to a bull run, I think there might be another leg down first.In my opinion, at least $40-48k needs to be broken for signs of a bull run picking up pace. Currently, it looks like we might start the final downturn before it's going up again. Those that know Elliott Wave would refer to it as the 5th leg down, before an upturn is coming. My expectation is that BTC will touch somewhere between $8-12k before the next bull-run starts. A clear downturn might start when/if Bitcoin breaks 20k and stays below that level for a couple of days. What are your thoughts about the technical analysis for Bitcoin in the near future?Ps. I tried to attach an image, but it didn't work. Also, please do your own analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "June 27, 2023, 09:31:36 PM",
      "body": "Quote from: cryptolists on May 12, 2023, 12:39:24 PMI've been working with technical analysis for close to two decades. While many think we are close to a bull run, I think there might be another leg down first.In my opinion, at least $40-48k needs to be broken for signs of a bull run picking up pace. Currently, it looks like we might start the final downturn before it's going up again. Those that know Elliott Wave would refer to it as the 5th leg down, before an upturn is coming. My expectation is that BTC will touch somewhere between $8-12k before the next bull-run starts. A clear downturn might start when/if Bitcoin breaks 20k and stays below that level for a couple of days. What are your thoughts about the technical analysis for Bitcoin in the near future?Ps. I tried to attach an image, but it didn't work. Also, please do your own analysis.Have you tried using this link here: https://imgbb.com/upload, I was probably using Imgur back then, it's of recent I can across this link someone made a post about how to add images on bitcointalk this is the link https://bitcointalk.org/index.php?topic=5297889.0 to how you can use the above link to add image. You are welcome ☺️...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}