{
  "id": "topic_5512113",
  "title": "deepskydiver",
  "author": "deepskydiver",
  "created_time": "October 06, 2024, 07:11:23 AM",
  "content": "https://www.bitcoincyclescomparison.com/Is it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5512113",
  "comments": [
    {
      "author": "nutildah",
      "created_time": "October 06, 2024, 07:21:55 AM",
      "body": "This is interesting. Looks like the cycle top could happen any time in the next 380 days or so.Its also an interesting questions raised. I don't think anyone thinks BTC is going up 100x from here, so yeah, the power of cycles is diminishing, with each successive cycle. Still, we could see $200k easy before the end of next year, even accounting for a weakened cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 06, 2024, 07:34:45 AM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AMIs it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?Or perhaps we're not in the middle of the S-curve, yet. Wishful thinking.  Quote from: nutildah on October 06, 2024, 07:21:55 AMIts also an interesting questions raised. I don't think anyone thinks BTC is going up 100x from here100x in purchasing power? Maybe highly unlikely. But, 100x in dollar terms? Inevitable. As long as there is no bottom for the USD, there is no ceiling for Bitcoin. 100 trillion USD market cap isn't so much of a fantasy for the world's  most preferred asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 06, 2024, 07:52:47 AM",
      "body": "Flat is good. It means a breakout is around the corner. Upwards or downwards that’s the big question. Btc looks pretty powerful for a while and the USD will soon lose more power when the FED lowers the interest rates more. Weak USD means strong BTC so I think bitcoin will soon go ballistic like the Iranian missiles and there is no Iron Dome on earth that has enough tech to stop this hell storm.Not this year but next year I expect btc to cross $100k like cutting butter because USD will lose so much mass and end up being a soy boy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 06, 2024, 08:03:10 AM",
      "body": "I'll calculate it.5,200/98 = 5398/7.5 = 1353/13 = 4This mean, in order to know the scale in the current super cycle we need to divide the last super cycle scale with 4.7.5/4 = 1.875 Bitcoin price at the moment is $62,000 x 1.875, so we got $116,250 which is the highest price of Bitcoin in the current super cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryss191",
      "created_time": "October 06, 2024, 10:16:39 AM",
      "body": "Honestly, it feels like this cycle is just dragging on. With everything happening in the economy, it’s hard to see those classic patterns holding up. I wouldn’t be shocked if we get a surprise breakout soon, though, maybe a shift in sentiment could kick things into gear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "October 06, 2024, 11:12:34 AM",
      "body": "It's still too early to tell for sure. You're right, this cycle has been flatter than the previous ones so far. But remember, we're barely halfway through the first quarter. There is still plenty of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "October 06, 2024, 11:23:19 AM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AMhttps://www.bitcoincyclescomparison.com/Is it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?If you study history, there were winters in the history of Europe that did not end in spring. More precisely, the calendar spring came, but the snow did not melt. Although we know about the existence of climate cycles - winter - spring - summer - autumn.Past events cannot guarantee us repeatability in the future. It is quite possible that in the current cycle, the ATH was at the level of 73,000 US dollars. And, for example, in the next cycle, the price of bitcoin will be much higher than anyone expected.And this can be logically explained. The market very often plays against the crowd. When all traders and investors in the market know about the existence of four-year cycles, they may manifest themselves differently than before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 06, 2024, 12:25:11 PM",
      "body": "Quote from: Solosanz on October 06, 2024, 08:03:10 AMI'll calculate it.5,200/98 = 5398/7.5 = 1353/13 = 4This mean, in order to know the scale in the current super cycle we need to divide the last super cycle scale with 4.7.5/4 = 1.875 Bitcoin price at the moment is $62,000 x 1.875, so we got $116,250 which is the highest price of Bitcoin in the current super cycle.Although we are all saying that not all future events indicates future results but I will say I actually believe we will re live this same cycle again. If there is anything then this calculations actually show it is possible. The other cycles had a far better movement because of the volatility, bitcoin is losing its volatility rate as the year and its adoption grows, although the $116k is below my predictions but is certainly not out of line. My prediction is bitcoin to have &120k to $140k (1.875x current ATH) as the highest price in this current bull run. Economic constrains could set in but they won’t be that sever to stop a six figure price in bitcoin next year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 06, 2024, 01:36:55 PM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AMhttps://www.bitcoincyclescomparison.com/Is it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?It is possible that this will happen gradually in the future, but in this cycle the high is yet to come. Anyway, in the two cycles from 16 to 24 the price was comparatively somewhat higher than now but quite flat as well, and with the natural variability of an asset as volatile as this, I don't see anything catastrophic in the pictures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "October 06, 2024, 01:44:34 PM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AM~I wouldn't say it's not significant anymore; it's just lower compared to the past pumps that the rest of the cycles had. Realistically speaking a 10x increase is around 600k ish from this point, I definitely don't think we'd be seeing such a price point for the next few years, let alone the next few months. Can still smell 100k for next year at least though. The cycle still definitely applies though (or can still be used as a reference). Just as you've said, it just looks like it doesn't because of how weak it is compared to past cycles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 06, 2024, 06:49:16 PM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AM<snip>Looking at the chart there's a pattern of flatter cycles with each halving, so it will be in character for this to be flatter than the last, which was flatter than the one before it, despite starting stronger.Quote from: nutildah on October 06, 2024, 07:21:55 AMI don't think anyone thinks BTC is going up 100x from here, so yeah, the power of cycles is diminishing, with each successive cycle. Still, we could see $200k easy before the end of next year, even accounting for a weakened cycle.I don't think we can put a cap on how high Bitcoin can go, without putting a date limit too. I'll not expect 100× anytime in the next 29 to 50 years, but I think we can get to that amount in more time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 06, 2024, 07:16:48 PM",
      "body": "Quote from: Upgrade00 on October 06, 2024, 06:49:16 PMQuote from: nutildah on October 06, 2024, 07:21:55 AMI don't think anyone thinks BTC is going up 100x from here, so yeah, the power of cycles is diminishing, with each successive cycle. Still, we could see $200k easy before the end of next year, even accounting for a weakened cycle.I don't think we can put a cap on how high Bitcoin can go, without putting a date limit too. I'll not expect 100× anytime in the next 29 to 50 years, but I think we can get to that amount in more time.Why not? I think a 100x increase is possible even before that. Heres my math: Assuming Bitcoin doubles in price every four-year cycle (which is a conservative estimate imho), it would take about seven cycles to go from $60,000 to $6,000,000 (a 100x increase). Thats less than 28 years.Of course, this is just a guess. But Bitcoin is still pretty new, and it has a lot of room to grow. Especially in developing countries, which generally have the large population.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "October 06, 2024, 07:58:13 PM",
      "body": "The cycles are obviously getting smaller and less volatile as time goes by. Look closely and you'll see that every halving year there's this test rally where the price goes up and crashes. It goes into a slow boring consolidation phase and resumes the move up 6 months later. I think that we were in such a phase this year. We touched the last ATH and when expectations were high someone pulled the plug. The way I see it, We're yet to see the mania phase, real rally, but for that to happen the price will have to break above $100k, because before that people will still be anxious and ready to sell at 90-100k psychological barrier, but at 110k everybody will go back in due to FOMO and greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 06, 2024, 08:20:03 PM",
      "body": "Quote from: Stalker22 on October 06, 2024, 07:16:48 PMHeres my math: Assuming Bitcoin doubles in price every four-year cycle (which is a conservative estimate imho), it would take about seven cycles to go from $60,000 to $6,000,000 (a 100x increase). Thats less than 28 years.I don't think the price doubles every 4 years for the next halvings. I think we get to a point, like $500k when the price doubling to $1 million in the next four years is not feasible, I'll speculate that it stops doubling in value before that price even.It's important I point out that this are just predictions and the market will act however it wants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "October 06, 2024, 08:35:40 PM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AMIs it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?Don't expect what happened in the previous cycles to repeat itself that is one rule about Bitcoin. When they mean by increase in the price of Bitcoin it doesn't mean the price will double times 2 every four years. The price could go up a little giving significant profit to those who wish to sell off their Bitcoin. Expecting a double in price may never happen or it may. No one can fully understand the nature of Bitcoin and where the price is headed in a specific timeframe. We could predict the price to increase to a certain amount in two days or a week (may not be certain still) but what it would be next month, or next year, or in 4-10 years we cannot tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "October 06, 2024, 09:28:29 PM",
      "body": "I encourage everybody to check on the Bitcoin Cycles website, as an alternative to the assumptions that cycles start at an halving, the alternative view that cycles start at a top:Source: Bitcoin Cycles Comparison(Open the image separately to view it in more detail.)This chart looks surprisingly much better for this year: The cycle is actually the second best after the 2011-2015 cycle! [1]This is because of two reasons:- The fall from 2021's top was slightly less pronounced than the previous ones (76% instead of >81%)- The recovery was faster, the 2021 ATH at 69000 was reached only 1 year and 4 months after the 2022 bottom. In previous cycles, this milestone was hit significantly later (generally about 2 years after the previous bottom). The 2013 top of $1000 was only reached in early 2017 again (2 years after the early 2015 bottom), and the 2017 top of $20000 was only reached in late 2020 (also 2 years after the late-2018 bottom).In addition, as @coolcoinz also wrote, it is expected that the cycles get \"flatter\" due to falling volatility/increasing liquidity.I also would like to warn to interpret too many regularities out of these \"cycles\". Many still think of 4-year cycles, but there were only two 4-year cycles (2013-17 and 2017-21, also measured \"from top to top\").[1] Small remark: the Bitcoin Cycles website considers 2011-2015 one cycle, which in my opinion is wrong, 2011-13 and 2013-17 are imo two different cycles, and I also don't understand why the second cycle according to the website ends in 2015 - perhaps because it's exactly 4 years away?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "October 06, 2024, 10:13:43 PM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AMhttps://www.bitcoincyclescomparison.com/Is it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?It's really hard to compare on the previous cycle because of this one important factor,a. we have reach new all time high pre-halving, March 2024 (2 months before the halving itself), at $73,000.So that alone is a big factor to me, as we haven't seen this kind of pattern before. And that's why we might be in for a new pattern, it could be that a new all time high or the peak of this bull run might take a little longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "October 07, 2024, 01:43:08 AM",
      "body": "Quote from: nutildah on October 06, 2024, 07:21:55 AMIts also an interesting questions raised. I don't think anyone thinks BTC is going up 100x from here, so yeah, the power of cycles is diminishing, with each successive cycle. Still, we could see $200k easy before the end of next year, even accounting for a weakened cycle.I mean it makes sense when we are at this point where bitcoin has grown a lot compared to before. Of course there is more significant growth back then when the price is still low. Basically you can see the movement so much when it came from 0 to 100. While now it may be difficult to reach the same growth as it did back then. This is not to say that it will not grow anymore but we should not be expecting for it to grow as much as it did back then in one cycle only. We can probably expect bitcoin to stabilize a little more than its previous years because of just how big its value is currently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 07, 2024, 02:39:46 AM",
      "body": "Quote from: deepskydiver on October 06, 2024, 07:11:23 AMhttps://www.bitcoincyclescomparison.com/Is it possible that the pattern of cycles no longer applies or is at the very least diminishing to a point where its effect is not significant?You built up a good website for Bitcoin cycle comparison.Now we are in a bull market, and the question is only whether the bull market hit its top yet. So I see we can skip discussion on where is the bottom.For a question on bull market top, let's see Pi Cycle Top indicator that is available on some Open-access websites.https://www.bitcoinmagazinepro.com/charts/pi-cycle-top-indicator/https://charts.bitbo.io/pi-cycle-top/https://coincodex.com/bitcoin-pi-cycle-top-indicator/Bitcoinmagazinepro.com used to let their page for Bitcoin Pi cycle top and bottom indicator as Open-access but now it is for Advanced (paid) users only.Quote from: nutildah on October 06, 2024, 07:21:55 AMThis is interesting. Looks like the cycle top could happen any time in the next 380 days or so.Its also an interesting questions raised.If a person does not want to invest in Bitcoin for very long term, more than this cycle, it is reasonable to think of taking profit and exit the market before the end of 2025, the next year. Because a bear market with its length of about 2 years, is always very painful and uncomfortable for people who don't have any plan for these times, and their feeling will be different than intelligent investors who have solid plans and wait patiently for bear market to get better entries or more accumulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}