{
  "id": "topic_5460251",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "July 18, 2023, 06:16:35 PM",
  "content": "No idea if/what is the official process for requesting this, but Polish local board could really use another merit source.To my understanding, we currently have only 1 source (malevolent) who is hardly active on this forum.The stats say it all (credit to Rikafip), it's the local board with the worst merit/post ratio, despite high quality posts:Quote from: Rikafip on July 17, 2023, 05:17:22 AMSo I'd like to nominate any of the most active (and well respected) top 3 posters:Tytanowy Januszwwzsockicygan",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460251",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "July 18, 2023, 06:25:23 PM",
      "body": "While I do agree that based on merit/post ratio Polish board could use another merit source, that's not really how merit sorce application works.Quote from: theymos on January 24, 2018, 11:00:11 PMIf you want to be a merit source: 1. Be a somewhat established member. 2. Collect TEN posts written in the last couple of months by other people that have not received nearly enough merit for how good they are, and post quotes for them all in a new Meta thread. The point of this is to demonstrate your ability to give out merit usefully. 3. We will take a look at your history and maybe make you a source.My suggestion is that you talk among yourslf in Polish board who will submit application, and then support the one you choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 18, 2023, 06:48:32 PM",
      "body": "To be honest, I just don't like the idea of giving merits on local boards. I am sorry if I sound like a bad guy but I would say that local boards feel the national pride and duty to help each-other to rank up and give merits to their compatriots.I think the situation is following: People from poor countries help each-other to rank up to participate in signature campaigns with high payroll. That's probably why I see that person only gets merits from local boards while his/her posts in English language never get rewarded. This isn't fair and probably destroys the main idea of merit system on this forum.Correct me if I am wrong, I have no problem with that but this is just what I see and notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 18, 2023, 07:03:49 PM",
      "body": "Quote from: Synchronice on July 18, 2023, 06:48:32 PMTo be honest, I just don't like the idea of giving merits on local boards. Local boards usually have members who prefer to be active only in their own local board and without merit sources it will be very hard for them to ever rank up. Therefore there is nothing wrong with having merit sources that will be focused on their own local board (btw, that doesn't stop them from sharing merit in other parts of the forum as they often do that).That used to be the case in Croatian local board few years ago when it was almost impossible to rank up if you were mainly active there no matter how quality your posts were. Luckily that changed after we got few merit sources so now quality posts don't go unmerited. Quote from: Synchronice on July 18, 2023, 06:48:32 PMThis isn't fair and probably destroys the main idea of merit system on this forum.The main idea behind merit system is to stop shitposters ever reaching higher ranks, and not to stop decent members from ranking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 18, 2023, 07:19:44 PM",
      "body": "Quote from: Rikafip on July 18, 2023, 07:03:49 PMQuote from: Synchronice on July 18, 2023, 06:48:32 PMThis isn't fair and probably destroys the main idea of merit system on this forum.The main idea behind merit system is to stop shitposters ever reaching higher ranks, and not to stop decent members from ranking.I can't call decent members to those who use the support of locals on local board to rank up and then post shit posts on international boards in English language. Am I the only one who sees this tendency? There are a lot of people who post shit posts but have lots of merits, then I check their profiles and 95% of merits come from local boards. This problem really exists, this is a loophole that shitposters use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 18, 2023, 10:24:29 PM",
      "body": "I understand the need for a locale to have a merit source at atleast one and since the one already assigned to the board is not that active anymore, having a request like this is enough to serve a reminder on the need for a merit source on the local board, but in additional to this, you need to understand the need to also encourage for more participations on the local board from members by increasing the board performances in activities, just as you can see from the statistical performance that it's the least on the chart and if they could atleast increase more performance may also trigger more attentions to back up the request.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 18, 2023, 10:44:17 PM",
      "body": "Quote from: Synchronice on July 18, 2023, 07:19:44 PMI can't call decent members to those who use the support of locals on local board to rank up and then post shit posts on international boards in English language. Am I the only one who sees this tendency? There are a lot of people who post shit posts but have lots of merits, then I check their profiles and 95% of merits come from local boards. This problem really exists, this is a loophole that shitposters use.Normally, someone who is a source of merit was evaluated and showed that he was someone with good sense in the distribution of merits.So, if someone makes great posts on your local board, and gets merits for it, that's fine. Who is to blame for those who give merits, for those who receive low-value posts in English? Where does the merits system fail in this regard? Merit is given not because it is person x or y, but for the posts it makes.In addition, it is up to campaign managers to assess whether this person makes good or bad posts.If the person makes more posts in a general way, then he doesn't have much advantage in having many merits, because he won't be able to participate in a campaign.By the way, merits were not created to participate in campaigns. Managers use this tool to help them choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "July 19, 2023, 02:47:13 AM",
      "body": "Quote from: Synchronice on July 18, 2023, 06:48:32 PMTo be honest, I just don't like the idea of giving merits on local boards. I am sorry if I sound like a bad guy but I would say that local boards feel the national pride and duty to help each-other to rank up and give merits to their compatriots.I think the situation is following: People from poor countries help each-other to rank up to participate in signature campaigns with high payroll. That's probably why I see that person only gets merits from local boards while his/her posts in English language never get rewarded. This isn't fair and probably destroys the main idea of merit system on this forum.Correct me if I am wrong, I have no problem with that but this is just what I see and notice.At least is not all the local board that does such, maybe you might have seen it happening in some other local board and I won't say people from poor countries, is best you specify the country and no country would like to be addressed in that way in as much as I myself respect you opinion. But some how what you're saying about these whole thing getting to destroy the merit system is true. I think that some merit source in some local board are really strict and they don't just give merit to any post just to help out their fellow compatriots in ranking up to join a higher paid campaign, to me I won't want anything to mess things up concerning the merit system as it is, before one has to get a merit he/she has to earn it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 19, 2023, 04:44:16 AMLast edit: July 19, 2023, 03:05:20 PM by wwzsocki",
      "body": "Quote from: pawel7777 on July 18, 2023, 06:16:35 PMNo idea if/what is the official process for requesting this, but Polish local board could really use another merit source.First thank you for nomination and second I agree with you that we need merit source from long timeit was discussed on our local board few times and we have even requested new merit source officially (as it should) very long time ago but never get any reaction to this from @Theymos so slowly gave up to even tryFortunately there was always couple of Polish members that posted also on English boards quality content that was rewarded and thanks to them we had some merits to reward newbies and active members for their efforts, to make them willing to come back at least. There are not many active members on our local board and many newbies never come back after they see that it will be almost impossible for them to rank up especially if they don't understand English enoughI myself don't have merits lately (don't post on English boards too often), and if I get some then also try to always save few to reward members on our local board to keep it rolling, when I see/read some quality post that I can't merit then always ask merit source to check it out and reward but this is rarely the case that it happens in the end of courseQuote from: Sexylizzy2813 on July 19, 2023, 02:47:13 AMQuote from: Synchronice on July 18, 2023, 06:48:32 PM...local boards feel the national pride and duty to help each-other to rank up and give merits to their compatriots...Correct me if I am wrong, I have no problem with that but this is just what I see and notice.At least is not all the local board that does such, maybe you might have seen it happening in some other local board...is best you specify the country...I think that some merit source in some local board are really strict and they don't just give merit to any post just to help out their fellow compatriots in ranking up to join a higher paid campaign...Merit sources are chosen by admins on request and nomination from local board members, if there is something wrong with how they use their power then such cases should be investigated and MS exchanged if proven that indeed rewarded posts they shouldn't. we just can't punish all local boards because of that and for sure this is not the case on Polish board, we have plenty of high quality content that should be rewarded and isn't because we don't have merits or active merit source to do it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "July 19, 2023, 08:18:34 AM",
      "body": "first, i would also like to thank pawel7777 for nominating me as a merit source on the polish local board.as wwzsocki has already written, it is very difficult to promote completely new users in their rank, if you can not show a general merit source in the said local board. thus, the number of new users stagnates and only the old-established users of the forum discuss.in addition, the only merit source on the polish board (malevolent) was last online on 03/18/2023 and has not visited the forum since then...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 19, 2023, 09:57:55 AM",
      "body": "Quote from: cygan on July 19, 2023, 08:18:34 AMin addition, the only merit source on the polish board (malevolent) was last online on 03/18/2023 and has not visited the forum since then... malevolent is also a moderator for Polish local board so if he/she left the forum, Polish board will need another local moderator.It is too soon to make a conclusion but let's keep observing actitivities of malevolent. If he left the forum, Polish members will have chance to ask two things: a new moderator and a new merit source.Different criteria for choosing a local moderator (mainly based on report history and reputation) and a merit source (reputation and post quality).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "July 19, 2023, 10:02:49 AM",
      "body": "Quote from: Synchronice on July 18, 2023, 07:19:44 PMQuote from: Rikafip on July 18, 2023, 07:03:49 PMQuote from: Synchronice on July 18, 2023, 06:48:32 PMThis isn't fair and probably destroys the main idea of merit system on this forum.The main idea behind merit system is to stop shitposters ever reaching higher ranks, and not to stop decent members from ranking.I can't call decent members to those who use the support of locals on local board to rank up and then post shit posts on international boards in English language. Am I the only one who sees this tendency? There are a lot of people who post shit posts but have lots of merits, then I check their profiles and 95% of merits come from local boards. This problem really exists, this is a loophole that shitposters use.Did you also see their posting on the local board? I see a lot of good posts on my local board and no spam there. I think a lot of members who communicate on international boards are language barrier. Apart from the quality of the posts, people who take the forum seriously and don't commit fraud also deserve appreciationDid you know that every time I post in English, I have to use a translation and correct the spelling? That's pretty tough buddy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 19, 2023, 10:06:52 AM",
      "body": "Quote from: PytagoraZ on July 19, 2023, 10:02:49 AMI think a lot of members who communicate on international boards are language barrier.People should feel more comfortable and communicate better through their mother language than through their second language such as Enlish. In fact, they should communicate better in their local boards with native languagues than in International (global) boards with English.They don't join local discussions probably because their local boards are dead, inactive or just shit posts and they are not interested in joining low quality discussions. Sometimes they just don't have a local board or local thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "July 19, 2023, 10:14:25 AM",
      "body": "Quote from: Synchronice on July 18, 2023, 07:19:44 PMI can't call decent members to those who use the support of locals on local board to rank up and then post shit posts on international boards in English language. Am I the only one who sees this tendency? There are a lot of people who post shit posts but have lots of merits, then I check their profiles and 95% of merits come from local boards. This problem really exists, this is a loophole that shitposters use.If those users have a lot merits and their posts on global boards are like shit, actually there's no problem for me. I mean, I don't care if those users have a lot merits from local board, it's just merit, nothing else. If they use the account to sell merit, ruin the DT system, or anything that harm for the community, this would be an issue. However most of signature campaigns need to posts in global boards, so if they're shitposters, they should be not in campaign as the managers will reject shitposters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 19, 2023, 10:20:42 AM",
      "body": "Quote from: pawel7777 on July 18, 2023, 06:16:35 PMNo idea if/what is the official process for requesting this, but Polish local board could really use another merit source.To my understanding, we currently have only 1 source (malevolent) who is hardly active on this forum.Until a new merit source is chosen, and if you feel unfair in getting merits in your local board, create a topic in the Reputation or Beginners & Help section with a quote for posts that deserve merits, (make the topic self-moderated to avoid spam) I will bookmark that page and visit it from From time to time, and it will be a best place to choose a merit source in the future.In general, the process of selecting new merit sources is slow, and I have a surplus of these sMerit, so creating such topic will make it easier for me.This is an invitation to all other local boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 19, 2023, 10:54:25 AM",
      "body": "Quote from: wwzsocki on July 19, 2023, 04:44:16 AMMerit sources are chosen by admins on request and nomination from local board members, if there is something wrong with how they use their power then such cases should be investigated and MS exchanged if proven that indeed rewarded posts they shouldn't. This is how merit laundering happens: I post a normal or high quality post, then someone gives me 50 merits, so I'm left with 25 smerits, then I send 25 smerits to another compatriot, then he will receive 30 merits from merit source, then he sends me 10 merits and so on. I would say that most of the times, local board members send inadequate volume of merits to their compatriots. Btw it's hard to argue whether person deserves 1 merit, 2 merit or 50 merits because everyone can back it up simply: I felt so.Quote from: Helena Yu on July 19, 2023, 10:14:25 AMHowever most of signature campaigns need to posts in global boards, so if they're shitposters, they should be not in campaign as the managers will reject shitposters.Managers don't reject shitposters. Sometimes signature campaigns have low pay rate but need to hire a lot of users, then they are unable to hire high quality posters and out of 50 slots, only 30 is filled. What managers do in this case? They simply hire low quality posters because there is no high quality poster left who will agree their payrate but there is a gap to fill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 19, 2023, 12:50:54 PM",
      "body": "Quote from: Synchronice on July 19, 2023, 10:54:25 AMThis is how merit laundering happens: I post a normal or high quality post, then someone gives me 50 merits, so I'm left with 25 smerits, then I send 25 smerits to another compatriot, then he will receive 30 merits from merit source, then he sends me 10 merits and so on. I would say that most of the times, local board members send inadequate volume of merits to their compatriots. Btw it's hard to argue whether person deserves 1 merit, 2 merit or 50 merits because everyone can back it up simply: I felt so.This is to assume that every merit source has a scheme to give more merits to their compatriots than to others. Which doesn't make any sense.I give more merits to the participants of the Portuguese tab, because I spend most of my time there, not just because I speak Portuguese.In addition, there is no rule or standard on how to distribute merits, so I think it is difficult to define whether a merit is or is not given well.Therefore, this idea that there is a merit distribution scheme in local tabs does not make any sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 19, 2023, 03:06:18 PMLast edit: July 19, 2023, 04:26:45 PM by Rikafip",
      "body": "Quote from: tranthidung on July 19, 2023, 09:57:55 AMmalevolent is also a moderator for Polish local board so if he/she left the forum, Polish board will need another local moderator.I wish them good luck if they go for another moderator. We (Croatian local board) lost ours (Lauda) years ago and never got a new one and we are far more active than Polish local board. Quote from: Synchronice on July 19, 2023, 10:54:25 AMThis is how merit laundering happens: I post a normal or high quality post, then someone gives me 50 merits, so I'm left with 25 smerits, then I send 25 smerits to another compatriot, then he will receive 30 merits from merit source, then he sends me 10 merits and so on. I would say that most of the times, local board members send inadequate volume of merits to their compatriots. Btw it's hard to argue whether person deserves 1 merit, 2 merit or 50 merits because everyone can back it up simply: I felt so.But you can clearly see that's not happening in Polish board as they had a measly 0.04 merits per post in June which is equal to Off-Topic merit/post ratio, and we all know what kind of discussions are going on there. Hell, even Announcements (Altcoins) board which is known for spam and shitposts had 2x of their merit post ratio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "July 19, 2023, 03:40:09 PM",
      "body": "Quote from: hugeblack on July 19, 2023, 10:20:42 AMUntil a new merit source is chosen, and if you feel unfair in getting merits in your local board, create a topic in the Reputation or Beginners & Help section with a quote for posts that deserve merits, (make the topic self-moderated to avoid spam) I will bookmark that page and visit it from From time to time, and it will be a best place to choose a merit source in the future. That's an interesting proposal. You are one of the few guys who want to merit local board posts. I don't remember seeing anyone except for fillippone, who intends to review local posts. There is a thread by Loyce to report unmerited good posts. But the limitation is he cannot review local posts as he doesn't understand other local languages! It will be challenging for you to evaluate good posts. But, if you rely on some established members who can review for you and submit the posts, this is great approach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "July 19, 2023, 04:23:38 PM",
      "body": "Quote from: Synchronice on July 18, 2023, 07:19:44 PMI can't call decent members to those who use the support of locals on local board to rank up and then post shit posts on international boards in English language. Am I the only one who sees this tendency? There are a lot of people who post shit posts but have lots of merits, then I check their profiles and 95% of merits come from local boards. This problem really exists, this is a loophole that shitposters use.What's the purpose of merit if I may ask you? To appreciate helpful contribution if I am correct, right? Judging from your perspective, even if a post is useful to the local board it should not be merited since it's a local board. That's a very weak argument. The merit sources are not that foolish to be meriting every post if they're not merit worthy.It's true that some people are not fluent in English but that doesn't stop them from contributing massively to their local board with their local board. Having majority of their merit from local board simply means they are more active there. By the way, campaign manager are not always after merit but the quality of your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}