{
  "id": "topic_5481099",
  "title": "Biggeno",
  "author": "Biggeno",
  "created_time": "January 10, 2024, 05:00:21 PM",
  "content": "True Bitcoin has had a massive turn since 2013 and was one of the year with benefits for Bitcoin investors or holders it started with $13.3 in 2013 and by October crossed over $200 unlike 2012 which was not too outstanding. Today bitcoin is about $45,474 per dollar and many cryptocurrencies are now been generated to compete greatly with Bitcoin, leaving the fact that it is the most known  cryptocurrency most individuals are still been illiterate about it.Although I have not yet owned Bitcoin, I understand that investing in Bitcoin is a great idea but as like others, it is not a 100% guarantee. And if owned should be stored in a non custodian wallet for safety, I would love to begin my Bitcoin journey and appreciate lots of ideas and advice from this family. So what is your take about this, would you advise on owning Bitcoin in 2024 or do you see it as a total risk?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5481099",
  "comments": [
    {
      "author": "Gio vanna",
      "created_time": "January 10, 2024, 05:19:20 PM",
      "body": "Is blissful since holding bitcoin, bitcoin growth as being amazing since all those years. Wish I started holding bitcoin around such years it would have been epic but still is never too late to still partake in this great opportunity.Back to you at first if you looking for 100% guarantee shows that you ain't ready. Yeah we all know that no investment can be 100% safe, even bitcoin but still the risk in bitcoin is not like that of the others alot of time many holders back then have given up on BTC but still end up making a huge profits. For instance during the 2022 around November bitcoin dip to the price range of $15k and alot of holders sold theirs in losses. But some still lose hope and left theirs on their Dex wallet but now bitcoin price is at the range of $45,474 and this is just the beginning ☺️  because soon bitcoin will beat it's old ATH. So if you planning to invest on bitcoin always make sure is long-term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "January 10, 2024, 05:26:54 PM",
      "body": "Everyone has already understood that Bitcoin has left its mark on history and is not going to just leave it. I believe Bitcoin will hit a new ATH in 2024 following the adoption of the Bitcoin ETF and yes... I would hold Bitcoin this year for the long term. After all, sooner or later the SEC will agree on everything and accept all applications for ETFs; there is no escape from this. And as we know, this market is huge and will bring huge investments in Bitcoin, therefore it is worth waiting and watching the news in this area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "January 10, 2024, 05:38:24 PM",
      "body": "if you believe in bitcoin you can invest, if you think that it is very risky you don't need to invest in it. investment requires self-awareness, not other people's opinions, because other people may think that bitcoin is profitable, but when you invest in it you lose and in the end you curse people on this forum and say that bitcoin is a scam.so if you understand the risks of investing in bitcoin and are ready for it, you can invest in bitcoin, don't jump straight away without thinking about the risks because that will only result in your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fuso.hp",
      "created_time": "January 10, 2024, 05:38:54 PM",
      "body": "In 2013, the price of one bitcoin was around 14 dollars, after 10 years, the price of one bitcoin has reached about 45 thousand dollars. That is, the value of Bitcoin has increased tremendously in these ten years. If we look at this future without the past figures now, then ten years from now, the value of Bitcoin may exceed hundreds of thousands of dollars. Ever since Bitcoin hit the market, its popularity and value have steadily increased. In 2013, many of us may have known about Bitcoin but due to lack of proper understanding about investment, we may have missed the opportunity to invest in this coin. When we know enough about investing and understand enough about bitcoin, then the value of one bitcoin has become too much, that is, we cannot buy one btc even if we want to now. If we keep buying btc little by little without buying one btc, but we may have more than one bitcoin at a time, so we have to think about this and plan our investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "January 10, 2024, 05:50:23 PM",
      "body": "I can advice people owning bitcoin but I only advice to people who has a prior knowledge first. I don't teach them, learning it how to use it and what to do with it with their own effort is important. If they have the sufficient knowledge about bitcoin, they will know the history of it, how to use it and how risky it is. We know that the volatility is considered by others as risky but I believe that it differs from person to person, I see volatility in a good way and understand how to take advantage of it.Knowledge and understanding bitcoin is what makes them invest aside from the potential profits they can get. Non-holders themselves are the one who will decide if they will have some portion of the bitcoins depending on the knowledge they have about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "January 10, 2024, 06:08:37 PM",
      "body": "There should be no rush in owning Bitcoin, it's best as you finding it interesting to get acquainted with the knowledge of Bitcoin first before venturing into the market cause I believe you certainly have the plans of investing on your list.Bitcoin has performed successfully over the years just after the halving that happend by 2020 we can tell when Bitcoin touched the $64k mark. So owning Bitcoin in plans for the 2024 halving is an incredible decision, you just have to go for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "January 10, 2024, 06:23:23 PM",
      "body": "I don't think investing in Bitcoin now that the price is $45 is a risk. In the last bull market bitcoin price at the top was around 67-$70 if I'm not making mistakes and now bitcoin price is just $45, i doubt this will be top price for the bull. Bitcoin price in this bull market will exceed the price of the last bull market. For me buying bitcoin is not risky because I know the price will still go up more than what it is, at this time one should only buy according to the amount you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "January 10, 2024, 06:38:42 PM",
      "body": "Quote from: Biggeno on January 10, 2024, 05:00:21 PMSo what is your take about this, would you advise on owning Bitcoin in 2024 or do you see it as a total risk?It is necessary and profitable in owning Bitcoin at any given time and 2024 shouldn't be a passer-by because there would surely be a \"had I know\" as a saying at when you would watch the markets value accelerating so impressively at when its investors have to echo with the Joy of higher incomes so, it is wise enough owning Bitcoin while time goes by before the bull un at ATF is approved.There is no given risky time in owning Bitcoin because Bitcoin has never in time factor looses its potentials. Though Bitcoin and Crypto in general has high risk of hodling due to its volatilities but Bitcoins is a most reliable crypto coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "January 10, 2024, 06:42:11 PM",
      "body": "Quote from: Obim34 on January 10, 2024, 06:08:37 PMThere should be no rush in owning Bitcoin, it's best as you finding it interesting to get acquainted with the knowledge of Bitcoin first before venturing into the market cause I believe you certainly have the plans of investing on your list.In order to invest in bitcoins, you don't necessarily need to have a deep understanding of how the bitcoin ecosystem works. It is enough to know the basics: how wallets work, what transactions are, etc. After all, not everyone who invests in gold, for example, knows the full process of gold mining. The main thing is to understand that investing in bitcoin is quite risky and to allocate the money that the investor is not afraid to lose in case of anything. That you do not need to sell your real estate or take out loans in order to invest in bitcoin. Otherwise, it can end up being quite disastrous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "January 10, 2024, 06:51:04 PM",
      "body": "There are some questions newbies ask that is making me to laugh. And they are funny. Op your question is fun. And base on your question I see this thread as nothing but you created it to increase your activities. You are really asking if to invest in Bitcoin in 2024 is okay or it is risky. Well I will tell you that it is risky because Bitcoin is volatile and if you can not ber a long term investment the. You should stay away from Bitcoin because Bitcoin is not a quick rich investment whereby you invest and thinking to have profit with a month. And if you think that Bitcoin is risky you can leave but those who like invest will still do it. Investing in Bitcoin is for everyone but you have to accept it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "January 10, 2024, 07:33:25 PM",
      "body": "Quote from: Agbe on January 10, 2024, 06:51:04 PMThere are some questions newbies ask that is making me to laugh. And they are funny. Op your question is fun. And base on your question I see this thread as nothing but you created it to increase your activities. You are really asking if to invest in Bitcoin in 2024 is okay or it is risky.I think what OP generally is asking in whether to invest in bitcoin in 2024 is basically about the price. OP might be having some doubts that since the price is around $45k it seems high now and it might retrace later. My advice to OP is bitcoin price do not retrace like that and waiting for retracement might never arrive. If you have the money now invest into bitcoin because even at the current price there is possibility that it is going to do a 3x during a full bull run. OP what you need to do is to split your funds and do a DCA if you’re skeptical about going all at this price. The DCA method is the best for price fluctuations like this. But be sure the amount you’re investing is for a very long time because. No one is certain when the bull run will actually comes the only prediction base on past bitcoin trends is that it comes after the halving but a certain date isn’t know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "January 10, 2024, 08:01:57 PM",
      "body": "Quote from: Biggeno on January 10, 2024, 05:00:21 PMSo what is your take about this, would you advise on owning Bitcoin in 2024 or do you see it as a total risk?OP, try and own some bitcoin this year 2024. Everything today is risky and bitcoin cannot be as risky as you’re imagining it. The year 2024 is been seen as a year of great fortune for bitcoin and if you want a retracement on the price before you’ll buy, I’m sorry, you’ll lose buying it at a very good price now. Your comparison to the past price of bitcoin makes me assume that you are not sure of investing now, not because you’re seeing it as a risky investment but because of the price it have rose to already. Try and own some bitcoin if you can and stop the procrastination about buying some now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "January 10, 2024, 08:17:22 PM",
      "body": "Quote from: Obim34 on January 10, 2024, 06:08:37 PMBitcoin has performed successfully over the years just after the halving that happend by 2020 we can tell when Bitcoin touched the $64k mark. So owning Bitcoin in plans for the 2024 halving is an incredible decision, you just have to go for it. This is true that the Bitcoin price has gained a sustainable rise in recent years after previous halving, but if we look at the price moment of Bitcoin, whomever movement is also much more vibrant. Apart from this, it is nice to see a vibrant gain in the price movement. I mean only Halving does not correspond with the aspect of profit; there are also a seeming rise in the Bitcoin price.So in fact, Bitcoin Halving is one of the most strategic and big events for Bitcoin enthusiasts, so these events have a special impact on the Bitcoin price. So it sounds good there. I also have advice for those people who are also trying to figure out a way to earn profit in a short time They need to invest their money before Halving because 1st is ETF approval and 2nd is Halving which is the best point because it can bring up the price of Bitcoin into a colossal range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "January 10, 2024, 08:33:07 PM",
      "body": "The risk will never be gone when you're trying to invest on anything, that's all you need to remember and like the first rule and tip of investing.I'd definitely advise to buy Bitcoin if you see this market to be a long term home for you. But once done telling to buy and advising, it's all on how you're going to respond or going to do exactly as what advised to you.I don't force people to buy Bitcoin but just tell them how the run was for me. Obviously, it was a good experience and that's why I am staying but new comers find it hard when they're inspired but also scared at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 10, 2024, 08:53:30 PM",
      "body": "Quote from: Biggeno on January 10, 2024, 05:00:21 PM-snip-So what is your take about this, would you advise on owning Bitcoin in 2024 or do you see it as a total risk?Owning Bitcoin or any other assets has a considerable degree of risks but owning Bitcoin do not have a \"total risk\" in 2024. Although the price of Bitcoin is getting bigger these days and it is discouraging at the same time, regardless, it is a way to make money, except that the money can't be as huge as though the coin was still very low in price. Imagine when the coin was still almost $10 or thereabout, one could still beat his chest that it would rise so high and multiple retruns would be made easily. This happened even at the lower price it was in the last post-halving period. But things have changed, and with the price almost $50,000 and nearing its ATH again, it might not be an investment that can give enough returns in multiples anymte. But still, you can make between x2-x3 of your money within the next 1.5 years.This is still better than most investments out there, you will hardly have the 30% return on your annual investment in them so this is still a very good deal for anyone. However, if you need more money and still want to gain it through investment, and crypto investment for that matter, you might want to turn to altcoins in this regards. You might also divide your investment in Bitcoin and altcoins to maximize your earning and also diversify your portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "January 10, 2024, 09:18:54 PM",
      "body": "Quote from: Biggeno on January 10, 2024, 05:00:21 PMAlthough I have not yet owned Bitcoin, I understand that investing in Bitcoin is a great idea but as like others, it is not a 100% guarantee. And if owned should be stored in a non custodian wallet for safety, I would love to begin my Bitcoin journey and appreciate lots of ideas and advice from this family.There is no 100% guarantee in investment. There should be a risk in the investment, whether it is a high risk or a low risk. If you are afraid with the risk, you have no chance to invest in any asset. Even you invest in gold or land, it also has a risk but it seems lower than the risk in Bitcoin investment. However, although Bitcoin has a higher risk but it offers a higher profits, too.Dude, if you think investing in Bitcoin will be a good idea, why you don't invest in Bitcoin yet? I think you need to start your investment in Bitcoin before its reaches the new ATH in the next few months. The current price is still cheap enough to buy Bitcoin, you can hold it for few months. I'm sure the price will increase more significantly after the Bitcoin halving in April.Quote from: Biggeno on January 10, 2024, 05:00:21 PMSo what is your take about this, would you advise on owning Bitcoin in 2024 or do you see it as a total risk?Total risk? I think Bitcoin investment is not so risky. Although we don't know how far Bitcoin to raise in the bullrun season, but the price of Bitcoin should increase gradually. So, since it is still in the very early of 2024, it is safe enough to buy Bitcoin now. It is okay to buy Bitcoin as long as the Bitcoin halving isn't started yet. So, why you don't want to buy now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "January 10, 2024, 09:41:53 PM",
      "body": "Well, if I were to advise you, of course you should invest in or own a bitcoin. Risk will never be avoided in bitcoin investment; rather, it is inevitable. It is up to the person or investors if they can take the risk. In bitcoin, taking risk equals reward or profit, so if you can't take the risk and the losses, then I'd rather say that you should avoid bitcoin. It will make you insane if you are not used to the risk or feeling of anxiety while you are investing in bitcoin or any other cryptocurrency.Bitcoin may be at a higher price now, but it is not necessary that you buy a whole bitcoin; you can buy a chunk, or satoshi, where satoshi is the cents of a bitcoin. Any amount of satoshi can make you profit if you put it in a good position and the price goes up. Risk risk risk: many topics are about this. If you are afraid or cowardly of the risk, then you can't take bitcoin as an investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "January 10, 2024, 09:57:32 PM",
      "body": "I know what you mean but it is not 45k per dollar but 45k per btc as of now. Even if you did or didn't invest in bitcoin but if you talk about bitcoin then you should think that there's a risk when you started to invest in bitcoin and of the reason why it is risky is it's price movement. I am sure you have know that bitcoin's price is not stable therefore it may increase or decrease at any time. If you haven't know, if you want to invest un bitcoin then it is not necessary to buy a whole bitcoin because you can buy satoshi which is a smaller amount of btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 10, 2024, 11:06:08 PM",
      "body": "Quote from: Biggeno on January 10, 2024, 05:00:21 PM(....)So what is your take about this, would you advise on owning Bitcoin in 2024 or do you see it as a total risk?For me yes, if you want to support Bitcoin, you can buy anytime Bitcoin and own it anytime regardless of the price and time.By just owning Bitcoin of any amount, it will help you to get introduced with Bitcoin, you will be curious of what is Bitcoin, you will try to do basic transferring of Bitcoin by receiving or sending and that's the start you will appreciate the really use of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}