{
  "id": "topic_5440033",
  "title": "Mandez4real",
  "author": "Mandez4real",
  "created_time": "February 16, 2023, 08:01:12 AM",
  "content": "I can't wait for Bitcoin and other cryptocurrencies to become widely accepted globally because this will definitely solve the challenges people are facing in some countries like Nigeria right now. With digital currency no need to depend on banks again, which will go a long way to make life better for the masses out there.Imagine what Nigerian people are currently going through over a new monetary policy. People can't get the money they put in banks, and the masses are passing through hell at the moment. I believe Bitcoin and cryptocurrencies are what we all need to make life better.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440033",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "February 16, 2023, 08:12:38 AM",
      "body": "You don't need legal tender and legally allowance to use cryptocurrencies.Citizens are allowed to do everything that are not prohibited by laws so even if cryptocurrencies are not accepted legally, you can still use them. Only if government locally prohibit cryptocurrencies and put it into kind of crime, you will not be able to use them legally.Legal tender is big achievement from El Salvador but you see, we don't need legal tender for Bitcoin globally to use it globally.Cryptocurrencies are created from blockchain technology that can be used to further change the world so they will be here and become more adopted globally.Status of Cryptocurrency regulations around the world",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pesona1",
      "created_time": "February 16, 2023, 08:26:45 AM",
      "body": "Not only you, of course we all hope that bitcoin can be adopted and accepted globally, now many countries in the world are starting to spark to use the blockchain system in their economies which in the end are starting to create their own digital currency (CBDC), but even so, not a few countries really doubt that bitcoin and other cryptocurrencies can be a trigger to turn off fiat money and banking so that several countries prohibit the use of crypto, I don't know how the regulations are in Nigeria, but it's really better for us to wait if one day it is adopted mass will be done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "February 16, 2023, 08:27:29 AM",
      "body": "Bitcoin and other cryptocurrencies are digital, no problem with online naira transactions. The problem is with the paper naira withdrawal limit and inadequate new naira in the circulation. Although, the paper naira withdrawal limit is not the cause of the recent problem, it is caused by the inadequate new naira notes in circulation.Not a lie that we are going through hell in Nigeria right now because there are some people that do not have online means of payment, people we buy pepper, onion, tomatoes and many other things from. Many people do come from village every 4 days to sell in town, many of them do not collect bank transfer but rely on naira notes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "February 16, 2023, 09:27:45 AM",
      "body": "Quote from: Mandez4real on February 16, 2023, 08:01:12 AMI can't wait for Bitcoin and other cryptocurrencies to become widely accepted globally because this will definitely solve the challenges people are facing in some countries like Nigeria right now. With digital currency no need to depend on banks again, which will go a long way to make life better for the masses out there.Imagine what Nigerian people are currently going through over a new monetary policy. People can't get the money they put in banks, and the masses are passing through hell at the moment. I believe Bitcoin and cryptocurrencies are what we all need to make life better.I would say not just digital currencies, but specifically Bitcoin has the potential to truly change the fate of certain countries and their inhabitants, especially those in third-world countries where many remain unbanked. Bitcoin can provide a means to control one's savings. I believe that Bitcoin has the potential to significantly improve the lives of people worldwide, but it requires a commitment to adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "February 16, 2023, 09:37:56 AM",
      "body": "To be honest why many people are complaint to the banks? it seems like banks did many mistakes or terrible service to their customers. In my experience I don't have any problem with my local banks, they serve very well and let me to withdraw my money. However since Nigerian banks not accept Bitcoin transactions, I believe only the customers who receive money related with Bitcoin are having problem, while the rest aren't. After all you can't do anything, but you have few choices if you want to cash out your Bitcoin in anonymous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 16, 2023, 10:04:08 AM",
      "body": "I think everyone without much restriction on their country can use digital cryptocurrencies such as bitcoin. There are a lots of merchants that uses and accept crypto as payments. Of course even though its not yet globally used this will increase more as long as crypto will continue to build its adoption and promotions. Its not like its gonna replace banks. But an additional gateway for easy finance management. With blockchain tech, this can be more utilized in different industries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "February 16, 2023, 10:38:51 AM",
      "body": "Quote from: Mandez4real on February 16, 2023, 08:01:12 AMI can't wait for Bitcoin and other cryptocurrencies to become widely accepted globally because this will definitely solve the challenges people are facing in some countries like Nigeria right now. With digital currency no need to depend on banks again, which will go a long way to make life better for the masses out there.Imagine what Nigerian people are currently going through over a new monetary policy. People can't get the money they put in banks, and the masses are passing through hell at the moment. I believe Bitcoin and cryptocurrencies are what we all need to make life better.Even if bitcoin still not consider as legal tender still people can use it whatever they want as long as their government didn't ban it. We actually don't need bank if we decide to do so since we can store our money in our homes but we need a good vault to make it safe away from people who want to do bad things about it. Maybe for now forget about those fantasies since this is long story and debate to do and just enjoy what bitcoin on what you can do about it since even if there's no global adoption we can still use it on any transaction we want to our fellow crypto users globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "February 16, 2023, 10:45:19 AM",
      "body": "Quote from: arwin100 on February 16, 2023, 10:38:51 AMEven if bitcoin still not consider as legal tender still people can use it whatever they want as long as their government didn't ban it.The opposite is existing and true too. Even Bitcoin is considered as legal tender in a country, there are people who use it and there are people who don't mind to use it. You can not force others do things they don't like and don't want to do.If there is no prohibition against Bitcoin, it's fine enough to use it without fear to be put into jail. That is enough to continue expanding adoption for Bitcoin at local and global scales.QuoteWe actually don't need bank if we decide to do so since we can store our money in our homes but we need a good vault to make it safe away from people who want to do bad things about it.You will likely need good vaults to store your hardware wallets, your seed phrase, private key backups against physical damages like fire, water, earthquake, heat.With Bitcoin, good practice to create your wallet, back it up, store backups safely, you control your coins and fund. You do no longer need any central banks to secure your fund and approve your transfers. You can do it all by yourself, secretly and very safely.Security checklist",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "February 16, 2023, 12:21:45 PM",
      "body": "even if Bitcoin is accepted as legal tender, you will still sometimes need the local currency to spend, and perhaps most people are already accepting Bitcoin as payment, unless for the market women that sell some petty perishable food stuffs. For Nigerians that are not yet coping so well with the cashless policy, is it digital currency that they can handle so happily? Even if Bitcoin becomes legal tender, most people will still not accept it, and it wouldn't stop people from putting money in the bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "February 16, 2023, 01:31:59 PM",
      "body": "Quote from: tbct_mt2 on February 16, 2023, 10:45:19 AMQuote from: arwin100 on February 16, 2023, 10:38:51 AMEven if bitcoin still not consider as legal tender still people can use it whatever they want as long as their government didn't ban it.The opposite is existing and true too. Even Bitcoin is considered as legal tender in a country, there are people who use it and there are people who don't mind to use it. You can not force others do things they don't like and don't want to do.True there is a country that accepts Bitcoin as legal tender but the country's influence isn't that huge.  It would be great if powerful countries like USA and alike acknowledge Bitcoin as legal tender, if not I am ok with them accepting Bitcoin as mode of payment.  This way, Bitcoin will have a global recognition to have a purchasing power.QuoteWe actually don't need bank if we decide to do so since we can store our money in our homes but we need a good vault to make it safe away from people who want to do bad things about it.True, whether we accept a cryptocurrency or not is up to our own discretion, it is that we need regulations if we are to use them on the economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natalim",
      "created_time": "February 16, 2023, 01:51:21 PM",
      "body": "I think that \"should\" is wrong because it means that we no longer have the option to use fiat in that case. Even don we have adapted digital currencies, this won't stop people from using fiat money, the freedom remains depending on where they are comfortable. It was to know that the existence of Bitcoin and any digital currency is not to replace paper money but this is to give an option to everyone and that rights remain no matter what will happen. In fact, as we can see that many people are still in favored fiat money over crypto, it means that we are still to far from fully adopted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ayers",
      "created_time": "February 16, 2023, 01:55:54 PM",
      "body": "Quote from: Solosanz on February 16, 2023, 09:37:56 AMTo be honest why many people are complaint to the banks? it seems like banks did many mistakes or terrible service to their customers. In my experience I don't have any problem with my local banks, they serve very well and let me to withdraw my money. However since Nigerian banks not accept Bitcoin transactions, I believe only the customers who receive money related with Bitcoin are having problem, while the rest aren't. After all you can't do anything, but you have few choices if you want to cash out your Bitcoin in anonymous.I think it depends on the country you live in, also I have never had a problem with my local bank since I used it until now, 14 years have passed. But maybe a few countries are having problems that make people unhappy and especially Nigeria, recently, they changed the national currency, so it caused a lot of frustration for people. I support people using bitcoin as an alternative but no need to badmouth the bank as we will still need to use it in the future even if bitcoin is widely accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "February 16, 2023, 02:02:00 PM",
      "body": "Quote from: Mandez4real on February 16, 2023, 08:01:12 AMI can't wait for Bitcoin and other cryptocurrencies to become widely accepted globally because this will definitely solve the challenges people are facing in some countries like Nigeria right now. With digital currency no need to depend on banks again, which will go a long way to make life better for the masses out there.Imagine what Nigerian people are currently going through over a new monetary policy. People can't get the money they put in banks, and the masses are passing through hell at the moment. I believe Bitcoin and cryptocurrencies are what we all need to make life better.Isn't bitcoin already in use around the world? What prevents you from owning bitcoin in any country on the planet? Nothing. You can get rid of dependence on banks right now. I perfectly understand the situation that is happening with many national currencies and people can find saving their money from new monetary policies in btc.If you dream of accepted of btc at the official, state level, then there is a chance that you will have to wait a long time or not wait at all. Bitcoin existed without it, and people did without the approval of governments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "February 16, 2023, 02:21:53 PM",
      "body": "Quote from: Natalim on February 16, 2023, 01:51:21 PMI think that \"should\" is wrong because it means that we no longer have the option to use fiat in that case. Even don we have adapted digital currencies, this won't stop people from using fiat money, the freedom remains depending on where they are comfortable. It was to know that the existence of Bitcoin and any digital currency is not to replace paper money but this is to give an option to everyone and that rights remain no matter what will happen. In fact, as we can see that many people are still in favored fiat money over crypto, it means that we are still to far from fully adopted. fiat currencies are somehow losing its purchasing power in every country, the fiat money will still remain but the purchasing power is declining fast.  Lebanon and Argentina are the latest countries where money was plunging down and it was very abrupt.i could be wrong but i have the feeling that fiat might really be gone in the coming years. with the rise of BTC and crypto, it's a sputnik moment for the central banks. it's in thier best interest to launch CBDC to keep up with the technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "February 16, 2023, 02:47:25 PM",
      "body": "Quote from: Mandez4real on February 16, 2023, 08:01:12 AMI can't wait for Bitcoin and other cryptocurrencies to become widely accepted globallyThis may nit be possible because you're including other cryptocurrencies along knowing that they were most not recognized as a digital currency due to the fact that some of them were being categoried under shitcoins, if i were you i would rather insist only on bitcoin here for global adoption.Quote from: Mandez4real on February 16, 2023, 08:01:12 AMbecause this will definitely solve the challenges people are facing in some countries like Nigeria right nowDo you even need to mention your country, i believe this economical crisis is a global challenge so why do you think it's only in your own country things were being affected, it is expected that we should not rely on government for being responsible for how we leave our lives.Quote from: Mandez4real on February 16, 2023, 08:01:12 AMWith digital currency no need to depend on banks again, which will go a long way to make life better for the masses out there.We all need this digital monetary era of a decentralized technology with bitcoin, this will help in changing many fiat monetary policies with handling cash and bulkiness people were facing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "February 16, 2023, 02:48:20 PM",
      "body": "There is no obligation to reach the global adoption level, but all countries should realize that there is convenience behind all the technology that this currency has. I think digital currency is not the same as cryptocurrency, it should be different because fiat can be digital even if it is not built on any blockchain.Adoption can be expected to continue to increase day by day, and this is a demand that will likely be difficult to prevent because it is fundamentally a necessity. More and more people are losing trust in banks to handle their financial transactions, and cryptocurrencies offer many things that are possibly better than just being handled by banks. Bitcoin one of the forefront has received high interest among the public, but adoption is still limited by regulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "February 16, 2023, 02:52:14 PMLast edit: November 15, 2023, 07:52:17 PM by Woodie",
      "body": "After seeing what's happening in Nigeria, the riots, running battles with the police as a result of a shortage of cash thanks to new bank policies..I really feel bitcoin can bridge this gap and ensure such wrangles are avoided once and for all! We really don't need cash for day-to-day transactions, a simple scan and pay can sort this out with the aid of technology.The problem politicians don't like to promote mediums that are likely to have a footprint and bitcoin being such an asset can never be adopted globally unless the people (citizens) that hold the real power pursue this motion of adopting cryptocurrencies globally! Otherwise going the bitcoin route will eliminate problems of cash shortages, cut budgets for the central bank when it comes to the printing of money, transparency and accountability obviously thanks to bitcoins public ledger and many other great benefits.Photo credit: REUTERS",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "February 16, 2023, 02:53:50 PM",
      "body": "Quote from: tbct_mt2 on February 16, 2023, 08:12:38 AMYou don't need legal tender and legally allowance to use cryptocurrencies.Citizens are allowed to do everything that are not prohibited by laws so even if cryptocurrencies are not accepted legally, you can still use them. Only if government locally prohibit cryptocurrencies and put it into kind of crime, you will not be able to use them legally.Legal tender is big achievement from El Salvador but you see, we don't need legal tender for Bitcoin globally to use it globally.Cryptocurrencies are created from blockchain technology that can be used to further change the world so they will be here and become more adopted globally.Status of Cryptocurrency regulations around the worldThis is true. Legal tender will just help mass adoption for Bitcoin since a store will have no choice than to accept Bitcoin as payment which means all establishments is required to accept Bitcoin as payment. On OP case like Nigeria. I believe they need to established first their government before they can jump on accepting crypto by themselves since it’s useless to use crypto as payment if there’s no bank or any means for them to cash in their fiat money online unless their salary is in the form of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "February 16, 2023, 02:56:51 PM",
      "body": "For sure it is wonderful to imagine that more people would be able to use this technology's advantages. But what's a bit worrying me lately is the extent of how Bitcoin and other cryptocurrencies are being used; as a profitable asset. What's more likely to happen if we would push adoption of this technology is regulation more likely. Governments would want to benefit on every transaction of its users and that is thru taxation. Also if this is the case, there is a tendency for the price to be less volatile simply because demand would be neutral as well because of the possible increase with fees and such which would persuade some investors to just use fiat based digital currency. If the price would be less volatile, will this industry still has a high demand from it afterwards?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}