{
  "id": "topic_5446639",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "March 28, 2023, 01:51:48 PM",
  "content": "Is it possible to become a clean politician? I really love politics and sometimes I feel I can do better than our leaders on sits. I don't how its sounds to you but do you think if I have the opportunity I will be worster than my current leaders who concerns is to consume the wealth and resource of the country. I can be a better politician and I must make a mark. I pray you support me. In few years to come I should be recognised in my country as one of the youngest ambitious and creating president my country ever have. I want to prove to people that life is a function of mindset and everybody have good mindset but only few use it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446639",
  "comments": [
    {
      "author": "topman21",
      "created_time": "March 28, 2023, 01:57:05 PM",
      "body": "Definitely possible. If you want to be a transparent politician, you have to promise to always treat people well. Being a good politician is very testing in the current context of the country. No matter how bad the condition of the country is, no matter how bad the people are, no matter how bad the politics are, there are still good people in it. The most important thing is your mindset. If your mindset is good and you plan ahead, you can definitely be a good politician.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "March 28, 2023, 03:09:23 PM",
      "body": "Before running for election, politicians also make statements like you, they say they will move the country forward, get more jobs, raise wages, lower taxes, and fight corruption...But when they climb up got that position, and what they do after, most people are disappointed.Honestly, I don't trust any politician, simply because we all have greed, power and money that will make people change quickly. When you are a poor person, you will have a different mindset, but when you are rich, you will have a different mindset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "March 28, 2023, 03:13:04 PM",
      "body": "Today, some leaders have taken politics to such a level that now when people hear the name of politics, they say corruption and anarchy. Political pressure comes from many quarters if one conducts his activities like an ideal politician after taking oath. As a result, even if he wanted to manage politics well, he failed. If you want to change such a system of politics, you have to do it from a very big position, then it is never possible to change the political system from the grassroots level. But since you have made such a wish, I congratulate you. Hope you will be a successful politician in future. But never compromise with injustice always follow the path of justice and take politics to such a level that people see you as an idol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "March 28, 2023, 03:43:22 PM",
      "body": "Quote from: JamesBorn on March 28, 2023, 01:51:48 PMIs it possible to become a clean politician? I really love politics and sometimes I feel I can do better than our leaders on sits. I don't how its sounds to you but do you think if I have the opportunity I will be worster than my current leaders who concerns is to consume the wealth and resource of the country. I can be a better politician and I must make a mark. I pray you support me. Politics is something entirety different from normal lifestyle, one can be very truthful and honest, but once they start politics, they start to change their characters towards the masses that vote them in. This statement of being different from the previous or current leaders on seat is what all the politicians use just to get the support and the vote from the community, and once their aim has been achieved, then its a different story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "March 28, 2023, 04:17:14 PM",
      "body": "Quote from: JamesBorn on March 28, 2023, 01:51:48 PMIs it possible to become a clean politician?  I can be a better politician and I must make a mark. I pray you support me. We should be having good fate in all what we want to do, if not I will say it is not possible to be a clean politician. To be honest and clean politician is not an easy task, we masses see politics as ordinary thing to do, it is beyond our expectation. For you to become good politician is possible, but know that you will sign a lot of agreement with the godfathers of your country before been choosen as a president and I no you will agree with their terms and conditions before giving the opportunity. Now after the elections can you turn against your godfather?They will want to control you like a television set, will you allow that to happen? Know that there is some obligation that you must do whether you like or not, can you turn back on them. Some  questions for you. Come to your personal life • what have you done for the people in your community? • Which position have you held before? • How do you see our present leaders? • Why do you said you can do better than them? • Why will we support you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 28, 2023, 06:00:36 PM",
      "body": "It is possible but it also depends on what country you live in. In the case of Western politics here in the Americas, it is difficult to be an honest politician, because even if you managed to get elected and you had good intentions, around you there will be people who won't be as honest as you and they will try to convince you to \"play their game\", if you resist or refuse to and do not go along, they will do anything in their hands to get you replaced with someone else. Something similar happens when policemen in developing countries with a high rate of corruption, does not matter if they enter with go intentions if their companions pushed them to accept bribes and criminals threaten to hurt their families if enforce the law on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "March 28, 2023, 08:08:48 PM",
      "body": "There are clean politicians but for every country, there will be citizens that might consider the good one as the bad ones and vice versa. You really need to make yourself as a good example. Just because politics is dirty, it doesn't mean that everyone there is dirty. As said, there are a few of those that have the heart for public service.Saying that you'll become a president someday is ambitious but good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 28, 2023, 08:23:05 PM",
      "body": "I’m going to go ahead and disagree with everyone and say that it is not possible to be a clean politician. This is because the machine behind you will not have the funding and support of industries that would prefer to have a bought and paid for politician over somebody who might share similar beliefs. I’ve seen corruption even in my local Home Owners Association. I can’t even begin to comprehend the corruption involved with elected government officials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahmad2nd",
      "created_time": "March 28, 2023, 10:20:04 PM",
      "body": "Some think that politics is just the activities of actors who focus on power, and most of them even reduce it as a dirty game in a democratic system. no doubt, citizens became apathetic. Nevertheless, I really appreciate the spirit and sense of nationalism that you have for your country.What you need to remember, in its journey, someone can deviate from the ideology they previously believed in. not infrequently, young politicians with the fiery enthusiasm and idealism they brought with them since graduating from college, melt down after having power. whether it's for the sake of the group, or self-interest. now there is no longer black and white in politics, everything is uniform depending on where you stand. someone will not be able to walk alone, everything comes back and depends on interests. if one wasn't strong, in the end, there were only two choices, following the established rules. or, back off slowly.Believe it or not, it's hard to say that there is such a thing as clean politics, because after all, all policies depend on interests. I don't know where you live, but what I said happened in my country. To be honest, that's why I prefer not to get involved in politics. by the way it doesn't mean what I'm saying, happens to all countries in this world, it just describes the other side of politics that's happening in my country. Maybe, it can be a reference for you to stick to the guidelines and ideology that you believe in. and hopefully, you can be a clean politician.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "March 28, 2023, 11:26:04 PM",
      "body": "Quote from: JamesBorn on March 28, 2023, 01:51:48 PMIs it possible to become a clean politician? I really love politics and sometimes I feel I can do better than our leaders on sits. I don't how its sounds to you but do you think if I have the opportunity I will be worster than my current leaders who concerns is to consume the wealth and resource of the country. I can be a better politician and I must make a mark. I pray you support me. In few years to come I should be recognised in my country as one of the youngest ambitious and creating president my country ever have. I want to prove to people that life is a function of mindset and everybody have good mindset but only few use it.Oh Great! You have such a high aspirations. One thing I will say is that you should not judge someone or something about their past or present in order to prove that you are better than them in the position they currently hold or previously held. Leading a large group of people is difficult, and abusing a leader because of failure can be harmful. You may be better or worse when you get there, but every nation hopes to get a better leader than the previous ones. Your bravery and determination for a better country will guide you, but know that it will not be enough as time passes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "March 29, 2023, 08:55:48 AM",
      "body": "everyone loves politics,but fear of blood shed scared people away, but not all politicians are unclean. they are good politicians in the game. the reason good people stay away from politics is because of the bad ones. but that is not good enough , good people should take the central stage of politics to silent the evil ones. when the good ones fail to participate in politics they will be ruled by mediocre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 29, 2023, 12:56:37 PM",
      "body": "There's nothing bad about having interest in politics but the problem that lies there is with those you will be dealing with, because they have been there already before you and would like to dictate for you what to do as long as you once request for their help before joining into politics, everyone knows that godfatherism is a bad practice that sentiment government into different segment base on selfish interest, you will need to consider all this and run a free and fare politics without their help in other for you to have say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "March 29, 2023, 01:40:29 PM",
      "body": "Quote from: JamesBorn on March 28, 2023, 01:51:48 PMbut do you think if I have the opportunity I will be worster than my current leaders who concerns is to consume the wealth and resource of the country.In few years to come I should be recognised in my country as one of the youngest ambitious and creating president my country ever have. There is an app called grammarly or simply you can use it on Web. This will help correct some of your syntax and make your post more appealing. Many of us would be patient to read and reply but some native English speakers might be offended and not read your posts.In my country, politics is regarded as a dirty game and I don't know how that concept was planted in people such that there is not place for honesty, trustworthiness and dependability in politics anymore. I doubt good people have good chances of doing well in politics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "March 29, 2023, 01:46:50 PM",
      "body": "Someone will become a clean and good politician if he wasn't asking for the position he is currently in because when someone doesn't want to be a leader but the people ask him to be the one who leads them, it means he is the real deal and he is the only one who is fit to be in that position and when you read histories, these are most of the successful leaders and the man who is now added to the history is no other than President Rodrigo Duterte. If the person will campaign and beg the people to vote for him, that's a crook and I think no one in the history of the world became a clean politician by doing that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "March 29, 2023, 01:47:28 PM",
      "body": "Quote from: JamesBorn on March 28, 2023, 01:51:48 PMIn few years to come I should be recognised in my country as one of the youngest ambitious and creating president my country ever have. I want to prove to people that life is a function of mindset and everybody have good mindset but only few use it.Are you into politics in your country ? or are you starting your politics from this forum ? I am asking you this because of the way you sound. Your mindset is what really matters when you are serving your country. The world don't see politics as serving the people anymore,instead they see it that they are king over the people and don't care about the welfare of their citizens anymore. It is easy said than done, for anybody to be a good leader,he must put God first in his life, so that God can give him the leadership wisdom to do things right and not to be carried away with power intoxication,if not you will end up loving money and abandon your citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexkut987",
      "created_time": "March 29, 2023, 03:02:04 PM",
      "body": "It is absolutely possible to become a clean politician. It takes commitment, dedication, and a strong moral compass to resist the temptation of corruption and ensure that your actions are always in the best interest of the people you represent. It is admirable that you have a passion for politics and a desire to make a positive impact on your country.However, it is important to recognize that politics is a complex and challenging field. It is not enough to simply have good intentions; you must also have the skills, knowledge, and experience to effectively lead and govern. It is also important to be realistic about the challenges and obstacles you may face, including resistance from entrenched interests and opposition from those who benefit from the status quo.That being said, if you are truly committed to becoming a clean politician and making a positive impact on your country, there are steps you can take to achieve that goal. You can start by educating yourself on the issues facing your country and the policies that can address them. You can also get involved in local politics, volunteer for political campaigns or community organizations, and build a network of like-minded individuals who share your values and goals.Ultimately, becoming a clean politician requires not only a strong moral compass but also a commitment to transparency, accountability, and the common good. If you are willing to put in the work and stay true to these principles, there is no reason why you cannot make a meaningful and lasting impact on your country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "March 29, 2023, 04:11:04 PM",
      "body": "The problem is not you been a clean politicians, the problem is depends on your co politicians, if you are clean, would they be clean just as you are? We are know in politics mostly in Nigeria, the majority always have the influencial powers in the government house and we all know majority of our Nigeria politicians are not clean, so they would fight you who is the clean politician and if you refuse to dance to their tune they will kick you out,You as a person might have good intentions towards the citizens, but believe me this Politicians out there will definitely inluence you either by power or money, So to me I don't really think you might be a clean Politician and work with the dirty ones because they won't give you a chance ,You must be dirty to work with them, that's my thoughts though...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "March 29, 2023, 06:08:58 PM",
      "body": "The chances of you becoming a transparent politician depends on the country you are from and the people you find yourself with. In my country, it is very rare to end up becoming a transparent politician because the system will corrupt your mind and reasoning. You will end up becoming a ruthless, hardened, and corrupt being like others. Every politician you know didn't start in a day become less transparent to the people they are serving and ruling.They started little by little to become the monster you see them as today. Money and fame corrupted them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 29, 2023, 07:16:54 PM",
      "body": "Quote from: JamesBorn on March 28, 2023, 01:51:48 PMIs it possible to become a clean politician? I really love politics and sometimes I feel I can do better than our leaders on sits. I don't how its sounds to you but do you think if I have the opportunity I will be worster than my current leaders who concerns is to consume the wealth and resource of the country. I can be a better politician and I must make a mark. I pray you support me. In few years to come I should be recognised in my country as one of the youngest ambitious and creating president my country ever have. I want to prove to people that life is a function of mindset and everybody have good mindset but only few use it.Although all politicians cannot be trusted but there is a significant difference between politics is developing world and developed societies. Politicians in developing nations like Africa a power drunk and can do anything ranging from killing, intimidation, electoral malpractices, etc to grab political power. These politicians are also sophisticatedly corrupt and don't care about the welfare of the citizens of the country. Politics in developed world is refined to some extent. Elections might not be free and fair but atleast there is no violence. Most politicians voluntarily resign when they lose the confidence of the populace. But It will take only violence or even civil war for an African leaders to relinquish power. They will always amend the constitution so that they can rule till they die. In summary, I will never be a politician in any African country but politics in some developing countries attracts me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}