{
  "id": "topic_5444551",
  "title": "aesthete2022",
  "author": "aesthete2022",
  "created_time": "March 12, 2023, 07:10:18 AM",
  "content": "Hi there,I was wondering if anyone knew a tool like Ian Coleman's BIP 39 mnemonic converter, but that could show you the public key changes according to the derivation path?Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444551",
  "comments": [
    {
      "author": "nc50lc",
      "created_time": "March 12, 2023, 07:19:24 AM",
      "body": "The question is quite hard to interpret.What do you mean by \"public key changes\"?Because IanColeman's BIP39 tool has \"Account Extended Public Key\" and \"BIP32 Extended Public Key\" that changes if you change the associated derivation path.If you mean the \"BIP32 Root Key\", it's unnecessary to have a public pair since it's \"hardened\" in which you can't derive the child key from the master public key.If you mean the addresses, you can toggle the public keys by clicking \"TOGGLE\" next to the \"Public Key\" column.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aesthete2022",
      "created_time": "March 12, 2023, 08:22:28 AM",
      "body": "My situation is that I rotated a key in Casa, and it changed all my xpubs due to the new derivation path (bumped me up a level). I'd previously input all my existing xpubs and the xpub of the new key into Sparrow, along with the new derivation path I knew they would give me, so that I could verify the new wallet address. However, I couldn't as, when I received the new wallet details on the Casa app, all the xpubs were different (due to the derivation path also changing). So what I'm looking for is a tool that I can use to input an existing xpub and and derive a new xpub for a given derivation path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 12, 2023, 09:33:15 AM",
      "body": "Quote from: aesthete2022 on March 12, 2023, 08:22:28 AMMy situation is that I rotated a key in Casa, and it changed all my xpubs due to the new derivation path (bumped me up a level).-snip-So what I'm looking for is a tool that I can use to input an existing xpub and and derive a new xpub for a given derivation path.Okay, IanColeman's BIP39 tool indeed can't do it.Your option in that tool is to start from the 'BIP32 Root Key' using your master private key in an offline environment instead.My concern is if Casa is using its own derivation path, it could complicate things.I'm not using their service so I may not be able to help you with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aesthete2022",
      "created_time": "March 12, 2023, 09:49:20 AM",
      "body": "Thanks for that. I have a call with them to try and determine how they change the keys. I did use the public keys they gave me for my three devices, along with the master fingerprints, to make a smaller quorum using their new derivation path and am able to use that to sign and transact no problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "March 12, 2023, 11:01:06 AM",
      "body": "According to Casa's support documents and walletsrecovery.org, Casa uses a derivation path of m/49/0/0, and by rotating a key you are incrementing the account number by one, so to m/49/0/1, then m/49/0/2, and so on.Even although these paths are unhardened, if all you have are the xpubs at m/49/0/0, then there is no way for you to derive the xpubs at m/49/0/1. xpubs can only be used to derive at child levels, not sibling levels. You will simply have to go back to Casa and extract the new xpubs for your new derivation paths.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aesthete2022",
      "created_time": "March 12, 2023, 01:41:31 PM",
      "body": "Thanks for this. It's a shame there is no way of independently verifying before sweeping funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}