{
  "id": "topic_5449492",
  "title": "Eh Moo Nah",
  "author": "Eh Moo Nah",
  "created_time": "April 19, 2023, 07:26:09 PM",
  "content": "Matagal ko nang ginagamit ang aking Phone Number sa Coins wallet at ito ay naka Plan, ngunit hindi ako makatawag sa customer service ng Telecommunication provider ko para ma Verify ko kung hindi ba ito ma ba block ng tuluyan.. Naka Plan ang Sim Card ko pero Palagi akong nakakareceive ng Text Message (Merit), na Kailangan ko daw e Rehistro ang Aking Sim, dahil Kung Hindi Tuluyan na Ma Block Ang Number ko. Ang Aking Inaalala ay kung kahit di na ako mag Register ng Aking Sim Card, maapektohan ba nito Ang Log ins ko sa Coins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449492",
  "comments": [
    {
      "author": "qwertyup23",
      "created_time": "April 19, 2023, 11:10:57 PM",
      "body": "Quote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMMatagal ko nang ginagamit ang aking Phone Number sa Coins wallet at ito ay naka Plan, ngunit hindi ako makatawag sa customer service ng Telecommunication provider ko para ma Verify ko kung hindi ba ito ma ba block ng tuluyan.. Naka Plan ang Sim Card ko pero Palagi akong nakakareceive ng Text Message (Merit), na Kailangan ko daw e Rehistro ang Aking Sim, dahil Kung Hindi Tuluyan na Ma Block Ang Number ko. Ang Aking Inaalala ay kung kahit di na ako mag Register ng Aking Sim Card, maapektohan ba nito Ang Log ins ko sa Coins? For me, i-register mo na yung simcard mo to avoid any future/potential conflicts talaga. Since sobrang daming mga applications ang naka depend sa sim registration, expect mo na maapektuhan din siguro ang iyong coins.ph account kapag hindi ka nakapag register. Though may mga against sa pag bigay ng personal information about sa sim registration, mas mabuti maging safe na lang kesa sa ikaw pa yung mamoblema in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 20, 2023, 08:58:48 AM",
      "body": "Quote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMMatagal ko nang ginagamit ang aking Phone Number sa Coins wallet at ito ay naka Plan, ngunit hindi ako makatawag sa customer service ng Telecommunication provider ko para ma Verify ko kung hindi ba ito ma ba block ng tuluyan.. Naka Plan ang Sim Card ko pero Palagi akong nakakareceive ng Text Message (Merit), na Kailangan ko daw e Rehistro ang Aking Sim, dahil Kung Hindi Tuluyan na Ma Block Ang Number ko. Anong network ba ng sim card mo? Kasi ako nakaplan ako sa globe tapos mag nag text lang sa akin na itext ko lang yung keyword na sinend nila at automatic registered na. Sa totoo lang parang hindi naman na din need ng mga naka plan na magregister kasi registered na yung number natin under sa provider tapos nandun pa mga info natin.Quote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMAng Aking Inaalala ay kung kahit di na ako mag Register ng Aking Sim Card, maapektohan ba nito Ang Log ins ko sa Coins? Oo kasi kapag hindi ka nakaregister hanggang sa deadline, dead na din sim mo at kung may mga notifications galing sa coins.ph, di mo na marereceive pati codes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "April 20, 2023, 12:50:58 PM",
      "body": "Quote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMAng Aking Inaalala ay kung kahit di na ako mag Register ng Aking Sim Card, maapektohan ba nito Ang Log ins ko sa Coins? Syempre, kasi minsan need din ng text confirmation para ma access ang coins.ph. Need talaga i register ang sim card mo kasi pag nahuli kana sa deadline di mo na magagamit yan, saka sayang lang din ang pera mo sa coins.ph, or pwede mo naman palitan ng number ang coins.ph mo, message mo lang ang support para ma guide ka, tapos gamitin mo ang sim card mo na registered na para safe na din.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "April 28, 2023, 04:14:31 PM",
      "body": "Quote from: blockman on April 20, 2023, 08:58:48 AMQuote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMMatagal ko nang ginagamit ang aking Phone Number sa Coins wallet at ito ay naka Plan, ngunit hindi ako makatawag sa customer service ng Telecommunication provider ko para ma Verify ko kung hindi ba ito ma ba block ng tuluyan.. Naka Plan ang Sim Card ko pero Palagi akong nakakareceive ng Text Message (Merit), na Kailangan ko daw e Rehistro ang Aking Sim, dahil Kung Hindi Tuluyan na Ma Block Ang Number ko. Anong network ba ng sim card mo? Kasi ako nakaplan ako sa globe tapos mag nag text lang sa akin na itext ko lang yung keyword na sinend nila at automatic registered na. Sa totoo lang parang hindi naman na din need ng mga naka plan na magregister kasi registered na yung number natin under sa provider tapos nandun pa mga info natin.Sadly hindi ganito mag isip ang mga telecommunications provider sa pag gather ng data. May globe sim ako na gamit ko pa since 10 years ago. Ilang beses ko na ito pina upgrade from normal sim to LTE to 5g at ngayon ay GOMO. Take note nagpapasa ako lagi ng ID every update kahit na dapat ay may record na ako sa kanila since isang number lng ang gamit ko ever since.Medyo tamad magrecover ng data ang telecommunications company. Kaka register ko lng ulit ng sim ko under sim registration law kahit na kaka convert ko lang sa GOMO with same process ng ID verification. Kaya mas mainanam na mag register nalang ulit dahil hindi talaga sila nagrerecycle ng records natin para sa ibang purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 28, 2023, 11:04:34 PM",
      "body": "Quote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMMatagal ko nang ginagamit ang aking Phone Number sa Coins wallet at ito ay naka Plan, ngunit hindi ako makatawag sa customer service ng Telecommunication provider ko para ma Verify ko kung hindi ba ito ma ba block ng tuluyan.. Naka Plan ang Sim Card ko pero Palagi akong nakakareceive ng Text Message (Merit), na Kailangan ko daw e Rehistro ang Aking Sim, dahil Kung Hindi Tuluyan na Ma Block Ang Number ko. Ang Aking Inaalala ay kung kahit di na ako mag Register ng Aking Sim Card, maapektohan ba nito Ang Log ins ko sa Coins? Katulad ng suhesyon ng iba, mas mabuti pa na i pa register mo yang sim card mo. Kung naka plan naman ito siguro mas maigi na mag punta ka mismo sa service provider mo para linawin sa kanila ang lahat. Although mukhang tapos na ang Sim registration pero mas maganda na talagang puntahan mo sila personal at kausapin at wag kang umasa sa customer service nila lalo na kung hindi mo ma sila makontak na.Maraming paalala ang Coins regarding the Sim registration. So hindi ako magtataka na baka magkaroon sila ng bagong policy tungkol dito. Maaring hindi mo na o tayo na magamit ang account natin kung ang phone na pinang open natin ng account at hindi naka rehistro.Alam natin natin ang pag nag login tayo sa Coins eh either phone number or email account. So if hindi registered at sim mo, meaning deactivated na to, obvious wala kang matatangap na OTP, hence hindi ka na makaka login pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "April 28, 2023, 11:48:27 PM",
      "body": "Ingat lang din sa mga text message na narereceive mo kasi may mga link na ibibigay yung mga scammer sayo para doon ka daw kuno magregister.Pero ang totoo mga scam links yun at phishing links para makakuha ng details sayo at worst baka pati mga bank accounts mo ay tanungin. Sundin mo nalang yung normal na proseso na pagrehistro ng sim tutal extend pa naman hanggang July.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 28, 2023, 11:55:26 PM",
      "body": "Quote from: Eh Moo Nah on April 19, 2023, 07:26:09 PMAng Aking Inaalala ay kung kahit di na ako mag Register ng Aking Sim Card, maapektohan ba nito Ang Log ins ko sa Coins? Ma aapektuhan yan kase since mg s'send ng otp ang coins for further verification eh pano mo ma re'receive yun kung disabled na ang simcard? Eh di ka rin makakapag login ng account mo.Simple, just register your simcard, alam ko mas madali mag register ng naka plan ang sim card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "socks435",
      "created_time": "April 29, 2023, 07:48:48 AM",
      "body": "Basi dun sa Gcash faqs and help kahit naka plan o naka verify ka sa gcash o kung ano paman sabi daw nila need talaga iregister ang sim card sa mismong provider luma o bagong sim card kung hindi may posibilidad na ma block yung sim card at baka mawalan na rin ng signal.Sakin nga e tatlong sim card ne register ko kasi ginagamit ko sa mga online to at sa ilang mga exchange at to make sure na rin na safe ako in the future kung ang sim card ko na nawala pwede ko pa block at mag pagawa ng bagong sim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}