{
  "id": "topic_5451086",
  "title": "octobuzz",
  "author": "octobuzz",
  "created_time": "May 03, 2023, 11:29:12 AM",
  "content": "I'm quite new here so I thought about exploring some boards. I opened up the Archival board and I tried making a post there but I wasn't able to. I then got to know that newbies are not allowed to make posts in the board. But I am a bit curious and I would like to know why it's so.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451086",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "May 03, 2023, 11:32:31 AM",
      "body": "The main reason would probably be to prevent Newbies from creating senseless threads there.What exactly do you want to do in the Archival board? It's filled with scrap post and testing post, I don't see anything that will benefit you there. I remember asking this same question back when I was still a newbie, Op you can't create a thread at the Archival board since you're still a newbie so if you want to check your post before posting it you can simply use the Preview button, that will do the trick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "May 03, 2023, 11:35:45 AM",
      "body": "There are certain restrictions on the forum based on rank; this is a result of reducing spam posts. It's not only on the archive board that you are not allowed to post; there are also places where, as a newbie, I believe you can't post until you obtain at least Jnr to member rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "May 03, 2023, 11:44:52 AM",
      "body": "This has been asked before Can't post on Archival?, I don't find any legitimate reason on there and I also don't think any good reason behind such restrictions.But if you want to solve it, you can buy a copper membership in order to post in archival.I think if you want to try something, you can post on off topic section because that's board is rarely viewed by most of members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 03, 2023, 11:45:51 AM",
      "body": "Quote from: octobuzz on May 03, 2023, 11:29:12 AMI'm quite new here so I thought about exploring some boards. I opened up the Archival board and I tried making a post there but I wasn't able to. I then got to know that newbies are not allowed to make posts in the board. But I am a bit curious and I would like to know why it's so.Not only on archival board a newbie cannot make a post, there is a board called serious discussion board where newbies as well were not permitted to make a post, this does not end there, there are other restrictions on a newbie account that you need to get them unlocked when you rank up to higher ranks, such as wearing an avatar, posting images (except for corper membership position if purchased), to me i see no big deal in denying a newbie access to make post in not more than two or three boards when we have a large number of other boards your post could best fit in, why should you worry, or better still wait till you rank up, this is to avoid spamming or posting unnecessary discussions by a newbie believed to be inexperienced enough about bitcoin or the forum at large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "May 03, 2023, 11:15:58 PM",
      "body": "Quote from: octobuzz on May 03, 2023, 11:29:12 AMI'm quite new here so I thought about exploring some boards. I opened up the Archival board and I tried making a post there but I wasn't able to. I then got to know that newbies are not allowed to make posts in the board. But I am a bit curious and I would like to know why it's so.I applaud your desire to explore the forum. I know you cannot be able to visit the whole boards in the forum, but you will cover alot if you are determined and it is one of the advice I gave in one of my newbie help compilation posts. To be able to tour the forum is a good one.However, even until now I haven't visited the archival board to try open topics there. When I was a newbie, I became aware of the board and as the name implies, it should be were old stuffs of the forum are found. So, it didn't make any sense at all for a newbie trying to make posts in archival.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 04, 2023, 12:44:22 AM",
      "body": "Archival board is like an unofficial trash bin where you store your old threads which you no longer use them now.Some posters use the Archival board as a location to make a new thread, new post to test their graphics, contents but it is not the initial and main use case of Archival board.You can always make your thread in other boards except two boards (Ivory Tower, Serious Discussions) which restrict newbies, then move that thread to Archival boards.Quote from: https://bitcointalk.org/index.php?topic=2722359.0- You must be at least a Jr Member to post in Serious Discussion, and a Full Member to post in Ivory Tower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}