{
  "id": "topic_5468176",
  "title": "Stepstowealth",
  "author": "Stepstowealth",
  "created_time": "September 26, 2023, 02:17:33 PM",
  "content": "Considering the poor state of our educational system, how there are more schools with unqualified teachers than schools with qualified teachers, plus the archaic nature of the curriculum wey most schools dey use for this our country, how you see am? e go better make you do home schooling, that is like gather better teachers dey pay them yourself make dem dey come teach your pikin den you dey closely dey monitor dem den dey add some kind small small modern knowledge of things dem suppose know, or you still prefer make dem go the schoool the way school dey for the country.I dey ask because, e get school wey dey near my side, I been dey hyear when the teachers for the school dey teach the children about things wey dem fit find for classroom, the thing vex me because why you go dey teach children that kind thing, something wey nor dey important like that and people parents dey pay school fees.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468176",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "September 26, 2023, 03:23:51 PM",
      "body": "Home schooling alone no dey enough for me because no be only book pikin dey learn for school. If you think am well, you go notice say the friends them wey you make for school played and still dey play important role for your life now... some go dey for you once once. Besides, you fit learn plenty things about life when you associate for school, things you no fit learn for house.Wetin me go do na to send my children to public schools come still arrange home classes for them. This style go make them balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 26, 2023, 03:32:40 PM",
      "body": "Regular school does well to expose the child to other human behavior that home schooling can not provide.Kids need to learn early on how the future of mankind is alot more to do with socialism and real human interaction than being on a device chatting or calling someone who isn't close by. If not for escalating crimes and economic impact, regular schooling is still the best, unless the child needs special attention and care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "September 26, 2023, 06:06:39 PM",
      "body": "Quote from: Stepstowealth on September 26, 2023, 02:17:33 PMConsidering the poor state of our educational system, how there are more schools with unqualified teachers than schools with qualified teachers, plus the archaic nature of the curriculum wey most schools dey use for this our country, how you see am? e go better make you do home schooling, that is like gather better teachers dey pay them yourself make dem dey come teach your pikin den you dey closely dey monitor dem den dey add some kind small small modern knowledge of things dem suppose know, or you still prefer make dem go the schoool the way school dey for the country.I dey ask because, e get school wey dey near my side, I been dey hyear when the teachers for the school dey teach the children about things wey dem fit find for classroom, the thing vex me because why you go dey teach children that kind thing, something wey nor dey important like that and people parents dey pay school fees. Since we already know say, some of this teacher no too qualify to teach, because before you become certified teacher, you don suppose get some certifications, either the course way you read for university has education background or you've gone to do PGD on education courses, before them go recognise you as a teacher. In those days before you stand to say you are a teacher, you must at least have attended \"National Teachers' Institute\" NTI , but today the whole story has changed, people way no even get O, level dey stand for board dey teach children.So for me, my child will attend the normal formal education by going to school everyday, and I will still create out time to do some school at home with them just to equip them more, because I cannot leave the education of my children into someone who I don't even know if he has attended class before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "September 26, 2023, 06:34:36 PM",
      "body": "I will prefer them in regular schooling because, there are somethings they will learn from other students that will help them to live a good life when they are no longer with their parents.  Parents just feel like is only teacher that can make their children to become a better person in the area of education without allow others students to come close to them, which is not correct no matter the amount of money you have to finance your children education but allow them to mingle with other students to learn somethings that will help them to differentiate bad or good. Don't forget that this home schooling for your children has made many gate man or teachers harm many children in our country because the parents of the children just gave the teachers and the gate man full trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 26, 2023, 09:04:18 PM",
      "body": "Quote from: Stepstowealth on September 26, 2023, 02:17:33 PMhow you see am? e go better make you do home schooling, that is like gather better teachers dey pay them yourself make dem dey come teach your pikin den you dey closely dey monitor dem den dey add some kind small small modern knowledge of things dem suppose know, or you still prefer make dem go the schoool the way school dey for the country.See ehh e get within being around others as children dey contribute for learning process, all those small small competition go make dem dey better demselfs as dem go wan read and learn to make sure say the other person no sabi pass dem like dat and na where public schooling dey important based on my own knowledge. If the money dey like dat as you dey talk why you no combine both learning method. After the public schools, you hire private tutors to teach your children more when dem reach house. Most of the children wey get anxiety problem and people wey no dey social na the way they were brought up to not associate with others na wetin cause am and now making them not to go to school wey dem go see other people fit increase this problem for the country. QuoteI dey ask because, e get school wey dey near my side, I been dey hyear when the teachers for the school dey teach the children about things wey dem fit find for classroom, the thing vex me because why you go dey teach children that kind thing, something wey nor dey important like that and people parents dey pay school fees.Dis one go be government school and sometimes this one fit just be wetin dey teacher dey do to try get energy for the class before him teach dem wetin serious. If public no be wetin you want for your children then carry dem go private school nah because dem plenty for the country wey dey teach better quality education. Everything na where person pocket reach because for this Nigeria we get school wey dey pay millions for school fees and we get those wey dey pay just 10k or less self so we no go expect the same quality of education from both grade of school. Carry your pikin go private school wey you knew say as you pay, you're paying for quality education and when your pikin come house you fit dey review him books to see wetin dem teach dem dat day and if e no still dey quality to your standards, you changed go better school wey go teach dem well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitco55",
      "created_time": "September 27, 2023, 11:51:55 AM",
      "body": "Just home lesson no go be the best option at all. Hwfa social life and skills? Being In a school environment makes one an alum with friends and cliques that'll become future business partners, co- founders, customers and so on. Home lesson go make pikin not to know how to socialize and for today's world no be who know book pass, na who sabi talk watin he know, use watin he know..True talk, some teachers no dey try at all, but I'm very sure that class you heard the teacher talking about things in the classroom should have been a nursery class or something. You don't expect the teacher to be teaching them about life or logarithm there.As money no go be problem, I go like send my pikin go better private school, definitely not boarding school.  Me I no sha attend and public school and I won't want to experiment it on my child, but I know say for better private school e go get better education and friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 27, 2023, 12:17:08 PM",
      "body": "Nigeria is not as bad to the extent you will not get your children good education if you have money.If money is not your problem, you can get your children a better education. There are still good schools in Nigeria but their school fees are expensive. Going to school helps in exposure. Quote from: Odohu on September 26, 2023, 03:23:51 PMHome schooling alone no dey enough for me because no be only book pikin dey learn for school. If you think am well, you go notice say the friends them wey you make for school played and still dey play important role for your life now.Yes, school is helping in having exposure. But do not be disappointed if people you schooled with have not important role to play. It depends, but you are not wrong. What I noticed is that you have friends where you moved to in life. If you have work, you may also have more friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "September 27, 2023, 06:47:08 PM",
      "body": "Quote from: Stepstowealth on September 26, 2023, 02:17:33 PMI dey ask because, e get school wey dey near my side, I been dey hyear when the teachers for the school dey teach the children about things wey dem fit find for classroom, the thing vex me because why you go dey teach children that kind thing, something wey nor dey important like that and people parents dey pay school fees. You know say when you get this money, all your mindset go dey for big big things and when the money dey I know sure say even me self go carry my pikin put for school way no get qualify teachers like the one way you talk.Wen your pikin dey small, maybe like 3 years you fit call teachers to teach your pikin for your house but that no go help the pikin Sha, because if your child just dey indoors dey learn the learning just dey boring and e go make the pikin no set social with people so school nai be the best for your child.If your child done grow up to the age of 17 to 18 e go also help em self because for this country naw as e dey so, JSS or SSS student suppose help them self and not only to rely on teacher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "September 27, 2023, 07:38:17 PM",
      "body": "OP exposure is part of the education process. It is good a child is allowed to meet, interact and relate with their peers as that would avail  them the opportunity to make good friends and learn more from the society. I know the rate at which fee increases is very disturbing but however that does not mean that there are no affordable school one can send their child to. If one feels not financially stable enough  to pay for their child fees, they can opt for the government owned schools. Some government owned schools have sound teachers much more better than some so called private schools with huge amount of fees attached to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 27, 2023, 11:27:53 PM",
      "body": "Quote from: Stepstowealth on September 26, 2023, 02:17:33 PMConsidering the poor state of our educational system, how there are more schools with unqualified teachers than schools with qualified teachers, plus the archaic nature of the curriculum wey most schools dey use for this our country, how you see am? e go better make you do home schooling, that is like gather better teachers dey pay them yourself make dem dey come teach your pikin den you dey closely dey monitor dem den dey add some kind small small modern knowledge of things dem suppose know, or you still prefer make dem go the schoool the way school dey for the country.You fit no gbadu wetin dey happen for school now for the country base on say you dey feel say the standard of teaching for the country don reduce drastically but one tin wey I want make you understand be say no be everything dem fit teach pikin from home no matter the amount of intelligent teachers you hire say make dem come teach your pikin. Some king tins dey wey be say na for classroom dey gatz teach with other students for the children to understand faster. And going to school also provides peaceful coexistence between parents having the same children in such schools, I don see am several times and na something wey good na him be dat. That tin wey dem dey call socialization, e dey very important for every child after their first step of socialization from home, na school be the next and should not be denied that right of mingling with their age group while keeping an eye on dem still.QuoteI dey ask because, e get school wey dey near my side, I been dey hyear when the teachers for the school dey teach the children about things wey dem fit find for classroom, the thing vex me because why you go dey teach children that kind thing, something wey nor dey important like that and people parents dey pay school fees. Dis your talk somehow funny sha because I no see anything wrong in dat wey dem dey teach dem as long as dat class wey dem dey dat time, na class wey dem suppose teach dem the tin. If dem no teach dem, how dem wan take know wetin dem fit find for classrooms. Dem fit dey see dem but dem no fit know d names all, so there’s nothing wrong in letting dem know. I don see person go for interview job and dey ask am wetin him fit find for office. Shey dat one no be impromptu question, if dem ask you dat one for interview question you go pause first come think before you fit mention ten out of it but before dat person go for interview of dem tell am say dem go ask am, him go still deny am. So me I no see anything wrong in dat. And your pikin no fit learn everything finish form home, he has to go to school for dem to instill some morals and knowledge into him that can never be gotten at home too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 03, 2023, 08:31:03 AM",
      "body": "Quote from: Stepstowealth on September 26, 2023, 02:17:33 PMConsidering the poor state of our educational system, how there are more schools with unqualified teachers than schools with qualified teachers, plus the archaic nature of the curriculum wey most schools dey use for this our country, how you see am? e go better make you do home schooling, that is like gather better teachers dey pay them yourself make dem dey come teach your pikin den you dey closely dey monitor dem den dey add some kind small small modern knowledge of things dem suppose know, or you still prefer make dem go the schoool the way school dey for the country.I dey ask because, e get school wey dey near my side, I been dey hyear when the teachers for the school dey teach the children about things wey dem fit find for classroom, the thing vex me because why you go dey teach children that kind thing, something wey nor dey important like that and people parents dey pay school fees. Whether qualified or not qualified teachers I still choose sending our kids to schools. Sending your children to school make them competitive among their classmates and it broadens their knowledge towards their reasoning ability.Sending our children to school helps them to be exposed to different individuals that may be impactful to them in the future. Like for instance if your classmate holds a notable office in the future it can be easy for them to reach out to you knowing fully well that you both started a journey together so sending our children to schools has lots of advantages though if you are handy enough you can still employ the services of a home teacher to further enlighten their knowledge on what they're being thought in school.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}