{
  "id": "topic_5464140",
  "title": "Samlucky O",
  "author": "Samlucky O",
  "created_time": "August 22, 2023, 10:43:58 AM",
  "content": "(1) Urinating behind the house.(2) Wife sleeping next to the wall(3) Keeping brooms behind the door.(4) When you get rich,people say you have a secret bedroom where noone enters.(5) When you become old you are suspected to be a witch.(6) When you take a bath,they will ask you if you are going somewhere.(7) Keeping some untensils aside specifically for visitors.( Counting pieces of meat to ensure they are served equally.(9) No natural death occurs in Africa.Your enemy is always the cause.(10) Counting money after withdrawing from the ATM.(11) Marrying a beautiful lady is equated to marrying a prostitute.(12) Removing shoes when walking in the mud and entering the house.(13) There are some special parts of the chicken meat that are reserved for the husband e.g gizzard.(14) Buying new clothes when there is a festival (15) When one is given a microphone,they first blow air into it or tap it with a finger to test whether it is working despite the previous user having used the same microphone.(16) Sweeping the whole compound even when some parts are not dirty.(17)Looking left and right when crossing one way road.(18) Keeping an empty plastic bottle after drinking the water for future use(19) Reserving a special chair in the house for the husband.(20).Feeling proud when sitting next to a white person in a bus.Shear your own experience about African's.https://www.facebook.com/100087629267607/posts/pfbid025tc7coU8QXoaRr714HURvVncvHABoGaqNaaCjmSknKcQdXz9ZDDo9jc9sKwhxKvUl/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464140",
  "comments": [
    {
      "author": "Gozie51",
      "created_time": "August 22, 2023, 02:14:18 PM",
      "body": "I agree with some of the things wey you say but I go just commen on some because some mentality don dey change as people don begin understand one or two things differently.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(4) When you get rich,people say you have a secret bedroom where noone enters.This one don dey change as people don dey see say no be really say na secret room for juju stuff but either for comfort and relaxation, study room and room to do some other legit business online.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(5) When you become old you are suspected to be a witch.This don begin change Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(6) When you take a bath,they will ask you if you are going somewhere.This one too don begin change with the rate of fine boy and girls wey dey baff up stay back home doing legit things, if you know you know.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(9) No natural death occurs in Africa.Your enemy is always the cause.People don begin change here too because of the rate of terminal diseases now and organ failure. People outside the family even know certain disease or sickness wey other people dey carry waka because dem dey meet dem for hospital, so person no go just come lie say person no sick just die. People outside and on internet get information wey we no even sabi.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(10) Counting money after withdrawing from the ATM.Na mostly old people fit still dey do this one. Majority of the young people understand better.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(12) Removing shoes when walking in the mud and entering the house.So you want carry portorportor enter house abi.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(13) There are some special parts of the chicken meat that are reserved for the husband e.g gizzard.Some house no dey do am again especially enlightened homes wey still understand say children need egg more than adult. That reminds me, you fit add this egg stuff join.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(14) Buying new clothes when there is a festival This is changing with the rate of poverty too, some families no dey send again.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(15) When one is given a microphone,they first blow air into it or tap it with a finger to test whether it is working despite the previous user having used the same microphone.Ha... Guys wey dey handle mic now don plenty so that is fading off because DJ self go don taste mic for your front before you collect am.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(17)Looking left and right when crossing one way road.Na who want die like that. No be even for one way self, even for better express. You know for naija everything possible.Quote from: Samlucky O on August 22, 2023, 10:43:58 AM(19) Reserving a special chair in the house for the husband.Na like chair wey go face visitors mostly. I know say some house still dey do am especially where the father is seen as demigodQuote from: Samlucky O on August 22, 2023, 10:43:58 AM(20).Feeling proud when sitting next to a white person in a bus.Back then, oyibo no even dey again for naija. Na we dey go meet dem for their country home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 22, 2023, 08:18:52 PM",
      "body": "OP, the person wey right these things try because him take e time observe from 1990 to this date. Na e make you are say he put some old ones wey people don stop to do. But the truth be say,if you go some interior villages those old practice still dey go on for there. OP, if you won walka for mud and you put on expensive shoe, I beg no lie,shey you go pull am come hold am for hand. My broda, if you no do like that,if fit be say na the last day wey you go wear the shoe be dat. Moreover,you go give yourself double work by washing the shoe very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "August 22, 2023, 08:24:39 PM",
      "body": "Nothing here defines an African man - please enough of these copy and paste articles. You can do better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 01, 2023, 09:50:00 AM",
      "body": "From wetin I see here all na almost truth especially that of crossing.. me myself usually check both sides before crossing because we get crazy people for we country wey dey always drive one way to come without following the normal route to drive, this commonly happened when there is traffic on the other lane so they may decide to use the other lane for quicker approach, imagine if you do not watch very carefully before crossing road what would happen to you at then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joyce ukata",
      "created_time": "September 01, 2023, 10:36:02 AM",
      "body": "This is very true, I Experience almost all these while growing up. But the thing be say most of them dn d change as people mentality  d change. We are getting there very soon none of the this will define an African habit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "September 01, 2023, 10:58:27 PM",
      "body": "I couldn't stop  laughing 🤣 Chairman, this your observations dey sharp and despite day e no dey paint us well but na the truth and me I be victim of almost all if not all wey you don list for here especially the road crossing and urinating but rather than walls, na tire me I dey piss  my own put. I no wan talk plenty but I must commend your work but since nothing dey my refrigerator to serve you, I go say make I rest now till my frig go get wetin he go fit serve you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "September 01, 2023, 11:46:43 PM",
      "body": "I see som familiar practices from my youth and omo, who ever gathered all these tried but could still have recount how much has changed. In recent time, a lot have been found to note nothing than just that and you can't as well say its practices that defines Africa. I think some other parts of the world had something similar and they still aren't defined by them.Africans have adapted, have evolved to learn that, there isn't much in a chair except the Kings throne.Counting meat you say... I think the only reason a patent would do that back the  was to ensure the child don't go seeking the pot for some meat protein. One means to deter the child from stealing from her pot.Be it as it may, some of these practices shaped lives for better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "September 07, 2023, 07:48:40 AM",
      "body": "When you meet and greet an elder, you will have to bow down for them as a mark of respect. When you don't do it to some elders, it's like you have committed an abomination. That's how deep it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 07, 2023, 08:59:04 AM",
      "body": "Very funny though but seems to be the reality.  Omo wetin you cap here is not different from the truth o. You see that one wey you talk about urinating na virtually a common practice here in Africa. Africa man no mind urinate anywhere wey him see as long as nobody come tell am anything about being wrong to urinate there.E get one particular one wey be say if you dey sit for chair any elderly person come there, you must get up for that elder to sit. If you no get up, my brother you don disrespect the elder be that o. Your matter don begin fly for air as arrogant and lacking manners. Dem go begin see you as pikin wey no get respect for elders. Na there your matter with dem begin e go come dey worst when e be say Na for village e happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 07, 2023, 12:59:19 PM",
      "body": "Too many manners of miracles and wonder expectations from heaven to come down deliver that world on what human can just fix and handle by themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Egii Nna",
      "created_time": "September 08, 2023, 03:58:15 AM",
      "body": "Quote from: iBaba on September 07, 2023, 07:48:40 AMWhen you meet and greet an elder, you will have to bow down for them as a mark of respect. When you don't do it to some elders, it's like you have committed an abomination. That's how deep it is.   Lol  my brother e be like say u are talking from experience most especially my village people you see and elder person you will bow down and is not that u will just greet and go oo the elder most ask you some questions about your family for identification even though he knows you some will still tell you your great grandfather name and other stories and then bless you before you go   It’s stressful but it a good thing to practice and it gives me joy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 19, 2024, 08:31:42 AM",
      "body": "Plenty things dey wey show say we be African, firstly na our way of thinking, the way we think and the way oyibo people dey think no be the same thing and our way of dressing and we no be also the same thing, them dey hardly kill animals but we animals na our own food, the way we talk and the way oyibo people dey talk no be the same thing, even our foods show say we be African infact most of our lives today or most of the things wey we dey do today no be actually our lifestyle but na wetin we copy from oyibo people dem but we get our lifestyle too but no matter how we copy from them, our own go surely show say this people na African and I'm proud to be called one self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loveday422",
      "created_time": "April 19, 2024, 10:59:49 PM",
      "body": "Someone will be poor for long when he make it people start saying he he did retualist,this has been the mind set of African, though many are like that .Some people suffer in their place of work ,to make sure their money increase but to no avai ,when his money will increase people started saying he went tonative doctor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odunybiz",
      "created_time": "April 19, 2024, 11:06:53 PM",
      "body": "Quote from: iBaba on September 07, 2023, 07:48:40 AMWhen you meet and greet an elder, you will have to bow down for them as a mark of respect. When you don't do it to some elders, it's like you have committed an abomination. That's how deep it is.   This is not seen from all Africans. Let me take Nigeria as an example, the Igbos don't really bow like the Yorubas when greeting. Even you hardly see the young ones standing up for the elders to sit in an occasion. But this is like a must among the Yorubas. So, this aspect of greeting is not really common to all Africans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}