{
  "id": "topic_5466562",
  "title": "Odohu",
  "author": "Odohu",
  "created_time": "September 12, 2023, 07:09:53 PMLast edit: September 12, 2023, 08:46:25 PM by Odohu",
  "content": "Different people with different approach to gambling. Some prefer committing huge capital to high probability small odds while others prefer using small capital to target big wins. There are many reasons for each of these approaches. While those that put huge capital win more often, their losses are usually painful. On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. There are other advantages and disadvantages for both approaches but for the sake of this discussion, let's know which approach you think is better and why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466562",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 12, 2023, 07:15:48 PM",
      "body": "I was using huge amount of money on small odds before and I win often, but if I lose, I lose more and one loss can be up to 20 winnings. Using huge capital for small odds is not good. Using small capital for huge winning is better. That is why I prefer casinos with games that gives me 3 odds or more. In sport, that kind of possibility makes the odd to significantly be reduced. The smallest odds are on sport betting. There is no good reason to be going for 1.005, 1.01 or other low odds. When I prefer to go for better odds more than 1.5 odds in sport, it has been better than before. I bet less than before and I use low amount of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "September 12, 2023, 07:19:18 PM",
      "body": "Quote from: Odohu on September 12, 2023, 07:09:53 PMDifferent people with different approach to gambling. Some prefer committing huge capital to high probability small odds while others prefer using small capital to target big wins. There are many reasons for each of these approaches. While those that put huge capital win more often, their losses are usually painful. On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. There are other advantages and disadvantages for both approaches but for the sake of this discussion, let's know which approach you think is better and why? In my opinion, it’s better to have a small capital and a big risk, because if I risk a lot of capital for the sake of a 10% profit, success will not impress me. But if I win 1000% of the bet, then emotions make themselves felt. In addition, it is obvious that it is better to lose a small bet than a huge deposit. This is a kind of damage control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 12, 2023, 07:25:33 PM",
      "body": "Quote from: KTChampions on September 12, 2023, 07:19:18 PMIn my opinion, it’s better to have a small capital and a big risk, because if I risk a lot of capital for the sake of a 10% profit, success will not impress me. But if I win 1000% of the bet, then emotions make themselves felt. In addition, it is obvious that it is better to lose a small bet than a huge deposit. This is a kind of damage control.If you check some football in-play, you will notice odds like 1.02 down to the ones I have mention above. With 1.02 odd, that is 0.02% profit and people going for that such odds are not wise at all because once they will lose, they lose in a way that will cause them depression and they will continue to lose money to gambling. 10% of profit is 1.1 odd and that is also still small. Just like I have said above, I prefer nothing less than 1.5 odd while gambling with bookmakers, while nothing less than 3 odds in casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 12, 2023, 07:25:38 PM",
      "body": "Quote from: KTChampions on September 12, 2023, 07:19:18 PMQuote from: Odohu on September 12, 2023, 07:09:53 PMDifferent people with different approach to gambling. Some prefer committing huge capital to high probability small odds while others prefer using small capital to target big wins. There are many reasons for each of these approaches. While those that put huge capital win more often, their losses are usually painful. On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. There are other advantages and disadvantages for both approaches but for the sake of this discussion, let's know which approach you think is better and why? In my opinion, it’s better to have a small capital and a big risk, because if I risk a lot of capital for the sake of a 10% profit, success will not impress me. But if I win 1000% of the bet, then emotions make themselves felt. In addition, it is obvious that it is better to lose a small bet than a huge deposit. This is a kind of damage control.Damage control can be very helpful in such situations and one of the most ignored damages control features that gamblers neglect some time is the cash out features,  because even the smallest odds can still lose so since there is no guaranteed odds one need to be very smart enough to monitor the entire game process and being able to make decisions in-between,  because that is what make the difference when you want to apply damage control not to lose the entire bet. Small deposit or big stake what matters is the luck,  if you are lucky to have selected a few sure games that you know can give some substantial winning you ought to go for it,  but also mind you,  the more the game selected the higher you chances of losing because you can be sure in all the selections,  definitely one or two games will cut the ticket and that is where making use of the cash-out feature could help significantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "September 12, 2023, 07:37:09 PM",
      "body": "Quote from: Oshosondy on September 12, 2023, 07:25:33 PMQuote from: KTChampions on September 12, 2023, 07:19:18 PMIn my opinion, it’s better to have a small capital and a big risk, because if I risk a lot of capital for the sake of a 10% profit, success will not impress me. But if I win 1000% of the bet, then emotions make themselves felt. In addition, it is obvious that it is better to lose a small bet than a huge deposit. This is a kind of damage control.If you check some football in-play, you will notice odds like 1.02 down to the ones I have mention above. With 1.02 odd, that is 0.02% profit and people going for that such odds are not wise at all because once they will lose, they lose in a way that will cause them depression and they will continue to lose money to gambling. 10% of profit is 1.1 odd and that is also still small. Just like I have said above, I prefer nothing less than 1.5 odd while gambling with bookmakers, while nothing less than 3 odds in casinos.Yes, I have good betting experience. I never make single bets on such low odds - there is no point in this (maybe except for the wager, but I am not distracted by such bonuses). I sometimes add low odds selections to my multi bets but even here I prefer a range of 1.3-1.7 and a total odds of 6 to 10. Such bets don’t always work out, but when they do, I get a lot of positive emotions.Quote from: Wiwo on September 12, 2023, 07:25:38 PMDamage control can be very helpful in such situations and one of the most ignored damages control features that gamblers neglect some time is the cash out features,  because even the smallest odds can still lose so since there is no guaranteed odds one need to be very smart enough to monitor the entire game process and being able to make decisions in-between,  because that is what make the difference when you want to apply damage control not to lose the entire bet. ~Cashout is usually too expensive to use. If the game has started and the situation has not changed, then it is already worth 10-15% of the bet, and if things did not go in our favor, then immediately more than 50%. Sometimes it is easier to make a hedge bet, but this is also expensive. I prefer not to fuss and just see how it all ends (unexpected endings are common in sports).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 12, 2023, 07:42:34 PM",
      "body": "Quote from: KTChampions on September 12, 2023, 07:37:09 PMCashout is usually too expensive to use. If the game has started and the situation has not changed, then it is already worth 10-15% of the bet, and if things did not go in our favor, then immediately more than 50%. Sometimes it is easier to make a hedge bet, but this is also expensive. I prefer not to fuss and just see how it all ends (unexpected endings are common in sports).I agree with you on the fact that cashout have it own risk most especially if things have changed and the odds are against you you may have a 40% slash from amount available in cash out but if you are playing in a live game and the time is way above half the 90 minutes with players already tired,  and there is no hope of winning waiting till the end may cost you a whole lot and some times it better to just exit and take the cash out looking forward to a better days. Most of the time I don't use cash out either and the only time I consider cash out is when I select multiple bets and I see there is a high tendency of one of the clubs to lose out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 12, 2023, 07:52:00 PM",
      "body": "Small capital as I don't have a stash of coins. You only have two options though when there should be more. Small-time gamblers are often just betting small amounts but could accumulate wins which is what I prefer to do.If I try small capital to win big, it would be the sports parlay but I have never won any of it since the time I have been doing it. I stopped because it was much like a state-owned lottery. The chances of winning is like 1 in 500M.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 12, 2023, 07:57:22 PM",
      "body": "Quote from: Odohu on September 12, 2023, 07:09:53 PM~Best Approach remains playing with an amount of money you can afford to lose, you decide if it is a big or small amount. And then If it is sports betting, I rather not pick too many games to bet on to accumulate odds, selecting a few games with good odds is good for me.Quote from: Odohu on September 12, 2023, 07:09:53 PMWhile those that put huge capital win more often, their losses are usually painful. On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. This is your own assumption. It is not true. Asides that there is no correlation with the amount you use in gambling influencing how often you win, there is no way to really quantify the pain that the people who gamble with small and big money feel when they loose. For example, someone who gambles with a small amount of money, it most time mean that they do not have much, loosing that small amount of money that they have managed to spare for gambling can be as painful as loosing a big amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "September 12, 2023, 08:00:14 PM",
      "body": "I think small capital will always be the best way to pick for average people. We are not millionaire you know. I don't think this is easy comparison so. Its one side only in my opinion. Small capital, big risk games but higher amounts can help you to hit high. By trying more, you substantially increase your chances to win. I also love trying sports betting with very high odds so I would get very high returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "September 12, 2023, 08:00:26 PM",
      "body": "I think there is no standard to what we can gamble with it just depends on the availability of funds with the gambler because if the gambler is having high funds he will definitely gamble with high money thinking that will reduce the risk also same thing goes with an average gambler who doesn't have much because he will tend to manage his funds and go with high risk because of the money he used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "September 12, 2023, 08:07:06 PM",
      "body": "Quote from: Odohu on September 12, 2023, 07:09:53 PMDifferent people with different approach to gambling. Some prefer committing huge capital to high probability small odds while others prefer using small capital to target big wins. There are many reasons for each of these approaches. While those that put huge capital win more often, their losses are usually painful. On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. There are other advantages and disadvantages for both approaches but for the sake of this discussion, let's know which approach you think is better and why? I think I'll stay with small capital with big risk considering in the long run if you wager enough and hit the win you either win or be just at breakeven. The only downside in it is that if you make lot of bets and all ended in losses that considers a huge loss of capital. There's always a risk on both sides but that's just gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "September 12, 2023, 08:10:33 PM",
      "body": "To be honest, I’d prefer to bet using a few bucks and not a huge amount of money because it would feel so bad when you lose it all. I’d prefer to go with small capital all the time and see if my luck will be with me. I really don’t wanna risk a lot of money on gambling as It’s something that you couldn’t control and you don’t even know if you could win or lose so it’s better to wager a bit of money but with high odds imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "September 12, 2023, 08:18:46 PM",
      "body": "I think both options are good, but it still depends on which match you prefer.I think there are times to use big bets for small odds and there are times to bet at big odds with small bets. It all depends on who is going to play the match so I am not as consistent as other people in my decisions. This means that analysis is required and bets must be placed on which team has the potential to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "September 12, 2023, 08:25:49 PM",
      "body": "Quote from: Odohu on September 12, 2023, 07:09:53 PMDifferent people with different approach to gambling. Some prefer committing huge capital to high probability small odds while others prefer using small capital to target big wins. There are many reasons for each of these approaches. While those that put huge capital win more often, their losses are usually painful. On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. There are other advantages and disadvantages for both approaches but for the sake of this discussion, let's know which approach you think is better and why? Every gamblers had their own style of gambling,some ready to inverse huge by multiple bets.Then the profit percentage is also high and sure win for the multiple betting gamblers.Each game had the winning of 10x of the invest money.If the gambler win of 3-10 bets,then the winning percentage will be 30x for the 10x deposit.So the gambler will easily win of 20x of the profit from the betting.This multiple bet is almost the risky one.Some time their is no winnings or 1-2 win from the 10 betting.For this reason,many gamblers avoid of the multiple betting.The big winning people also from the multiple betting,So the choice is yours.Since the money deposited by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 12, 2023, 08:32:20 PM",
      "body": "It's the opposite for me. The lower the bankroll or capital you have, the lesser risk that you're taking. Yeah, those that have huge capitals can stay to gamble for so long but do they afford to lose all of that? And that's why I think that having a smaller capital is what should be the lesser risk. Since everyone is anticipating that they're going to lose then lose with small and affordable amount of yours. The principle of betting what you can afford to lose is what we always say because its risk is associated on how much we're willing to let go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "September 12, 2023, 08:35:55 PM",
      "body": "It depends on how much money you have and what your risk tolerance is. Nobody should start gambling with money they can’t afford to lose, it doesn’t matter if it’s big capital with a small risk or small capital with a big risk. Responsible gambling is key, everybody with half a brain knows that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "September 12, 2023, 08:45:39 PM",
      "body": "It depends but I've done both in the past.With large capital, small risk means choosing small odds and with the favorite team being played, there is clearly a small risk, but when we lose on a large capital bet, it will be more painful. I know that sometimes things go wrong even though the risk is small.Small capital obviously wants to win at high odds but this is difficult to win, for example the Chelsea vs Forest match, who would have thought Forest would win? But it's luck with big risks, you can win, but it will be difficult for me to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "September 12, 2023, 09:15:01 PM",
      "body": "Quote from: Odohu on September 12, 2023, 07:09:53 PMWhile those that put huge capital win more often, their losses are usually painful.Those who put huge money will end up targeting small odds, which will make them often win their bets, but if you are the type that gambles with huge amounts of money, it’s kind of risky to me because whenever you are losing, you will end up losing even the profits that you made previously, and at the end you will notice that your profit and loss might end up being kind of close. Using huge amounts of capital in gambling is kind of risky, and I don’t always recommend that.Quote from: Odohu on September 12, 2023, 07:09:53 PM On the other hand, those that commit small capital to make huge wins rare win but when they do, they win big; their losses too are less painful. It’s annoying whenever I see the amount that some people use in placing bets and the amount that they plan to win. After some people place their bet, I know it will be kind of difficult to win. Those are the types that will keep on hoping they win big one day, and they will keep on wasting money. If all the little amount they have spent is calculated, then you will discover that the money is already much.Quote from: Odohu on September 12, 2023, 07:09:53 PMThere are other advantages and disadvantages for both approaches but for the sake of this discussion, let's know which approach you think is better and why? I don’t think the two strategies are appropriate because I have the feeling that you will end up losing a lot if you use them. It’s better to use a reasonable amount of money to place a bet on the little odd, I am not saying the odd should be too small. I think it will be better than spending huge amounts of money on little odds and spending little amount expecting to win huge amounts, which they might never win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "September 12, 2023, 09:20:40 PM",
      "body": "Sometimes using a higher amount to place a bet increases one's chance of winning because that big amount could just be used to select a few options with favourable odds, and with those odds calculating with your wager amount, you can make a tangible profit. But when you use small capital to make your bet, you will start running from one option to the other looking for means to increase your winning amount with that small capital, which most times will lead one to select the wrong game, which could not have been an option from the beginning but because of the odd that it has, it has the chance of doubling their winning. But whichever amount is being used, I still believe both share an equal amount of losing risk; if you bet with big capital and luck falls on your side, you win big, and if you wager with a small amount and the winning enters, you start regretting why you did not double the wager amount, and this is also the case in the aspect of losing. So I believe both also share the same value of losing, looking at it from the winning and losing perspectives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}