{
  "id": "topic_5419671",
  "title": "BitSwapNow",
  "author": "BitSwapNow",
  "created_time": "November 06, 2022, 08:07:18 PM",
  "content": "Good day all. So coming from a cybersecurity background and being an ex black hat hacker myself I find so many people falling victim to scams and malicious attacks. I feel it would be super useful and also helpful to raise awareness and give my own personal thoughts to remain vigilant on the newest threats and best practices to remain safe not just in the crypto sphere but in the cyber realm as a whole. I’m not sure the best forum section to start this thread and also if users would find this useful so I’m asking here. A) what would be appropriate for posting about crypto related scams and fraud , cybersecurity and best practices of cyber hygiene to remain safe and keep your funds safe in an ever evolving cyber world . I think we can create an awesome discussion around this and learn from past and present mistakes of others as well as industry veterans who may share some great knowledge on this subject also.PS: For those whose don’t want to read is this the best place to start a crypto // cybersecurity best practices thread? I want to talk about ways to stay safe and the methods scammers and fraudsters are using currently to steal one’s funds.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419671",
  "comments": [
    {
      "author": "Accardo",
      "created_time": "November 07, 2022, 10:38:24 AM",
      "body": "Beginners and help is the right section to share such information for both newbies and other members to learn and further share ideas. However, if the post is technically focused then the Dev and tech section is also another good section for that. In the beginners section keep the terms and thread simple to understand. You can use tech jargon on the Dev section, they're a lot of tech savvy members in that section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitSwapNow",
      "created_time": "November 08, 2022, 12:13:33 AM",
      "body": "Thanks yea i wouldnt say its much of a dev thread more so cyber security precautions and ways to remain safe. Not to technical. Anyone can understand and more so complex themes of fraud or phishing. Also about wallets, metamask, cold wallets ect and staying safe with those as well as email and downloads to watch out for. I will put it in the hlpe section when i get some time to start the thread off with some good topics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}