{
  "id": "topic_5405022",
  "title": "tokyohd",
  "author": "tokyohd",
  "created_time": "July 03, 2022, 02:52:07 PM",
  "content": "Voyager Digital today announced it had suspended trading, deposits, withdrawals, and loyalty rewards on its platform.Voyager Suspends Crypto Trading and WithdrawalIn an announcement made today, crypto company Voyager Digital stated that it was “temporarily suspending trading, deposits, withdrawals and loyalty rewards” as of 2 p.m. ET on Friday.Commenting on the development, Stephen Ehrlich, Chief Executive Officer of Voyager, said:“This was a tremendously difficult decision, but we believe it is the right one given current market conditions. This decision gives us additional time to continue exploring strategic alternatives with various interested parties while preserving the value of the Voyager platform we have built together. We will provide additional information at the appropriate time.”The move hardly comes as a surprise as just a few days back, Voyager issued a notice of default the beleaguered crypto hedge fund Three Arrows Capital (3AC) due to the latter’s inability to repay a $650 million loan, primarily denominated in bitcoin (BTC) and USDC.Currently, Voyager is actively pursuing all available remedies for recovery from 3AC, including through the court-ordered liquidation process in the British Virgin Islands.In a bid to expedite the process, Voyager had taken the services of Moelis & Company and The Consello Group as financial advisors, and Kirkland & Ellis as legal advisors.Voyager also released financial and balance sheet updates in accordance with the requirements of Canadian Securities Laws. Notably, the balance sheet includes $350 million of USDC and 15,250 BTC loaned to 3AC.  Further, the balance sheet update shows that Voyager holds $355.72 million in cash held for customers and $168 million in crypto collateral received/held. Details: https://crypto.news/crypto-firm-voyager-suspends-withdrawals-deposits-trading/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405022",
  "comments": [
    {
      "author": "Husires",
      "created_time": "July 03, 2022, 05:44:08 PM",
      "body": "These companies do nothing except that they rotate loans as they take the currencies from the user and give codes to start the purposes of those currencies to other institutions with better returns, so that these institutions carry out their purposes for others and so the circle continues.When the currencies begin to decline, then problems occur, and if the company has a sound financial model, they will have hedge for these scenarios, but they are models for quick profit.A lot of these platforms are connected to each other so this will not be the last story and we will hear more soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 03, 2022, 08:41:45 PMLast edit: July 03, 2022, 09:30:24 PM by JeromeTash",
      "body": "People are adviced to always avoid keeping their cryptocurrency in 3rd party centralized platforms but very many play deaf thinking that they will get some earnings through lending, staking, yield farming etc.The true reality is one will be risking a lot of money to just get those peanuts in APYs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "July 03, 2022, 09:26:13 PM",
      "body": "Quote from: JeromeTash on July 03, 2022, 08:41:45 PMPeople are advices to always avoid keeping their cryptocurrency in 3rd party centralized platforms but very many play deaf thinking that they will get some earnings through lending, staking, yield farming etc.The true reality is one will be risking a lot of money to just get those peanuts in APYs.They are being warned and this could be a lesson to them if they still push through. Small investors are not enjoying those APYs, that’s too low for me and if you do know how to trade, there’s a higher chance to earn more than to wait for that APY. Though this is just a temporary suspension, I’m pretty sure once they live the withdrawals again, many will start to collect their money because of a risk on losing everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 03, 2022, 10:53:58 PM",
      "body": "Another reason why everyone is advising all of you guys to never let a huge amount stayed on any platform. It's why we're all advising that when you keep your portfolio, it should be on a non-custodial wallet. Just like Voyager and other exchanges, they're all custodial and they are the ones holding our funds. This scenario cannot be foreseen and comes by a surprise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 04, 2022, 02:41:09 AM",
      "body": "When did they freeze withdraws? Today or did they do it last week. It was revealed a week ago or so they were exposed to the 3AC loans and I am surprised people still kept funds in there.All of these crypto loan places are getting hit one by one. Exchanges seems fine because they weren’t exposed too much to loaning.Wonder how much more of these we will get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 04, 2022, 02:47:01 AM",
      "body": "Since it's temporary, I think it's going to be okay. Sam from FTX has saved their butts to make sure that they are still above-board on this. It's just that they are having a hard time probably recouping and managing their losses. I do hope that this wouldn't be a downplay towards the cryptocurrency scene because it's going to be a hard ride TBH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 04, 2022, 06:46:00 AM",
      "body": "The suspension is only temporary and should be a warning to users when everything is back open to immediately withdraw funds from there.Trade should be completed per day and withdraw funds from the exchange but unfortunately many traders think the withdrawal fee will reduce their profit even though keeping large funds in 3rd party is a risk both to trade and to invest, but I'm sure that this won't stop people from doing it and learning how risky it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "July 04, 2022, 07:12:29 AM",
      "body": "Quote from: adaseb on July 04, 2022, 02:41:09 AMWhen did they freeze withdraws? Today or did they do it last week.They announced the suspension of withdrawal at 2:00 PM EDT July 1.Quote from: https://www.investvoyager.com/blog/voyager-update-july-1-2022/Today, Voyager made the difficult but necessary decision to temporarily suspend trading, deposits, withdrawals, and loyalty rewards, effective at 2:00 PM Eastern Daylight Time on July 1.Quote from: adaseb on July 04, 2022, 02:41:09 AMIt was revealed a week ago or so they were exposed to the 3AC loans and I am surprised people still kept funds in there.And now 3AC filed for Bankruptcy[1] which in turn they became the latest victim of this so-called \"Bear Market\".What's funny is that it looks like they have taken the money of their customers to give an uncollateralized loan to a hedge fund 3AC which is now filing for bankruptcy   -- see we take your money and suspend the withdrawal to avoid having the same fate to the company we have lent money to.[1] https://www.bloomberg.com/news/articles/2022-07-01/crypto-hedge-fund-three-arrows-files-for-chapter-15-bankruptcy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "July 04, 2022, 09:55:26 PM",
      "body": "Quote from: Strongkored on July 04, 2022, 06:46:00 AMThe suspension is only temporary and should be a warning to users when everything is back open to immediately withdraw funds from there.Trade should be completed per day and withdraw funds from the exchange but unfortunately many traders think the withdrawal fee will reduce their profit even though keeping large funds in 3rd party is a risk both to trade and to invest, but I'm sure that this won't stop people from doing it and learning how risky it is.Once they resume the withdrawal option, for those users who are holding funds, better take that opportunity.Because we will never know their next steps on this market. Better secure your funds in your own wallet.Third party trading platforms are not for storage purposes of your coins. With the bear market that we are still experiencing, these companies will indeed resort to securing their bankroll first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "July 06, 2022, 05:33:11 AM",
      "body": "Quote from: tokyohd on July 03, 2022, 02:52:07 PMVoyager Digital today announced it had suspended trading, deposits, withdrawals, and loyalty rewards on its platform.Voyager Suspends Crypto Trading and WithdrawalIn an announcement made today, crypto company Voyager Digital stated that it was “temporarily suspending trading, deposits, withdrawals and loyalty rewards” as of 2 p.m. ET on Friday.Commenting on the development, Stephen Ehrlich, Chief Executive Officer of Voyager, said:“This was a tremendously difficult decision, but we believe it is the right one given current market conditions. This decision gives us additional time to continue exploring strategic alternatives with various interested parties while preserving the value of the Voyager platform we have built together. We will provide additional information at the appropriate time.”The move hardly comes as a surprise as just a few days back, Voyager issued a notice of default the beleaguered crypto hedge fund Three Arrows Capital (3AC) due to the latter’s inability to repay a $650 million loan, primarily denominated in bitcoin (BTC) and USDC.Currently, Voyager is actively pursuing all available remedies for recovery from 3AC, including through the court-ordered liquidation process in the British Virgin Islands.In a bid to expedite the process, Voyager had taken the services of Moelis & Company and The Consello Group as financial advisors, and Kirkland & Ellis as legal advisors.Voyager also released financial and balance sheet updates in accordance with the requirements of Canadian Securities Laws. Notably, the balance sheet includes $350 million of USDC and 15,250 BTC loaned to 3AC.  Further, the balance sheet update shows that Voyager holds $355.72 million in cash held for customers and $168 million in crypto collateral received/held. Details: https://crypto.news/crypto-firm-voyager-suspends-withdrawals-deposits-trading/ This is the disadvantages if anyone is using centralised exchange platform, though I'm not saying all centralised is the same like the voyager. It's just a pity that the client users of this exchange have no choice and nothing they can do to release their assets because the deposit and withdrawal transaction is frozen, And the only thing they can do is but to wait only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 06, 2022, 12:48:21 PM",
      "body": "Quote from: tokyohd on July 03, 2022, 02:52:07 PMVoyager Digital today announced it had suspended trading, deposits, withdrawals, and loyalty rewards on its platform.Starting with UST/ LUNA crisis, then Celcius liquidation risk and some lending platforms recently. I am sad to see people still store their money on risky platforms.You read it right. Any third-party platforms are risky to store your coin. However, high risky platforms have unsustainable financial models such as too high APYs, and some shady things that have yet been clear with their public audits. In the middle of bear market and with net effects from some crashes, collapses recent months, it's safest to withdraw your coins out of third party lending platforms, just to be safe.If they are fine, in next few months, you can deposit your money back. At the moment, just don't, let's protect your money in your wallet (non-custodial).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 06, 2022, 12:59:19 PM",
      "body": "In short this companies are connected to each other which used the money of there investors to loan to other company and banks to make a cycle. And now crypto is crumbling while they are sharing the pain of the losses which results to sell-off just to cover there loans collateral liquidation. This is a chain reaction and I believe many company will follow since there investors is already starting to loss trust and pull out there investment. This is the worst nightmare of venture capitalist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 07, 2022, 07:54:44 PM",
      "body": "Other exchanges will do the same if their reserve has issue and become mostly empty to pay for user withdrawal demand. It can be a hack or a financial crisis like what Voyager has after their failed investment into old Luna (Luna Classic now) and a terrible loan recently that can not get a loan repayment from Three Arrows Capital.Hence, storing your coins on exchanges where you don't own private key of your coin is bad. Because you don't have access to your coin if exchanges don't approve your request. You can not move your coin if your request is rejected by exchange.Consider to store your coins in non custodial wallet is smarter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 07, 2022, 10:13:10 PM",
      "body": "Voyagers Digital just filed their bankruptcy days after Three arrow capital filed their bankruptcy. Voyagers digital customer for sure is now worrying about their crypto inside that exchange, There were likely a chance that their crypto won't be given back or if they got refunded I think it won't be in full. When Voyagers temporary suspends withdrawal, I'm sure it serves a warning to the users of voyagers to take out all of their money cause something is wrong and every thing can happen on market like this. This is why we should never store our money into centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "July 07, 2022, 11:42:17 PM",
      "body": "They have filed for bankruptcy and what happens to those remaining funds from their customers? I've read the news that FTX/Alameda Research has a debt to Voyager of $377m. I guess that will be the compensation for those users that still has fund on Voyager after filing bankruptcy.--> https://decrypt.co/104570/sam-bankman-fried-alameda-research-bankrupt-voyager-377m",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 08, 2022, 04:18:07 AM",
      "body": "Quote from: boyptc on July 07, 2022, 11:42:17 PMThey have filed for bankruptcy and what happens to those remaining funds from their customers? When bankruptcy happens, you only can hope that you belong to customers who will get compensation. That is solely hope.In order to avoid panic (when crisis happens), uncertainty (when crisis is on-going and not handled) and hopeless hope (when bankruptcy occurs), avoid to store your coins on third party services. If you want to cash out, do it and withdraw your money as soon as possible.If you store your money on third party sites too long, and feel that you are completely safe based on their past reputation, that contains risk. Black swan events can kill any company and you can be one of victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 08, 2022, 07:05:02 AM",
      "body": "Yeah, why not, the market's really sucking these days for day to day transactions. Its not big deal for guy like me or those who are willing to just hodl until market clears the current fog. With the time situation either will worsen even more or it may just diminish and start over with new prices. However, the firms like in the OP really needs to sustain themselves in the current market. Some of them will either lay off the employees, some of them might strip down the salaries and most of them are halting the transaction. The tension is rising on the both sides really: user and provider.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 08, 2022, 08:00:35 AM",
      "body": "Quote from: tranthidung on July 08, 2022, 04:18:07 AMQuote from: boyptc on July 07, 2022, 11:42:17 PMThey have filed for bankruptcy and what happens to those remaining funds from their customers? When bankruptcy happens, you only can hope that you belong to customers who will get compensation. That is solely hope.In order to avoid panic (when crisis happens), uncertainty (when crisis is on-going and not handled) and hopeless hope (when bankruptcy occurs), avoid to store your coins on third party services. If you want to cash out, do it and withdraw your money as soon as possible.If you store your money on third party sites too long, and feel that you are completely safe based on their past reputation, that contains risk. Black swan events can kill any company and you can be one of victims.Not all who are involved in crypto understand that the risk of storing their funds in third parties for any form of trading, staking, or investment is the risk bigger more than to gain profits, becuase seeing their assets increase every day is more tempting than keeping them long-term in their own wallet.Reading this bankruptcy news doesn't seem to be over, maybe there will be something more surprising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 08, 2022, 08:53:02 AM",
      "body": "A former investment manager at Celsius Network sued the crypto lender on Thursday, saying it used customer deposits to rig the price of its own crypto token and failed to properly hedge risk, causing it to freeze customer assets.The complaint said Celsius ran a Ponzi scheme to benefit itself through \"gross mismanagement of customer deposits,\" and defrauded the plaintiff KeyFi Inc, run by the former manager Jason Stone, into providing services worth millions of dollars and refusing to pay for them.Source --> https://www.livemint.com/news/world/troubled-crypto-lender-celsius-network-accused-of-fraud-in-a-lawsuit-11657262744331.htmlSource: https://twitter.com/WatcherGuru/status/1545093851492208640If this were the case, Voyager Digital Ltd would be in a worse position in terms of financial management.Withdrawal may remain frozen for a while even if they manage to pay off some of the debts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}