{
  "id": "topic_5468174",
  "title": "joker1313",
  "author": "joker1313",
  "created_time": "September 26, 2023, 02:01:43 PM",
  "content": "So we all know how regular traders pumped up the gamestop prices to exponential prices. And major shorts were squeezed and a lot of hedge funds lost money in it.I was thinking how about we all make up a community for crypto and maybe try such thing ? We all say that whales are manipulating the markets but we are not doing anything to tackle them.  Look at the prices they keeping it so tight right now that even stocks are more volatile than crypto. Why not eat the rich in crypto ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468174",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 26, 2023, 03:37:15 PM",
      "body": "Because 99% of the people saying that the \"whales are manipulating the markets\" has no basis at all and are just saying that so they have someone to blame for their bad trades.Also, do we even have proof of a hedge fund shorting bitcoin with huge amounts of money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "September 26, 2023, 04:16:41 PM",
      "body": "Quote from: joker1313 on September 26, 2023, 02:01:43 PMI was thinking how about we all make up a community for crypto and maybe try such thing ? We all say that whales are manipulating the markets but we are not doing anything to tackle them. Only strict monitoring and regulations and high capitalization/liquidity can do this. Do we have the power? No.Quote from: mk4 on September 26, 2023, 03:37:15 PMBecause 99% of the people saying that the \"whales are manipulating the markets\" has no basis at all and are just saying that so they have someone to blame for their bad trades.Also, do we even have proof of a hedge fund shorting bitcoin with huge amounts of money?The proof you are seeking is one big reason why there might be law indeed but there mightn't be justice. And it's highly unfortunate that people tend to defend injustice due to ignorance and naivety.My years of trading show clearly that the market is manipulatable, and with evidence, some makers had been sanctioned in the past. This takes me to the crypto market, why not? In this highly unregulated market, if more regulated ones could still be caught in such an act, you don't need a soothsayer before knowing that it happens. To manipulate Bitcoin can't be attractive much with the current capitalization, but I do wonder how some shitcoins indeed behave, and I don't need proof that they are being manipulated due to their low liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "September 26, 2023, 07:49:10 PM",
      "body": "They could already be so many GameStop sagas in crypto that go unnoticed because they are not highly publicized, like it was gone with actual GameStop chaos. Maybe you are not yet in such groups/communities, but they do exist  We have seen people doing insider trading way before a token is listed in an exchange only for arrests to be made years later, so just be there's no news about it today doesn't mean it's not happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "September 26, 2023, 08:10:42 PM",
      "body": "Quote from: joker1313 on September 26, 2023, 02:01:43 PMI was thinking how about we all make up a community for crypto and maybe try such thing ? We all say that whales are manipulating the markets but we are not doing anything to tackle them. The Gamestop thing was only possible because of the big players getting reckless with overleveraged shorting. This means there were simply not enough stocks in circulation for the short-sellers to buy to close their position, effectively making them cash cows.This was not just a case of a bunch of people agreeing to pump up the price. Pump groups are a different story, are nothing new and always end up with those who came in late being dumped on and ending up in red.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "September 26, 2023, 08:32:57 PM",
      "body": "IIRC, there was also this call before by someone. Like it's just an attempt to do the same as gamestop retailers did. It's possible and doable but you can do this with small cap tokens that has no liquidity at all. It will get the other traders attention and that's how it's going to go.That's why we have this famous line on it called 'pump and dump'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "September 26, 2023, 08:59:43 PM",
      "body": "Whales don't trade manually, they have their systematic bot setup that takes care of the trades it executes, based on the algorithm given to it. There is no money that can beat whales because if we all can unite, so can they. And if the liquidity goes on the same side, then who will earn? Nobody, because you will just go with the flow and eat up the orders to spike up the price of a crypto but what if the order book does not get buying orders later then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "September 26, 2023, 10:43:20 PM",
      "body": "in gamestop saga i think its just clueless whales vs everyone here, it was happening so sudden, had the whales know beforehand what happened they surely could anticipate it.the thing is that, a whale have much more capital than many retailers out there, even if these retailers are uniting, whales could simply do the same thing.so i don't think its viable scenario.moreover, you know people are not that faithful when they see money, when you try to margin call those overly leveraged shorts from whale, you might need to pump the price high, meanwhile the other people that supposed to unite adding the buy demand could be dumping their assets and take profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "September 27, 2023, 02:51:22 AM",
      "body": "Quote from: mk4 on September 26, 2023, 03:37:15 PMBecause 99% of the people saying that the \"whales are manipulating the markets\" has no basis at all and are just saying that so they have someone to blame for their bad trades.They know whales are manipulating the market, scammers are creating new games to steal money from unwise investors like them but they ignore all risks and easily spend money in altcoin projects. They do it easily but unwisely because they are greedy and always want to find opportunities anywhere they can.They are not experienced enough to know great chances they see are actually big risks that will cause them very big losses. Whales manipulate market is not important and wise investors will not lose money by whale manipulation because they buy and hold, no leverage use, futures trading, hence they are safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 27, 2023, 04:06:41 AM",
      "body": "Yeah it’s possible, especially on any type of small or mid cap coins which have perp futures and are heavily shorted. It happened before on many occasions.GameStop was different because it was mostly extra leverage which was created by the market makers that printed those call options which were bought by the wall street bet investors. When the price went higher and higher they had to hedge by buying the shares which was in limited supply. Hence why it shot up so fast and blew out a few big players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2023, 04:14:46 AM",
      "body": "Quote from: EarnOnVictor on September 26, 2023, 04:16:41 PMThe proof you are seeking is one big reason why there might be law indeed but there mightn't be justice. And it's highly unfortunate that people tend to defend injustice due to ignorance and naivety.My years of trading show clearly that the market is manipulatable, and with evidence, some makers had been sanctioned in the past. This takes me to the crypto market, why not? In this highly unregulated market, if more regulated ones could still be caught in such an act, you don't need a soothsayer before knowing that it happens. To manipulate Bitcoin can't be attractive much with the current capitalization, but I do wonder how some shitcoins indeed behave, and I don't need proof that they are being manipulated due to their low liquidity.Of course I'm not referring to low marketcap shitcoins lol because that's easy as hell to manipulate.Bitcoin on the other hand, sure there are a lot of entities attempting to manipulate it. But the question is — in what manner? And how will you exploit the fact that they're trying to manipulate it? Exactly, we have little to no idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 27, 2023, 05:14:44 AM",
      "body": "Quote from: mk4 on September 26, 2023, 03:37:15 PMBecause 99% of the people saying that the \"whales are manipulating the markets\" has no basis at all and are just saying that so they have someone to blame for their bad trades.Also, do we even have proof of a hedge fund shorting bitcoin with huge amounts of money?It fully depends on what people understand as manipulation. For many coins (and especially alts) the majority of trading volume is coming from market makers who is using MM bots in order to keep the price in specified range and making buy and sell walls which normal traders are unable to break.Also, the support and resistance is usually broken on very large trade volumes which also indicates that major price changes are happening due to whale orders.And yes, some of the market makers are hunting stop losses. This is why it is better to set a larger SL if you trade altcoin futures. But generally, this is not a big problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker1313",
      "created_time": "September 27, 2023, 12:03:27 PM",
      "body": "Quote from: mk4 on September 26, 2023, 03:37:15 PMBecause 99% of the people saying that the \"whales are manipulating the markets\" has no basis at all and are just saying that so they have someone to blame for their bad trades.Also, do we even have proof of a hedge fund shorting bitcoin with huge amounts of money?Buddy have u seen the charts from march ?? you still think market is not manipulated ?? bitcoin volatility is worst than stocks right now. and you still need proof ?? no one is blaming anyone for bad trades. its just clearly seen the market is manipulated by big players for their benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 27, 2023, 03:54:46 PM",
      "body": "Make a community for crypto? Are you not aware where you are right now?  I mean if we could have done it, we would have done it already but we can't and that is why we don't. The reason why we are not doing it is not the fact that nobody thought about it before, its because nobody managed to do it before. To do what you think we could do, we would need a lot of people all putting their money and not selling for a while, and we can't have that all coordinated.But, we also have bull periods where it is exactly what you say that happens, we all end up buying and we all end up holding until the crash, which to be fair gamestop had as well because it eventually crashed to a point where its not nearly as high as it used to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2023, 05:55:27 PM",
      "body": "Quote from: joker1313 on September 27, 2023, 12:03:27 PMBuddy have u seen the charts from march ?? you still think market is not manipulated ?? bitcoin volatility is worst than stocks right now. and you still need proof ?? no one is blaming anyone for bad trades. its just clearly seen the market is manipulated by big players for their benefits.Volatility doesn't automatically mean manipulation.But sure, I'm not saying that bitcoin is NOT getting manipulated; but tell me specifically how it's being manipulated because you seem too sure that the volatility was indeed caused by manipulation. I'll wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker1313",
      "created_time": "September 28, 2023, 06:33:08 AM",
      "body": "Quote from: mk4 on September 27, 2023, 05:55:27 PMQuote from: joker1313 on September 27, 2023, 12:03:27 PMBuddy have u seen the charts from march ?? you still think market is not manipulated ?? bitcoin volatility is worst than stocks right now. and you still need proof ?? no one is blaming anyone for bad trades. its just clearly seen the market is manipulated by big players for their benefits.Volatility doesn't automatically mean manipulation.But sure, I'm not saying that bitcoin is NOT getting manipulated; but tell me specifically how it's being manipulated because you seem too sure that the volatility was indeed caused by manipulation. I'll wait.i really dont need to explain it. just see the price action n you will see its totally manipulated. and now after all this ETF news i guess it will be same like stocks now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "September 28, 2023, 12:29:46 PM",
      "body": "Quote from: joker1313 on September 26, 2023, 02:01:43 PMSo we all know how regular traders pumped up the gamestop prices to exponential prices. And major shorts were squeezed and a lot of hedge funds lost money in it.I was thinking how about we all make up a community for crypto and maybe try such thing ? We all say that whales are manipulating the markets but we are not doing anything to tackle them.  Look at the prices they keeping it so tight right now that even stocks are more volatile than crypto. Why not eat the rich in crypto ?    Have you seen any changes despite the lowkey attention crypto is getting since we entered bear market, the crypto trading market is now a competition between whales short and long squeeze of each other just to liquidate each other and get money from each other. Sometimes, when things are happened that are either beneficial or detrimental to the market, it's always the whales thy are always push the narrative to the mainstream just to induce fear or fomo among people, this is how squeeze attacks happen everytime.How do we manage this? It's only through tight regulations!However, how many people are ready to allow crypto to be regulated? I'm of the opinion NO!We want Defi at full force, enough of the middle men in traditional market, we need such thing here because if crypto becomes regulated, we might not enjoy it as we used to, don't be surprised if they one day canceled out event like bitcoin halving and some anniversary that are been celebrated. Regulations will not do crypto any good but more harms.But if they can probe centralized exchanges of users that do these manipulations, they can be easily fetch out if they conduct proper investigations, after all whales used centralized exchanges the most for the attacks and manipulation of the market but Binance and others will close their eyes as if nothing is really happening in the exchange, don't be surprised that centralized exchanges coordinate most of the attacks we see as whale manipulation because they control almost cryptos in circulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FanEagle",
      "created_time": "September 29, 2023, 06:28:34 PM",
      "body": "For those who are not aware what happened, there was a bad company that was about to bankrupt and should have been bankrupted by now, it was a game company that sold games on cd's like it was 20 years ago, and nobody used that anymore because they used places like steam and so forth, so gamestop was doomed to bankrupt. This made big banks and so forth realize that they could just short it, which was still weird considering there shouldn't even be any place that accepted shorting gamestop, it was that bad.However, some internet trolls ended up \"saving it\" for a while, it is still going to bankrupt, and plenty of people will lose all their money, but because they managed to make some profit for some people, they thought it was a good move. I really hope it doesn't happen in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "October 01, 2023, 09:45:52 AM",
      "body": "Quote from: joker1313 on September 26, 2023, 02:01:43 PMSo we all know how regular traders pumped up the gamestop prices to exponential prices. And major shorts were squeezed and a lot of hedge funds lost money in it.I was thinking how about we all make up a community for crypto and maybe try such thing ? We all say that whales are manipulating the markets but we are not doing anything to tackle them.  Look at the prices they keeping it so tight right now that even stocks are more volatile than crypto. Why not eat the rich in crypto ?    The whole idea behind the Gamestop trade was that there were big Hedge Funds that shorted the stock in large quantities. It even went so far that traders expected the short positions to be larger than the actual number stocks available. So, if the Hedge Funds were forced to liquidate their positions and buy back all the stocks in the market, there wouldn't even be enough to close out positions. Which would lead to huge losses for the Hedge Funds and high profits for any stock holder. It was a story where the small-time investor from home could take on the professional traders on Wall Street. It seems questionable if a similar situation could occur in the crypto world, because I don't think there are such large short positions in crypto coins. To be able to create so many short positions it needs a big infrastructure, a few exchanges alone wouldn't be able to create such a large number of positions. It would also be questionable if the exchange is willing to give out more shorts than long positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btctodamon",
      "created_time": "October 01, 2023, 10:22:51 AM",
      "body": "Quote from: joker1313 on September 26, 2023, 02:01:43 PMSo we all know how regular traders pumped up the gamestop prices to exponential prices. And major shorts were squeezed and a lot of hedge funds lost money in it.I was thinking how about we all make up a community for crypto and maybe try such thing ? We all say that whales are manipulating the markets but we are not doing anything to tackle them.  Look at the prices they keeping it so tight right now that even stocks are more volatile than crypto. Why not eat the rich in crypto ?    It is possible to create similar scenarios in the cryptocurrency market, where a group of individuals collaborates to drive up the price of a particular cryptocurrency. In fact, there have been instances of so-called \"pump and dump\" schemes in the crypto space, where a group artificially inflates the price of a cryptocurrency, typically a low-cap or lesser-known coin, and then sells off their holdings at the inflated price, leaving other investors with significant losses.However, it's essential to understand that such activities can be illegal and are often considered market manipulation. Regulatory bodies in many countries have rules and regulations in place to prevent and punish market manipulation and fraud in both traditional financial markets and the cryptocurrency space",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}