{
  "id": "topic_5404374",
  "title": "franch",
  "author": "franch",
  "created_time": "June 28, 2022, 02:45:38 PM",
  "content": "Ünlü yatırımcı ve yazar, yakın gelecek için Bitcoin planlarından bahsetti. “Rich Dad, Poor Dad”in yazarı ve Bitcoin yatırımcısı Robert Kiyosaki, yakın gelecekte BTC fiyatıyla ilgili yeni planlarını dile getirdi. Kiyosaki, kazananların hatalarından ders çıkardığını söyleyerek “kazananlar ve kaybedenler” hakkında bir tweet attı. Kiyosaki, lider kripto para birimi Bitcoin’in 1100 doları test etmesini beklediğini söyledi. Kiyosaki bu aşamadan sonra BTC’nin toparlanması halinde daha fazla alım yapacağını ifade etti. Ayrıca Kiyosaki için dipten satın almak için başka bir seçenek de, “kaybedenler” dediği “zayıf ellerin” teslim olmasını beklemek.Kaynak: https://www.coinkolik.com/robert-kiyosaki-bitcoinin-1100-dolari-test-etmesini-bekliyorum/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404374",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "June 29, 2022, 06:42:16 AM",
      "body": "nasıl ki, finansal araçların doğasında balonlaşma bir mecburiyet haline gelmişse; popüler insanların fikrlerinde de balonlaşma benzeri şeylerin neredeyse bir mecburiyet haline gelmiş olduğunu gözlemliyorum... tabii, bu adamların fikirlerindeki balonlaşma \"saçmalama seviyesini bir hayli aşmış olduğu için\" finansal araçlardaki balonlaşmadan daha bariz ve daha belirgin bir seviyeye ulaşmış oluyor. :) eğer arkadaşımız bitcoin'de bu denli sürpriz sayılabilecek fiyatları bekliyorsa bu beklentisini daha nesnel ve daha somut argümanlarla desteklemeli. bence sırf popüler biri olduğu için aklına geleni fütursuzca söylememeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redhack",
      "created_time": "July 01, 2022, 01:28:28 AM",
      "body": "Fazla sallamış 11000 dolar dese inanan çıkardı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 01, 2022, 03:55:33 AM",
      "body": "Quote from: redhack on July 01, 2022, 01:28:28 AMFazla sallamış 11000 dolar dese inanan çıkardı.Belki de 11 bin dolar diyecekti bir sıfır yanlış söyledi  Aslında 1100 dolara gelirse ki ben sanmıyorum geleceğini bir çok insan bitcoini almak için yarışacak. çünkü yarılanmalar ortada zorluk ve maliyet hesaplarını da katarsak işin için 20 bin bile düşük kalıyor şu an.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spack17",
      "created_time": "July 02, 2022, 12:00:14 AM",
      "body": "ben de biraz daha düşeceğini düşünüyorum bitcoinin. Ancak bu değer 1100 dolar değil. 10 bin dolar değerinin altına düşeceğini pek düşünmüyorum. Dipten almak isteyen kişiler 13 bin dolar seviyelerinden rahatlıkla alabilirler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jorgesalcedo",
      "created_time": "July 02, 2022, 08:26:19 AM",
      "body": "Bitcoin’in buralardan dönmesini kimse beklemiyor, bir miktar geriye çekilme daha göreceğiz gibi ama 1100 dolar görülürse marketin toparlanması daha önceki buhranlar kadar kolay olmayabilir. Yeni maliyetlenmeler oldukça yukarı sürmeyecekler bundan dolayı iyice bıktırması gerekiyor yatırımcıları balinaların ve bunun için aceleleri de yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 02, 2022, 12:04:29 PM",
      "body": "yahu bu salozu ciddiye alan var mı? zengin baba, fakir baba kitabının yazarı olarak etrafta dolaşıyor. özellikle finans hakkında bilgisi olmayıp sadece bu herifin kitabını okuyan insanlar tarafından ilah sınfına ulaşmış bir tip. bitcoin 1.100 dolara gelir ya da gelmez fark etmez sadece bu tip şarlatanları ciddiye almayın yeter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero1111",
      "created_time": "July 02, 2022, 01:18:43 PM",
      "body": "Ben kendime karamsar derdim piyasa tahmini için ama adam resmen gömmüş bitcoin fiyatını 1100 dolar nedir ya , hadi eth için veya diğerleri için bu kadar düşüşün olmasını olası karşılarsın geçmiş deneyimler ile fakat btc amiral gemi ve her hangi bir sistemsel sıkıntı yaşamadığı sürece 1100 dolarlara sarkması imkansız .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}