{
  "id": "topic_5408112",
  "title": "BlokBro",
  "author": "BlokBro",
  "created_time": "July 30, 2022, 04:24:19 AM",
  "content": "Blokbro ist die erste Plattform zur Überprüfung der Kryptowährungsadresse, die eine Identifizierung für private Benutzer oder Unternehmen ermöglicht. Jeder kann kostenlos nach verifizierten Adressen über IDaddress suchen und Anrufe über APIs tätigen, um die Suche in seine Systeme zu integrieren. Benutzer, die sich registrieren und Adressen verifizieren, können bei jeder Transaktion Prämien bei BLKB sammeln.Weitere Informationen finden Sie auf unserer Website: https://blokbro.comTelegram https://t.me/BLKB_Blokbrotwitter https://twitter.com/BLKB_BLKBExplorer-Token https://bscscan.com/token/0xd83a442e2d0bdf3af4260ff020d48d8fda10f5f9",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408112",
  "comments": [
    {
      "author": "Lafu",
      "created_time": "July 30, 2022, 10:03:30 AMLast edit: July 30, 2022, 04:36:48 PM by Lafu",
      "body": "Warum sollte ich meine Kryptowährungsadressen oder adresse Verifizieren bei einer Plattform ?Das ist ja eigentlich das gute an der Blockchain das man zwar die Transaktionen alle einsehen kann aber man denoch eine anonymität hat.Dies wäre ja dann vorbei wenn man sich Verifiziert und seine ganzen sachen preis gibt , mag eventuell gut für exchanges sein aber nicht für den normal verbraucher.Ist irgendwie genau das gegenteil was Bitcoin eigentlich sein sollte , eine 3rd Party die dann weis was jede Verifiziert adresse und person dann macht , Nein Danke ! Sollte demnach auch in Altcoins verschoben werden da es sich eher um werbung für den Token dreht.Edit:Und ich habe auch was sehr interessantes gefunden (werde ich später vorlegen)Edit 2:@mole0815 bitte diesen Thread nicht löschen , da kommt noch was wichtiges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "July 30, 2022, 01:06:06 PM",
      "body": "Thread wurde hiermit verschoben BlokBro. Den Sinn hinter dem Projekt habe ich noch nicht ganz verstanden aber das kann ja noch geklärt werden",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "July 30, 2022, 04:33:57 PM",
      "body": "Quote from: Lafu on July 30, 2022, 10:03:30 AMWarum sollte ich meine Kryptowährungsadressen oder adresse Verifizieren bei einer Plattform ?Das ist ja eigentlich das gute an der Blockchain das man zwar die Transaktionen alle einsehen kann aber man denoch eine anonymität hat.Dies wäre ja dann vorbei wenn man sich Verifiziert und seine ganzen sachen preis gibt , mag eventuell gut für exchanges sein aber nicht für den normal verbraucher.Ist irgendwie genau das gegenteil was Bitcoin eigentlich sein sollte , eine 3rd Party die dann weis was jede Verifiziert adresse und person dann macht , Nein Danke ! Sollte demnach auch in Altcoins verschoben werden da es sich eher um werbung für den Token dreht.Edit:Und ich habe auch was sehr interessantes gefunden (werde ich später vorlegen)Ich bin nicht hier, um den Token zu veröffentlichen, sondern um einen anderen Service und ein anderes Konzept für die Frage der Identitätsprüfung zu bieten. Der Excheng weiß bereits, wem er address gehört, seit Sie das Portfolio über sie erstellen , und mit den neuen euroee-Richtlinien sind sie verpflichtet, die Daten an Dritte weiterzugeben. Ich zwinge niemanden, die Daten auf Blokbro zu überprüfen. Es ist alles gut, bis Sie betrogen werden oder Sie Ihre Kryptowährungen mit Betrug stehlen. Wenn ein Benutzer, der Kryptos sendet, weiß, dass es verifiziert ist, bedeutet dies nicht, dass Sie Ihre Daten verschenken, da standardmäßig nur Vor- und Nachname angezeigt werden, sondern es bedeutet, dass Sie sicher sind, an wen Sie Ihre Kryptos senden. Dieses Konzept wird am besten für diejenigen verstanden, die Kryptos außerhalb des Handels verwenden. Im Jahr 2020 sind Ecommerc-Scam-Betrügereien um 1500% gestiegen, weil Hacker Websites geklont und ihre Address eingegeben haben. Die Opfer dachten unwissentlich daran, ein Produkt oder eine Dienstleistung zu kaufen, stattdessen wurden sie ausgetrickst.  Dies würde die Sicherheit Ihrer Transaktionen erhöhen, da Hacker und Betrüger davon fernbleiben würden und Sie auch sicher wissen, an wen Sie Ihre Kryptos senden, um Fehler zu vermeiden.   Was Sie sagen, dass \" gut für den Handel wäre und nicht für den Verbraucher \" ist in der Tat im Gegenteil, dass es der Verbraucher ist, der Krypto im Handel verwendet, der betroffen sein wird, Ich tausche nicht mit Ihnen, denn wenn Sie ein solches System einführen, werden viele Leute es wegen Ihrer Argumentation verlassen. Eines Tages haben address bisongo überprüft zu werden. .; es ändert mich nicht im geringsten, ob Sie mir glauben oder nicht, ich bin nicht hier, Sie zu überzeugen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwk",
      "created_time": "July 30, 2022, 04:44:00 PM",
      "body": "Quote from: BlokBro on July 30, 2022, 04:33:57 PMich bin nicht hier, Sie zu überzeugen.Ich bin nicht hier, um Ihren Google-Translate-Unsinn zu widerlegen, deshalb erlaube ich mir, das in einem Wort zusammenzufassen:Bullshit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "July 30, 2022, 05:50:37 PM",
      "body": "Und wer noch mehr erfahren will was ich gefunden habe der kann gerne hier mal schauen : https://bitcointalk.org/index.php?topic=5408164.0Leider etwas zu spät gefunden aber lieber zu spät als niemals , habe es mir daher erlaubt einen Topic zu eröffnen in Scam Accusations.Denke das dies ein anderes Licht auf die sache wirft.Hoffe mole0815 lässt diesen thread als warnung bestehen oder zumindest als hinweis.Quote from: qwk on July 30, 2022, 04:44:00 PMIch bin nicht hier, um Ihren Google-Translate-Unsinn zu widerlegen, deshalb erlaube ich mir, das in einem Wort zusammenzufassen:Bullshit. Sehr schön und richtig ausgedrückt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "July 30, 2022, 07:10:58 PMLast edit: August 01, 2022, 12:25:18 PM by mole0815",
      "body": "Quote from: qwk on July 30, 2022, 04:44:00 PMQuote from: BlokBro on July 30, 2022, 04:33:57 PMich bin nicht hier, Sie zu überzeugen.Ich bin nicht hier, um Ihren Google-Translate-Unsinn zu widerlegen, deshalb erlaube ich mir, das in einem Wort zusammenzufassen:Bullshit. Entschuldigung, aber ich weiß nicht ganz Deutsch Der Begriff  \" Ich bin nicht hier, um Sie zu überzeugen \" war für die Frage der verschiedenen Ideen gedacht, in dem Sinne, dass ich Ihre Ideen voll und ganz respektiere, in Bezug auf den für Betrug zitierten Link werde ich antworten und fragen, wo das Problem ist...Ich habe auf den Link der Betrugsvorwürfe geantwortet und privat an @Lafu und mole0815 geschrieben. Ich erwarte Antworten zu diesem Thema. Entschuldigung, da ich auf Deutsch schreibe.[merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 30, 2022, 10:07:35 PMLast edit: July 30, 2022, 11:02:34 PM by 1miau",
      "body": "Abgesehen vom Sinn, seine privaten Blockchaintransaktionen bei einem marginal seriösen Drittunternehmen \"verifizieren\" zu lassen und im Gegenzug wertlose Shittokens zu erhalten, ist der Vorwurf von Lafu halt schon korrekt, dass das Whitepaper Plagiate enthält und das nicht zu knapp. Quote from: BlokBro on July 30, 2022, 04:33:57 PMDer Excheng weiß bereits, wem er address gehört...... und mit den neuen euroee-Richtlinien sind sie verpflichtet, die Daten an Dritte weiterzugeben.Nur weil der \"Excheng\" bestimmte Addressen zuordnen kann, heißt das nicht, dass man jedem semi-seriösen Quacksalber da draußen seine Blockchain-Daten geben muss. Ein bisschen seltsam eurer Geschäftsmodell.  Kann mir nicht vorstellen, warum jemand euren überaus schlechten Deal annehmen sollte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "July 30, 2022, 10:52:23 PM",
      "body": "Quote from: 1miau on July 30, 2022, 10:07:35 PMAbgesehen vom Sinn, seine privaten Blockchaintransaktionen bei einem marginal seriösen Drittunternehmen \"verifizieren\" zu lassen und im Gegenzug wertlose Shittokens zu erhalten, ist der Vorwurf von Lafu halt schon korrekt, dass das Whitepaper Plagiate enthält und das nicht zu knapp. Quote from: BlokBro on July 30, 2022, 04:33:57 PMDer Excheng weiß bereits, wem er address gehört...... und mit den neuen euroee-Richtlinien sind sie verpflichtet, die Daten an Dritte weiterzugeben.Nur weil der \"Excheng\" bestimmte Addressen zuordnen kann, heißt das nicht, dass man jedem semi-seriösen Quacksalber da draußen seine Blockchain-Daten geben muss. Ein bisschen selbsam eurer Geschäftsmodell.  Kann mir nicht vorstellen, warum jemand euren überaus schlechten Deal annehmen sollte.  Sehen Sie, dass Sie nichts über das Verifizierungssystem verstanden haben. Sie sind gut darin, Sie des Betrugs zu beschuldigen. Das Verifizierungssystem fragt nicht nach den Daten Ihrer Crypto-Brieftasche und nicht einmal nach den in der Blockchain vorhandenen Daten. Mit der in Blobro vorhandenen KYC-Verifizierung verknüpfen wir sie mit Ihrer Adresse. Und wie verknüpfen wir Ihre Identität mit der Adresse? In der KYC-Überprüfung gibt es einen Abschnitt, in dem Sie eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse. Ich bin froh, dass Sie es nutzlos finden ... für mich ist es schon ein Anfang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 30, 2022, 11:08:44 PM",
      "body": "Quote from: BlokBro on July 30, 2022, 10:52:23 PMQuote from: 1miau on July 30, 2022, 10:07:35 PMAbgesehen vom Sinn, seine privaten Blockchaintransaktionen bei einem marginal seriösen Drittunternehmen \"verifizieren\" zu lassen und im Gegenzug wertlose Shittokens zu erhalten, ist der Vorwurf von Lafu halt schon korrekt, dass das Whitepaper Plagiate enthält und das nicht zu knapp. Quote from: BlokBro on July 30, 2022, 04:33:57 PMDer Excheng weiß bereits, wem er address gehört...... und mit den neuen euroee-Richtlinien sind sie verpflichtet, die Daten an Dritte weiterzugeben.Nur weil der \"Excheng\" bestimmte Addressen zuordnen kann, heißt das nicht, dass man jedem semi-seriösen Quacksalber da draußen seine Blockchain-Daten geben muss. Ein bisschen selbsam eurer Geschäftsmodell.  Kann mir nicht vorstellen, warum jemand euren überaus schlechten Deal annehmen sollte.  Sehen Sie, dass Sie nichts über das Verifizierungssystem verstanden haben. Euer Verifizierungssystem ist unnötig und jeder, der etwas Ahnung hat, wird es meiden. Quote from: BlokBro on July 30, 2022, 04:33:57 PMSie sind gut darin, Sie des Betrugs zu beschuldigen. Ich habe euch (noch) nicht des Betrugs beschuldigt. Quote from: BlokBro on July 30, 2022, 04:33:57 PMDas Verifizierungssystem fragt nicht nach den Daten Ihrer Crypto-Brieftasche und nicht einmal nach den in der Blockchain vorhandenen Daten. Mit der in Blobro vorhandenen KYC-Verifizierung verknüpfen wir sie mit Ihrer Adresse. Meinst du wirklich irgend jemand, der noch ganz bei Sinnen ist, wird bei eurer Klitsche ein KYC machen?  Quote from: BlokBro on July 30, 2022, 04:33:57 PMUnd wie verknüpfen wir Ihre Identität mit der Adresse? In der KYC-Überprüfung gibt es einen Abschnitt, in dem Sie eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse. Ja viel Spaß beim Finden von Deppen, die das nutzen.  Vllt gleich die persönlichen Daten dem Hacker im Darkent verkaufen?  Hast dir jedenfalls jetzt meinen negativen Trust verdient für die Kombination der folgenden Vergehen: - offensichtliche Plagiate- fragwürdiges Geschäftsmodell mit vielen roten Flaggen- nutzloser Shittoken- Gefahr für die Privatsphäre- Drohungen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "July 30, 2022, 11:12:10 PM",
      "body": "Quote from: 1miau on July 30, 2022, 11:08:44 PMQuote from: BlokBro on July 30, 2022, 10:52:23 PMQuote from: 1miau on July 30, 2022, 10:07:35 PMAbgesehen vom Sinn, seine privaten Blockchaintransaktionen bei einem marginal seriösen Drittunternehmen \"verifizieren\" zu lassen und im Gegenzug wertlose Shittokens zu erhalten, ist der Vorwurf von Lafu halt schon korrekt, dass das Whitepaper Plagiate enthält und das nicht zu knapp. Quote from: BlokBro on July 30, 2022, 04:33:57 PMDer Excheng weiß bereits, wem er address gehört...... und mit den neuen euroee-Richtlinien sind sie verpflichtet, die Daten an Dritte weiterzugeben.Nur weil der \"Excheng\" bestimmte Addressen zuordnen kann, heißt das nicht, dass man jedem semi-seriösen Quacksalber da draußen seine Blockchain-Daten geben muss. Ein bisschen selbsam eurer Geschäftsmodell.  Kann mir nicht vorstellen, warum jemand euren überaus schlechten Deal annehmen sollte.  Sehen Sie, dass Sie nichts über das Verifizierungssystem verstanden haben. Euer Verifizierungssystem ist unnötig und jeder, der etwas Ahnung hat, wird es meiden. Quote from: BlokBro on July 30, 2022, 04:33:57 PMSie sind gut darin, Sie des Betrugs zu beschuldigen. Ich habe euch (noch) nicht des Betrugs beschuldigt. Quote from: BlokBro on July 30, 2022, 04:33:57 PMDas Verifizierungssystem fragt nicht nach den Daten Ihrer Crypto-Brieftasche und nicht einmal nach den in der Blockchain vorhandenen Daten. Mit der in Blobro vorhandenen KYC-Verifizierung verknüpfen wir sie mit Ihrer Adresse. Meinst du wirklich irgend jemand, der noch ganz bei Sinnen ist, wird bei eurer Klitsche ein KYC machen?  Quote from: BlokBro on July 30, 2022, 04:33:57 PMUnd wie verknüpfen wir Ihre Identität mit der Adresse? In der KYC-Überprüfung gibt es einen Abschnitt, in dem Sie eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse. Ja viel Spaß beim Finden von Deppen, die das nutzen.  Vllt gleich die persönlichen Daten dem Hacker im Darkent verkaufen?  Hast dir jedenfalls jetzt meinen negativen Trust verdient für die Kombination der folgenden Vergehen: - offensichtliche Plagiate- fragwürdiges Geschäftsmodell mit vielen roten Flaggen- nutzloser Shittoken- Gefahr für die Privatsphäre- DrohungenGut im Anklagen ohne konkrete Beweise. Gutes Leben",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "July 31, 2022, 06:31:06 AMLast edit: July 31, 2022, 10:51:10 AM by MinoRaiola",
      "body": "Quote from: BlokBro on July 30, 2022, 10:52:23 PMDas Verifizierungssystem fragt nicht nach den Daten Ihrer Crypto-Brieftasche und nicht einmal nach den in der Blockchain vorhandenen Daten. Mit der in Blobro vorhandenen KYC-Verifizierung verknüpfen wir sie mit Ihrer Adresse. Und wie verknüpfen wir Ihre Identität mit der Adresse? In der KYC-Überprüfung gibt es einen Abschnitt, in dem Sie eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse. Ich bin froh, dass Sie es nutzlos finden ... für mich ist es schon ein Anfang.Das Wort Verifizierung ist bei vielen nicht gewollt. Wenn ich mir ab und zu DSGVO und Cookie Notifikation Stats ansehe, dann werden Nutzer immer abtrünniger. Es möchte „pauschal gesagt“ keiner messbar sein, oder greifbar. Man möchte selbst entscheiden, was man weitestgehend anonym machen kann/darf. Mit dem Service wird es schwer und gerade in Krypto nochmal ein Tick mehr. Quote from: BlokBro on July 30, 2022, 10:52:23 PMIch bin froh, dass Sie es nutzlos finden ... für mich ist es schon ein Anfang.Als Anbieter sollte man doch nicht froh sein, wenn es jemand nutzlos findet. Ich wünsche viel Erfolg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "July 31, 2022, 08:40:58 AM",
      "body": "Quote from: BlokBro on July 30, 2022, 10:52:23 PM..eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse.Das is so ein Punkt, den ich bei diesem \"Service\" echt nich verstehe.Ihr verknüpft die Identität mit EINER Adresse.Gängige Praxis bei Bitcoin-Transaktionen sollte doch sein, für jede Transaktion ne neue Adresse zu erstellen.Nun mag es für den Betreiber ja sinnvoll profitabel sein, wenn die Nutzer Opfer für jede Transaktion erstmal ne Vorab-Verifikations-Transaktion von ungefähr 1 USD an ihn durchführen, aber so wirklich praktikabel is das doch wohl eher nich.Aber vielleicht liegt das auch an mir und ich hab das Konzept einfach nich verstanden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullCoiner",
      "created_time": "July 31, 2022, 09:49:34 AM",
      "body": "Ich sammle eure Identitäten für $0,50 USD! Ach verdammt, What's App, Google und Co. sind noch billiger...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "July 31, 2022, 05:59:31 PMLast edit: August 01, 2022, 12:27:24 PM by mole0815",
      "body": "Quote from: MinoRaiola on July 31, 2022, 06:31:06 AMQuote from: BlokBro on July 30, 2022, 10:52:23 PMDas Verifizierungssystem fragt nicht nach den Daten Ihrer Crypto-Brieftasche und nicht einmal nach den in der Blockchain vorhandenen Daten. Mit der in Blobro vorhandenen KYC-Verifizierung verknüpfen wir sie mit Ihrer Adresse. Und wie verknüpfen wir Ihre Identität mit der Adresse? In der KYC-Überprüfung gibt es einen Abschnitt, in dem Sie eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse. Ich bin froh, dass Sie es nutzlos finden ... für mich ist es schon ein Anfang.Das Wort Verifizierung ist bei vielen nicht gewollt. Wenn ich mir ab und zu DSGVO und Cookie Notifikation Stats ansehe, dann werden Nutzer immer abtrünniger. Es möchte „pauschal gesagt“ keiner messbar sein, oder greifbar. Man möchte selbst entscheiden, was man weitestgehend anonym machen kann/darf. Mit dem Service wird es schwer und gerade in Krypto nochmal ein Tick mehr. Quote from: BlokBro on July 30, 2022, 10:52:23 PMIch bin froh, dass Sie es nutzlos finden ... für mich ist es schon ein Anfang.Als Anbieter sollte man doch nicht froh sein, wenn es jemand nutzlos findet. Ich wünsche viel Erfolg. Ich weiß, und ich weiß auch, dass die Anwendung gegen alle geht ... meine Überlegungen sind damit geendet, warum viele Menschen und Unternehmen Kryptowährungen nicht als Tauschmittel für ihre realen Geschäfte verwenden wollen. Das Ergebnis der Antworten hängt von der Volatilität, der Geschwindigkeit der Transaktionen und der Sicherheit ab, wer genau die Kryptowährungen erhält. Für die Volatilität kann ein Unternehmen eine Brieftasche verwenden, die bei jeder Transaktion einen sofortigen Währungsumtausch durchführt und so Preisschwankungen vermeidet. Die Geschwindigkeit der Transaktionen heutzutage mit Lightning Network, Börsen usw. Wir sind auf einem akzeptablen Niveau. Für die Sicherheit beim Senden der Zahlung an diesen Benutzer oder dieses Unternehmen gibt es in diesem Fall einen großen Fehler. Kein Händler würde ein Zahlungssystem verwenden, das seinen Käufern nicht garantieren könnte, dass diese Kryptowährungen sie direkt erreichen würden ... es gab und wird immer noch zu viele Betrügereien um diesen Fehler geben. Dann lässt die Anwendung Personen (die sie wollen) wissen, dass diese Adresse genau zu dieser Firma gehört. Die Suchanwendung kann über API auf jedem Wallet oder E-Commerce integriert werden. Kryptowährungen haben einen sehr kleinen Prozentsatz der realen Geschäfte eingenommen, und ich glaube, das ist ein echtes Hindernis. Vielleicht irre ich mich, aber die Anwendung ist jetzt verfügbar und nutzbar.Der Satz \"Ich bin froh, dass Sie es nutzlos finden ... für mich ist es ein Anfang\" ist, weil sie mich gestern dazu gebracht haben, die Kisten auf den Kopf zu stellen ... sie hatten Recht und ich diskutiere nicht darüber, aber ich diskutiere den Weg Sie benahm sich, ich gab sofort eine negative Bewertung ab und sagte der Öffentlichkeit, dass es am besten ist, Blokbro zu meiden. Wenn ich in meinem täglichen Geschäft auf ein Problem stoße, etikettiere ich eine Person nicht sofort, sondern frage sie zuerst nach der Motivation. Entschuldigung, wie schlecht ich auf Deutsch schreibeQuote from: lassdas on July 31, 2022, 08:40:58 AMQuote from: BlokBro on July 30, 2022, 10:52:23 PM..eine Transaktion mit einem Betrag in Höhe von ungefähr 1 USD durchführen können. Mit dieser Transaktion verknüpfen wir Ihre Identität mit dieser Adresse.Das is so ein Punkt, den ich bei diesem \"Service\" echt nich verstehe.Ihr verknüpft die Identität mit EINER Adresse.Gängige Praxis bei Bitcoin-Transaktionen sollte doch sein, für jede Transaktion ne neue Adresse zu erstellen.Nun mag es für den Betreiber ja sinnvoll profitabel sein, wenn die Nutzer Opfer für jede Transaktion erstmal ne Vorab-Verifikations-Transaktion von ungefähr 1 USD an ihn durchführen, aber so wirklich praktikabel is das doch wohl eher nich.Aber vielleicht liegt das auch an mir und ich hab das Konzept einfach nich verstanden.Jedes Mal eine 1-Dollar-Transaktion zur Verifizierung durchzuführen, ist nicht korrekt und unpraktisch. Diejenigen, die in der realen Welt Geschäfte machen, benötigen 1 oder 2 Adressen und dass sie verifiziert sind, um den Käufern die Gewissheit zu geben, dass die von ihnen gesendeten Kryptowährungen an sie gehen. Nehmen wir ein Beispiel: Sie möchten einen PC von einer italienischen Firma kaufen. Gehen Sie zu ihrer Website und beachten Sie, dass Sie mit crytpo kaufen können. Senden Sie die Kryptographie an die Adresse, die sie Ihnen gegeben haben, und anstatt an die italienische Firma zu gehen, gehen sie an Hacker, der die Seite geklont hat. (diese Dinge passieren jeden Tag und auch auf unterschiedliche Weise). Das Ergebnis ist, dass Sie wütend werden und das italienische Unternehmen Krypto nicht mehr verwendet. Wenn andererseits diese Adresse des Unternehmens über die Anforderungs-API sichtbar als verifiziert markiert ist oder selbst mit einem einfachen Klick, der Sie zu Blokbro im Bereich IDaddress weiterleitet, wissen Sie mit Sicherheit, dass diese Adresse verifiziert wurde und von Blokbro zertifiziert ist und daher die von Ihnen gesendeten Kryptowährungen sicher beim Händler ankommen.[merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "August 01, 2022, 03:51:06 AM",
      "body": "Quote from: BlokBro on July 31, 2022, 06:14:46 PM-snip-Sie möchten einen PC von einer italienischen Firma kaufen. Gehen Sie zu ihrer Website und beachten Sie, dass Sie mit crytpo kaufen können. Senden Sie die Kryptographie an die Adresse, die sie Ihnen gegeben haben, und anstatt an die italienische Firma zu gehen, gehen sie an Hacker, der die Seite geklont hat. (diese Dinge passieren jeden Tag und auch auf unterschiedliche Weise). Das Ergebnis ist, dass Sie wütend werden und das italienische Unternehmen Krypto nicht mehr verwendet. Wenn andererseits diese Adresse des Unternehmens über die Anforderungs-API sichtbar als verifiziert markiert ist oder selbst mit einem einfachen Klick, der Sie zu Blokbro im Bereich IDaddress weiterleitet, wissen Sie mit Sicherheit, dass diese Adresse verifiziert wurde und von Blokbro zertifiziert ist und daher die von Ihnen gesendeten Kryptowährungen sicher beim Händler ankommen.Dann dürfte das italienische Unternehmen aber auch keine EUR oder USD mehr akzeptieren, das passiert damit genauso. Gefakte Webseiten schaffen es letztendlich auch noch, den BlokBro Status der jeweiligen Adressen zu faken, dass diese Daten jemand konkret nachprüft wage ich zu bezweifeln, wenn doch, wäre derjenige auch nicht auf eine gefakte Webseite reingefallen. Ich sehe ehrlich den Sinn nicht hinter eurem System und führt sich für mich im Crypto-Bereich ziemlich nah an \"ad absurdum\". Euer Geschäftsmodell hingegen finde ich sehr gut, um 1 USD KYC-Daten zu bekommen ist sehr lukrativ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "August 01, 2022, 05:23:24 AM",
      "body": "Quote from: Lakai01 on August 01, 2022, 03:51:06 AMQuote from: BlokBro on July 31, 2022, 06:14:46 PM-snip-Sie möchten einen PC von einer italienischen Firma kaufen. Gehen Sie zu ihrer Website und beachten Sie, dass Sie mit crytpo kaufen können. Senden Sie die Kryptographie an die Adresse, die sie Ihnen gegeben haben, und anstatt an die italienische Firma zu gehen, gehen sie an Hacker, der die Seite geklont hat. (diese Dinge passieren jeden Tag und auch auf unterschiedliche Weise). Das Ergebnis ist, dass Sie wütend werden und das italienische Unternehmen Krypto nicht mehr verwendet. Wenn andererseits diese Adresse des Unternehmens über die Anforderungs-API sichtbar als verifiziert markiert ist oder selbst mit einem einfachen Klick, der Sie zu Blokbro im Bereich IDaddress weiterleitet, wissen Sie mit Sicherheit, dass diese Adresse verifiziert wurde und von Blokbro zertifiziert ist und daher die von Ihnen gesendeten Kryptowährungen sicher beim Händler ankommen.Dann dürfte das italienische Unternehmen aber auch keine EUR oder USD mehr akzeptieren, das passiert damit genauso. Gefakte Webseiten schaffen es letztendlich auch noch, den BlokBro Status der jeweiligen Adressen zu faken, dass diese Daten jemand konkret nachprüft wage ich zu bezweifeln, wenn doch, wäre derjenige auch nicht auf eine gefakte Webseite reingefallen. Ich sehe ehrlich den Sinn nicht hinter eurem System und führt sich für mich im Crypto-Bereich ziemlich nah an \"ad absurdum\". Euer Geschäftsmodell hingegen finde ich sehr gut, um 1 USD KYC-Daten zu bekommen ist sehr lukrativ. why couldn't the Italian company have access to its USD or EUR? .. it seems you don't know how crypto works (no offense). .. for the speech that the hacker clones the site: he will be able to clone it but if the buyer clicks to verify the address and is redirected to the blokbro page, he will see that it does not belong to the company ... and will understand that there is something strange. many times they send you addresses that do not belong to the right person, and this is an essential check to understand that you are sending crypto to that person or company.It is not obtaining data at 1USD, but giving a verification and certification service owned by the address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "August 01, 2022, 07:55:27 AM",
      "body": "Quote from: BlokBro on August 01, 2022, 05:23:24 AMwhy couldn't the Italian company have access to its USD or EUR? .. it seems you don't know how crypto works (no offense). .. Crypto? Was ist das?   Im Ernst: Sieh dir mal an wie gefakte Seiten und/oder Scams funktionieren. Dort findest du dann auch gefakte Crypto Empfangsadressen oder Bankkontonummern die nicht der Firma gehören sondern dem jeweiligen Angreifer. Natürlich hat die italienische Firma darauf keinen Zugriff sondern bekommt vom Angriff erst dann etwas mit, wenn es Beschwerden der Kunden über ausbleibende Lieferungen hagelt. Quote from: BlokBro on August 01, 2022, 05:23:24 AMhe will be able to clone it but if the buyer clicks to verify the address and is redirected to the blokbro page, he will see that it does not belong to the company ... Natürlich, wer an so einen Schutzmechanismus glaubt glaubt auch daran, dass das grüne Schild bei einer erfolgreichen Prüfung des SSL-Zertifikats irgendetwas über die Legitimität der Webseite aussagt. Auch eure BlokBro Seite wäre im Fall des Falles sehr einfach gefaked und bietet für den Konsumenten quasi keinen Schutz - im Gegenteil, Angreifer könnten sich das falsche Vertrauen zunutze machen und so erst recht Konsumenten betrügen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "August 01, 2022, 12:34:31 PM",
      "body": "BlokBro nicht wundern wenn du ein paar Benachrichtungen erhalten hast.Ich zensiere hier nicht rum sondern es wurden ein paar Beiträge von dir zusammengefasst.Bitte in Zukunft den -Button verwenden damit keine Doppelposts entstehen - danke!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlokBro",
      "created_time": "August 01, 2022, 04:37:55 PM",
      "body": "Quote from: Lakai01 on August 01, 2022, 07:55:27 AMQuote from: BlokBro on August 01, 2022, 05:23:24 AMwhy couldn't the Italian company have access to its USD or EUR? .. it seems you don't know how crypto works (no offense). .. Crypto? Was ist das?   Im Ernst: Sieh dir mal an wie gefakte Seiten und/oder Scams funktionieren. Dort findest du dann auch gefakte Crypto Empfangsadressen oder Bankkontonummern die nicht der Firma gehören sondern dem jeweiligen Angreifer. Natürlich hat die italienische Firma darauf keinen Zugriff sondern bekommt vom Angriff erst dann etwas mit, wenn es Beschwerden der Kunden über ausbleibende Lieferungen hagelt. Quote from: BlokBro on August 01, 2022, 05:23:24 AMhe will be able to clone it but if the buyer clicks to verify the address and is redirected to the blokbro page, he will see that it does not belong to the company ... Natürlich, wer an so einen Schutzmechanismus glaubt glaubt auch daran, dass das grüne Schild bei einer erfolgreichen Prüfung des SSL-Zertifikats irgendetwas über die Legitimität der Webseite aussagt. Auch eure BlokBro Seite wäre im Fall des Falles sehr einfach gefaked und bietet für den Konsumenten quasi keinen Schutz - im Gegenteil, Angreifer könnten sich das falsche Vertrauen zunutze machen und so erst recht Konsumenten betrügen. Alles, was Sie sagen, ist absolut richtig, und ich hatte gehofft, Sie würden dieses Argument vorbringen. Wenn der Hacker die Unternehmenswebsite geklont hat und auch, wie Sie sagen, das Bestätigungszeichen, wenn der Käufer diese Adresse eingibt, um die Einzahlung vorzunehmen, informiert ihn das Wallet, dass die Adresse nicht verifiziert ist oder jemand anderem gehört, und schützt sie vor Betrug oder unbeabsichtigter Fehler. All dies wird möglich, wenn die Wallets den Request-API-Aufruf bei der Eingabe der Adresse implementieren, indem sie automatisch den Verifizierungs-„Check“ durchführen. Die einzige Möglichkeit, die der Hacker in diesem Fall hat, ist, meine Datenbank zu erzwingen ... aber das finde ich unmöglich. Ich habe die Registrierungsdatenbank für Benutzer auf einer defragmentierten privaten Blockchain mit 6 Servern entworfen, die von einem Lese-Masternod für die API-Anforderung verwaltet werden, die nur ein Leseergebnis zurückgibt. Während das Schreiben in zwei Phasen erfolgt, wird die erste Phase bereits in der Registrierungsphase vom Nutzer bearbeitet und die zweite Phase wird mit dem Abschluss der Verifizierung durch den Admin abgeschlossen, der diese an den Write Masternod sendet. Wenn das Ergebnis positiv ist, dann sendet der Schreib-Masternod die Datei an einen der 6 Server, der einen Teil der Datei entrahmt, entschlüsselt und behält, und sie dann an einen anderen weitergibt ... also bis zum 6. Server (diese Phase ist zufällig), alle 3 Minuten wiederholen die Daten, die die 6 Server gespeichert haben, den gesamten Vorgang. Um die vollständigen Daten zu haben, müssen Sie 6 Server gleichzeitig plus den Write Masternod hacken, alles in 3 Minuten, wobei Sie die genaue Reihenfolge der defragmentierten Datei auf den Servern kennen. Ich habe versucht, Ihnen so einfach wie möglich zu erklären, wie es funktioniert ... Also alles, was Sie gesagt haben, ist richtig, aber nur, bis eine gute Akzeptanz durch die Brieftaschen besteht.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}