{
  "id": "topic_5466122",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "September 08, 2023, 03:03:30 PM",
  "content": "O Vitalik lançou junto a outros especialistas, o documento ''Blockchain Privacy and Regulatory Compliance: Towards a Practical Equilibrium''A ideia do paper é definir uma espécie de ''padrão tecnologico'' para de privacidade, que esteja em conformidade legal. A ideia é sugerida através de um novo protocolo chamado Privacy Pools, que é um fork do TORNADO CASH  O whitepaper na integra: https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4563364",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466122",
  "comments": [
    {
      "author": "tg88",
      "created_time": "September 08, 2023, 05:13:46 PM",
      "body": "Resumindo seria possível verificar automaticamente se uma transação está de alguma forma associada a \"atividades ilegais\" sem necessariamente ter que expor o dono dos fundos que estão sendo movimentados. Me parece uma ideia horrível pois pelo que entendi governos poderiam bloquear qualquer movimentação de fundos que eles classificarem ilegal dentro dessa bockchain especifica. Me pareceu um Bloqueio/confisco 2.0 ou estou perdendo algum ponto?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 08, 2023, 05:22:01 PM",
      "body": "Quote from: tg88 on September 08, 2023, 05:13:46 PMResumindo seria possível verificar automaticamente se uma transação está de alguma forma associada a \"atividades ilegais\" sem necessariamente ter que expor o dono dos fundos que estão sendo movimentados. Me parece uma ideia horrível pois pelo que entendi governos poderiam bloquear qualquer movimentação de fundos que eles classificarem ilegal dentro dessa bockchain especifica. Acaba caindo naquela ideia da quebra de fungibilidade do Bitcoin, a separação do que é BTC “limpo” e o que é BTC “sujo”. Também acho uma ideia horrível, mas pode ser um mal necessário se o governo entrar com os dois pés na porta querendo tratar 100% das transações de mixers e outras soluções como ilegais.Em que ponto seria um confisco? Não há bloqueio no nivel da blockchain, seria só uma declaração para as entidades governamentais. Você poderia muito bem só ignorar tudo isso, mas ai teria que lidar com o governo ao usar uma exchange regulamentada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 08, 2023, 05:31:35 PM",
      "body": "Quote from: TryNinja on September 08, 2023, 05:22:01 PMEm que ponto seria um confisco? Não há bloqueio no nivel da blockchain, seria só uma declaração para as entidades governamentais. Você poderia muito bem só ignorar tudo isso, mas ai teria que lidar com o governo ao usar uma exchange regulamentada. Confisco não foi a palavra correta mas talvez evolua para ele no próximo estágio da regulamentação  , mas digamos que se realmente isso se tornar um padrão a ser seguido de forma global penso que esses fundos passariam a ter um grande deságio. Não sei se exchanges aceitariam esse depósito, infelizmente acho que é um caminho bem provável.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 08, 2023, 08:08:10 PM",
      "body": "É o Vitalik está com medo de também cair na malha fina da investigação do departamento de justiça norte-americano. Afinal, os grandões das criptomoedas estão na maioria sendo investigados. Afinal de contas, o Vitalik reside em qual País? Ele ainda tem a cidadania Russa ou abdicou da mesma ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 08, 2023, 08:16:50 PM",
      "body": "Quote from: Paredao on September 08, 2023, 08:08:10 PMÉ o Vitalik está com medo de também cair na malha fina da investigação do departamento de justiça norte-americano. Afinal, os grandões das criptomoedas estão na maioria sendo investigados. Afinal de contas, o Vitalik reside em qual País? Ele ainda tem a cidadania Russa ou abdicou da mesma ?Até onde eu me lembro, o Vitalik vivia como uma especie de digital nomad sem casa fixa. O mais proximo que me recordo de ter visto por ai como sua morada era Cingapura, mas agora já não sei.Não vejo muito perigo para ele visto que não contribuiu diretamente com nenhum projeto de privacidade como o Tornado Cash, e a Ethereum por si só não tem nenhum mecanismo estilo Monero que dificulte esses rastreios do governo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 08, 2023, 11:00:51 PM",
      "body": "Quote from: tg88 on September 08, 2023, 05:31:35 PMQuote from: TryNinja on September 08, 2023, 05:22:01 PMEm que ponto seria um confisco? Não há bloqueio no nivel da blockchain, seria só uma declaração para as entidades governamentais. Você poderia muito bem só ignorar tudo isso, mas ai teria que lidar com o governo ao usar uma exchange regulamentada. Confisco não foi a palavra correta mas talvez evolua para ele no próximo estágio da regulamentação  , mas digamos que se realmente isso se tornar um padrão a ser seguido de forma global penso que esses fundos passariam a ter um grande deságio. Não sei se exchanges aceitariam esse depósito, infelizmente acho que é um caminho bem provável.É verdade que em teoria, e para quem não percebe do assunto - como boa parte dos legisladores por esse mundo fora, o essas exchanges e mixes trazem essa ideia de lavagem de dinheiro.Mas, na realidade, mesmo que o blockchain permita muita movimentação de dinheiro sem ser detetável, também permite que o seu rasto seja seguido. É verdade que ao passar por um mixe, fica complicado seguir as mesmas moedas, mas podem ser criados mecanismos que continuam a seguir as moedas que saem do mix. E mais cedo ou mais tarde o bandido acaba por se revelar, principalmente se for alguém que só use as cripto para essa finalidade, a menos que realmente não faz um uso massivo do dinheiro que roubou/lavagem. Mas, normalmente, bem sabemos que quem usa os mix com o objetivo de limpar o seu rastro criminoso, é porque vai mesmo querer dar uso a todo esse dinheiro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 08, 2023, 11:39:55 PM",
      "body": "Quote from: Paredao on September 08, 2023, 08:08:10 PMAfinal de contas, o Vitalik reside em qual País?Tem um notícia bem recente sobre isso, faz menos de um que ele foi anunciado que Vitalik Buterin se torna residente de Taiwan, pelo teor da notícia Taiwan inda não tem uma legislação muito clara sobre criptoativos. Acho que ao longo dos últimos anos eles fez algumas liquidações razoáveis de ETH, em algum país ele deve ter registrado isso e talvez recolhido algum imposto para evitar problemas futuros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 09, 2023, 02:16:33 AM",
      "body": "Quote from: Paredao on September 08, 2023, 08:08:10 PMÉ o Vitalik está com medo de também cair na malha fina da investigação do departamento de justiça norte-americano. Afinal, os grandões das criptomoedas estão na maioria sendo investigados. Afinal de contas, o Vitalik reside em qual País? Ele ainda tem a cidadania Russa ou abdicou da mesma ?O cara tava usando o Tornado para doar dinheiro pra Ucrânia, último lugar que ele vai é pra Rússia Fonte: https://twitter.com/VitalikButerin/status/1556925602233569280Essas conversas/ideias ai surgiram justamente quando os EUA queriam sancionar quem usou o TC.. Vitalik ta tentando deixar os ETH dele livres, não é bobo de perder seus bilhões.. mas se você doou pra Rússia, logo vai ser sancionado.Cripto tá virando um dólar 2.0, EUA quem decide quem é bandido e quem é mocinho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 09, 2023, 07:38:36 AM",
      "body": "Quote from: sabotag3x on September 09, 2023, 02:16:33 AMCripto tá virando um dólar 2.0, EUA quem decide quem é bandido e quem é mocinho.Esta frase mereceu merit.Isso é bem verdade. A maioria das cripto estão se a render ao que as autoridades dos EUA estão a fazer, com muito pouca reação. Por isso, é que o Bitcoin tem de se manter como está para não cair nesse tipo de malha, imposta por essas autoridades.As autoridades dos EUA já perceberam que as cripto podem ser, ou já são, uma ameaça para o seu sistema financeiro. E todos nós sabemos, como eles são extremamente protecionistas desse sistema, capazes de se prejudicarem a si próprios para derrubar/destabilizar sistemas \"concorrentes\". Algumas teorias da conspiração, dizem que este aumento de juros indiscriminado (que começou nos EUA) foi com objetivo de destabilizar a Zona Euro, que estava em fase de crescimento.Que o Bitcoin se mantenha como está, que teremos sempre esta boia de salvação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 09, 2023, 02:14:46 PM",
      "body": "Inclusive aproveitando que hoje está ocorrendo a reunião do G20, não sei se já viram esse novo relatório atualizado que o FMI montou para o tentar criar uma regulamentação global de criptomoedas. A frase destaque dele é esta: \"Proibição não resolve, mas não deve ser descartada\"FMI e G20 lançam roteiro global de regulação de criptomoedas: “Proibição não deve ser descartada”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 09, 2023, 04:23:14 PM",
      "body": "Quote from: tg88 on September 09, 2023, 02:14:46 PMInclusive aproveitando que hoje está ocorrendo a reunião do G20, não sei se já viram esse novo relatório atualizado que o FMI montou para o tentar criar uma regulamentação global de criptomoedas. A frase destaque dele é esta: \"Proibição não resolve, mas não deve ser descartada\"Resumindo... Estão com medo, que os investidores deixem de investir no sistema financeiro tradicional - controlado pelos governos - e passe a investir num sistema livre onde eles tem total liberdade de atuação.Acho que estes relatórios, só atrai esses tais investidores \"tradicionais\" do que os afasta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 09, 2023, 08:02:40 PM",
      "body": "Quote from: joker_josue on September 09, 2023, 07:38:36 AMIsso é bem verdade. A maioria das cripto estão se a render ao que as autoridades dos EUA estão a fazer, com muito pouca reação. Por isso, é que o Bitcoin tem de se manter como está para não cair nesse tipo de malha, imposta por essas autoridades.As autoridades dos EUA já perceberam que as cripto podem ser, ou já são, uma ameaça para o seu sistema financeiro. E todos nós sabemos, como eles são extremamente protecionistas desse sistema, capazes de se prejudicarem a si próprios para derrubar/destabilizar sistemas \"concorrentes\". Algumas teorias da conspiração, dizem que este aumento de juros indiscriminado (que começou nos EUA) foi com objetivo de destabilizar a Zona Euro, que estava em fase de crescimento.Que o Bitcoin se mantenha como está, que teremos sempre esta boia de salvação.Olha, não fala mal do Tio Sam, senão eles vão te buscar em Portugal. Vão dizer que tem um português liderando a subversão contra o governo norte-americano. Olha que eles te pegam e te levam para Guantánamo. Portugal tem algum acordo de extradição com os Estados Unidos ? Olha que o \"grande irmão\" está atento.Obs* Brincadeirinha, não fica preocupado @joker_josue. O Tio Sam está atrás de peixes grandes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 09, 2023, 09:31:48 PM",
      "body": "Quote from: Paredao on September 09, 2023, 08:02:40 PMOlha, não fala mal do Tio Sam, senão eles vão te buscar em Portugal. Vão dizer que tem um português liderando a subversão contra o governo norte-americano. Olha que eles te pegam e te levam para Guantánamo. Portugal tem algum acordo de extradição com os Estados Unidos ? Olha que o \"grande irmão\" está atento.Obs* Brincadeirinha, não fica preocupado @joker_josue. O Tio Sam está atrás de peixes grandes    Por acaso até tem! E eu sabia que tinha, mas decidi pesquisar o assunto. Sabe o que eu descobri?A convenção de extradição com os EUA existe desde 1908, ainda Portugal era uma monarquia e tinha Rei. Entretanto foi revisto em 2005.Mas, tanto a primeira convenção, como a revisão de 2005, deixa claro que o criminoso extraditado para os EUA, não pode sofrer pena de morte.No texto revisto podemos ler:QuoteNo momento da troca dos instrumentos declarando o cumprimento das formalidades internas aplicáveis para a entrada em vigor do Instrumento, Portugal formulará a seguinte declaração: «A República Portuguesa declara que, nos termos do direito constitucional português, existem impedimentos à extradição relativamente a infracções puníveis com a pena de morte, com pena de prisão perpétua ou com pena de prisão de duração indeterminada. Em consequência, a extradição por tais infracções só pode ser concedida de acordo com condições específicas desde que sejam consideradas pela República Portuguesa como compatíveis com a sua Constituição. Na hipótese de surgir um caso em que estejam envolvidos os princípios constitucionais de Portugal acima descritos, a República Portuguesa invocará os termos do §4 do Instrumento.»Bem interessante!Segue os links, porque sei que gostas disto:Convenção de 1908Revisão de 2005",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 10, 2023, 02:02:43 PM",
      "body": "Já tem mais algumas atualizações sobre as tratativas de \"regulamentação mundial das criptomoedas\" que está ocorrendo no encontro do G20 neste final de semana, os planos são de um sistema de compartilhamento de informações entre países operacional já no ano de 2027. Esse acordo afetaria dois terços da população mundial que vive em algum país do G20.Maiores detalhes na noticia:  G20 avança na criação de estrutura internacional para o mercado de criptomoedas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 10, 2023, 08:40:56 PM",
      "body": "Quote from: tg88 on September 10, 2023, 02:02:43 PMJá tem mais algumas atualizações sobre as tratativas de \"regulamentação mundial das criptomoedas\" que está ocorrendo no encontro do G20 neste final de semana, os planos são de um sistema de compartilhamento de informações entre países operacional já no ano de 2027. Esse acordo afetaria dois terços da população mundial que vive em algum país do G20.Já faz um bom tempo que o pessoal do G20 planeja dar uma \"podada\" nos mercados de criptomoedas. Mas acredito que onde eles vão bater mais forte será nas stablecoins. Acredito que nosso Bitcoin ficará de fora de qualquer sanção. Os Maximalistas agradecem e torcem por isso. Bitcoin é o rei !!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "September 11, 2023, 10:06:06 AM",
      "body": "Quote from: Disruptivas on September 08, 2023, 03:03:30 PMO Vitalik lançou junto a outros especialistas, o documento ''Blockchain Privacy and Regulatory Compliance: Towards a Practical Equilibrium''A ideia do paper é definir uma espécie de ''padrão tecnologico'' para de privacidade, que esteja em conformidade legal. A ideia é sugerida através de um novo protocolo chamado Privacy Pools, que é um fork do TORNADO CASH  O whitepaper na integra: https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4563364Eu sinceramente não sei como tem gnt que compra esse lixo eletrônico. Que merda é essa de equilibrio entre privacidade e lei estatal ? Ou voce tem privacidade ou voce tem o estado se metendo na sua vida. Não existe privacidade com o dedo do governo no meio. Tem que ser muito idiota para comprar e acreditar nessa merda de ethereum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 11, 2023, 10:32:26 AM",
      "body": "Quote from: thiagothx1370 on September 11, 2023, 10:06:06 AMEu sinceramente não sei como tem gnt que compra esse lixo eletrônico. Que merda é essa de equilibrio entre privacidade e lei estatal ? Ou voce tem privacidade ou voce tem o estado se metendo na sua vida. Não existe privacidade com o dedo do governo no meio. Tem que ser muito idiota para comprar e acreditar nessa merda de ethereumE você acha que o estado vai te deixar de boa mandando suas moedinhas pra quem quiser, a hora que quiser, sem prestar contas a ninguém?Baseado nessa sua lógica o governo vai proibir completamente todas as moedas, afinal, é impossível ter controle completo da rede para exigir KYC no nivel do protocolo, e se isso é impossível, o governo vai ter que bloquear tudo (sem meio termo).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "September 11, 2023, 03:43:18 PM",
      "body": "Quote from: TryNinja on September 11, 2023, 10:32:26 AMQuote from: thiagothx1370 on September 11, 2023, 10:06:06 AMEu sinceramente não sei como tem gnt que compra esse lixo eletrônico. Que merda é essa de equilibrio entre privacidade e lei estatal ? Ou voce tem privacidade ou voce tem o estado se metendo na sua vida. Não existe privacidade com o dedo do governo no meio. Tem que ser muito idiota para comprar e acreditar nessa merda de ethereumE você acha que o estado vai te deixar de boa mandando suas moedinhas pra quem quiser, a hora que quiser, sem prestar contas a ninguém?Baseado nessa sua lógica o governo vai proibir completamente todas as moedas, afinal, é impossível ter controle completo da rede para exigir KYC no nivel do protocolo, e se isso é impossível, o governo vai ter que bloquear tudo (sem meio termo).e é exatamente por isso que eu compro BTC p2p, totalmente imune ao KYC. Boa sorte pro governo tentar bloquear as transações de BTC e meus satoshinhos também. Desejo muito boa sorte ao governo!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 11, 2023, 06:25:05 PM",
      "body": "Quote from: thiagothx1370 on September 11, 2023, 03:43:18 PMe é exatamente por isso que eu compro BTC p2p, totalmente imune ao KYC. Boa sorte pro governo tentar bloquear as transações de BTC e meus satoshinhos também. Desejo muito boa sorte ao governo!O ponto é outro:Se eventualmente os governos declararem a ilegalidade de qualquer atividade com cripto, incluindo o BTC. Quem é que vai querer esse BTC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}