{
  "id": "topic_5444950",
  "title": "uche6215",
  "author": "uche6215",
  "created_time": "March 15, 2023, 07:31:03 AMLast edit: March 16, 2023, 11:54:57 AM by uche6215",
  "content": "Good Day medium, there is something I will want us to be aware of since bitcoin is a life-changing investment some people are taking it as property, I say this because I overhear someone making a call and saying he has 2BTC and that's is his property. Now that bitcoin is more valuable in most countries, that shouldn't be a property it should be an investment, those who see bitcoin as property should learn more or read more about bitcoin and how it works. To me, bitcoin is an investment and also a treasure, I don't know if am wrong or right. But if someone may ask you, what do you call BITCOIN?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444950",
  "comments": [
    {
      "author": "Spaceman1000$",
      "created_time": "March 15, 2023, 07:59:10 AM",
      "body": "I think is a matter of semantics, because your property can also be your investment, just the way you invest in Real estate, the property is yours, so in turn you see it as your own investment visa Vis a Vis if there is a return in investment.So the guy making the call might not be entirely wrong, he might see Bitcoin as an investment property, because there is also a return in your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 15, 2023, 08:03:03 AM",
      "body": "Quote from: uche6215 on March 15, 2023, 07:31:03 AMwhat do you call BITCOIN? It must be called as Bitcoin or BTC in brief.Bitcoin is Bitcoin and always is Bitcoin. You can consider it as a treasury, an asset, a cryptocurrency, a digital gold, a lottery ticket or whatever you think is its usability for yourself. However, about name, it has only one name, Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "March 15, 2023, 09:39:29 AM",
      "body": "Don't be confused by choice of words of other people...and yes stick to your own idea about it and be guided in your decisions as you journey along in the world and market of cryptocurrency with its dramatic ups and downs just like riding a big roller-coaster full of excitement and sometimes also disappointments. One can certainly call Bitcoin as a property because it is something one can own digitally...but a property can also be an investment, of course, especially if one is looking forward to gain something out of it. Just like a real estate property which is an investment into the future. Whatever you call it, the most important thing is that you own some Bitcoin hidden somewhere safely. And hopefully one day it would be a big treasure for you and your family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 15, 2023, 09:44:58 AM",
      "body": "Quote from: uche6215 on March 15, 2023, 07:31:03 AMTo me, bitcoin is an investment and also a treasure, I don't know if am wrong or right. Bitcoin is an investment asset fine and good to call it, but is every of your investments not your property? Of course they are your property because you have them in possession but only onna digital form and that's why the most preferred term to be used for it more appropriately is an investment and not property vut in the same vein it's still your property because you own it, we most times refers physical assets as property while digital ones as investment but all are your possessions, just a difference on terms we call each one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "March 15, 2023, 10:58:36 AM",
      "body": "Quote from: Doan9269 on March 15, 2023, 09:44:58 AMQuote from: uche6215 on March 15, 2023, 07:31:03 AMTo me, bitcoin is an investment and also a treasure, I don't know if am wrong or right. Bitcoin is an investment asset fine and good to call it, but is every of your investments not your property? Yes, my investment in my property, but since bitcoin is a cryptocurrency and it's online money. So my confusion here is that if for criterion, can I say the money on my fiat bank is my property? I Belive that anything that's not physical doesn't worth it, but I can call my house, car, or businesses my property. Please lecture me more about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "March 15, 2023, 11:50:04 AM",
      "body": "Bitcoin can fit multiple definitions, so there will be a segregation in our community.  To me, it is an investment, a property, Currency and value.  Maybe I can pick some other words to define it too, but none come up in my mind right now.If you want a single definition that is generally accepted, read the White paper.  There you have a very in detail definition of what Bitcoin is.  If you ask us, there will be many different answers to your question.  To some people, Gold is money.  To others, it is an investment.  But to others, it is just a metal.Quote from: uche6215 on March 15, 2023, 10:58:36 AMSo my confusion here is that if for criterion, can I say the money on my fiat bank is my property? I Belive that anything that's not physical doesn't worth it, but I can call my house, car, or businesses my property. Fiat that is in your Bank Account is not your property any more.  It theoretically is.  But under their custody.  So, to me, that is not mine any more.Physical or not, a property is a property.  You can create a business logo and sell it.  That was your property and you are giving it away to the buyer.  You can write a book in Word and that is yours as well.  You can buy downloadable eBooks and then you own them.Your car is your property because you have it physically?  Like Amazon can cancel your purchased eBooks or Sony can cancel your downloadable PS5 games, your State can seize your car.  That does not make it NOT your property.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "March 15, 2023, 12:09:13 PM",
      "body": "I would call it a \"High Risk Digital Asset\".  It's that simple.  I want people to know and be interested in BTC or the world of cryptocurrencies and I will introduce them as \"digital assets\" where everyone can own and invest there.  But I also call it \"high risk\" because I hope people who are interested in BTC know the risk they are taking with every trade they make.  I think this can help a lot of people to get interested in BTC and also know the risks they have.  Thank You",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "March 15, 2023, 12:15:56 PM",
      "body": "Quote from: uche6215 on March 15, 2023, 07:31:03 AMI overhear someone making a call and saying he has 2BTC and that's is his property. In simple terms what is a property? It is anything that belongs to a particular person. The bitcoin belongs to the person so he has all the right to call it his property.What you call bitcoin doesn’t really matter everyone have his separate view, i can call it my investment or my property as long as it still belongs to me nothing else matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "March 15, 2023, 12:16:23 PM",
      "body": "Bitcoins are clearly an asset and you could hold them like gold when you want to treasure them yourself and just put them to sleep in your wallet for 50 years and no one could touch it. With the ongoing conflict all around the world today, Bitcoins can give people convenience if war ever breaks out and we have no time to convert our gold and assets into cash. I think when that happens bitcoins price will spike because it will be the most recommendable asset that you can bring anywhere without anyone noticing you at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sakanwa",
      "created_time": "March 15, 2023, 05:22:32 PM",
      "body": "Yeah bitcoin is a life changer as you have said earlier so many life has been transformed through Bitcoin and has become one of the most important thing in there lifes,you can call it treasure or anything you wise to call it because of what it has done in people's lives. Everyone have it reason and purpose of give it there own name it just base on what it has done in there life,I might call it MY BIGGEST TREASURE due to what it has done for me, so can call it what ever you feels like is best to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "March 15, 2023, 05:30:29 PM",
      "body": "It is still called your property because you own it and because it also gives you value financially or emotionally. It is an asset because of its huge amount, which is why it was treated by people as very important because it cost a huge amount. Imagine owning 2BTC is everything for me as the cost of it is very high and I am rich with it. It is really a treasure to us, like what we've seen in the movies—a treasure that is digital, and it cost a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nara1892",
      "created_time": "March 15, 2023, 05:51:11 PM",
      "body": "I don't think it's wrong in this case because when you make an acknowledgment claim, it is certain that it is in the owned portfolio, which of course is already in the private owned wallet, both in the seed and the private key.Actually, even though it doesn't mean that we own all the bitcoins in circulation, but we become part owners for some of it, just like we have other investments such as stocks or real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MIner1448",
      "created_time": "March 15, 2023, 05:53:15 PM",
      "body": "Like any other form of investment, bitcoin can be both a treasure and an investment, depending on how you look at it and how you use it.On the one hand, bitcoin can be considered a treasure because its price has risen significantly in recent years. Some people think that investing in bitcoin is a way to make quick money, especially if you invested in it early in its history and have a large amount of coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "March 15, 2023, 06:08:10 PM",
      "body": "There are countries where Bitcoin is treated as property or something similar to property for tax purposes. The USA is among those countries, according to Investopedia. So when people say Bitcoin is property, they might mean that it's literally a form of property in their jurisdiction. And property can also be a form of investment. For example, some people buy flats, expecting the price to rise in the future, so that they can sell these flats for much more money in the future. A flat, in this case, it both a property and an investment. Some do the same thing with gold. As for treasure, let's say someone has emeralds and considers them one's treasure. But since this person owns them, doesn't it make it one's property as well? So Bitcoin can easily be an investment, a property, and a treasure, with all these words simply signifying various aspects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "March 15, 2023, 07:03:12 PM",
      "body": "Bitcoin is my property since I own the bitcoins I have in my wallet, so I can call them my property. Why would you find it wrong if someone calls it their property? LOLWhat is the difference between a property and an asset? The bitcoin I own is my property and a priceless asset, though it has a price tag. Don't bother how others see bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "March 16, 2023, 09:55:16 AM",
      "body": "Ahh, it is same thing as arguing whether bitcoin is currency, asset or some sort of commodity which has fiat valuation. I don’t think nomenclature really matters here considering what bitcoin is and what is its status today in the current timeline. Bitcoin has got its own spark, its own value and its own investors. There is no need to call it property or some sort of asset. We use them occasionally or while speaking about it because it’s just referring word or name to understand we are talking about something that has “value”.  So naming it has got least priority at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 16, 2023, 05:09:43 PM",
      "body": "Bitcoin is digital property, hard money. It’s a gift from Satoshi to the world, to save us from corrupt bankers & an ever decreasing purchasing power we have with our traditional fiat monies. Bitcoin is here to stay, I suggest you build the biggest position that you are able to.People have to invest their fiat just to beat inflation, it’s just unsustainable. Bitcoin is the future, be part of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannahB4",
      "created_time": "March 16, 2023, 05:22:52 PM",
      "body": "Property means any tangible possession one owns, so you can say bitcoin is your property. But you can choose whatsoever names you want as far as it is for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzy887",
      "created_time": "March 16, 2023, 05:47:21 PM",
      "body": "Bitcoin is just creating confusion. Understand Bitcoin in simple terms. The guy who spoke on the call was right. Because if your money is your wealth, then that person's money invested in Bitcoin is his wealth.Again, if you call your place wealth, then the wallet used by the person is the place to keep his invested money. He alone owns the place. So he can call that place his wealth if he wants. You can call Bitcoin anything you want, but Bitcoin is just Bitcoin.The rest are just pseudonyms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}