{
  "id": "topic_5465445",
  "title": "ParaBoi",
  "author": "ParaBoi",
  "created_time": "September 02, 2023, 08:51:11 PM",
  "content": "Hello I just day read different thread from this community what I experienced is that almost every body in this community just day emphasize on the daily news some even create a thread of news that has already circulate, nah him I say make I talk some thing about that issue ona ona way be them legendary members, hero members, sr members suppose day create new thread way ona go day teach us tins we way be new comers at least if ona day carry us alone we go know many things nah But ona just day look us no any change so no be say I day tell ona Watin ona go do but make ona they consider people way just join this forum nah one Nigeria we be oo no be say u go go day teach another pasin way no be your own if you day teach the new comers like me no be say we day hurt merit but make we know more in this forum from the community then we can succeed and also go where we no expert but ona way get experience come day side no any help e too much nah this local community can be a great channel to help us way just day enter the forum I just say make I talk my mind no be say I com offen any body but if person vex I day sorry so I go rest my cast for here and any pasin way get something way day boda him/she for mind make him/she just talk am because u fit get helper for here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465445",
  "comments": [
    {
      "author": "BoiCrypto",
      "created_time": "September 02, 2023, 09:10:24 PM",
      "body": "You sure say, you don check all the thread wey they this local board and you didn’t see any thread that was created by any senior members in which it has help many newcomers? You are talking of the senior members are just watching what did you want them to do if you look and check this is local board and they are trying there best to see people going up. You said you only see news that have been circulated in the county for our local board which you think is not meaningful, and even this thread I don’t see anything meaningful here that will help people or change anything in summary your thread is not meaningful mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ParaBoi",
      "created_time": "September 02, 2023, 09:20:28 PM",
      "body": "Quote from: BoiCrypto on September 02, 2023, 09:10:24 PMYou sure say, you don check all the thread wey they this local board and you didn’t see any thread that was created by any senior members in which it has help many newcomers?No be say I no see am but at least e no plenty as e suppose be because if e plenty many new comers go don see and achieve mate what I want to ask you is dat you way day ask me say I no see thread way sr member create to help new comers pls make u just bring some link of them make we see and achieve nah my point be dat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BoiCrypto",
      "created_time": "September 02, 2023, 09:29:48 PM",
      "body": "Quote from: ParaBoi on September 02, 2023, 09:20:28 PMQuote from: BoiCrypto on September 02, 2023, 09:10:24 PMYou sure say, you don check all the thread wey they this local board and you didn’t see any thread that was created by any senior members in which it has help many newcomers?No be say I no see am but at least e no plenty as e suppose be because if e plenty many new comers go don see and achieve mate what I want to ask you is dat you way day ask me say I no see thread way sr member create to help new comers pls make u just bring some link of them make we see and achieve nah my point be dat Have you try checking this thread by Charles Tim even once since you join the forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ParaBoi",
      "created_time": "September 02, 2023, 09:33:39 PM",
      "body": "Quote from: BoiCrypto on September 02, 2023, 09:10:24 PMHave you try checking this thread by Charles Tim even once since you join the forum? That is my point thanks for the link you can still search more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 02, 2023, 10:46:15 PM",
      "body": "Everyone started as a newbie like you and we all grew gradually with learning on the forum and doing our own research. The only thing that I can tell you is to read more articles or topics in the forum and only contribute on topics and discussions that you have knowledge on. You should read always because you can only learn here by reading and you can only grow by learning and contributing here. Make e no be like say, I just dey talk come leave you like that. You should read this topic,it has everything as a newbie that you need to know on bitcoin and the forum and many more Beginners &Help Encyclopedia You have three merits already with just nine activities and you need help abi you won fly ,guy life na gradual process.Quote from: ParaBoi on September 02, 2023, 09:33:39 PMQuote from: BoiCrypto on September 02, 2023, 09:10:24 PMHave you try checking this thread by Charles Tim even once since you join the forum? That is my point thanks for the link you can still search moreWhy don't you do the searching by yourself by using the search engine. @Charles-Tim has explained how to use the search engine in his thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "September 03, 2023, 03:43:56 PM",
      "body": "Quote from: ParaBoi on September 02, 2023, 08:51:11 PMHello I just day read different thread from this community what I experienced is that almost every body in this community just day emphasize on the daily news some even create a thread of news that has already circulate, nah him I say make I talk some thing about that issue ona ona way be them legendary members, hero members, sr members suppose day create new thread way ona go day teach us tins we way be new comers at least if ona day carry us alone we go know many things nah But ona just day look us no any change so no be say I day tell ona Watin ona go do but make ona they consider people way just join this forum nah one Nigeria we be oo no be say u go go day teach another pasin way no be your own if you day teach the new comers like me no be say we day hurt merit but make we know more in this forum from the community then we can succeed and also go where we no expert but ona way get experience come day side no any help e too much nah this local community can be a great channel to help us way just day enter the forum I just say make I talk my mind no be say I com offen any body but if person vex I day sorry so I go rest my cast for here and any pasin way get something way day boda him/she for mind make him/she just talk am because u fit get helper for here.I want to add a couple of things in addition to all the advice that have been given to you already. Local board is just one of the ways we can interact as one since everyone understands the common language which ours happen to be pigin but it's allowed to interact with English, if you Sabi read pigin, that means say English communication no go hard you, based on your level of communication you even understand plain English.This is a public forum, you can relate anywhere whether in the local board or in other general board, you are allowed to learned anywhere, in fact as a newbie, beginner and help  is the best you are suppose to start from, basically everything you need as new person is there, we don't have them here in the local board because it's still new but if you look around you, you can see some here as well.You are free as bird to ask anyone in this forum, you don't have to depend on anyone, you don't have to depend on local board to gorw, it can even limit you to forum exposure, so it's better you make your way more to other boards, read and observe, post when you need to and ask questions when you are lost, lastly you are free to make friends with anyone you feel like if they welcome you but make sure you don't beg for favours or anything. Good luck to us both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "September 03, 2023, 06:38:37 PM",
      "body": "Quote from: ParaBoi on September 02, 2023, 08:51:11 PMI just say make I talk my mind no be say I com offen any body but if person vex I day sorry so I go rest my cast for here and any pasin way get something way day boda him/she for mind make him/she just talk am because u fit get helper for here.I no come know why u dey vex ooo, you wey just dey come forum wey u suppose came down, u dey claim say u wan talk ur mind, and who tell you say high rank members wey dey dis local board no dey try? Dem they try there possible best to make sure say dem carry everyone along, and I don’t know maybe high rank people wey dey dis local board dey ur mind wey be say dem go sabi Wetin dey ur mind, no be say u don ask question wey be say anybody no answer u, e go dey difficult wey anybody go ask question and people no go contribute positively to am. U just dey enter d local board and d second post wey u go do for here, u come dey para say high rank no dey do there work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ParaBoi",
      "created_time": "September 04, 2023, 07:23:01 AM",
      "body": "Quote from: Stable090 on September 03, 2023, 06:38:37 PMQuote from: ParaBoi on September 02, 2023, 08:51:11 PMI just say make I talk my mind no be say I com offen any body but if person vex I day sorry so I go rest my cast for here and any pasin way get something way day boda him/she for mind make him/she just talk am because u fit get helper for here.I no come know why u dey vex ooo, you wey just dey come forum wey u suppose came down, u dey claim say u wan talk ur mind, and who tell you say high rank members wey dey dis local board no dey try? Dem they try there possible best to make sure say dem carry everyone along, and I don’t know maybe high rank people wey dey dis local board dey ur mind wey be say dem go sabi Wetin dey ur mind, no be say u don ask question wey be say anybody no answer u, e go dey difficult wey anybody go ask question and people no go contribute positively to am. U just dey enter d local board and d second post wey u go do for here, u come dey para say high rank no dey do there work.I am very sorry all this things happen as lack of proper investigation this goes not only to a person but all the high rank members in this community actually coming to a community as a new comer without appropriate investigations you can do the same thing I did so I am very sorry of my attitude I want to use this medium to beg for forgiveness please and I will also go and have more experience and investigations before I do anything again ones again sorry for my manners 🙏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}