{
  "id": "topic_5465281",
  "title": "Hatchy",
  "author": "Hatchy",
  "created_time": "September 01, 2023, 11:19:37 AM",
  "content": "In recent weeks, I encountered a frustrating experience with my local mobile banking app. At first, I thought it was a mere network issue preventing me from accessing my fiat currency because it kept on giving me the network error notice. However, after numerous attempts and no resolution, it became evident that the problem was far beyond connectivity.Upon reaching out to customer support, they promised to resolve the issue immediately but these promises were left unfulfilled. I then decided to visit the app store may be I could get some updates but upon getting there, I met series of similar complaints from fellow users.This experience made me realize something very important I taught of sharing. When we keep our money in these banks, they have access to accounts and use our money however they want. It's a clear reminder that depending on these institutions for our financial safety might not be the smartest idea.For this reason, I extend my gratitude to Satoshi Nakamoto for pioneering a financial revolution that grants us true autonomy over our funds.Bitcoin offers a viable alternative that liberates us from the clutches of banks that claims to safeguard our savings while exploiting them through loans and various fees. some reasons Bitcoin will always be better than the fiat currency areAbsolute Control: Bitcoin empowers you with complete control over your finances, eliminating the need to rely on third partiesUnrestricted Access: You can access your Bitcoin holdings at any time, without being subject to arbitrary restrictions Enhanced Security: Bitcoin provides robust security measures that surpass the often-vulnerable systems of traditional banks.Cost-Efficiency: Unlike banks, Bitcoin doesn't burden you with monthly maintenance fees, card maintenance costs, or hidden charges.investment capital: Investing in Bitcoin offers the potential for long-term profits as its price tends to increase over time. In contrast, traditional banks often do not provide substantial long-term interest on the money they loan out, making Bitcoin an appealing alternative for those seeking high returns on their investments.Embracing Bitcoin represents a step towards financial liberation, where you determine the fate of your money, not faceless or third party institutions. for those out there who still have doubts about Bitcoin, I think it's high time you reconsider where you place your funds. Bitcoin, with its decentralized and transparent nature, is a compelling choice.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465281",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "September 01, 2023, 11:38:14 AM",
      "body": "All your above-mentioned benefits of bitcoin could only be possible if you are not using a custodial service, because if you are using a centralised exchange to store your bitcoins or other currency and you expect things to be different from the banking sector, then you will be mistaken. When talking about the benefit and why it's good not to save on a local bank account, it's almost the same thing as why you shouldn't have funds where you don't have a private key or phrase.  NOT YOUR KEY, NOT YOUR COIN Not your control, not your money. I guess it will be more appreciated if you can outline your statement clearly and differentiate between the use of a custodial system and that of a non-custodial system, as many people see the use of bitcoin and other currencies as the same, irrespective of where they are being saved or used to transact with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 01, 2023, 11:44:57 AM",
      "body": "Quote from: Hatchy on September 01, 2023, 11:19:37 AMAbsolute Control: Bitcoin empowers you with complete control over your finances, eliminating the need to rely on third partiesUnrestricted Access: You can access your Bitcoin holdings at any time, without being subject to arbitrary restrictions Enhanced Security: Bitcoin provides robust security measures that surpass the often-vulnerable systems of traditional banks.Cost-Efficiency: Unlike banks, Bitcoin doesn't burden you with monthly maintenance fees, card maintenance costs, or hidden charges.investment capital: Investing in Bitcoin offers the potential for long-term profits as its price tends to increase over time. In contrast, traditional banks often do not provide substantial long-term interest on the money they loan out, making Bitcoin an appealing alternative for those seeking high returns on their investments.You will have absolute control over your finance or Bitcoin if you don't keep your money in exchanges. You have control over your Bitcoin if you own and control the keys to your wallet. Unrestricted access is also associated with using a decentralized wallet because KYCs in exchanges can hinder access. Keeping your Bitcoin safe depends more on you than the Bitcoin system. You have to learn basic privacy and security practices to keep your money safe. Your wallet is more prone to attack, so you have to learn how to protect your wallet. Bitcoin transactions are less expensive if you adopt other transaction methods such as the lightning network. Compared to some bank charges, Bitcoin transaction is cheaper. It is better to keep Bitcoin for a long time than to keep fiat. Due to inflation, some currencies will become worthless if you keep them for a long time. Bitcoin offers a better long-term investment option because is a hedge against inflation and is profitable in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 01, 2023, 12:08:21 PM",
      "body": "Quote from: Hatchy on September 01, 2023, 11:19:37 AMAbsolute Control: Bitcoin empowers you with complete control over your finances, eliminating the need to rely on third partiesWe should that this is what bitcoin offers to us by giving us the desired control over our finances, but it's something worth being pity for when you discover that some bitcoiners doesn't still make use of this same advantage from using bitcoin when they decided to make use of a custodial means to store their bitcoin, it makes no difference as using a bank except you're using a non custodial wallet.Quote from: Hatchy on September 01, 2023, 11:19:37 AMUnrestricted Access: You can access your Bitcoin holdings at any time, without being subject to arbitrary restrictions When you owe your coins on your wallet, then they belongs to you because you have the keys to the wallet to access tour bitcoin on the blockchain, you dont need an authorization from any financial institution, government or any third party before you can make any use of your funds.Quote from: Hatchy on September 01, 2023, 11:19:37 AMEnhanced Security: Bitcoin provides robust security measures that surpass the often-vulnerable systems of traditional banks.Cost-Efficiency: Unlike banks, Bitcoin doesn't burden you with monthly maintenance fees, card maintenance costs, or hidden charges.The security is simple to practice, make use of a non custodial wallets, a good example is in cold storages, about bitcoin being cost effective, you can modify the amount you wat to be charged for your transaction or even make use of the mempool to track the fee rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 01, 2023, 12:10:28 PM",
      "body": "Quote from: Nwada001 on September 01, 2023, 11:38:14 AMAll your above-mentioned benefits of bitcoin could only be possible if you are not using a custodial service, because if you are using a centralised exchange to store your bitcoins or other currency and you expect things to be different from the banking sector, then you will be mistaken. When talking about the benefit and why it's good not to save on a local bank account, it's almost the same thing as why you shouldn't have funds where you don't have a private key or phrase.  NOT YOUR KEY, NOT YOUR COIN Not your control, not your money. I guess it will be more appreciated if you can outline your statement clearly and differentiate between the use of a custodial system and that of a non-custodial system, as many people see the use of bitcoin and other currencies as the same, irrespective of where they are being saved or used to transact with them.I get your point @Nwada001 but It has never been advisable to store your funds in exchanges that are centralized. Bitcoin has a decentralized system, but it all depends on how you choose to store your Bitcoin.both the centralized and decentralized exchanges has different futures and functions thus many people has different choice depending on what best suits them. The banking system offers you less choice as compared to what Bitcoin system has to offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 01, 2023, 12:24:16 PM",
      "body": "Quote from: Hatchy on September 01, 2023, 12:10:28 PMQuote from: Nwada001 on September 01, 2023, 11:38:14 AMAll your above-mentioned benefits of bitcoin could only be possible if you are not using a custodial service, because if you are using a centralised exchange to store your bitcoins or other currency and you expect things to be different from the banking sector, then you will be mistaken. When talking about the benefit and why it's good not to save on a local bank account, it's almost the same thing as why you shouldn't have funds where you don't have a private key or phrase.  NOT YOUR KEY, NOT YOUR COIN Not your control, not your money. I guess it will be more appreciated if you can outline your statement clearly and differentiate between the use of a custodial system and that of a non-custodial system, as many people see the use of bitcoin and other currencies as the same, irrespective of where they are being saved or used to transact with them.I get your point @Nwada001 but It has never been advisable to store your funds in exchanges that are centralized. Bitcoin has a decentralized system, but it all depends on how you choose to store your Bitcoin.both the centralized and decentralized exchanges has different futures and functions thus many people has different choice depending on what best suits them. The banking system offers you less choice as compared to what Bitcoin system has to offer.Many have said here in the forum that it is not good to store Bitcoin on centralized exchanges, even though it is one of the top exchanges in this field. It's been years since I read such words of warning in the communities here, and I don't see anything wrong with this warning.That's why we can't stop others from storing in centralized exchanges like Binance; even I have some stored in this exchange, but it's not a big amount, because it depends on trust and belief in the exchange. Also, this Binance exchange has been in the business industry for a few years. I would rather store here at this exchange than at the bank, to be honest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 01, 2023, 12:24:41 PM",
      "body": "I remember once, not long time ago, when I taught my uncle that, when you deposit money in a bank, you lose the possession of your funds and get, instead, a right to get it back. But, if problems arise (like in Argentina with the \"corralito\", for example) you may not be able to demand the fulfillment of said right. That doesn't happen if you manage to keep the custody of your money, which was not possible until now (due to risks attached to having big sums of money in your home, for instance), thanks to Bitcoin and other cryptos.Of course, if you keep your funds in a centralised service, you are not changing anything, and it could be even worse because jurisdictions where they are registered are usually softer than usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "September 01, 2023, 12:30:44 PM",
      "body": "There are still people who dont get it and are so used to their FIAT financial providersthat they dont forsee any problems.Using a bank is conditionalAccess to the buildings is limited, if we have a query and need a member of staff to clarifysomething it will only happen during business hours. They can easily decide to hold backour FIAT and restrict our access to it.The OP has listed everything positive Bitcoin has to offer to counter the FIAT system itsjust that paying for goods and services is not widespread yet.Also - dont forget Bitcoin is borderless!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 01, 2023, 12:31:18 PM",
      "body": "The another thing is privacy and saving time, you have a choice to become anonymous. Saving time, you don't have to wasting your time to communicate with the banks employer, especially when you move big amount of money or they detect there's suspicious activity in your account.Quote from: gunhell16 on September 01, 2023, 12:24:16 PMAlso, this Binance exchange has been in the business industry for a few years. I would rather store here at this exchange than at the bank, to be honest.In terms of assurance, there's no company will back up Binance in case of bankruptcy due not regulated by government. While banks are still prone to bankruptcy, but FDIC will cover it although there's a maximum amount they can afford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wend",
      "created_time": "September 01, 2023, 12:37:51 PM",
      "body": "Quote from: gunhell16 on September 01, 2023, 12:24:16 PMQuote from: Hatchy on September 01, 2023, 12:10:28 PMQuote from: Nwada001 on September 01, 2023, 11:38:14 AMAll your above-mentioned benefits of bitcoin could only be possible if you are not using a custodial service, because if you are using a centralised exchange to store your bitcoins or other currency and you expect things to be different from the banking sector, then you will be mistaken. When talking about the benefit and why it's good not to save on a local bank account, it's almost the same thing as why you shouldn't have funds where you don't have a private key or phrase.  NOT YOUR KEY, NOT YOUR COIN Not your control, not your money. I guess it will be more appreciated if you can outline your statement clearly and differentiate between the use of a custodial system and that of a non-custodial system, as many people see the use of bitcoin and other currencies as the same, irrespective of where they are being saved or used to transact with them.I get your point @Nwada001 but It has never been advisable to store your funds in exchanges that are centralized. Bitcoin has a decentralized system, but it all depends on how you choose to store your Bitcoin.both the centralized and decentralized exchanges has different futures and functions thus many people has different choice depending on what best suits them. The banking system offers you less choice as compared to what Bitcoin system has to offer.Many have said here in the forum that it is not good to store Bitcoin on centralized exchanges, even though it is one of the top exchanges in this field. It's been years since I read such words of warning in the communities here, and I don't see anything wrong with this warning.That's why we can't stop others from storing in centralized exchanges like Binance; even I have some stored in this exchange, but it's not a big amount, because it depends on trust and belief in the exchange. Also, this Binance exchange has been in the business industry for a few years. I would rather store here at this exchange than at the bank, to be honest.There is no difference between storing assets on centralized exchanges and banks, even I think the opposite, storing assets on centralized exchanges is a lot more risky than deposit money in the bank. In short, there is no big difference between these two as it is no longer your money, you are no longer in full control of it. I do not agree with the idea of leaving money on exchanges but I cannot deny that we still need to use CEX and banks. They are still useful to us in many use cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 01, 2023, 12:49:58 PM",
      "body": "With the local banks, there's a certain upgrade you'd need to access to allow you store a huge amount of money if you are not using a current account else it would be assumed that the money you own was probably gotten through dubious means and if you can't present proof that you own such amount through honest means, your funds get locked but that's not the same with Bitcoin. I mean, that's if you don't misplace your keys or seed phrases. The traditional fiat and banks tend to control your every move and go as far as deeming it mandatory to keep you and your funds \"safe\" whereas it's just a camouflaged way of monitoring you, ridding you of your privacy.Recently, in my country, social media handles of customers were demanded for and I quote \"regulation to prevent crime and terrorism and also to boost the precision and thoroughness of customer verification \". But in Bitcoin, with it's peer to peer network, this doesn't happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "September 01, 2023, 12:51:11 PM",
      "body": "I have also experienced this incident with the mobile banking application and it was very disturbing. There is something even worse that has happened when dealing with banks, namely long queues. Every time a customer experiences a problem, there is always a soft voice that comes from the officer's lips, be patient, sir. Soon everything will go back to normal.Quote from: Hatchy on September 01, 2023, 11:19:37 AMAbsolute Control: Bitcoin empowers you with complete control over your finances, eliminating the need to rely on third partiesUnrestricted Access: You can access your Bitcoin holdings at any time, without being subject to arbitrary restrictions Enhanced Security: Bitcoin provides robust security measures that surpass the often-vulnerable systems of traditional banks.Cost-Efficiency: Unlike banks, Bitcoin doesn't burden you with monthly maintenance fees, card maintenance costs, or hidden charges.investment capital: Investing in Bitcoin offers the potential for long-term profits as its price tends to increase over time. In contrast, traditional banks often do not provide substantial long-term interest on the money they loan out, making Bitcoin an appealing alternative for those seeking high returns on their investments.I hope this will also be shared with friends who can be discussed so that all the advantages of Bitcoin can be known to them and from them information about the advantages of Bitcoin can also be spread widely again because currently we really need parties who explain to people that Bitcoin is a breakthrough towards the independence and freedom of the financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "September 01, 2023, 01:05:46 PM",
      "body": "If you are holding Bitcoin in a non-custodial wallet then congrats, you have raised every third-party eye from your worth, including Banks and your Government, I am no more a fam of Fiat since I knew about Bitcoin years ago, I hardly use Fiat or keep money in the bank now, unless I need some things to buy, that's when I consider using peer to peer platform to convert my Crypto back to Fiat. There are few local banks in my country right now that are somehow stealing from people, there are few people that have been saving their money in these banks for years and maybe the Bank thought they are dead, these people came back from the U.S. and they found out that their account balance is empty. At first I thought the victims are responsible for this, maybe someone managed to get access to their bank account online and start moving their money, but after some legal steps involving the law and some powerful people, to my surprise the Bank said the fault is from them, that they will refund every penny, imagine, I will never trust my money with the Banks, this habit is growing in numbers over here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smeet",
      "created_time": "September 01, 2023, 01:18:30 PM",
      "body": "In the comparison between Bitcoin and fiat currency, Bitcoin stands out for its potential to grant individuals greater power and control over their assets, thanks to its decentralized nature and transparent blockchain technology. It offers accessibility to a global reach and also has a limited supply, which some can see as a hedge against inflation.However, I believe that Bitcoin is also marked by significant volatility, limited acceptance for everyday transactions due to its mining process, a lack of regulation that can lead to risks. Whether Bitcoin is a better choice than fiat currency depends on individual preferences, risk tolerance, and financial goals. Diversification and informed decision-making remain important aspects of managing one's finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "September 01, 2023, 01:33:03 PM",
      "body": "About absolute control, it can only happen if you keep it in self-custodial wallets like Ledger Nano (not opting for the recovery feature), Trezor, Tangem, SecuX and more and not stored in centralized exchanges. As for hot wallets like the good ol’ Blockchain Wallet, it is still vulnerable to getting exploited and/or hacked because we cannot deny that these hackers are getting smarter and intelligent in their skills and knowledge just t penetrate these wallets being created online even if it means self-custodial. Cold wallets are better for storing Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "September 01, 2023, 02:29:16 PM",
      "body": "The presence of BTC serves as an alternative to address the shortcomings of FIAT currency, although not all of FIAT's shortcomings translate into advantages for BTC. While this may be a bitter truth for Bitcoin enthusiasts, we can, at the very least, grasp Bitcoin fairly. In my country, Bitcoin still cannot be used to purchase goods or services, which imposes certain restrictions and hinders me from exploring its features more freely.One valuable function I have found is the ability to easily pay for services from other countries that my local bank cannot facilitate. This function has truly been a great help to me.In essence, I use Bitcoin by harnessing it as an investment vehicle and a straightforward means of conducting transactions across borders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "September 01, 2023, 03:03:58 PM",
      "body": "The first two of the benefits were less likely to be utilized by Bitcoin holder, especially the newbie. They don't yet have the knowledge to use non-custodial wallet where they have full control over their own fund, most of them stored it in an online wallet, or worse some of them even store bitcoin in the centrailzed exchange wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "September 01, 2023, 03:18:09 PM",
      "body": "I understand that anarchic statement and bitcoin = freedom ideas but I dont accept that as a complete cult like thing. You have be realistic here, the world does not run on bitcoin, but on fiat and for the next years of our lifetime bitcoin will grow but at a slow pace, maybe our next generations might see bitcoin running the economy but I have my doubts and I feel a coexistence will be happening.Still, I do encourage people to use their bitcoin if possible, but many have the opinion of \"never sell only buy\" - because buying goods with bitcoin is essentially selling your coins. Like we have seen, bitcoin is freedom and we are free to make our own decisions here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "September 01, 2023, 03:20:01 PM",
      "body": "Bitcoin is the new bank.There is no point in trying to argue which banking or Bitcoin is better when Bitcoin is obviously the next-gen bank? Is that not its called \"be your own bank?\". For some people, it seems time to take that literally. . Not much point in saying that here for any older Bitcoiners. Really thats just the message for newbie Bitcoiners.One of my favorite aspects of Bitcoin is how its deflationary. There can never be more than 21 million Bitcoin in supply. But it is always possible for there to be less (forever lost wallets, for example).The value of each Satoshi would only go upwards, if the world adopted Bitcoin as legal tender. Which it will. I cannot wait for that day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 01, 2023, 03:28:28 PM",
      "body": "Your perspective highlights the appeal of Bitcoin as a decentralized and transparent alternative for those seeking more control and potential financial benefits. Bitcoin offers a number of features that make it a more attractive option for many people. The potential rewards of investing in Bitcoin are significant, and I believe that it is a worthwhile risk for those who are looking for a more secure and efficient way to store and transfer their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}