{
  "id": "topic_5426602",
  "title": "SunGlassesRon",
  "author": "SunGlassesRon",
  "created_time": "December 07, 2022, 08:32:33 PM",
  "content": "Hello AllI bought 2 of  these  miners  from Aliexpress AvalonMiner 1246 they both where mining fine till one packed up after a week and a half. They did not overheat as I live in UK and it is cold in my garage the hottest board was around 70 to 72 I have been back and forth with seller but they either are useless or know what problem is and don't care I am no expert but I thought since I had two the first thing I swapped was the PSU with no success so today I swapped the control board still no good. My problem is I cant understand how all 3 boards could go down I am contemplating swapping a board  but I know there are experts here so I thought I could show log and someone could point me in right direction.Many thanks for any advicehttps://www.dropbox.com/s/a3qx9wkj45k9yyw/Screenshot%202022-12-07%2013.05.20.png?dl=0https://www.dropbox.com/s/66kirln63bdke18/Screenshot%202022-12-07%2013.05.12.png?dl=0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426602",
  "comments": [
    {
      "author": "ben120",
      "created_time": "December 07, 2022, 09:07:26 PM",
      "body": "Hello! I'm not sure I understand everything, but your miner seems to work, it looks like a configuration problem, I'll leave you these few links, maybe they can help you, I had an avalon usb miner, but that's all what I can dohttps://github.com/Canaan-Creativehttps://download.canaan-creative.com/https://holybitcoin.com/avalon-nano-setup-guide/on github or on the \"holy bitcoin store\" you could be informed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 07, 2022, 10:53:17 PM",
      "body": "Bootby said it has no hashrate and the systemstatus says you only have one hashboard detected.Maybe the PSU you replaced is defective or incompatible with your unit.However, the logs say a few hashboard have lost contact try the cable if they do have a connection if it doesn't have any connection replace them or if it still doesn't work the two hashboard might be already broken. Try to run them one by one to check which detected normally and then swap PSU wires and cables to other hashboard that are not detected to the detected one to test.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 12, 2022, 10:50:58 PM",
      "body": "It seems that the fan is not automatically running at high speed after the hash board reaches its temp limit.Would you mind to try aging to calibrate the miner?Use the FMS tool to aging the miner you can download the tool here https://canaan.io/service/447There is 3 FMS tool only one has an aging button so download the 2nd or I think the 3rd one from that link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 14, 2022, 12:32:19 AM",
      "body": "Is it stuck on scanning? Would you mind to try to hold the func button for 15sec from your miner while the FMS tool is scanning if didn't work try the rst button?If still stuck on scanning it might be your PC firewall blocking it from scanning. Try to disable the firewall first and try again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "January 19, 2023, 11:04:29 PM",
      "body": "Quote from: SunGlassesRon on January 18, 2023, 07:44:46 PMDid you say before about aging miner it was mentioned by avalon support but I am not sure how to do that.Many Thanks for any adviceI already post it before from my previous post that you can try aging just download the tool from Canaan the link is already my post above. Make sure to download version 2.3.3 because the other FMS tool doesn't have the aging button that's the easier one.However, you can download other FMS tools and use commands to aging the miner. You can find commands on my old post below including the Aging command.- https://bitcointalk.org/index.php?topic=5381842.msg59012568#msg59012568",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinerMetrix",
      "created_time": "January 26, 2023, 05:57:47 AM",
      "body": "Quote from: BitMaxz on December 12, 2022, 10:50:58 PMIt seems that the fan is not automatically running at high speed after the hash board reaches its temp limit.Would you mind to try aging to calibrate the miner?Use the FMS tool to aging the miner you can download the tool here https://canaan.io/service/447There is 3 FMS tool only one has an aging button so download the 2nd or I think the 3rd one from that link.If you start the aging process without 3 good hash boards then it will be stuck in aging-mode until you fix the hash boards. All versions of FMS have the command line tool: click the diagnose button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinerMetrix",
      "created_time": "January 26, 2023, 06:09:46 AM",
      "body": "Quote from: SunGlassesRon on December 07, 2022, 08:32:33 PMHello AllI bought 2 of  these  miners  from Aliexpress AvalonMiner 1246 they both where mining fine till one packed up after a week and a half. They did not overheat as I live in UK and it is cold in my garage the hottest board was around 70 to 72 I have been back and forth with seller but they either are useless or know what problem is and don't care I am no expert but I thought since I had two the first thing I swapped was the PSU with no success so today I swapped the control board still no good. My problem is I cant understand how all 3 boards could go down I am contemplating swapping a board  but I know there are experts here so I thought I could show log and someone could point me in right direction.Many thanks for any advicehttps://www.dropbox.com/s/a3qx9wkj45k9yyw/Screenshot%202022-12-07%2013.05.20.png?dl=0https://www.dropbox.com/s/66kirln63bdke18/Screenshot%202022-12-07%2013.05.12.png?dl=0The unit is in normal mode, it needs to be in High Performance mode (Configuration tab on the backstage, after changing click Reboot). None of your fans are connect/working. Only found 1 hash board with 120 total ASICS, indicating possible hash board problems. Your SF is not the same as your ATABD's, either the frequency command was entered or it is auto-tuning to shut down due to no hash rate in 5 minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinerMetrix",
      "created_time": "February 25, 2023, 07:42:03 PM",
      "body": "On your backstage log it indicates \"WORKMODE[0]\". Which means your unit is in normal operation mode, so I will never reach within 6% of designated hash rate. Click on the \">Configuration\" link on the backstage, then at the very bottom change the \"Mode:\" dropdown to \"High Performance\". Click 'Reboot' and it should fully hash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 25, 2023, 10:45:03 PM",
      "body": "Based in your logs what I see is that the two hashboards are overheating and your tmax is reach more than 85c this can cause miner to stop hashing.What I would like you to try is to cool down your miner try to put extra fan and make sure to exhaust hotair/heat from the room.You can also run the fan at 90% or full speed to help hashboard to cool down.You can use this command below to increase the fan speed.Code:[{\"command\":\"ascset\",\"parameter\":\"0,fan-spd,90\"}]You can submit this command using FMS under diagnose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}