{
  "id": "topic_5444159",
  "title": "BlackHatCoiner",
  "author": "BlackHatCoiner",
  "created_time": "March 09, 2023, 08:09:26 PM",
  "content": "Το παρόν νήμα θέλω να το αφιερώσω στην ιδιωτικότητα, καθώς δεν υπάρχει ήδη ένα. Έχουμε κάνει διάφορες συζητήσεις περί ιδιωτικότητας και ανωνυμίας, αλλά είναι σκόρπιες σε πολλά threads. Μπορεί αργότερα να αρχίσω να παραθέτω και μεταφρασμένα άρθρα εδώ, και να λειτουργήσει σαν χρήσιμη λίστα από τακτικές προστασίας. Μερικά θέματα προς συζήτηση:Πόση ιδιωτικότητα χρειαζόμαστε στις συναλλαγές; Σας ενδιαφέρει / ενοχλεί αν δεν έχετε; Θα πληρώνατε ποτέ λίγο παραπάνω αν πρόκειται να είχατε υψηλότερα επίπεδα ιδιωτικότητας;Σας αρκεί η ιδιωτικότητα στο bitcoin; Πιστεύετε πως χρειαζόμαστε κι άλλη;",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444159",
  "comments": [
    {
      "author": "cryptosize",
      "created_time": "March 10, 2023, 04:37:02 PM",
      "body": "Προσωπικά στα του BTC με ενδιαφέρει να δω ποιά θα είναι η πορεία υιοθέτησης του BOLT12, γιατί μέχρι στιγμής σε deployment υπερέχει το LND έναντι του CLN...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 17, 2023, 07:35:43 PM",
      "body": "Quote from: cryptosize on March 10, 2023, 04:37:02 PMΠροσωπικά στα του BTC με ενδιαφέρει να δω ποιά θα είναι η πορεία υιοθέτησης του BOLT12, γιατί μέχρι στιγμής σε deployment υπερέχει το LND έναντι του CLN...Εμένα με ενδιαφέρει να υλοποιηθεί κάποια στιγμή, απλά για να το δοκιμάσω. Έχω δοκιμάσει να παράξω offer αλλά δεν έκρυψε το node ID μου. Μου απάντησε ένας κάτω πως χρειάζεται να είναι enabled το blinded paths, αλλά δεν βλέπω να υποστηρίζεται ακόμα από το CLN. Είχα στείλει και μέιλ στον Rusty (που είναι ο δημιουργός του BOLT12) αλλά μου είπε πως δεν είναι έτοιμο ακόμα. Το LND με τις χρηματοδοτήσεις που έχει λογικά θα είναι πάντα ένα βήμα πιο μπροστά. Το CLN είναι πιο tech-focused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}