{
  "id": "topic_5428341",
  "title": "Stepstowealth",
  "author": "Stepstowealth",
  "created_time": "December 13, 2022, 10:40:23 PM",
  "content": "Can someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply. I checked another topic on the same place, and I could not reply still. Then I tried another place to see that I could reply, can someone please explain to me so I can learn, learning is my earnest desire.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428341",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "December 13, 2022, 11:06:59 PM",
      "body": "This decision was made around five years ago to decrease spam on \"Serious discussion\" and its child board \"Ivory Tower\". For more information, read the post made by theymos.Quote from: theymos on January 10, 2018, 05:12:05 PMI see that newbies were already posting junk in Serious Discussion, so I made changes: - The member limitations are moved up one rank. You must be a Jr Member to post in Serious Discussion and a Full Member to post in Ivory Tower - Posts in Serious Discussion only activate a potential-activity period. They do not increase your post count. - Posts in Ivory Tower neither activate a potential-activity period nor increase your post count.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "December 13, 2022, 11:41:27 PM",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PMCan someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply. I checked another topic on the same place, and I could not reply still. Then I tried another place to see that I could reply, can someone please explain to me so I can learn, learning is my earnest desire.Yeah.... What Hosse said is actually true... Newbies have been restricted on these options Cus who knows? anyone could just pop-up and Begin to write some execrably, crappy garbage ( put together). Some doesn't make any sense and could be something totally different from the topic sentence, wack!! You checked another topic and you was able to reply? That should tell you that it ain't getting optimised for every board.Well, on the other hand -- if you were a member -- it's either the thread is locked, you don't have up to atleast 300 post (for some threads),or you have that particular board on ignore (which I don't think it'll show up as an option for you). You just have to keep posting to get your ranks just so you'd participate anyway, anytime you want.Sandra 🧑",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 14, 2022, 09:34:51 AM",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PM<...>As far as I’m aware, Rank restriction to post apply only the previously mentioned Serious Discussion and Ivory Tower boards, as well as to the Investigations board. Whilst the former two mentioned boards do allow you to read the content within whatever your rank (not post, as mentioned in @hosseinimr93's quote), the latter, Investigations, can’t be accessed, even to read it, until you reach Member Rank.A few related additional things to consider would be:- You need to become a Jr. Member (or acquire a Copper Membership) to post visible images on the forum.- Posting frequency is limited by your Activity (not Rank), as per the following formula:Quote from: theymos on December 25, 2013, 03:50:28 AM<…>Code:waittime = 360;if(activity >= 15)        waittime = (int)(90 - activity);if(activity >= 60)        waittime=(int)(34.7586 - (0.0793103 * activity));if(activity >= 100)        waittime = max((int)(14-(activity/50)), 4);Essentially, you start-off with a 6 minute cool down time between posts, and as your Activity increases, it can go down to 4 seconds between posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 14, 2022, 09:42:43 AM",
      "body": "Yeah, there are restrictions on certain boards but in all honesty, those aren't related to bitcoin or crypto anyway. You aren't going to learn anything bitcoin-related by browsing and posting in Serious Discussion or the Ivory Tower. You are welcome to participate in the discussions in all sub-boards that mean something though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 14, 2022, 09:50:20 AM",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PMCan someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply.Have you considered the topic again and again that says serious discussion, have you taken your time to study and discover the rules that already stated it not to include the newbies, for goodness sake we have alot of threads, thousands of topics and a numbers of boards including the locale you belong to where you can find interesting to make your post even that similar thread could be suitable for you by finding a board it could fit in with your reply intended, that is the rule and respect it for the forum, it's either you wait till you rank up or locate other boards where your reply could fit in as well, moreover this should be a thing of less concerned to you because you have varieties of where you can post been a newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aqua_Man",
      "created_time": "January 11, 2024, 09:23:36 AMLast edit: January 11, 2024, 09:38:59 AM by Aqua_Man",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PMCan someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply. I checked another topic on the same place, and I could not reply still. Then I tried another place to see that I could reply, can someone please explain to me so I can learn, learning is my earnest desire. That's right—newbies aren't allowed to respond to threads.  Due to the rank \"newbie,\" some users may post replies that are off-topic or even irrelevant because, as the name suggests, we're relatively new to the forum and haven't learned much. Many of us haven't even read the rules, so we may spam or plagiarise. In order to prevent negative trust  and getting banned, users may choose to lock the thread. It's a component of keeping us safe and shielding us from tragedies like these. Additionally, there are some that aren't important enough for you to research or learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 11, 2024, 09:47:05 AM",
      "body": "Almost most of us cannot post here ----> https://bitcointalk.org/index.php?board=87.0 However, there are many boards in the forum in which you can post by creating an account that does not require you to verify the email or any personal data, so whoever wants to learn there Many of the sections are available to everyone, and the sections that give rank restrictions are either not related to Bitcoin or the restrictions are set to avoid spam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "January 11, 2024, 10:59:09 AM",
      "body": "Those changes were made as consequence of 2017 and 2018 bull market with appearance of ICO scam wave and massive spam in Bitcointalk.Bitcointalk's important historic changesQuote from: tranthidung on September 23, 2019, 06:23:57 AMRestrictions on signature in some boardTwo new no-signature boardsRules for Serious Discussion and Ivory TowerDecisions made for those boards with some restrictions on newbies but theymos tried to find solutions to kill spams by creating this topic.Ideas for improving post quality?Applying those restrictions were not enough and he deployed the merit system that was not enough. Then we have Jr. member demotion.He tried to control spam in Wall Obsever thread tooWhat to do with the wall observer thread?Wall Observer new ownership",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Benedictare",
      "created_time": "January 12, 2024, 06:10:37 PM",
      "body": "Newbies are beginners that have not really read and understood and digest Bitcoin and so involving them in all discussion will make no meaning to them ,they will be lost because there are some terminologies and acronyms that will be used which they will not understand, which make them unable to communicate  and has nothing to offer in the topic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 12, 2024, 11:54:06 PM",
      "body": "Quote from: Benedictare on January 12, 2024, 06:10:37 PMNewbies are beginners that have not really read and understood and digest Bitcoin and so involving them in all discussion will make no meaning to them ,they will be lost because there are some terminologies and acronyms that will be used which they will not understand, which make them unable to communicate  and has nothing to offer in the topic Not all newbie accounts have newbie minds, there are few of them who excel. But since this is a forum, rank restrictions is pretty normal. Most forums do the same like this so it's not new.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "January 13, 2024, 06:38:39 AM",
      "body": "Quote from: hugeblack on January 11, 2024, 09:47:05 AMAlmost most of us cannot post here ----> https://bitcointalk.org/index.php?board=87.0One can understand why certain ranks can't post in Serious Discussion. The reason isn't far fetched as it's in the text to show a level of seriousness to issues discussed. It takes conciseness and in-depth knowledge to address serious issues and these have to do with members exposure to those types of issues, without which nothing of benefit will be derived from such engagements. However, I don't know why  Important Announcements  you mentioned is put under such situation too and members can't respond there. Why can't members reply or react to announcements? Do you know?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 13, 2024, 10:58:33 AM",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PMCan someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply. I checked another topic on the same place, and I could not reply still. Then I tried another place to see that I could reply, can someone please explain to me so I can learn, learning is my earnest desire.Serious discussion board is not meant for everyone to post there especially when you're a newbie, is there anything wrong about that, when there are many other boards you could actually post at and contribute with meaningful posts, do I don't see a reason why this should be a bothering factor on you, that's just how it has always been, the better you get used to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "January 13, 2024, 11:15:36 AM",
      "body": "Quote from: Mpamaegbu on January 13, 2024, 06:38:39 AMHowever, I don't know why  Important Announcements  you mentioned is put under such situation too and members can't respond there. Why can't members reply or react to announcements? Do you know?Because theymos thought for Important announcements, there are nothing good to confuse people who join the thread later and read many posts there. Consequently, he drafted those announcements, published it and locked it ASAP.If I was him, I would do the same.If forum members want to discuss about those announcements, they can simply create discussion topics.What you pointed your fingers on can be seen with DT update log which does not belong to Important Announcements child board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 13, 2024, 01:44:07 PM",
      "body": "I'm a bit confused with this question, or at least the way it's asked. It seems it's raised from somebody who's a newbie, which you are not. You're already a full member. Were you supposed to post this from another account, a newbie one? Anybody please correct me if I'm wrong but I think a full member can already post replies on topics under Serious discussion. Are you sure that this account of yours which is already ranked full member cannot join discussions under the Serious discussion board?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 13, 2024, 02:12:52 PM",
      "body": "Quote from: Darker45 on January 13, 2024, 01:44:07 PM<…>Take a look at the dates:-   OP’s account was created on the 28/10/2022-   OP’s post was created on the 14/12/2022OP was therefore fairly new at the time when he posted the question, and therefore it makes perfect sense. The thing is that this thread was resurfaced over a year later, which is somewhat odd, as the thread should have been deeply buried by now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 14, 2024, 01:38:33 AM",
      "body": "Quote from: DdmrDdmr on January 13, 2024, 02:12:52 PMQuote from: Darker45 on January 13, 2024, 01:44:07 PM<…>Take a look at the dates:-   OP’s account was created on the 28/10/2022-   OP’s post was created on the 14/12/2022OP was therefore fairly new at the time when he posted the question, and therefore it makes perfect sense. The thing is that this thread was resurfaced over a year later, which is somewhat odd, as the thread should have been deeply buried by now. As much as I avoid replying in a resurrected thread, I sometimes fail to take notice of the dates. I failed on this one once again. Thanks for pointing this out. I actually made my reply when the topic was at the top. And seeing that it was still at its first page and the latest replies were also posted very recently, the impression was that it was just newly created. I was wrong. But now I understand how this thread has resurfaced. Since this was bumped by a newbie, he/she might have been searching, exploring, and reading newbie topics. It so happened he/she made a reply on this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "January 14, 2024, 08:59:55 AM",
      "body": "Quote from: Pmalek on December 14, 2022, 09:42:43 AMYeah, there are restrictions on certain boards but in all honesty, those aren't related to bitcoin or crypto anyway. You aren't going to learn anything bitcoin-related by browsing and posting in Serious Discussion or the Ivory Tower. You are welcome to participate in the discussions in all sub-boards that mean something though.As the name implies 'serious discussion, another is ivory tower, so meaning that the topics discussed there are not for everyone, I've personally rarely visited that board. We have many boards where i can fully perticipate and make meaningful contributions in the forum, I wouldn't worry about posting in restricted areas. I can understand restrictions for newbies in specific boards, where their inputs are not required, it takes experience for older members to make quality contributions there. Bitcointalk forum is an interesting place to visit everyday, and there are more than enough boards and sub boards to engage in discussions, rather than a few restricted areas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Riginac111",
      "created_time": "January 14, 2024, 09:57:05 AM",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PMCan someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply. I checked another topic on the same place, and I could not reply still. Then I tried another place to see that I could reply, can someone please explain to me so I can learn, learning is my earnest desire.If am even moderate I will restrict some certain ranking positions to place they will post, secondly some newbies comments is different from those people that have being dwelling in this place, so what we need to understand is that newbies responses sometimes is not a perfect match to what the discussion is all aboutI'm a beginner and I find it very difficult for me to understand the forum, since two years now I registered in the forum but I don't respond to something I don't understand, if check some threads you will what newbies respond if their response is a match with the discussion, I according to people that responded so far that the restrictions of newbie in certain threads has being there over five years I would love them to make some more restrictions for newbies because they over flood some threads with spam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zigabel",
      "created_time": "January 14, 2024, 10:47:48 AM",
      "body": "Quote from: Stepstowealth on December 13, 2022, 10:40:23 PMCan someone tell me a reason why newbies are not granted access to reply some topics in some places here. For instance, I saw a topic in \"serious discussion\" side that I would have loved to add some talk to the discussion, but I noticed that although I could read it, there was no option for me to reply. I checked another topic on the same place, and I could not reply still. Then I tried another place to see that I could reply, can someone please explain to me so I can learn, learning is my earnest desire.A simple and straight answer would be because you are newbie and it's expected you do more of learning at this point a.d so it's assumed most newbies have limited knowledge about what's been discussed in such board, I know some newbies outside the forum has got some varsertile knowledge in the crypto space but we're newly or recently introduced to the forum so they are not newbie in actually sense but on this forum you are regarded as one so you work to get pass that stage and you will be able to contribute across all boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}