{
  "id": "topic_5457446",
  "title": "Framelover",
  "author": "Framelover",
  "created_time": "June 24, 2023, 06:02:24 PM",
  "content": "My pipu, who Una think say de at fault for dis tragedy wey sup as some of us go don hear am for news about d serious gbege wey hit residents of Trademore Estate wey de Lugbe for inside we Capital Territory wey be Abuja. Heavy rain wey fall on Friday wey first start like play play come later turn to serious mathias as d water swallow plenti houses (about 116). D water catch d resident for d area by surprise as d plenti water suddenly pass de drainage system wey been no too strong as water begin pass garri. As e happun so, d flood water just begin rise, sotey e don cover d entrance of d estate. D aftermath come leave plenti damage for d area.Make una find more info about d mathias from Punch https://punchng.com/flood-wreaks-havoc-in-abuja-submerges-116-buildings/?ampVanguard for d end of their story also mention say d rumor wey be say 1person die, say na lie https://www.vanguardngr.com/2023/06/early-morning-flood-submerges-116-houses-in-abuja/amp/Also, news gather am say d place been don already de marked for demolition for long based on say d area de prone to flood but government never respond by demolishing d area.As for me, I get strong feeling say as dem mark d estate for demolition, shareholders of d estate fit don bribe pipu wey de in charge make dem no for demolish d area nd dis na pure wickedness wey we de do ourselves cuz why risk people’s lives cuz of money?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457446",
  "comments": [
    {
      "author": "RockBell",
      "created_time": "June 29, 2023, 11:25:08 PM",
      "body": "I learned through the news that most of the houses in the estate have been demolished. People have refused to leave the residence that has been marked for demolition. The destruction was sad, and I am certain that the estate does not have sufficient drainage or is not properly managed.  I believe that organizations must take their jobs seriously because the damage is a significant threat to life. I'm sure a lot of thought has gone into it, and something will be done since it involves people's lives. According to NIMET the rain has just began so more is coming, people needs to start doing what is right to avoid occrances in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}