{
  "id": "topic_5421794",
  "title": "yoshimitsu777",
  "author": "yoshimitsu777",
  "created_time": "November 17, 2022, 09:42:46 AM",
  "content": "i thought the S17+ had 76 TH, now I read in the specifications at Bitmain that it is specified with 67 TH. What is true now?what about the reliability of the S17Pro and S17+ models?price aside, would you rather recommend the S17Pro or S17+ and for what reasons?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421794",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "November 17, 2022, 03:51:51 PM",
      "body": "Have you read the specification you provided above?Check it again and scroll down.They release 4 types of s17+ they do also have s17+ 76TH/s and s17+ 67TH/s.About comparison between them check this https://bitcointalk.org/index.php?topic=5230097.0Its only related to temp comparison for s17+ and the pro version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 17, 2022, 03:55:18 PM",
      "body": "I would skip them and find a s19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 19, 2022, 04:59:36 PM",
      "body": "From my limited experience with an S17 Pro, I would say to avoid them if possible. Mine rarely ever ran close to the advertised speed and boards went bad so frequently that it was basically a complete waste of money. Not sure if I was just extremely unlucky, but I would say it was my worst experience with mining hardware and reliability. Maybe not as bad as the old CoinTerra machines, but for the time the S17 came out it seems extremely unreliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ndgo",
      "created_time": "November 20, 2022, 09:29:24 AM",
      "body": "The heatsink mounting on every model of the S17 is so garbage, that if you somehow manage to get a 17 to your mining location without losing one you deserve a prize. Find a cheap S19 or go whatsminer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skot",
      "created_time": "November 21, 2022, 03:28:15 PM",
      "body": "Does anyone have a S17 they want to sell me? I don't mind heatsinks that have fallen off, but I'd like minimal bad chips.I'm reverse engineering the BM1397 ASIC, so it will be put to good use!https://github.com/skot/BM1397/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betosworld",
      "created_time": "November 21, 2022, 08:28:20 PM",
      "body": "I work for SafeTek Solutions in the Houston area of TX. We had bought about 5000 of the 17 series, and due to the manufacturer's solder defect, they started to drop like flies eventually. We were losing about 75 miners a week.We now have a facility here that has created a proprietary refurbishment process to effectively rid the 17 series of that shit solder. We sell our refurbished miners as well as \"as-is\" miners if requested. We put a ton of work into each hashboard to get the miner stable and at the expected hashrate, but there are cases where it truly is just the hardware's fault. Bitmain really messed up with the 17 series, but it IS possible to solve. Just be very weary as everyone is selling T/S17+ \"upgraded\" and most of these people are not getting the defective solder off of the hashboard, and it's essentially the same problem of the solder melting, but with a prettier and more secure heatsink.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yoshimitsu777",
      "created_time": "November 23, 2022, 08:45:23 AM",
      "body": "thanks a bunch to all --- that was very helpfulwill stay away from s17",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mcpepe",
      "created_time": "November 29, 2022, 12:51:40 PM",
      "body": "Quote from: yoshimitsu777 on November 23, 2022, 08:45:23 AMthanks a bunch to all --- that was very helpfulwill stay away from s17the S17+ model is a powerful but delicate model. you need to have 17 series experience to keep them operational, you can always purchase upgraded sheet metal models. Even if I recommend a pro before a +.On the contrary, the s17 pro is a great team. if it has been decently taken care of,a greeting",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yoshimitsu777",
      "created_time": "December 05, 2022, 07:30:12 AM",
      "body": "which s19 would be recommended if it should not be the XP but rather a smaller cheaper model? i see there are S19pro-104TH, S19pro-110TH, S19a Pro-110TH, S19-95TH, S19j Pro-96TH, S19j Pro-104THwhy these strange names and different hash rates?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yoshimitsu777",
      "created_time": "January 02, 2023, 09:37:15 AM",
      "body": "noone knows?any suggestion on s19?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "altair_tech",
      "created_time": "January 04, 2023, 05:14:57 PM",
      "body": "S17 series is super unreliable, but I have a slight preference for S17 Pro over S17+ . Got with a S19 or XP, if you can afford it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}