{
  "id": "topic_5521655",
  "title": "Catenaccio",
  "author": "Catenaccio",
  "created_time": "December 05, 2024, 02:41:56 AM",
  "content": "Several minutes ago, Bitcoin after many days of delays, hits $100,000 and even breaks it to about $101,000.Is Bitcoin dead after many years of \"Death\" fud?https://99bitcoins.com/bitcoin-obituaries/The message is simple from Bitcoin performance today, it has never been death and it won die in future.Michael Saylor ⚡ (MicroStrategy) Portfolio Tracker. Michael Saylor has another big celebration for his successful investment in Bitcoin.https://saylortracker.com/ shows that the portfolio brings $17.2B in profit now.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521655",
  "comments": [
    {
      "author": "cr1776",
      "created_time": "December 05, 2024, 02:43:58 AM",
      "body": "Another milestone.  The same type of people saying \"it's a ponzi/tulips/dead\" haven't change since well under a dollar in 2010 and dollar parity in 2011. $30, $100, $1000, $10,000, $20,000 etc. Quote from: Catenaccio on December 05, 2024, 02:41:56 AMSeveral minutes ago, Bitcoin after many days of delays, hits $100,000 and even breaks it to about $101,000.Is Bitcoin dead after many years of \"Death\" fud?https://99bitcoins.com/bitcoin-obituaries/The message is simple from Bitcoin performance today, it has never been death and it won die in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 05, 2024, 02:45:32 AM",
      "body": "yep watching the market on things like https://exchange.coinbase.com/trade/BTC-USDjust went crazy with activity in those minutes. the greens and reds flickered faster then ever, like a bad tug of war game between green and red flashy lights just going crazy on the trade history paneldefinitely seemed to have woke up all the bots",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "December 05, 2024, 02:47:23 AM",
      "body": "Quote from: cr1776 on December 05, 2024, 02:43:58 AMAnother milestone.  The same type of people saying \"it's a ponzi/tulips/dead\" haven't change since well under a dollar in 2010 and dollar parity in 2011. Etc. Compare Tulip mania to Bitcoin is bad, because tulip bulb supply is unlimited, inflationary but Bitcoin supply is inflationary but with less and less inflation rate with time. Since 2009, there are 19.79M bitcoins were mined from Bitcoin blocks that account for 94.24% of Bitcoin total supply.There are not too many bitcoins from Bitcoin block subsidy until 2140 from Bitcoin mining.https://en.bitcoin.it/wiki/Controlled_supply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "December 05, 2024, 02:49:45 AM",
      "body": "Quote from: Catenaccio on December 05, 2024, 02:41:56 AMSeveral minutes ago, Bitcoin after many days of delays, hits $100,000 and even breaks it to about $101,000.Is Bitcoin dead after many years of \"Death\" fud?https://99bitcoins.com/bitcoin-obituaries/The message is simple from Bitcoin performance today, it has never been death and it won die in future.Michael Saylor ⚡ (MicroStrategy) Portfolio Tracker. Michael Saylor has another big celebration for his successful investment in Bitcoin.https://saylortracker.com/ shows that the portfolio brings $17.2B in profit now.BTC have reached yet another milestone now and has crossed the $101k mark, this is another time for BTC to prove the naysayers wrong and validate it's potentials against limiting predictions from those that thinks lowly of it. This is just the beginning of the good tidings. Congratulations to those who held long enough and new investors who made the right decisions. BTC is just starting, the potentials getting greener everyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "December 05, 2024, 02:51:07 AM",
      "body": "Quote from: Catenaccio on December 05, 2024, 02:47:23 AMQuote from: cr1776 on December 05, 2024, 02:43:58 AMAnother milestone.  The same type of people saying \"it's a ponzi/tulips/dead\" haven't change since well under a dollar in 2010 and dollar parity in 2011. Etc. Compare Tulip mania to Bitcoin is bad, because tulip bulb supply is unlimited, inflationary but Bitcoin supply is inflationary but with less and less inflation rate with time. Since 2009, there are 19.79M bitcoins were mined from Bitcoin blocks that account for 94.24% of Bitcoin total supply.There are not too many bitcoins from Bitcoin block subsidy until 2140 from Bitcoin mining.https://en.bitcoin.it/wiki/Controlled_supplyExactly and yet the same type of people are saying the same things with little understanding of the protocol, the software, or economic incentives.  Among other things.   Peter Schiff said it will \"never hit 100,000\".  And like others, I'm sure nothing will change his mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "December 05, 2024, 03:06:54 AM",
      "body": "It is still going wild.  It is nearly to 103k.Edit:  and 103k nowQuote from: franky1 on December 05, 2024, 02:45:32 AMyep watching the market on things like https://exchange.coinbase.com/trade/BTC-USDjust went crazy with activity in those minutes. the greens and reds flickered faster then ever, like a bad tug of war game between green and red flashy lights just going crazy on the trade history paneldefinitely seemed to have woke up all the bots",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 05, 2024, 03:12:47 AM",
      "body": "This calls for a celebration! I want to congratulate everybody who believed in Bitcoin, who believed $100,000 would be reached! Today, Bitcoin has won a major battle! The wall has fallen! Finally! From here onwards, sky's the limit! Well, $101,000 was easy. $102,000 is as easy. We're not going to be counting thousands anymore; we're counting tens of thousands in growth. By the way, I'm replying to what appeared as the first thread opened for this particular topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 05, 2024, 03:21:28 AM",
      "body": "This is a milestone for bitcoin that many people should celebrate. In my opinion, I think bitcoin may reach 110k or even more like 120k at fhe end of December. As of now, it's still at 102k. The reason why I said that it may reach 110 or 120k is because it reached 103k so it's 7k less although there's also a chance it wont reach to that amount when there's a delay to reach more than a 100k. Anyway, I might be wrong about it but I believe it may happen.Quote from: Darker45 on December 05, 2024, 03:12:47 AMBy the way, I'm replying to what appeared as the first thread opened for this particular topic. I was going to open a thread about it but it's already created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 05, 2024, 03:22:46 AM",
      "body": "Congratulations to every body who had the patience and positivity to hold on to their Bitcoin.  To many of us who waited so many years to get here, I think this is actually not too surprising.  I felt way more emotion four years ago, these rallies are now simply normality to me.Yet again.  This increases the chances that four years down the road the exact same thing is going to happen.  We all have four more years to prepare for probably another crazy rally.  The cycle is running again.  Congratulations to all of you, to all of us.And to not forget, toast to all the Members who are missing on the rally due to not being around us any more.  Leo, I know you instructed your family well and I hope at least they can raise a glass in your name for achieving this mile stone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "December 05, 2024, 03:24:13 AM",
      "body": "Wow Santa rally in full effect! Christmas came early this year! A toast to all who held strong all these years through thick and thin.Congrats to all and happy holidays. PS: I'm still not selling!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 05, 2024, 03:46:53 AM",
      "body": "Quote from: PrivacyG on December 05, 2024, 03:22:46 AMAnd to not forget, toast to all the Members who are missing on the rally due to not being around us any more.  Leo, I know you instructed your family well and I hope at least they can raise a glass in your name for achieving this mile stone.Indeed! A toast to everybody who have become part of the Bitcoin community in one way or another. This is for all of us! Living and dead, those who hodl until today, those who sold earlier, to the man who created this, to the man who bought pizzas for 10,000BTC, to all those who were forced to convert their coins because of emergencies, to everybody. Perhaps this goes out as well to naysayers and critics. To the likes Peter, Cramer, Taleb, Dimon. You're all part and parcel of the community!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solokan",
      "created_time": "December 05, 2024, 04:17:31 AMLast edit: December 05, 2024, 04:30:38 AM by Solokan",
      "body": "Quote from: DubemIfedigbo001 on December 05, 2024, 02:49:45 AMQuote from: Catenaccio on December 05, 2024, 02:41:56 AMSeveral minutes ago, Bitcoin after many days of delays, hits $100,000 and even breaks it to about $101,000.Is Bitcoin dead after many years of \"Death\" fud?https://99bitcoins.com/bitcoin-obituaries/The message is simple from Bitcoin performance today, it has never been death and it won die in future.Michael Saylor ⚡ (MicroStrategy) Portfolio Tracker. Michael Saylor has another big celebration for his successful investment in Bitcoin.https://saylortracker.com/ shows that the portfolio brings $17.2B in profit now.BTC have reached yet another milestone now and has crossed the $101k mark, this is another time for BTC to prove the naysayers wrong and validate it's potentials against limiting predictions from those that thinks lowly of it. This is just the beginning of the good tidings. Congratulations to those who held long enough and new investors who made the right decisions. BTC is just starting, the potentials getting greener everyday.Yes, today I am finally quite happy with the achievements achieved by BTC and yes, now BTC has managed to penetrate $100k, but now I see on the market that BTC is already in the range of $103k and this is definitely a happy moment for BTC holders because of course there is money now. they have increased. Yes, now people who discuss BTC will definitely be embarrassed at this time because BTC is not actually dead, in fact BTC will continue to live and in the future, BTC will definitely continue to live and progress.Honestly, at first I thought BTC would correct quite deeply, but now people are starting to realize that BTC is a valuable asset and has good potential in the future. Yes, of course, by seeing today's increase, I am even more enthusiastic about continuing to accumulate BTC because BTC has never let me down so far. Yes, I also want to congratulate those of who are still holding on to BTC and of course it took a tough struggle to be able to hold BTC to this day, so congratulations to the people who have successfully held BTC to date. yes btc will definitely continue to grow every day and today btc is really cool.Source: Binance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "December 05, 2024, 05:45:08 AM",
      "body": "Congratulations to everyone who had the courage and patience to keep acquiring BTC even after facing a lot of criticism from Bitcoin haters, and a big congratulations to the people who saw this new milestone coming but couldn't live to witness it I see you all as the real winners and champions.To my late friend Naza thank you for encouraging me not to sell when the pains was even more and to @JayJuanGee I will never stop buying regardless of the situation I found myself and the price of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "December 05, 2024, 06:12:42 AM",
      "body": "Quote from: Catenaccio on December 05, 2024, 02:41:56 AMSeveral minutes ago, Bitcoin after many days of delays, hits $100,000 and even breaks it to about $101,000.Is Bitcoin dead after many years of \"Death\" fud?https://99bitcoins.com/bitcoin-obituaries/The message is simple from Bitcoin performance today, it has never been death and it won die in future.Michael Saylor ⚡ (MicroStrategy) Portfolio Tracker. Michael Saylor has another big celebration for his successful investment in Bitcoin.https://saylortracker.com/ shows that the portfolio brings $17.2B in profit now.This is a clear evidence to those that are still doubting BTC will not go far before it will disappear from the market, the price of BTC has finally hit $102k today, for those that are still hodling BTC to use the opportunity to accumulate profits from the market. Even though BTC will going to die or disappear in the nearest future, it will surely going to hit $1m before such thing will come to reality because I know BTC will not last forever, and we the BTC users we will not last forever which is certain to all living things in the world. I'm very happy that the price of BTC hit the highest price in this month of december, and I have learned a lot of things from the few past bull run I have experienced, and if I have the opportunity to buy BTC when the bear run occur, I think $200k will be my target before I will sell the BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "December 05, 2024, 06:20:50 AM",
      "body": "Quote from: PrivacyG on December 05, 2024, 03:22:46 AMCongratulations to every body who had the patience and positivity to hold on to their Bitcoin.  To many of us who waited so many years to get here, I think this is actually not too surprising.  I felt way more emotion four years ago, these rallies are now simply normality to me.You guys who have seen many of these rallies and now it seems simply normal are the real OGs and I duff my hat to you. For individuals like us that's experiencing this like for first time it looks like the most significant and phenomenal event in the entire history of human kindYes Congratulations to all of us.QuoteAnd to not forget, toast to all the Members who are missing on the rally due to not being around us any more.  Leo, I know you instructed your family well and I hope at least they can raise a glass in your name for achieving this mile stone.I don't know who Leo, you speak so emotional about him and I hope that wherever he is, his happy he has good friends and kind people who still have him and his family in their thoughts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jubalix",
      "created_time": "December 05, 2024, 06:23:38 AM",
      "body": "Quote from: cr1776 on December 05, 2024, 02:43:58 AMAnother milestone.  The same type of people saying \"it's a ponzi/tulips/dead\" haven't change since well under a dollar in 2010 and dollar parity in 2011. $30, $100, $1000, $10,000, $20,000 etc. Quote from: Catenaccio on December 05, 2024, 02:41:56 AMSeveral minutes ago, Bitcoin after many days of delays, hits $100,000 and even breaks it to about $101,000.Is Bitcoin dead after many years of \"Death\" fud?https://99bitcoins.com/bitcoin-obituaries/The message is simple from Bitcoin performance today, it has never been death and it won die in future.becuase they dont understand the implications of zero counterparty risk, nor the value of a clean signal which mean BTC can allocate all capital",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nestex_one",
      "created_time": "December 05, 2024, 06:26:33 AMLast edit: January 09, 2025, 11:43:31 AM by nestex_one",
      "body": "Best day ever. We were having a regular coke and pizza dinner and we got high just seeing btc hit 100,000. Yea I'm one of those who carries the lasting regret of not storing my wallet.dat safely back in 2012~13 because I didn't \"get\" it (I lost it in a hard drive crash, not due to deletion)Sure getting it today though",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "December 05, 2024, 09:22:11 AM",
      "body": "Yeah, finally Bitcoin hit $100,000. The price that we are waiting for a long time that can happen today. It is great to be part of Bitcoin investors who see that monumental price while people out there can't believe if Bitcoin can hit that price. Well it is our time to take the cash out from the exchanges and celebrate that with families or someone we loved. But what will happen after this? Bitcoin will get another correction or it will still increase to the next higher price? We can just sit, wait, and do something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 05, 2024, 04:38:01 PM",
      "body": "I was not early to join the Bitcoin community or even early to invest into Bitcoin but at least I have read so many FUDs and criticism by people who never loved Bitcoin but I am saying a big congratulations to those that believed in the technology and I am honestly happy that with the new price ($104k) it has push shame on the faces of those that said Bitcoin was a scam and that it's price will never get to $100k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}