{
  "id": "topic_5471478",
  "title": "Dextro1",
  "author": "Dextro1",
  "created_time": "October 24, 2023, 01:53:05 PM",
  "content": "Good day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471478",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "October 24, 2023, 01:53:49 PMLast edit: October 24, 2023, 02:04:26 PM by Cantsay",
      "body": "Welcome to Bitcointalk.orgSince you’re new to the forum, it would be best if you go through the rules of the forum so as to help you steer clear from things that might cause you to lose your account and it also explains what each boards are meant for and the type of posts that should be made there. So click here to check out the rules. Next would be for you to learn about bitcoin/cryptocurrency. I don’t know if you are familiar with the crypto world, but since you’re here it would be a great idea to learn about it so as to enable join discussions and also share your thoughts on some topics that you’re interested in. So here are some few links to help you kick start your learning journey, https://github.com/bitcoinbook/bitcoinbook#chapters https://www.bitcoin.com/get-started/ https://learnmeabitcoin.com/Beginners & Encyclopaedia And lastly, the Search feature.  I’m 100% certain that during this period of your learning you’ll surely come across some new things that you don’t understand, and that’s where the search function comes into play— this forum it’s an archive of knowledge so all you have to do is to search for the appropriate keywords and you’ll get the answers that you’re looking for.  So check out the links below to learn how to use the search function properly. But in cases where you’re not satisfied with the result you got from the search you can always create a thread and ask the question there. [1] https://bitcointalk.org/index.php?topic=703657.0[2] https://bitcointalk.org/index.php?topic=5276341[3] https://bitcointalk.org/index.php?topic=5464746.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 24, 2023, 02:08:27 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks! Welcome to this forum, I hope you will find some interesting things to do here and will grow your knowledge more. I would love to share that, you should first read, if you are a newbie, read as many topics as you can, reading will give you more information about cryptocurrencies and even give you an idea of how things work here, because when someone makes a topic, he is not only supported (if right) instead opposed too (if wrong), it proofs the trust on the forum.By reading replies under a topic, you will get to know how you can make replies and what type of replies you should give. I am not saying just take ideas from other replies and write them in your own words and post them, I am saying, you should read them and get an idea how they write it, and in what manner, like is it helping, bashing one, or opposing one. Try to understand the nature of the replies. Avoid abusive language. And try to be helpful and good to others. I am mentioning some threads for you, if you have enough time, you should go through them. Comprehensive guide to Bitcointalk. Newbie friendly + calculator and infographicKnowledge to help you argue with bitcoin criticsPosting techniques for newbies on the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 24, 2023, 02:13:41 PM",
      "body": "Welcome to the forum,Another interesting resource you can use if you want to learn about Bitcoin is https://www.lopp.net/bitcoin-information.html (it's a collection of different info and guides). Of course don't afraid to ask if you are not sure of something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 24, 2023, 02:27:42 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks! A very warm welcome to the forum buddy.Without imposing the regular strategy of posting the references of go through this, that, and learn all this I would love to motivate you, that here you're free to ask, answer and share your thoughts, most likey I can speculate that your entry here on this time is due to the market attractiveness.I would say better not to hurry, simply take your time explore the forum in reading mode and go through the rules only and the topics as well mentioned by many members if you dont mind. For the rest its not the Only Pump and attractive market senrio stick with us and explore the beauty of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "October 24, 2023, 02:59:13 PMLast edit: October 24, 2023, 03:43:28 PM by Frankolala",
      "body": "OP, you can start with the articles that has been provided for you by other forum members above. You should create out time that you will always visit the forum to learn from topics that are being discussed and how to create your own topic. As a newbie, you should post less and read more so that you can learn and grow your account here. Have passion and zeal to learn so that you can understand fast and contribute on the discussions on the forum. You can also teach forum members the knowledge that you learnt from outside the forum do that other forum members can learn from you. Don't forget to use the search engine to get information on whatever you want to know on bitcoin, as a lot of topic discussed now has already been discussed in the past. Do your own research and learn better.Welcome onboard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 24, 2023, 03:06:54 PM",
      "body": "Hello friend, apart from the advice you have been given, I don't think you need any advice on this:Quote from: Dextro1 on October 24, 2023, 01:53:05 PM<...> I will love to explore <...> this forum also. If you want to explore the forum, just do it. Take a look at the different sections and you will find some more interesting than others, although over time if you stay on the forum your tastes may change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 24, 2023, 03:10:14 PMLast edit: October 24, 2023, 03:31:12 PM by acroman08",
      "body": "since you are new to the forum and I assume you plan to spend some time here reading and joining discussions, I am just adding this here since I don't see it being shared on this thread and I suggest that you read it first (Newbies - Read before posting), the thread I shared is basically like a forum introduction for new members, you'll find informative information there that would help you understand the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 24, 2023, 03:24:55 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I would appreciate any write-up that I can read to kick-start my journey here thanks! Good to know that you are new here and just like all of us up here in the forum we once were newbies and as time passed on we grew up to our current status of both in the knowledge of Bitcoin and the forum which have become a tool for use to gain information and interact with others that have similar interest to ours.Just like the first comment on this thread already outlines for you various links to discussions here innthe forum that will help you in your journey here and outside, just keep being active and engage in various discussions to widen your knowledge on Bitcoin, once again welcome mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 24, 2023, 03:33:23 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks! Before you can welcome yourself to rhe forum, first read the rules and regulations of the forum and see that you can abide by them, secondly don't plagiarize, lastly, ream more than posting being a newbie, you have alot to learn and discover about this forum and bitcoin, i have some additional threads that can help your journey as well.bitcoin historyhttps://bitcointalk.org/index.php?topic=5438353.0everything you need to know about forum rank, activities and merits.https://bitcointalk.org/index.php?topic=2766177.0posting etiquetteshttps://bitcointalk.org/index.php?topic=5184741.0#post_altgiveawayBeginners and Help Encyclopediahttps://bitcointalk.org/index.php?topic=5364418.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 24, 2023, 03:42:08 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks! Welcome to this forum, I hope you will enjoy your time here, and the advice I can give to you is too much, but the least and the easiest that I can suggest to you is to, avoid plagiarism content. And consider this forum as a library of cryptocurrency knowledge. Where there are different sections of different books, like the BTC discussion section and the technical discussion etc. You will find many earning opportunities too if you stay longer here.But first, you have to get familiar with the trust system, and who to trust and whom to not, then get familiar with posting ethics then read more topics get more knowledge, and try to participate in discussions so that your doubts would be cleared if you have any. Do not be afraid to make posts because, on making posts, you will learn more, even if many members will not like your reply, do not be discouraged by such comments and keep your mind up and try to be beneficial here, contribute good knowledge, and get rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Egii Nna",
      "created_time": "October 24, 2023, 03:59:22 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks!  Wow, it feels good to have a newcomer who wants to learn. You are welcome to bitcoin and bitcoin talk. At the same time, I can see the link you need to read more and understand the forum (bitcoin talk), and bitcoin itself has been provided. I will just encourage and advise you to be a good researcher and a good reader.If you read a lot, you will understand bitcoin, but when you feel lazy, you will end up being a victim of plagiarism in the forum, and your account will be banned. From there, you have already lost a lot because anything you need to know about bitcoin and other cryptocurrency can be answered here. We have high-ranking members that are intelligent enough and are ready to teach everyone, especially beginners, so I will encourage you to read well and be more serious because you can’t help someone who is not ready to learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 24, 2023, 08:57:40 PM",
      "body": "Hey there, Dextro1! Welcome to the BitcoinTalk forum and the world of crypto.  It is awesome to see you here. To start, like some others said, reading Satoshi's original Bitcoin whitepaper is a must to get the core ideas.  The sticky threads here also have some great basics, and browsing the Beginners & Help section has lots of guides and talks that will help.  Dont be shy to ask anything - people here love to geek out and explain things, and can learn a ton.  Have fun on the journey down the rabbit hole!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Turn it off",
      "created_time": "October 24, 2023, 09:03:15 PM",
      "body": "Hey mate, welcome to the community. Like majority have said just read the rules and then move on to something else like navigating around the forum and learning about the nitty gritty of bitcoin that will help you settle well into the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 24, 2023, 09:35:48 PM",
      "body": "Welcome to the Bitcointalk platform.You made a good decision coming here. There are lots of opportunities here if only you would make the most of your time for yourself to gain more knowledge about bitcoin and this platform. All you need to do is learn how things are done here. Read posts, understand them, and make contributions that's all. You can create topics with a good educational perspective, possibly based on your findings, which could be of great importance and help other members as well. I see you have been furnished with lots of links to materials of much importance as it relates to this platform and bitcoin.I have checked them, and I can say that they are very rich in information, which you can absorb within your capacity if only you make time for it. You can see below some videos that you can listen to to gain a better understanding. YouTube Video1  YouTube Video2. These videos could be of help to you, if you care.Do not fail to ask questions when you have any challenges. The community is here to help you scale through your time of learning as a newbie. Feel free, abide by the forum principles and you will have no problem here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "October 24, 2023, 10:17:58 PM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks! I welcome to bitcointalk, I want to inform you that essence of been in bitcointalk community is to discuss about bitcoin and learn more about bitcoin, but their is something important you have to note since you have been a registered, you have to read all the links that been drop so that you will be able to understand what you don't know in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 24, 2023, 10:41:55 PM",
      "body": "Welcome to the community, Bitcointalk.org.I like a newbie asking how to learn than a newbie here asking how to earn and if you explore the forum and spend your precious time reading rather than posting, you will learn a lot for sure.I saw a lot of threads and links to an article posted above which are good to visit.In addition, \"https://bitcoin.org/en\" also gives some basic information about Bitcoin and how this technology works.  Just click the \"English\" button on the right side to show other languages that you like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "October 24, 2023, 10:47:58 PM",
      "body": "It's interesting to see newbies interested in learning and understanding bitcoin. The above resources is enough to  get you started, but not be enough to satisfy your need to know bitcoin. The numerous forum boards can put you ahead of your current level of bitcoin knowledge. Such that wherever, whenever bitcoin is stated. You'd have loads of valuable information to voice out to the listening ear. Remember to read the forum meta boards before engaging seriously in the forum. There you'll find unaccepted practices in the forum and its punishments. Ask questions any possible day, and also contribute to answer other people's question. Who may not have read to the extent you've gotten in the search for bitcoin knowledge. That's basically what the forum is about. For bitcoin, the knowledge is overwhelming. New ideas, techniques, rules seasonally come up. Members are expected to be consistent, if they actually want to learn bitcoin through this forum. Because they may get lost if they don't. Allocate time to learn bitcoin everyday; few hours. This include participating in sharing information. If you give it a break, it could reduce the rate you've known bitcoin. And, also, delay your journey in the forum. While you look around, I'd encourage that you maintain consistency in your fresh journey. Welcome to the forum! Good to have you around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "October 25, 2023, 08:58:42 AM",
      "body": "Quote from: Dextro1 on October 24, 2023, 01:53:05 PMGood day Bitcoin talkers, I'm new to the forum and  cryptocurrency world in general and I will love to explore the Bitcoin world and this forum also. So I will appreciate any write up that I can read to kick start my journey here thanks! Bitcoin world is broad and there are different sectors which you might find interesting, just fixed yourself in one of them that's considerable and comfortable for you. In the meantime, you're welcomed to the forum, there's alot to learn about the system and I hope you're 100% ready to accomplish tasks. I must issue out this warning, the system prohibits plagiarism and all tasks ought to be completed by oneself. We all have gather some experience except for newbies like you, just cope to reading the terms and conditions, and abide obediently by them because there are consequences if the lines are crossed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "October 25, 2023, 10:24:09 AM",
      "body": "Quote from: sheenshane on October 24, 2023, 10:41:55 PMIn addition, \"https://bitcoin.org/en\" also gives some basic information about Bitcoin and how this technology works.  Just click the \"English\" button on the right side to show other languages that you like.bitcoincore.org is another good website to first, download Bitcoin Core wallet software, and second get some information and guide for it.At bitcoin.org, I like two pages most.https://bitcoin.org/en/choose-your-wallethttps://bitcoin.org/en/secure-your-walletIf someone want to go advanced, for developershttps://bitcoindevlist.com/Awesome Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}