{
  "id": "topic_5408025",
  "title": "cryptoshupak",
  "author": "cryptoshupak",
  "created_time": "July 29, 2022, 10:11:22 AM",
  "content": "Pozdrav ekipo, Prvo pogledajte video pa ako je netko zainteresiran pls kontaktirajte me putem telegrama Pogledajte video - >  https://youtu.be/YYeU7UwSamcKako u zadnje vrijeme non stop i od istih ljudi slusamo razne kripto analize i ostale kripto teme. Razmišljao sam o tome kako između vas sigurno ima kripto znalaca koji odlično analiziraju tržište, kriptovalute, tokene, kretanje cijena i ostale teme vezane za naš svijet kriptovaluta a nemaju kako plasirati dobru vijest ili informaciju. Moja Ideja je (naravno) ako je netko zainteresiran jda pokrenemo serijal Kripto Braća gdje bi za svaki od vas koji bude zainteresiran snimio kvalitetnu audio kripto analizu ili neku drugu temu vezanu za kripto koju bih smontirao i objavio na mom Youtube kanalu. U tom slučaju siguran sam da bi bilo vrlo zanimljivih likova sa odličnim temama koji bi neki od ne baš puno pretplatnika kanala kripto shupka rado poslušali i pogledali.  Znam da dosta ljudi ne zeli u javnost ali ovo bi bio samo vaš glas bez snimanja lica.Bilo bi zgodno da se neke od vas ima prilike čuti da malo razbijemo dosadne teme.Naravno za vas naći i pokoja nagrada u obliku kripta ili fiat love ukoliko ideja zaživi i ovisiti će u kojem će se smjeru kretati …ako bude loše brišemo sve i nikome ništ. Ako ste zainteresirani javite mi se putem Telegrama da se dogovorimo oko detalja. ispod nek me kontaktira putem telegremaVidmo se !Crypto Shupak",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408025",
  "comments": [
    {
      "author": "dkbit98",
      "created_time": "July 29, 2022, 08:17:48 PM",
      "body": "Nisam siguran za glasovne snimke, ali znam da ima ljudi na forumu koji mogu odraditi sjajnu analizu crypto marketa (puno bolje nego ja) a ti to možeš onda proćitati na svom youtube kanalu.Možeš pronaći i mnogo tema i korisnih informacija za inspiraciju na našem lokalu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "July 30, 2022, 12:56:25 PM",
      "body": "Quote from: dkbit98 on July 29, 2022, 08:17:48 PMNisam siguran za glasovne snimke, ali znam da ima ljudi na forumu koji mogu odraditi sjajnu analizu crypto marketa (puno bolje nego ja) a ti to možeš onda proćitati na svom youtube kanalu.Možeš pronaći i mnogo tema i korisnih informacija za inspiraciju na našem lokalu.Ima na našem lokalu i drugih vrlo zanimljivih tema kao npr. jako dobrih pojašnjenja od Domchi-a na temu plaćanja poreza na kripto, pa načinima povlačenja bitcoina u hrk, hardverski novčanici...Cryptofrka je svojevremeno imao jako dobre kripto analize tržišta.Nisam baš siguran da bi ti to netko želio glasovno snimati svoje analize ali slobodno kontaktiraj autore tema, pitaj ih za dozvolu i onda objavi na svom youtube kanalu.Kada pokreneš taj kripto youtube kanal slobodno ga promoviraj ovdje, sigurno će biti interesa, i tako ćeš si u startu malo povećati praćenost kanala.Sretno s projektom",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 30, 2022, 05:52:35 PM",
      "body": "Quote from: Daniel91 on July 30, 2022, 12:56:25 PMKada pokreneš taj kripto youtube kanal slobodno ga promoviraj ovdjeKanal je već pokrenut prošle godine i cryptoshupak je već postavio link gore.Ja sam prestao gledati većinu youtube crypto videa, osim možda super Bitcoin analize Bitcoin The Week On-chain koje radi Glassnode.Evo jedne  koja je postavljena pre neki dan:https://www.youtube.com/watch?v=B6S0eXI2Gd4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}