{
  "id": "topic_5410396",
  "title": "tokyohd",
  "author": "tokyohd",
  "created_time": "August 18, 2022, 05:23:09 PM",
  "content": "Per the Shibburn website, the burn rate of Shiba Inu has suddenly increased by 322%. The Shiba Inu burn rate was down earlier, as reported by U.Today. This shows that burning activities are resuming across the board, although the amount of SHIB burned remains lower than usual. The recent Shiba Inu rally shifted investors' attention to buying and hodling, leading to a decrease in the amount of Shiba Inu being sent to dead wallets. Over the weekend, Shiba Inu posted an impressive rise, gaining more than 35% in one swoop.The Shib Burn Twitter handle reports a small amount of 64,506,471 SHIB tokens burned in 10 transactions. Aside from this, a few million SHIB were sent to dead wallets in different transactions in recent hours. In the last hour, 4,854,572 SHIB tokens were burned in a single transaction.Read details on U.Today https://u.today/shiba-inu-burn-rate-suddenly-jumps-322-shib-price-approaches-key-support",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410396",
  "comments": [
    {
      "author": "makishart",
      "created_time": "August 19, 2022, 02:02:38 AM",
      "body": "I thought that if it has reached multi billions burn like about 100 billions or even 900 billions burn but a bit surprised that if it was pretty the same like nothing happened. Ethereum burned millions everyday while this one doing nothing. 900 USD burn? wow, that looks so impressive. It's better if there would be no burn rather than burn but it was only doing burn pennies for billions worth of asset like shiba inu. This is a shame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Henrobakkara",
      "created_time": "September 01, 2022, 04:47:57 PM",
      "body": "Quote from: makishart on August 19, 2022, 02:02:38 AMI thought that if it has reached multi billions burn like about 100 billions or even 900 billions burn but a bit surprised that if it was pretty the same like nothing happened. Ethereum burned millions everyday while this one doing nothing. 900 USD burn? wow, that looks so impressive. It's better if there would be no burn rather than burn but it was only doing burn pennies for billions worth of asset like shiba inu. This is a shame. That is what people don't understand thinking that the price of Shiba Inu will reach $1 soon which causes is been affected by its total supply with this type of burn rate, Shiba Inu is no were coming close to that amount Shiba supporters are thinking will happen when compared to others as you have mentioned like ETH and BNB here, the last burn was approx $444million worth of BNB",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "September 01, 2022, 05:56:55 PM",
      "body": "If the asset is unlimited ofcourse they would have to use things like using the dead wallet and burning the coins, giving people a passive income in form of another Altcoin, I think this move is not only highly intelligent but it's also going to manipulate the market positively this shiba can have loads of profits. But ofcourse how much is burnt 🔥 is honestly important therefore I believe that it won't be reaching 1$ that soon, might take ages, so even if you are looking at the burnt coins increasing in number better hold your horses.  Reaching 1$ \"soon?\" - definitely not possible, see the graph and check the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DevFile90",
      "created_time": "September 01, 2022, 06:19:16 PM",
      "body": "No matter how many Shiba inu token get burnt it's never going to make one token turn 1$ each, that's so unrealistic, the max supply of shiba token is still insanely high so this burning mechanism will go on and on for a long period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}