{
  "id": "topic_5447728",
  "title": "Nonstopspider",
  "author": "Nonstopspider",
  "created_time": "April 05, 2023, 11:00:37 PM",
  "content": "Hello guys, I guess a lot of you that are common users of Twitter, might so this particular outrage Between Bitget Exchange and Evan Luthra, and Reel Token team, and for those who do not know I will share the overview, and if you like so, please share your honest opinion about this.The Drama started with this tweet https://twitter.com/EvanLuthra/status/1641727962566508545?s=20  Apparently The Crypto Influencer Evan Luthra got 200K frozen on Bitget but later admitted that he sold a huge amount of $REELT (200K USD or nearly 2M of that asset) and further, bitget blocked his account for dubious behavior, that was at the same time with other 3 accounts that sold huge amounts of that asset. All of that accounts are identified as part of the dev and advisors team of Reel Token. Thanks to this, the token dump heavily.Later was constant harassment on Twitter trying to make the bitgetScam hashtag to get trend and he succeded with maneuvers like this https://twitter.com/EvanLuthra/status/1643230510653767683?s=20  or in other words, paying people to share their \"experience\"What Bitget Says?, Well they released a statement here https://www.bitget.com/en-PH/support/articles/12560603778479. In response, the influencer argued that the Customer service didn't give him an answer or refused to give the money back to him and shared this kind of tweet https://twitter.com/EvanLuthra/status/1643192782130139136?s=20 (Personally is a very dubious source and legitimacy) What is my opinion? Well, first of all, I do not trust Crypto Influencers at all, especially if they are paid for a project like this one we have plenty of cases of pumped projects by influencers, and after that, the crash occurs. Second I found in their Twitter profile some fishy actions like Constantly avoiding sharing the transaction hash of their sales (he admitted it) and you can see it in this leak https://twitter.com/CryptoAdviceTM/status/1643747585075871744?s=20, Third: Is Sharing fake info like the CEX was banned in Indonesia and that was not true (The article says other things), The guy accused of a hacked in Bitget in this post https://twitter.com/EvanLuthra/status/1643184103653613570?s=20 but as you can tell, there is not the same CEX. And I repeat that the guy is paying the people to share the hashtag, and tried to make a Live for this. Conclusion: Evan Luthra and the other members dump the token, they were not smart and did it all in mere minutes of difference on bitget and the CEX protocol (like every other one has) Blocked the 4 accounts for fraud and RugPull behavior and for sure the followers started to complain to him and the devs. But that is my opinion please let me know what is yours",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447728",
  "comments": [
    {
      "author": "Zee27",
      "created_time": "April 05, 2023, 11:05:31 PM",
      "body": "I think this is a case of a bad guy trying to point fingers for some wrong he intentionally did against investors of REELT. Bitget has my respect for blocking that man's account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}