{
  "id": "topic_5405900",
  "title": "CryptoFuturistic",
  "author": "CryptoFuturistic",
  "created_time": "July 11, 2022, 03:25:54 PM",
  "content": "I see this article recently https://markettimes.co.uk/cryptocurrencies/bitcoin-adoption-in-el-salvador-seems-to-be-failing/ what do you think about it? I think Bukele knows the potential of the Bitcoin. The problem is that people wants to be billionaire investing $1000 one day and waiting to get 100,000,000 in a week from earnings of Bitcoin. We need to remember that bitcoin only gonna be 21,000.000",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405900",
  "comments": [
    {
      "author": "darkv0rt3x",
      "created_time": "July 11, 2022, 03:39:12 PM",
      "body": "Quote from: CryptoFuturistic on July 11, 2022, 03:25:54 PMI see this article recently https://markettimes.co.uk/cryptocurrencies/bitcoin-adoption-in-el-salvador-seems-to-be-failing/ what do you think about it? I think Bukele knows the potential of the Bitcoin. The problem is that people wants to be billionaire investing $1000 one day and waiting to get 100,000,000 in a week from earnings of Bitcoin. We need to remember that bitcoin only gonna be 21,000.000 Well, there is a learning curve. And it will take time to flatten that curve. In the process I believe there might be a decrease in adoption, but in due time, the adoption curve will start to get grip again!What I say is that there are at least like 3 or maybe 4 generations a live at the same time on earth right now! The 2 older generations will start do disappear naturally while the 2 other will take their place. The latter will be way better informed, educated (we hope) and will understand Bitcoin better. That's when I believe mass adoption may take place! We are still struggling to include education in schools and even out of schools, so, it may be acceptable that many people will give up in the meantime!And also, there is the people that are in for the quick buck... Those will be kicked out by Darwinism applied to economics! Evolution will take over, for sure!Also, from that article, I see it was conducted by National Bureau of Economic Research and conducted by 3 US economists, so, take it with a grain of salt!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 11, 2022, 03:58:56 PM",
      "body": "The article says that 60% of Salvadorans got into the Bitcoin train when it was introduced; With an estimated population of six and a half million people, that's about 3.9 million and with 10% still using it after exhausting their airdrop bitcoins, that is approximately 400k users in the country. Those are not terrible numbers if you ask me, for the first year of introduction and in a bear market.The bear market is naturally a slow time for Bitcoin adoption and this would become a trend if more countries adopt it as a currency; Periods of growth where everyone is happy, mixed with bear markets, where citizens complain their assets are lossing value.I expect volatility to slowly reduce as adoption grows over the years, but while we still have wild fluctuations, there would always be analysis about what Bitcoin project failed when the market slows down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 11, 2022, 04:31:43 PM",
      "body": "It is normal to see falling in bear market but bear market is for builders.El Salvador can fail but let's wait for a next few years, at least 2 or 3 more years, then we can say they fail or succeed. They have a degen President who loves Bitcoin, has strong belief in Bitcoin and try to build up lot of things in their country with Bitcoin.Anyway, bear market does not support them but if it can not kill them, they will return stronger in next bull market. If they are still building in this bear market.Bear markets are for building",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "July 11, 2022, 04:44:32 PM",
      "body": "No country is able to make a bold decision same as El Salvador have done last year. From that point El Salvador was facing more and more criticism. In all time period and on different criticism Nayib Bukele haven't changed his mind. He gave the proper reasons upon which he decides bitcoin to be the best investment.Recently the bearish market have made El Salvador loss 50% of the investment on bitcoin. But, they haven't sold any of their holdings. President is very positive about bitcoin and the sufferings of El Salvador will be a learning for rest of the countries that plan of adopting bitcoin as legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "July 11, 2022, 04:55:02 PM",
      "body": "El-salvador was only too expectant; 60% of them are HODLing Bitcoin According to the report and Bukele,since he misinterpreted the process and believed it'd solve sole economic problem, introduced bitcoin as a legal tender. I don't know but I'm not seeing these as a proper line of action, why? Bitcoin isn't compatible to serve an Individual as fiat does; imagine being paid in btc and before some verification processes was done, the value had reduced by half,how do you cope? Its volatility doesn't support fringe investment,yeah so I'd rather see bitcoin as a store of value to avoid unnecessary questioning and some kyc shit from the local bank.Sandra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "July 11, 2022, 05:10:32 PM",
      "body": "The POV is not there yet. They are still looking at the price. If it fluctuates down then it's a failure, if it goes bull, it is a success. There is a good thing about what happened last year in El Salvador though, he made his people realize there are other options in terms of currencies, and it's not just always USD. It's a crawl, that I am sure. Progress today seems to be getting slower and slower whenever a new thing is being introduced. But when it comes to social media they are so fast at joining the trend. It's not a failure, it's all up to his countrymen on how they will maximize their usage of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "July 11, 2022, 05:28:03 PM",
      "body": "Quote from: Upgrade00 on July 11, 2022, 03:58:56 PMThe article says that 60% of Salvadorans got into the Bitcoin train when it was introduced; With an estimated population of six and a half million people, that's about 3.9 million and with 10% still using it after exhausting their airdrop bitcoins, that is approximately 400k users in the country. Those are not terrible numbers if you ask me, for the first year of introduction and in a bear market.The bear market is naturally a slow time for Bitcoin adoption and this would become a trend if more countries adopt it as a currency; Periods of growth where everyone is happy, mixed with bear markets, where citizens complain their assets are lossing value.I expect volatility to slowly reduce as adoption grows over the years, but while we still have wild fluctuations, there would always be analysis about what Bitcoin project failed when the market slows down.the 60% really needs to learn trading this time to maintain the value. someone i think should act to provide signals for them so they'd know when to sell and buy. 60% is close to majority already. in the long run if they hold BTC, they all will still be in the successful side of their history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "July 11, 2022, 06:19:37 PM",
      "body": "Quote from: CryptoFuturistic on July 11, 2022, 03:25:54 PMI see this article recently https://markettimes.co.uk/cryptocurrencies/bitcoin-adoption-in-el-salvador-seems-to-be-failing/ what do you think about it? I think Bukele knows the potential of the Bitcoin. The problem is that people wants to be billionaire investing $1000 one day and waiting to get 100,000,000 in a week from earnings of Bitcoin. We need to remember that bitcoin only gonna be 21,000.000 Let me cheap in this at first that you don't really have to believe everything publicized on the social media to be genuine or truth, as for the El-Savadorans, they have no issues with bitcoin adoption but yet i see the external and less concerned ones to be more pathetic still on this El-Savador bitcoin adoption, the country claim that's what they want and i see nothing bad in going by it, bitcoin is not a get rich quick scheme, it takes time and patience while the said $21,000 is unclear to me what OP is trying to fish out here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 11, 2022, 06:36:52 PM",
      "body": "Quote from: CryptoFuturistic on July 11, 2022, 03:25:54 PMI see this article recently https://markettimes.co.uk/cryptocurrencies/bitcoin-adoption-in-el-salvador-seems-to-be-failing/ what do you think about it? I think Bukele knows the potential of the Bitcoin. The problem is that people wants to be billionaire investing $1000 one day and waiting to get 100,000,000 in a week from earnings of Bitcoin. We need to remember that bitcoin only gonna be 21,000.000 Patience is the key here! Like many other millions of bitcoin investors, El-Salvador treasury is also feeling the heat of falling bitcoin price and high volatility. Bitcoin has potential but you need to give time. It can't happen overnight. People and especially from opposition parties will always try to find loopholes in the current system and yell about that. Just imagine, if bitcoin went upto 100,000 level, then we wouldn't have seen such statements today. So it's a matter of time and that's it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 11, 2022, 06:37:55 PM",
      "body": "Quote from: Upgrade00 on July 11, 2022, 03:58:56 PMThe article says that 60% of Salvadorans got into the Bitcoin train when it was introduced; With an estimated population of six and a half million people, that's about 3.9 million and with 10% still using it after exhausting their airdrop bitcoins, that is approximately 400k users in the country. Those are not terrible numbers if you ask me, for the first year of introduction and in a bear market.The bear market is naturally a slow time for Bitcoin adoption and this would become a trend if more countries adopt it as a currency; Periods of growth where everyone is happy, mixed with bear markets, where citizens complain their assets are lossing value.I expect volatility to slowly reduce as adoption grows over the years, but while we still have wild fluctuations, there would always be analysis about what Bitcoin project failed when the market slows down.I agree with this.In my opinion it would have also good if the government of El Salvador put more emphasis on Bitcoin as an instrument for remmitances and break free from fees imposed by banks like Wells Fargo, ect.If more people from El Salvador learnt and applied Bitcoin this way they may save a sustancial amount of money per year, but as we all know this would be an incovenient to said banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 11, 2022, 06:47:55 PM",
      "body": "Quote from: electronicash on July 11, 2022, 05:28:03 PMthe 60% really needs to learn trading this time to maintain the value. someone i think should act to provide signals for them so they'd know when to sell and buy. I should reiterate that the 60% number are those who downloaded the recommended wallet to claim the $30 Bitcoin airdrop, only one-tenth of that number actually kept on using it according to the article.Also, trading is not everyone's cup of tea and one does not need it inorder to get into bitcoin or use it as a medium of exchange. It's also not surprising that majority went back to the safety of fiat, Bitcoin is not nature as a currency and not everyone has ready to gamble their assets on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 11, 2022, 07:12:11 PM",
      "body": "Quote from: CryptoFuturistic on July 11, 2022, 03:25:54 PMI see this article recently https://markettimes.co.uk/cryptocurrencies/bitcoin-adoption-in-el-salvador-seems-to-be-failing/ what do you think about it? I think Bukele knows the potential of the Bitcoin. The problem is that people wants to be billionaire investing $1000 one day and waiting to get 100,000,000 in a week from earnings of Bitcoin. We need to remember that bitcoin only gonna be 21,000.000 In my opinion, I think its normal not to expect the entire citizens of El Salvador to immediately or instantly get used to Bitcoin just because their government adopted it and made it a legal tender, it is true we all want adoption but certainly, not everybody will like to use Bitcoin as a means of paying for there day to day expenses, some will prefer to buy and keep it as an investment, others will prefer to only use Bitcoin when they want to transfer money to their loved ones that live outside the country, at the end of the day, you discover its just a few person that use the currency for their day to day transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 11, 2022, 07:38:00 PM",
      "body": "Humans want to become multi-billionaires over the night which is impossible with Bitcoin. But yes, Bitcoin would give you a good return if you hold with patience. If you compare El Salvador holding with current rates then it would look like they are failing. But look at the future, just imagine Bitcoin touching ATH again. Then you will not see El Salvador in the loss. Have to think deeply, can't judge anyone without deep research. Bukele isn't buying Bitcoin to sell it tomorrow, he must have a good plan about his holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 11, 2022, 07:55:11 PM",
      "body": "We shouldn't blame Bukele for this failure if we can even call it that. He did the right thing by choosing to buy some bitcoins and promoting it among his people. It's not his fault that global economy is in recession and the price fell due to rate hikes around the world. These are things none of us can change, even country leaders can't change it because these things are done by monetary committees. In other words, even governments of countries with currencies of world reserve status are in it for the ride. Bukele with his small country is like a kid on a big ship. If adults start screaming the ship won't stop but at least they'll make some noise, draw attention. But a kid crying? Nobody will even notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 11, 2022, 08:08:07 PM",
      "body": "Quote from: CryptoFuturistic on July 11, 2022, 03:25:54 PMwhat do you think about it?I think someone either is very pessimistic or wants to see El Salvador's plan fail.To be honest, how long has it been since El Salvador started pushing for Bitcoin adoption?  I think it is VERY early to tell whether the plan is failing or not, especially considering a few things.  There is a war, a hyper inflation, Terra crashing and many other factors currently shaking the markets and keeping them in a continuous bearish status.Plus, I would imagine not everyone who got interested into Bitcoin back when their national Wallet app has been released are still interested in Bitcoin today.  Everything was going nuts at the time, but only a quite small part of those interested get to actually believe, understand and get into Bitcoin for real.  There was a hype back then, and we know there is at least a slight reduction in interest when a hype ends.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 11, 2022, 08:26:20 PM",
      "body": "We should also keep in mind that El Salvador didn't lose anything. 1BTC is still 1BTC. I know the problem may be another, but still, I think it's too soon to tell that the Bitcoin bet was a fail. There is still much to work on and a lot to evolve, embrace, etc. The more we see fiat going down, jus tlike what is happening in the Netherlands and in China, I think it will call for the people's attention regarding alternatives. People are desperated and usually humans adapt. I still hope the best is yet to come but also that the worse is also yet to come!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "July 11, 2022, 08:59:02 PM",
      "body": "Quote from: OcTradism on July 11, 2022, 04:31:43 PMIt is normal to see falling in bear market but bear market is for builders.El Salvador can fail but let's wait for a next few years, at least 2 or 3 more years, then we can say they fail or succeed. They have a degen President who loves Bitcoin, has strong belief in Bitcoin and try to build up lot of things in their country with Bitcoin.Anyway, bear market does not support them but if it can not kill them, they will return stronger in next bull market. If they are still building in this bear market.Bear markets are for building Well, most of our investments are failing these days seeing the market is highly bearish. But hey, this won't take forever so we have all the time to recover from this and see them grow once the market start to recovers too. El Salvador may just put on risk since they really bought huge amount of bitcoin, but we can't blame Bukele because he has the greatest passion with bitcoin, that most of us don't have. And when its time for bull run and bitcoin reaches its new ATH, then El Salvador will be the one to lead in gaining massive profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "July 11, 2022, 09:13:23 PM",
      "body": "Quote from: CryptoFuturistic on July 11, 2022, 03:25:54 PMI see this article recently https://markettimes.co.uk/cryptocurrencies/bitcoin-adoption-in-el-salvador-seems-to-be-failing/ what do you think about it? I think Bukele knows the potential of the Bitcoin. The problem is that people wants to be billionaire investing $1000 one day and waiting to get 100,000,000 in a week from earnings of Bitcoin. We need to remember that bitcoin only gonna be 21,000.000  There's always a process if we start entering bitcoin investment, and that is we have to endure first the price volatility and see our investments falling in prices, but eventually they will also grow if the market has stabilized. With regards to El Salvador, we can't expect for them to succeed quickly from bitcoin adoption because they are still new to it. If after 3-5 years the result is still the same, then that's the time we can conclude that Bukele was a failure in his bitcoin propaganda. Also, in a market that is experiencing a long term bearish market, no one gets succeeded easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CaVO32",
      "created_time": "July 11, 2022, 09:18:30 PM",
      "body": "Quote from: darkv0rt3x on July 11, 2022, 08:26:20 PMWe should also keep in mind that El Salvador didn't lose anything. 1BTC is still 1BTC. I know the problem may be another, but still, I think it's too soon to tell that the Bitcoin bet was a fail. There is still much to work on and a lot to evolve, embrace, etc. The more we see fiat going down, jus tlike what is happening in the Netherlands and in China, I think it will call for the people's attention regarding alternatives. People are desperated and usually humans adapt. I still hope the best is yet to come but also that the worse is also yet to come!And as we have seen, El Salvador is still buying just like that they disclosed they bought btc at 19k level. So who knows, even at 20k level they are slowly stashing some? It is indeed true that they are not losing in this market if they are not yet selling. As they are very positive about btc market, they won't sell at a loss. And remember, this is not the end of the road for btc, so yes, there's hope that in the next coming months, btc will recover and may reach higher price levels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}