{
  "id": "topic_5400791",
  "title": "Humdealeu",
  "author": "Humdealeu",
  "created_time": "May 31, 2022, 12:15:48 AM",
  "content": "Hey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400791",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 31, 2022, 03:07:02 AM",
      "body": "No one can be an \"expert\" at predicting the future. But if you really want an answer from an \"expert\", probably try asking a fortune teller. If I were to guess though, I'd say there's a 30% chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "May 31, 2022, 03:37:43 AM",
      "body": "I'm also not an expert. And anybody who will claim to be an expert in predicting Bitcoin's next price is probably not even accurate in half of all his predictions. So in a way we are all equal in this guessing game. June 2022 is just hours away. I don't believe Bitcoin's price will suddenly fall below $20,000 when it has already started climbing back to almost $32,000. I'd say $45,000 is more probable than below $20,000. Either way, hodl!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cahayaachilles",
      "created_time": "May 31, 2022, 04:06:24 AM",
      "body": "Kiyosaki expected the downfall to reach $17K. He also mentioned that once the BTC hits rock bottom, he will make the investment to support the coin and that will prove to be more profitable to individuals too.News Source R. Kiyosaki is Holding Up for BTC to Attain $20K Low - TheNewsCrypto : https://shrinke.me/mJjGjp1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 31, 2022, 04:21:47 AM",
      "body": "Quote from: cahayaachilles on May 31, 2022, 04:06:24 AMKiyosaki expected the downfall to reach $17K. He also mentioned that once the BTC hits rock bottom, he will make the investment to support the coin and that will prove to be more profitable to individuals too.Though Kiyosaki might be a good writer/author, he ain't an \"expert\" either. These so-called \"experts\" have been calling for 6 digit BTC prices for 2022 then suddenly they all reversed and scream bear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "May 31, 2022, 04:27:33 AM",
      "body": "Quote from: Humdealeu on May 31, 2022, 12:15:48 AMHey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?How could anyone know something like this? This is like asking the lucky numbers of the upcoming local lottery. Do you know anybody that can see the future? Even if there is anybody like that, I am pretty sure he is not on this forum and even if he is, do you think he is going to share this information with you? For free? Get some common sense before asking such stupid questions please.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 31, 2022, 04:33:55 AM",
      "body": "Quote from: cahayaachilles on May 31, 2022, 04:06:24 AMKiyosaki expected the downfall to reach $17K. He also mentioned that once the BTC hits rock bottom, he will make the investment to support the coin and that will prove to be more profitable to individuals too.News Source R. Kiyosaki is Holding Up for BTC to Attain $20K Low - TheNewsCrypto : https://shrinke.me/mJjGjp1Kiyosaki dumped his coins too late while the bear market is already very visual which he now wishes BTC to drop below the strongest support line. The ones that I know who had predicted prices to dumped hard missed the $67K rise because they saw $41K to be the peak last Jan 2021.The crypto market is just so unpredictable. Since yesterday the price is rallying, but don't get your hopes up already because this could just be a bull trap. Its still possible that price will take a dive to $25K as what analyst predicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "May 31, 2022, 04:34:20 AM",
      "body": "Who can predict except FUDER lol? All the unrealistic predictions came out from the FUDER, to be honest. No one can make perfect predictions ever. Otherwise, they would become multi Billionaire by using their predictions. So do your own reach read the previous history then you can realize where BTC would go. Don't follow what fuder saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 31, 2022, 04:40:06 AM",
      "body": "Quote from: Jatiluhung on May 31, 2022, 04:28:47 AMplease analyze by your self. maybe this news or image I found helps a bit. few days ago Elon shared a picture.https://i.imgur.com/ogliLu1.jpegactually there are still some pictures that show good news for btc. but i think this is also enough. to be taken into consideration. Is this a sign that it will be bullish or whatever, please take your respective conclusions.Correlation is not causation.Y'all really analyzing markets based on Elon Musk image tweets like what the heck. There are lots of far more productive things to do than this crap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "May 31, 2022, 04:49:51 AM",
      "body": "Quote from: mk4 on May 31, 2022, 04:40:06 AMQuote from: Jatiluhung on May 31, 2022, 04:28:47 AMplease analyze by your self. maybe this news or image I found helps a bit. few days ago Elon shared a picture.https://i.imgur.com/ogliLu1.jpegactually there are still some pictures that show good news for btc. but i think this is also enough. to be taken into consideration. Is this a sign that it will be bullish or whatever, please take your respective conclusions.Correlation is not causation.Y'all really analyzing markets based on Elon Musk image tweets like what the heck. There are lots of far more productive things to do than this crap.I don't know much about analyzing crypto yet because I'm new. but I read in various sources that apart from technical analysis we also need other analyzes such as news and so on for additional information. because after all the news has a lot of impact on the market situation. because even Fibonnaci's technical analysis can be off the mark if suddenly there is big news about something affecting the market. correct me if wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 31, 2022, 06:02:13 AM",
      "body": "Quote from: Jatiluhung on May 31, 2022, 04:49:51 AMI don't know much about analyzing crypto yet because I'm new. but I read in various sources that apart from technical analysis we also need other analyzes such as news and so on for additional information. because after all the news has a lot of impact on the market situation. because even Fibonnaci's technical analysis can be off the mark if suddenly there is big news about something affecting the market. correct me if wrong.That's simply because there's no single indicator that's going to have 0% failure rate, most especially when talking about technical analysis.If you're bullish on an asset or an idea, then just invest and deploy your money wisely. You don't necessarily need to listen to these so called \"eXpErTs\" and you most definitely don't need to do some chart astrology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "May 31, 2022, 06:10:47 AM",
      "body": "Quote from: Humdealeu on May 31, 2022, 12:15:48 AMHey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?No one knows what will happen to bitcoin in June 2022.We can only be prepared for whatever happens so that we can be ready to buy more if the price drops.If the price rises above and reaches the $45k level, we can sell most or even all of the bitcoins we have for a profit.But for, people who want to hold bitcoin for long periods will do nothing and just watch the price go up and down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "May 31, 2022, 06:28:35 AM",
      "body": "Quote from: Humdealeu on May 31, 2022, 12:15:48 AMHey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?This will depend on the individual actions of literally millions, if not billions, of people.No one can predict the short term price of Bitcoin.Sure, many will try, and then after the fact you can look back and cherry pick the ones that said what actually happened, but that's not predicting the price.If you have a longer time preference, it's probable that the purchasing price of Bitcoin will continue to increase, at least because fiat purchasing power will continue to lower over the years with certainty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cahayaachilles",
      "created_time": "May 31, 2022, 07:30:58 AM",
      "body": "News Update, BTC predicted prices up to 35k in jun 2022Summary : Russia’s Ministry of Finance is considering allowing the use of cryptocurrencies for international trade, local news outlet Interfax reported on Friday. In March, the chairman of the country’s Congressional energy committee, Pavel Zavalny, said in a press conference that Russia was open to accepting bitcoin for its natural resources exports. Zavalny explained that only “friendly” countries like China and Turkey would be given the option, as President Vladimir Putin had said the day before that “unfriendly” countries should pay for Russian gas in rubles.Source News Bitcoin Magazine : https://shrinke.me/78IGI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 31, 2022, 07:53:14 AM",
      "body": "No one can tell that. Ask the traders what they can see with it, no need for that expert type solely on bitcoin but what you need is someone who can read the charts and analyze it from that point of view of theirs based on the movement of it through technical analysis.But, there's also some other ways that affects the price such as through fundamentals and there goes the fundamental analysis. If your main goal is to just invest and go away on June 2022 if the price goes up, you'll learn the hard way with that short term need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Easteregg69",
      "created_time": "May 31, 2022, 07:56:37 AMLast edit: May 31, 2022, 10:45:03 PM by mprep",
      "body": "Quote from: cahayaachilles on May 31, 2022, 07:30:58 AMNews Update, BTC predicted prices up to 35k in jun 2022Summary : Russia’s Ministry of Finance is considering allowing the use of cryptocurrencies for international trade, local news outlet Interfax reported on Friday. In March, the chairman of the country’s Congressional energy committee, Pavel Zavalny, said in a press conference that Russia was open to accepting bitcoin for its natural resources exports. Zavalny explained that only “friendly” countries like China and Turkey would be given the option, as President Vladimir Putin had said the day before that “unfriendly” countries should pay for Russian gas in rubles.Source News Bitcoin Magazine : https://shrinke.me/78IGIPutin gets yobit. It sucks. In rubles.BTW you guys better mask you parade if you are from an unfriendly country.About BTC price. It's doomed to go up. Buy from the top or the bottom. Same deal.Come on. I read it again and it makes no sense at all.I got the beers. Cheers.PS. Don't delete the forum if you get paranoid.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "May 31, 2022, 12:27:29 PM",
      "body": "Quote from: traderethereum on May 31, 2022, 06:10:47 AMQuote from: Humdealeu on May 31, 2022, 12:15:48 AMHey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?No one knows what will happen to bitcoin in June 2022.We can only be prepared for whatever happens so that we can be ready to buy more if the price drops.If the price rises above and reaches the $45k level, we can sell most or even all of the bitcoins we have for a profit.But for, people who want to hold bitcoin for long periods will do nothing and just watch the price go up and down.The price of Bitcoin during the month of June is likely to improve as monthly candle will close above 31,500 which is a good sign and above 20 Days Moving average, the next resistance is 32,00 which is important to cross to continue bullish momentum.The stock market of USA has also perform better during the past week and this trend is likely to continue in coming days and weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 31, 2022, 01:42:04 PM",
      "body": "Quote from: Humdealeu on May 31, 2022, 12:15:48 AMHey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?Do not invest in Bitcoin money that you need in the short term, I think you need it to use your investment  in month...June, the answer you need is to have planning in the event that bitcoin does not reach your desired price in the estimated time.Q1?: 45k yes, but maybe not in June 2022.Q2?: It is possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "May 31, 2022, 02:48:55 PM",
      "body": "Quote from: Humdealeu on May 31, 2022, 12:15:48 AMHey any one here btc expert and do you know btc back again minimum 45k or back to below 20k in jun 2022?First, no one is expert here, everyone is making a wild and educate guess. Second, we are in a bear market, so at least you got a hint as to where the price might go short or long term. And with that said, the likelihood of hitting $45k is slim as there could be selling pressures. And there are still the war in the background, and then maybe some FUD that causes investors to sell-off. So I would say that don't expect any drastic price movement to $45k this June, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "May 31, 2022, 03:44:56 PM",
      "body": "The price of bitcoin is determined by supply and demand and when the demand for bitcoin increases the price will go up. And when demand falls, prices will also fall.experts and teachers can be so accurate that no, they will never have 100% accuracy, even if they never fail, because they can fail and you can regret it.and now the bitcoin price has only moved slightly and is still around 30k and reached 35k in the month of gambling I think it makes sense, if it continues it might reach 45k, but I doubt it because I see bitcoin price movement in a few months only move a little and go back down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}