{
  "id": "topic_5489900",
  "title": "Bonny070",
  "author": "Bonny070",
  "created_time": "March 22, 2024, 01:28:39 PM",
  "content": "bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5489900",
  "comments": [
    {
      "author": "Frankolala",
      "created_time": "March 22, 2024, 01:30:45 PMLast edit: March 23, 2024, 04:18:28 PM by Frankolala",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.Bitcoin is already legalized in some Africa countries. I don't know the country that you are from, but my country has legalized the used of cryptocurrency, and Nigeria has the highest number of crypto daily users and adopters.Nigeria, South Africa, Morocco , Ghana and Kenya and many more countries in Africa that bitcoin is legalized. It is not compulsory that the government must use it as a legal tender before, bitcoin can be used or is legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 22, 2024, 01:33:48 PM",
      "body": "Quote from: Frankolala on March 22, 2024, 01:30:45 PMBitcoin is already legalized in some Africa countries. Not in some, but in almost all Africa countries because either the government of the country do not talk about it at all or they legalize it. I do not think there are up to 5 countries in Africa that illegalize bitcoin and other cryptocurrencies in Africa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "March 22, 2024, 01:37:26 PM",
      "body": "Bitcoin is not a future digital currency, it is a current digital currency which you can use right now.Bitcoin is also legal in majority of African countries today, with some making it explicit and others just allowing their citizens to do what they want with it. This is the same on all the different continents, acceptance of Bitcoin is at a very high rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "March 22, 2024, 01:37:55 PM",
      "body": "Bitcoin has been a reality for a long time, now with government repression people are seeing the real utilitarian value it has. One thing to note here is the exponential increase in the Nigerian local council, mainly reflecting the huge adoption of bitcoin by people, imagine the people there who have no idea that BTT exists... The number of bitcoin adoption in the African continent must be far beyond what we imagine... In a few years, we, bitcoiners, will be the new world nobility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 22, 2024, 01:46:05 PM",
      "body": "Quote from: criptoevangelista on March 22, 2024, 01:37:55 PM The number of bitcoin adoption in the continent Africa must be far beyond what we imagine... In a few years, we, bitcoiners, will be the new world nobility.So you think that buying stuff and hoping to get rich from it makes you noble?What a load of...Quote from: Frankolala on March 22, 2024, 01:30:45 PMNigeria, South Africa, Morocco, Ghana and Kenya and many more countries in Africa that bitcoin is legalized. It is not compulsory that the government must use it as a legal tender before, bitcoin can be used or is legal. Bitcoin is banned in Morroco!Also in Algeria and Egypt, and apart from South Africa and Mauritius there is no country that has truthfully legalized it, more like regulate it!And seeing Nigeria on that list, after the authorities issued a ban on exchange and almost kidnaped two Binance executives...lol!Quote from: Bonny070 on March 22, 2024, 01:28:39 PM i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. So, two countries by 2059, nice roadmap! Such impressive goals, much growth!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "March 22, 2024, 01:49:16 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.It has already been established that Bitcoin is legalized in some African countries despite not been explicitly announced by their governments. What I would like to think that will be accomplished with Bitcoin in Africa within the next 50years is it's scalability. I want to see more African businesses have a payment gateway for accepting Bitcoin. I also want to see Bitcoin being openly taught in African universities. I also would like to see Bitcoin open up in rural communities in Africa and it being utilized or held by the educated and uneducated. Just like Bitcoin banking the unbanked.  This are what I'll like to see before bitcoin celebrates 50 years in existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "March 22, 2024, 01:59:58 PM",
      "body": "Quote from: stompix on March 22, 2024, 01:46:05 PMAnd seeing Nigeria on that list, after the authorities issued a ban on exchange and almost kidnaped two Binance executives...lol! LOL..that was too harsh from the Government of Nigeria.  Crypto trading is still very active in Nigeria, because investors are using other exchanges to carry out their trade, and the government never announced that crypto has been banned. I guess Binance was too loud, that was why they caught the authority's attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "March 22, 2024, 02:01:25 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it.  50years is a long time, by that time a lot of things can have changed. If bitcoin is made legal to transact, it would mean a radical change in the government systems would have happened already. It is possible but I dont see much progress at this level.Quotebecause block chain network is expanding every day by day.  Blockchain is a technology that has been used by many companies out there. Its development is actively promoted by governments but not bitcoin.Quoteand most of the countries in Africa have the knowledge BTC how it works. It does not work that way. If the government sees something that they dont like but it is already so popular that they cant risk stopping it, they will put it in a grey zone and stop discussions on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "March 22, 2024, 02:11:06 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.You can see they accept Bitcoin and Bitcoin will be legal in African nations but legal tender is very far.With very hatred policy, changes many times in Nigeria, and with uncertainty in politics of many African nations, I don't believe there will be any nation from the Africa continent, make Bitcoin legal tender soon.They will be uncertain with their own national politics, fall to geopolitical manipulation from Russia and Western nations.https://newhedge.io/terminal/bitcoin/legality-mapThe map shows there are many countries in Unknown, only Algeria is Illegal, only Central African Republic is Legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 22, 2024, 02:14:19 PM",
      "body": "I think you mean adopting it legally as a legal tender, as I believe that there is an African country that has already done that, and some small countries may do that. Although Africa has huge resources, in financial policy it does not represent a significant percentage of the global economy, and if there was any serious warning about Bitcoin in the United States or the European Union, most countries in the world would follow, and the opposite would be true if Bitcoin was banned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "March 22, 2024, 02:18:46 PM",
      "body": "Quote from: stompix on March 22, 2024, 01:46:05 PMSo you think that buying stuff and hoping to get rich from it makes you noble?What a load of...It's not a question of wealth, or hoping to get rich with something... it's a question of freedom, not having borders to move your life, everything will be in the clouds, on the blockchain... Having the total power to choose where you live, without depending of nothing and no one... See Venezuela, many successful doctors and engineers today go hungry because their capital is tied up in one place... Bitcoin would solve this.The new world nobility are the truly free people, not the rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "March 22, 2024, 02:31:18 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.Bitcoin has just managed to set an all-time record after its price managed to reach an All Time High (ATH) above $70,000. The increase in Bitcoin prices is certainly very profitable for investors who have kept it, including El Salvador, which has invested and accepted Bitcoin as a legal tender since 2021. Now El Salvador could become one of the richest countries in the world if the value of Bitcoin continues to rise as has happened in recent times. The policy taken by the El Salvador government of investing by purchasing 1 Bitcoin per day needs to be adopted by African countries to achieve the level of success that El Salvador has achieved. The decision to legalize Bitcoin and accept it as legal tender will certainly attract criticism at the start of the policy, but over time countries investing in Bitcoin will bear fruit. It is possible that African countries that adopt Bitcoin as El Salvador has done can repay their loans to the International Monetary Fund (IMF) if the country has taken out loans before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "March 22, 2024, 02:36:39 PM",
      "body": "Bitcoin doesn't have to be legalized i.e. accept as a legal tender nor commodity, it's only need to not be banned. If Bitcoin in grey area, it means anyone is freely to buy Bitcoin without need to be afraid. Even though... technically you can buy Bitcoin even it's illegal in your country.Quote from: Husires on March 22, 2024, 02:14:19 PMI think you mean adopting it legally as a legal tender, as I believe that there is an African country that has already done that,Central African Republic no longer accept Bitcoin as a legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "March 22, 2024, 03:01:38 PM",
      "body": "I'm all for prosperity in a country so yes, I am hoping to see a lot of African countries get in line and adopt bitcoin, although I hope that it's not going to be a rich people only kind of prosperity because as it stands, bitcoin is for everyone who can afford to buy a bitcoin so I know for a fact that those that have the money will probably exploit the adoption and make sure that they've got the first place again against other people that really needed the bitcoin. I know that this isn't just a one continent issue though as this kind of inequality is prevalent in many countries too from different continents.I do believe too that bitcoin is a symbol of waking up to the oppression that the masses endure so I'm all for it even more that bitcoin becomes a legal thing and that it's the best thing to happen, I'm sure that each adoption of bitcoin in Africa is going to be a monumental thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "March 22, 2024, 03:03:40 PMLast edit: March 26, 2024, 09:23:15 PM by Odohu",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.It will be hard to know which countries will legalize Bitcoin in Africa and which will not because as government changes, so does policies. As of today Central African Republic has taken the lead in this regards and many other African countries might consider it when they see the successes of CAR over the coming years. When the new government of Nigeria came on board,  expectations were high that they will legalize Bitcoin following some of their policies like lifting the restrictions placed on accounts of some individuals and enterprises who engaged in cryptocurrency.  Well, the joy among crypto lovers of Nigeria was short-lived when the government began their crackdown on cryptocurrency exchanges which they accused of playing a part in messing up the exchange rates of the country, an action that could not address the worsening economy of the country and which many see as exercise in futility. Conclusively, the potential of Bitcoin is great globally and even in Africa and with time, we will have leaders that will be able to embrace it rather than stand against it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "March 22, 2024, 03:04:39 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.Not sure whether it's a post of hope or a post of sarcasm! In 50 years of Bitcoins existence, I believe majority of the countries would legalise Bitcoin. Because many governments would understand the benefits of Bitcoin by then!But one main question remains - if the world legalises Bitcoin, will Bitcoin be able to scale up to handle the volume?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kliss",
      "created_time": "March 22, 2024, 03:07:43 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.The Blockchain behind bitcoin is indeed expanding rapidly and so many countries in Africa already have good understanding of how it works. Bitcoin does not necessarily need approval to be legalized in Africa or anywhere else, and i do believe that there is no country in Africa that citizens or individuals are not engaged in bitcoin. Bitcoin functions independently so individuals and business can choose to accept bitcoin as a form of payment without requiring government approval or legalising it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pi-network314159",
      "created_time": "March 22, 2024, 03:08:28 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.That is actually correct. Bitcoin will be adopted as a legal tender of many countries. Already it has gone beyond expectations. Just that many places in the world are not yet awear about it. But before the 50 years of bitcoin existence, I believe it would have circulated all over the World. And will be fully adopted. Just like El Salvador adoption of Bitcoin, which has become the talk of the day. EL savedo has become a focal point and has taken the Leed to challenge most part of the world on how important adopting Bitcoin as a legal tender should be. In due time more countries will mimic them and bitcoin adoption will increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "March 22, 2024, 03:32:52 PM",
      "body": "Quote from: Bonny070 on March 22, 2024, 01:28:39 PM bitcoin is a future digital currency, i strongly believes that before BTC celebrate 50 years in existence at least one or two African countries is going to legalis it. because block chain network is expanding every day by day. and most of the countries in Africa have the knowledge BTC how it works.Don't even go too far in expectations for 50 years, that's way too forward, anything can happen henceforth right now as we are talking, just as we have Central African Republic adoption of bitcoin when we least expect after El-Salvador bitcoin adoption as a legal tender, there are many African countries that have the prospect to this, if we first go with the consideration of the way they have been involved in bitcoin use, we may not have to wait that long before seeing more countries coming to adopt bitcoin as a legal, we already have two countries worldwide within the space of fourteen years and if bitcoin should get close to $100,000 or  beyond, we are likely to see more adoptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}