{
  "id": "topic_5460738",
  "title": "grendel25",
  "author": "grendel25",
  "created_time": "July 23, 2023, 03:33:55 AM",
  "content": "Anybody else member actual cryptocurrencies? Like a fair launch, open to everybody, first coins attained by Proof of Work mining? ASIC resistant mining? A chart that starts at zero or very close to it rather than starting high and dwindling down while projects hemorrhage cash for operating expenses?I member...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460738",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "July 24, 2023, 09:18:10 AM",
      "body": "Quote from: grendel25 on July 23, 2023, 03:33:55 AMAnybody else member actual cryptocurrencies? Like a fair launch, open to everybody, first coins attained by Proof of Work mining? ASIC resistant mining? A chart that starts at zero or very close to it rather than starting high and dwindling down while projects hemorrhage cash for operating expenses?I member...I see the announcement of new coins in miner chats, but you should mine a coin whose mining profit is very doubtful. The developer of the coin will need money for various expenses, or the developer will take a commission from each block for the development of the project, which is also dishonest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 24, 2023, 11:25:10 PM",
      "body": "It's hard to replicate what Bitcoin, Litecoin, Ethereum and all those early coins did before the crypto space started going crazy. Most of what we have now are just copycats and scams, masquerading as the coins of the future.Mining such new POW coins today is just a gamble that may or may not pay off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batsonxl",
      "created_time": "July 26, 2023, 04:07:04 PM",
      "body": "I believe there will be new hero for gpu miners near future. Only thing is just SURVIVE now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 26, 2023, 06:40:51 PM",
      "body": "Quote from: Bitcoin_Arena on July 24, 2023, 11:25:10 PMIt's hard to replicate what Bitcoin, Litecoin, Ethereum and all those early coins did before the crypto space started going crazy. Most of what we have now are just copycats and scams, masquerading as the coins of the future.Mining such new POW coins today is just a gamble that may or may not pay off.Then it was also a game, and the miners did not believe in the future of Bitcoin, Litecoin, Ethereum and other coins for mining.The difference was only in the payback period of mining. When these terms were reduced, the number of miners was added, and vice versa. But there are no good alternatives for GPU mining yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "grendel25",
      "created_time": "July 29, 2023, 02:16:14 AM",
      "body": "Quote from: Bitcoin_Arena on July 24, 2023, 11:25:10 PMIt's hard to replicate what Bitcoin, Litecoin, Ethereum and all those early coins did before the crypto space started going crazy. Most of what we have now are just copycats and scams, masquerading as the coins of the future.Mining such new POW coins today is just a gamble that may or may not pay off.Ethereum started as 100% pre-mine. I member...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 29, 2023, 06:05:12 PM",
      "body": "Quote from: grendel25 on July 29, 2023, 02:16:14 AMQuote from: Bitcoin_Arena on July 24, 2023, 11:25:10 PMIt's hard to replicate what Bitcoin, Litecoin, Ethereum and all those early coins did before the crypto space started going crazy. Most of what we have now are just copycats and scams, masquerading as the coins of the future.Mining such new POW coins today is just a gamble that may or may not pay off.Ethereum started as 100% pre-mine. I member...In 2015, the payback of video cards in Ethereum mining was very fast, less than 10 months, and on used video cards that could be bought on the markets, the payback period was very good - up to 6 months and there were very few miners. Premine didn't affect the profit of miners for more than 7 years",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 31, 2023, 02:18:04 PM",
      "body": "Quote from: batsonxl on July 26, 2023, 04:07:04 PMI believe there will be new hero for gpu miners near future. Only thing is just SURVIVE nowThat is correct and I agree with it.Most likely there will come a new good coin that will make miners happy again,I am sure Nvidia and AMD are not liking the revenues they see now after Ethereum going to PoS and they are some massive driver that should ask for a new coin to be developed and be well mined with GPU-s which in turn will make their revenues good again.As for the survive now I think it is a gambler as what coin you choose to mine,most people and I agree with them have stick with ETC+ZIL dual mine while staking ZIL to get extra benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 04, 2023, 09:23:29 PM",
      "body": "Why is it still ETC + ZIL? ZIL can be dual-mined with most profitable coins, and this is not parallel mining, but simply switching to ZIL mining about 1 time per hour for a short time when necessary. Nvidia's shares are growing stronger than AMD's, and the topic of AI is more profitable for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}