{
  "id": "topic_5406396",
  "title": "348Judah",
  "author": "348Judah",
  "created_time": "July 15, 2022, 12:24:28 PMLast edit: July 15, 2022, 01:50:57 PM by 348Judah",
  "content": "This is to all user of the microfinance bank \"Kuda\" that taking effect from the 15th of July 2022 the bank will begin the deduction of #50 stamp duty as instructed by the government on every transaction made that is above the sum of #10,000. this could take us some daysy back to how Kuda bank has being a zero transaction fee bank for it first twenty five transaction made within a month but has now declare the cost to be deducted from it user on every said amount.QuoteThe bank in the mail stated, “In line with the federal government’s duty act. We‘re required by law to apply a N50 charge to all depositors of N10,000 or more made into your Kuda account. This charge will apply to the following kinds of deposits from Friday, July 15, 2022; electronic transfer, money added to your account with a debit card and cash deposits made into your account at any of our partner banks.”https://nairametrics.com/2022/07/12/kuda-bank-to-charge-customers-n50-for-deposits-of-n10000-and-above-from-july-15/?amp=1The governments aren't making things easier for the comfortability of the citizen, if one of the reasons why the microfinance banks which are private and Kuda a low or zero interest transaction fee bank can make the people taste the affordability of every aspect of the economic and financial circumstance in providing individuals and businesses to have an itch free experience in running a day to day transaction without indescriminate deductions from user's account.All the said has been done all about Cryptocurrency with the first introduced one \"bitcoin\" was aimed to ease and lessen the burden of cross boarder transactions charges, securing privacy and running a decentralized digital currency and network on the blockchain with bitcoin make us has this unique benefit from the rule of government over our financial trust, That's one of the reasons why using a traditional fiat system irregardless of bank, CBDC, or whatever has thesame implications to get altered by government but bitcoin has been a thick bone on their neck to control or regulate and i therefore encourage the use of bitcoin in the running of our economy which cannot be hindered by government just as it has power over banks regardless of types.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406396",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 15, 2022, 12:39:13 PM",
      "body": "Kuda said it is in accordance to the Federal Government’s stamp duty act. Kuda gains nothing from it. QuoteThe bank however stressed that it gains nothing from the N50 charges as everything would be remitted to the government’s pocketThe monthly 25 transactions are still free.50 naira equals to $0.082.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 15, 2022, 02:05:36 PM",
      "body": "This is like what the charges go for the use of mobile apps to transact with fiat. I think the government of Nigeria is trying to generate miscellaneous income from the pucket of citizens. Agreed that taxes should be paid but the ones remitted are not judiciously used. There is also the increase in VAT that goes down to increase in charges on phone calls, internet data usage and right down to increase in food stuffs and shelter. We are just witnessing high inflation rate that is it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 15, 2022, 02:21:10 PM",
      "body": "Quote from: 348Judah on July 15, 2022, 12:24:28 PM Remain decentralized with crypto or centralized with banks.I believe this article is orinated from Nigeria. Because is a Nigeria Bank although I do not know it it has branches in the international arena. OP, you have to understand something, base on your topic, crypto currency has not been legal in Nigeria and the people that are using crypto are much, just like my community as for now I am the only one has bitcoin so to what extend people leave centralized bank currency to crypto currencies. But if it is a country whereby the government approves to use crypto for all the citizens then it will be very easy for one to focus only on crypto currency (bitcoin), as it is, even though you have bitcoin you can not use it to buy what you want in the Nigerian State unless the thing you want to buy is accepted by the seller to pay crypto if not your bitcoin will still be converted/transferred to a centralized bank for them to cut the amount that the government asked them to cut. so, as it is all the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 15, 2022, 02:40:43 PM",
      "body": "Quote from: 348Judah on July 15, 2022, 12:24:28 PMThe governments aren't making things easier for the comfortability of the citizen, if one of the reasons why the microfinance banks which are private and Kuda a low or zero interest transaction fee bank can make the people taste the affordability of every aspect of the economic and financial circumstance in providing individuals and businesses to have an itch free experience in running a day to day transaction without indescriminate deductions from user's account.Always beware of what is freeQuoteHow does Kuda make money?We make money by using collective deposits to make investments and issue credit.We also make money from commission on airtime purchases and from service fees sellers pay us when people like you shop with their Kuda Card.Does this ring a Celsius?  Also, is this 200000 Naira insurance (which is 400$???) the standard in Nigeria?So only $400 is insured in case of a bank crash?Quote from: Charles-Tim on July 15, 2022, 12:39:13 PMThe monthly 25 transactions are still free.50 naira equals to $0.082. My calculator says 12 cents but, anyhow, the tax should apply to every transaction over 24$ which is really really stupid.I remember a while ago how everyone said that apps and mobile banking are revolutionizing Nigeria's banking and helping the unbanked, and now you have taxes for transactions below 25$? This is going downhill pretty fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 15, 2022, 03:39:39 PMLast edit: July 15, 2022, 04:37:23 PM by Charles-Tim",
      "body": "Quote from: stompix on July 15, 2022, 02:40:43 PM---snipped---Kuda is an online microfinance bank, unlike commercial banks that have thousands of workers to pay monthly salary. The money Kuda will spend on maintenance and other things will be significantly reduced. It is given license by the central Bank of Nigeria but spending less on workers and services if compared to commercial banks.26th transactions and above are not free. Kuda is widely used by people buying and selling crypto, they can make over 100 transactions monthly. Also some people and business organizations can make over 25 transactions monthly. The first Visa card is free, but after expiration, the renewal is around 900 naira to 1000 naira (within that price range but I have forgotten the exact amount)Quote from: stompix on July 15, 2022, 02:40:43 PMMy calculator says 12 cents but, anyhow, the tax should apply to every transaction over 24$ which is really really stupid.I remember a while ago how everyone said that apps and mobile banking are revolutionizing Nigeria's banking and helping the unbanked, and now you have taxes for transactions below 25$? This is going downhill pretty fast.That is what Nigeria has turned to, even the rich people will be favoured while the poor is not in this regard. I do not know much about this yet, but if just 50 naira will be deducted from  transaction above 10000 naira, even anyone that transferred 5 million niara will only have 50 naira deducted from the total amount received, that is stupid in my opinion too because the rich are favoured.You used the CBN rate for your calculation, but we Nigerians know that is not what is actually happening, parallel or black market rate is used.Dollar to naira is 415.4 today, using CBN rate, but I exchanged dollar to naira at 612 the last time which was few days ago. People buy and sell dollar at higher rate if compared to the CBN rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 15, 2022, 03:54:38 PM",
      "body": "Quote from: Charles-Tim on July 15, 2022, 03:39:39 PMThat is what Nigeria has turned to, even the rich people will be favoured while the poor is not in this regard. I do not know much about this yet, but if just 50 naira will be deducted from  transaction above 10000 naira, even anyone that transferred 5 million niara will only have 50 naira deducted from the total amount received, that is stupid in my opinion too because the rich are favoured.Bro.. You realize that this is how Bitcoin works too, right? Everyone pays the same for one tx, no matter the amount!Quote from: Charles-Tim on July 15, 2022, 03:39:39 PMDollar to naira is 415.4 today, using CBN rate, but I exchanged dollar to naira at $612 the last time which was few days ago. Well, this makes sense, so does this mean if I'm a foreigner and I get into a bank and they exchange my $ for Naira I get fleeced by about 30%?Nice, reminds me of traveling abroad in the '90, always checking the real and official rates. Quote from: Charles-Tim on July 15, 2022, 03:39:39 PM26th transactions and above are not free. Kuda is widely used by people buying and selling crypto, they can make over 100 transactions monthly.Pure curiosity, how much is the fee after this? Or it depends on the amount cause if it's like that it's a real pain in the ass to understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 15, 2022, 04:01:33 PM",
      "body": "Did you know that until now I did not use a bank account. I have used it once in my life in 2016, and even it lasted for 6 months in an account filled account less than $50. After I got to know cryptocurrency until now I always cashed it. Fiat is just an alternative when I need to buy some essentials, it's all generated from crypto. The rest is still safe in Bitcoin today.You see, the simple reason is because I have complete faith in crypto, and I have lost all confidence in keeping my money in the bank. Btw, I'm still fine, and never had interest like other bank users. I think this is the freedom that is essential and suitable as I have been looking for all this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "July 15, 2022, 04:09:35 PM",
      "body": "Quote from: Gozie51 on July 15, 2022, 02:05:36 PMThis is like what the charges go for the use of mobile apps to transact with fiat. I think the government of Nigeria is trying to generate miscellaneous income from the pucket of citizens. Agreed that taxes should be paid but the ones remitted are not judiciously used. There is also the increase in VAT that goes down to increase in charges on phone calls, internet data usage and right down to increase in food stuffs and shelter. We are just witnessing high inflation rate that is it.No country that doesn't have issue for management of inflation and i believe that what your country is experiencing other countries experienced more your country. For now no country is bad economical free. Some African countries their is no charges of taxation and still people living in those areas are still complaining of hardship. What will resolve the issues of country experiencing of hardship is from the government management. Any increase any country experience is from the government, because of them is greedy for money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 15, 2022, 05:29:16 PMLast edit: July 16, 2022, 07:31:18 AM by Charles-Tim",
      "body": "Quote from: stompix on July 15, 2022, 03:54:38 PMWell, this makes sense, so does this mean if I'm a foreigner and I get into a bank and they exchange my $ for Naira I get fleeced by about 30%?Nice, reminds me of traveling abroad in the '90, always checking the real and official rates.According to what I noticed, CBN has its own rate, banks have their own rates and parallel market rate is also different. I remember last year, many months ago when I wanted to make a cross border transaction of over $100, CBN in a month or two months before that time made it mandatory for all banks to reduce naira credit card international monthly spending to $100. My bank rate for the naira to dollar transaction (the bank I used) was around 460 and 480, CBN rate was 410, parallel market was around 520. The rate is slightly different from bank to bank.Because I got no option as I wanted to spend more than $100, I make use of Astropay virtual prepaid card, all I noticed was that making use of third party like Astropay for the payment, parallel market price of around 1 dollar also almost equals to 520 naira (parallel market price) was deducted from my bank account to fund the virtual card before making the payment.Quote from: stompix on July 15, 2022, 03:54:38 PMPure curiosity, how much is the fee after this? Or it depends on the amount cause if it's like that it's a real pain in the ass to understand it.After 25 transactions, irrespective of the amount to be transferred, 10 naira will be deducted for each transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 15, 2022, 05:35:30 PM",
      "body": "The above statement is absolutely confirm to be true as a matter of fact I was  also notified by a pop up notification through the application and I was how could government induced such statement or such transaction fees. Maybe they found much transactions via the app so they decided to have control over the app, this simply shows that there would be less active from the app after today being the implementation day.Government trying to make things worst over some poor citizens of our country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 15, 2022, 06:22:56 PM",
      "body": "Only if everyone understood their own Governments never wanted the better for their citizens and in many (probably all) countries it is all about power, influence, stealing and corruption.  And if anyone believes a centralized bank will ever want to do good, no offense but they are fools.But I see people complaining about this transactional fee.  This makes me wonder, and would be great if someone from Nigeria could answer because I do not get it really.  How is Bitcoin more affordable than a bank, even with this fee, if we consider Bitcoin sometimes has some pretty hefty transaction fee premiums?  My last few transactions have gone through with over $0.1 per transaction in fees.  Is it really better than what the cost this 'stamp duty' inquires?Quote from: Charles-Tim on July 15, 2022, 03:39:39 PMThat is what Nigeria has turned to, even the rich people will be favoured while the poor is not in this regard. I do not know much about this yet, but if just 50 naira will be deducted from  transaction above 10000 naira, even anyone that transferred 5 million niara will only have 50 naira deducted from the total amount received, that is stupid in my opinion too because the rich are favoured.This is so debatable.  Think about it, you have a billion Naira and you have to pay 0.1% to move your money while others have to pay N10 or N50 or whatever.  Is it fair?  Creating a fair system is insanely hard, probably even impossible because if you get to pay more as a rich guy then why do you have to pay more?  Because your wallet is thicker?  Because you worked hard (yes, I know, many of the rich do not like being asked about their first million)?  On the other hand, I get what you are saying.  Paying 0.1% for N10,000 and someone else paying 0.0001% for N10,000,000 is unfair.  To me, both opinions are just as valid.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 15, 2022, 07:02:00 PM",
      "body": "Quote from: Charles-Tim on July 15, 2022, 03:39:39 PMThat is what Nigeria has turned to, even the rich people will be favoured while the poor is not in this regard. I do not know much about this yet, but if just 50 naira will be deducted from  transaction above 10000 naira, even anyone that transferred 5 million niara will only have 50 naira deducted from the total amount received, that is stupid in my opinion too because the rich are favoured.Quote from: PrivacyG on July 15, 2022, 06:22:56 PMThis is so debatable.  Think about it, you have a billion Naira and you have to pay 0.1% to move your money while others have to pay N10 or N50 or whatever.  Is it fair?  Creating a fair system is insanely hard, probably even impossible because if you get to pay more as a rich guy then why do you have to pay more?  Because your wallet is thicker?  Well to this point even as it is debatable with the disparity between charges for the amount of money being deposited or transacted but it doesn't really relate to being poor or rich because the rich also sometimes have to do a transaction below the usual large amount like 10,000 and get charged 50 naira as the new policy is stipulating. In order words, the law is blind to whoever comes to it. My point is that regarding the charges, it does not respect the rich nor poor, is like the daily requirement for mobile fiat withdrawal which is put at same level for every customer depending on the bank you operate with.I'm saying that the Nigerian government doesn't really bother about providing jobs for people to be able to take care of the bills levelled on their shoulder rather they keep increasing the price for every service rendered. Moreover, I don't understand why you have to be charged for depositing money to your account where it is even serving as a loan to them because they use it for business and don't pay you returns but withdraw different kinds of charges monthly in the name of account servicing and maintenance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 15, 2022, 07:27:10 PM",
      "body": "Quote from: 348Judah on July 15, 2022, 12:24:28 PMThe governments aren't making things easier for the comfortability of the citizen, if one of the reasons why the microfinance banks which are private and Kuda a low or zero interest transaction fee bank can make the people taste the affordability of every aspect of the economic and financial circumstance in providing individuals and businesses to have an itch free experience in running a day to day transaction without indescriminate deductions from user's account.Yes, it is true, governments never care about the comfort of citizens, here in my country the same thing too, I expect that the same thing is in most countries, when they provide you with such free or semi -free services, it is certain that they have other goals greater than that, they may want to track all your transactions Or prevented you from transferring your money into encrypted currencies, for example, the government does not waste any opportunity to impose centralization and control citizens and know all the details of their lives, especially the financial life, so I think this is the goal of creating this type of bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "July 15, 2022, 07:55:13 PM",
      "body": "Quote from: yhiaali3 on July 15, 2022, 07:27:10 PMYes, it is true, governments never care about the comfort of citizens, here in my country the same thing too, I expect that the same thing is in most countries, when they provide you with such free or semi -free services, it is certain that they have other goals greater than that, they may want to track all your transactions Or prevented you from transferring your money into encrypted currencies, for example, the government does not waste any opportunity to impose centralization and control citizens and know all the details of their lives, especially the financial life, so I think this is the goal of creating this type of bank.Nothing is free, it is the basis of a centralized financial system. In fact, I can make transactions hundreds of times every month using a local bank (same bank) with no fees but in reality they can still charge a service fee at the end of the month (card fee or admin fee). The government does not want to lose even though it actually uses our money stored in bank accounts. They say revenue sharing but they cut taxes. That's the thing that makes me never put a lot of money in a bank account again, it's totally unfair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "July 16, 2022, 06:54:40 AM",
      "body": "I love this topic, this is magnificent. I literally became a crypto obsessed person because of this. Doesn't mean that it's not going to end up working for us, of course it does, but that's still not going to be something that is dangerous to us all to just stay in crypto and prefer that, over the horribleness of banks. Don't get me wrong, I am not even thinking as people who work in Banks are bad people, not even CEO's, maybe individually there could be some bad people who are bankers, but not inheritly.The problem is how banks work, if there is a bank out there, all of them, every single one from tiny to giants, all work in a way to ruin peoples' lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 16, 2022, 08:15:36 AM",
      "body": "There are way more hidden charges than these to be honest, and it varies from banks to banks also from countries to countries. I have credit cards with zero membership charges but still they deduct some money per year or quarters I don't know exactly as subscription fee, they even charge for checks, deposit and using ATM after certain times so there are lot of small money keep deducted by banks all the time which I really hate it but that is not the only reason I want to have decentralized monetary system.Banks literally printing more money so this keep reducing the purchasing power which isn't really have to be in that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "July 16, 2022, 11:46:36 AM",
      "body": "Quote from: stompix on July 15, 2022, 02:40:43 PMI remember a while ago how everyone said that apps and mobile banking are revolutionizing Nigeria's banking and helping the unbanked, and now you have taxes for transactions below 25$? This is going downhill pretty fast.I always laughed when I read those articles because most of them were just pushing an agenda and nothing much. People fail to realized that majoriy of this so called life changing apps has VC backing and the VCs are made up by the government officials and the banking officials in our country. You think an app will just come from nowhere and dominate the banking sectors in an economy like that of Nigeria without the official allowing it to happen. Our banking official knows the citizens will naturally patronize apps that looks like aren't under the control of the government without realizing that before an app can operate as  the Kuda bank app has, they must have the approval from the CBN and complie to their regulations.I thought people will come to their senses when the Kuda bank app started blocking cryptocurency related transaction or account belongings to public cryptocurency figure but no that wasn't the case instead the publicity of the app grow faster because of the so called free transaction and wasn't overcharging her customer but then this are just disguise. How are they then different from the traditional banks if we get same charges. Slowly they'll be as worst as the regular banks. Their services are only fast now because they don't transact the amount the regular banks does. Banks can never have your best interest at heat, they're only looking for means to enrich themselves and control you through your finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "July 16, 2022, 12:11:57 PM",
      "body": "Quote from: Findingnemo on July 16, 2022, 08:15:36 AMThere are way more hidden charges than these to be honest, and it varies from banks to banks also from countries to countries. I have credit cards with zero membership charges but still they deduct some money per year or quarters I don't know exactly as subscription fee, they even charge for checks, deposit and using ATM after certain times so there are lot of small money keep deducted by banks all the time which I really hate it but that is not the only reason I want to have decentralized monetary system.Banks literally printing more money so this keep reducing the purchasing power which isn't really have to be in that way.That's why I say nothing is free when you deal with a bank. I don't believe it even though they actually free some transactions because in the end there is always a fee that is expected. The bottom line is, if you want to keep a lot of money in the bank then you have to be willing to accept their T&C as a terms of service.But we will not be able to be 100% decentralized because we are actually adherents of government law. A centralized financial system is always needed, we cannot completely avoid it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 16, 2022, 12:30:12 PM",
      "body": "Quote from: Falconer on July 15, 2022, 07:55:13 PMQuote from: yhiaali3 on July 15, 2022, 07:27:10 PMYes, it is true, governments never care about the comfort of citizens, here in my country the same thing too, I expect that the same thing is in most countries, when they provide you with such free or semi -free services, it is certain that they have other goals greater than that, they may want to track all your transactions Or prevented you from transferring your money into encrypted currencies, for example, the government does not waste any opportunity to impose centralization and control citizens and know all the details of their lives, especially the financial life, so I think this is the goal of creating this type of bank.Nothing is free, it is the basis of a centralized financial system. In fact, I can make transactions hundreds of times every month using a local bank (same bank) with no fees but in reality they can still charge a service fee at the end of the month (card fee or admin fee). The government does not want to lose even though it actually uses our money stored in bank accounts. They say revenue sharing but they cut taxes. That's the thing that makes me never put a lot of money in a bank account again, it's totally unfair.Yep That's how bank works. There will be never a free service especially on banks. There are many banks that offer zero charge on becoming their member but the reality is it will be the gateway for them to charge you fees as you use their service. Fees are scattered between their services and some is charging annual fees. There are couple of banks out there and they are just fighting with each other by providing you an advantage over other banks such as lower fees, 0 membership fee, waived annual fees and other promotions. We have bitcoin on our side but we can't deny the comfortability that banks gives us on our daily lives. I myself have some money on my bank but it isn't that much since I don't fully trust them, It's just the life would be easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}