{
  "id": "topic_5420111",
  "title": "Ucy",
  "author": "Ucy",
  "created_time": "November 09, 2022, 12:32:08 PM",
  "content": "Sorry for those who try to achieve \"peace\" through the back doors (Ethiopia & Russia).This is mainly for Ethiopia.Ethiopia, I have observed you trying to abandon the good path that was set for thee, for the wrong path. Barriers preventing you from entering Tigray/Tigrai were removed for you to get into the region, defeat the enemy and guide the region according to the Will of the CREATOR... instead you are negotiating with the enemy (an evil entity) and doing his will in the name of peace.Haven't you heard that True Peace comes from our CREATOR only? And the only way to achieve it is by obeying HIS commandments? The enemy is only deceiving you in order to get in quickly and conquer you. You think you can outsmart the enemy without the CREATOR guiding you?Anyway I'm predicting the opposite of what the enemy is trying to offer you: Peace, rewards/money, etc Those will achieve the opposite as it's fake peace and cursed rewards (reward full of problems or rewards of iniquities).  Peace only comes when we are subject to the Will of our CREATOR or obey his Commandments of Love for GOD and Neighbors . That's precisely what was given to you through me... a list of peace messages you must obey to achieve peace... the list includes: replacing tplf with a good group and working with the people of Tigray according to the Will of GOD for the good of the Region, Ethiopia, Africa and the World. By the way, Tigray seems to want a decentralized system. Decentralization should be done right or in ways that do not create problems for You and the Region.   The people's right to bear arm plus other important rights (rights that do not violate the CREATOR Commandments) should be respected. You or Tigray should not abuse/misuse the rights. This is the good path you much follow to achieve True Peace. The path requires 100% obedience. You are on your own if you decide to follow the wrong path Related Post:To Russia and Ethiopia, why negotiate with the ones you called Terrorists?https://bitcointalk.org/index.php?topic=5418432.msg61189278#msg61189278",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420111",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "November 09, 2022, 01:07:47 PM",
      "body": "If we really consider these steps we couldn't conclude on them as means to making peace or settling one than attack on human because of rule of power, fame and supremacy to surpress others under thier jurisdiction, settling peace is a good means whereby peace and orderliness can be achieved without any compromisation of things the bad way, we try to solve some problems but constitute more at the cause of doing so, peace is when you have it from within you then you can be able bto make or give others this same peace by fighting on their own interest by all cost amd not killings of innocent souls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "November 09, 2022, 05:03:07 PM",
      "body": "The agreement was signed between the Ethiopian Federal Government and the Tigray Liberation Front on November 2, with the mediation of the African Union and African leaders who intervened to end the dispute. I do not think that Ethiopia will violate this agreement if the Tigray Liberation Front did not violate it.It was the Tigray Liberation Front that started the violence after the election of Abi Ahmed as prime minister, after the front had ruled the country for 27 years.Russia is looking for a foothold in the Horn of Africa by adopting other methods away from the conflict files in the region, unless it is the one who supports the Tigray Liberation Front, which I believe is far from the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 09, 2022, 05:06:27 PM",
      "body": "You seem to be unhappy that peace is being restored in Ethiopia. Have you not considered the loss of lives and the human suffering that the instability in Ethiopia has caused? The issues that are causing this war can be settled by dialogue. If Tigray regions want autonomy then they should have it, don't forget that they also have the right to self-determination. They have the right to hold a referendum to determine if they are comfortable in Ethiopia. Ethiopia is a Democratic Republic where the voice of all citizens should be heard and not silenced. Let us give peace and freedom a chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}