{
  "id": "topic_5439906",
  "title": "taufik123",
  "author": "taufik123",
  "created_time": "February 15, 2023, 03:32:47 AM",
  "content": "Shocking news came from the legendary exchange LocalBitcoins which has been operating for 10 years, they will close their services starting on February 9, 2023 yesterday with the suspension of new registrations, so they cannot register again and tomorrow February 16, 2023 will suspend trading and suspend the use of LocalBItcoin wallets. after February 17, 2023 LocalBitcoin customers can no longer use trading and wallet services. Customers who still have assets in LocalBitcoin are given 12 months to withdraw all their assets. Quote from: https://localbitcoins.com/service_closure/Timeline for discontinuing the Bitcoin trading service:2023-02-09 Suspension of new sign-ups 2023-02-16                       Suspension of trading on LocalBitcoins                       Suspension of using LocalBitcoins wallet (with exception of withdrawing one's funds)After 2023-02-17 LocalBitcoins customers will only be able to log-in to withdraw their Bitcoins. The trading and Wallet services will no longer be available at this point.Of course it is not without reason why LocalBitcoin has to close its services. This is because market conditions are no longer favorable, so it is forced to close. LocalBitcoins has actually experienced a decline in transactions since 2020 according to Forbes news and suspended user accounts without prior notice.https://www.forbes.com/sites/digital-assets/2023/02/09/localbitcoins-matching-exchange-cited-by-us-in-bizlato-case-to-close-after-10-years-of-operation/?sh=40112f3d301cand in 2017 according to data provided by Coindance, LocalBitcoins was processing $100 million worth of trades every week, but within the last four months of 2023, transactions dropped to $5.5 million-$7.5 million. So it can't be expected anymore, because there is no profit if it continues to operate.https://coin.dance/volume/localbitcoins/ALLWhat do you think about this Legendary Exchange, what are some memories you have with LocalBitcoins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439906",
  "comments": [
    {
      "author": "BITCOIN4X",
      "created_time": "February 15, 2023, 03:41:10 AM",
      "body": "Bitcoin Forum > Economy > Marketplace > Service Discussion > Exchanges@taufik123, like this thread lends itself to being moved to exchange boards instead of on bitcoin discussions.About LocalBitcoins exchange, I have no experience there because as far as my participation in crypto then local exchange and some other exchanges like Binance are enough to support my interest. I don't think the impact of the closure of the LocalBitcoins service has been great either, but it's not surprising when trading volume on this exchange has completely disappeared over the last few years which was the reason for the closure of his service.But wait, a similar thread was created before you, so are you sure you want to continue?Localbitcoins closing down",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "February 15, 2023, 03:07:50 PM",
      "body": "Quote from: taufik123 on February 15, 2023, 03:32:47 AMShocking news came from the legendary exchange LocalBitcoins which has been operating for 10 years,You are right, I have seen the information about the blocking of LocalBitcoins exchange on: 16 OCTOBER 2020 four years ago.Information that I see.QuoteLocalBitcoins was blocked by Roskomnadzor four years ago. Last month, Binance announced their site was also blocked in Russia. Even earlier this month, it could not be accessed in Indonesia. Nevertheless, Binance is no longer on the blacklist of the Russian government.Before the blocking news happened on the LocalBitcoins exchange, I wanted to use the LocalBitcoins exchange, luckily I got the information beforehand before using the LocalBitcoins exchange.I've also seen the same information on February 09, 2023, topic created by: @davis196.Topic: Localbitcoins closing down. As mentioned by BITCOIN4X.Hope users using Localbitcoins exchange without any problem with their assets. with the closing case of the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 15, 2023, 11:16:22 PM",
      "body": "We have more than one topic that talked about closing this platform, and therefore there is no need to create more of them.Their argument is not strong and it seems that they preferred to withdraw from the market with the current reputation rather than die slowly. It is unfortunate to see them out, but they made an excellent copy in the first days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "February 16, 2023, 08:30:54 PM",
      "body": "Quote from: BITCOIN4X on February 15, 2023, 03:41:10 AMBut wait, a similar thread was created before you, so are you sure you want to continue?Localbitcoins closing downQuote from: YOSHIE on February 15, 2023, 03:07:50 PMI've also seen the same information on February 09, 2023, topic created by: @davis196.Topic: Localbitcoins closing down. As mentioned by BITCOIN4X.Quote from: Husires on February 15, 2023, 11:16:22 PMWe have more than one topic that talked about closing this platform, and therefore there is no need to create more of them.I just realized about similar Threads, because by using the search feature I didn't find the thread (maybe I wasn't thorough enough).But back to the discussion I just gave, in this thread I also include the history that happened to LocalBitcoin about blocking in 2020.and some supporting data on why LocalBitcoin has to close its current service.The very significant decrease in transactions was caused because there was not enough revenue to continue to maintain the LocalBitcoin Exchange. Indeed, many are disappointed, but like it or not, it must be done rather than the developer having to lose because there is no commensurate profit.I will lock this thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}