{
  "id": "topic_5440372",
  "title": "mxfwzzwizqbz",
  "author": "mxfwzzwizqbz",
  "created_time": "February 19, 2023, 04:13:42 AM",
  "content": "Currently, I am a sophomore in high school. I learned about btc from my dad and btc blew my mind and I was hooked. I've been pretty much putting all that I can into it for a year and a half now. Are there any tips you guys give me? 2/3 of my bitcoin is in Stockpile and the other third is with my dad (I'm not sure how he's storing it). At this moment I own a total of 0.01798185 bitcoin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440372",
  "comments": [
    {
      "author": "Edwardard",
      "created_time": "February 19, 2023, 04:18:00 AM",
      "body": "Good job young man. Consider yourself lucky to even know about bitcoin at such a young age. I suggest you to keep and store your btc in a secure self custodial wallet like electrum, bluewallet, mycelium. You can use exchanges to buy more BTCs but never store them there since \"not your keys, not your coins\". Good luck on your future ventures!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "February 19, 2023, 04:26:50 AM",
      "body": "Am not sure what does you mean about you put all into it, did you refer to how long you invest to learn Bitcoin or you're used all of your money which is $450 to buy Bitcoin? As long as you can afford to lose all of your $450 and you don't need to use that money to buy stuff in your school, you're good to go.Does you mean this app? https://www.stockpile.com/ It's a centralized platform and I see they're ask KYC verification, it's not good for long term holding, you need to use hardware wallet since you're still newbie. Make sure you bought it from official store/seller. Anyway this thread is good to learn Security and Privacy Topics on Guides and Protection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "February 19, 2023, 04:30:58 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:13:42 AM2/3 of my bitcoin is in Stockpile and the other third is with my dad (I'm not sure how he's storing it). At this moment I own a total of 0.01798185 bitcoin I have never heard about Stockpile but if it is a centralized service, don't use it to store your bitcoin.Reminder: do not keep your money in online accountsCryptocurrency security checklistBitcoin information and resourcesAdvice to secure your wallets[General] Bitcoin Wallets - Which, what, why?You can use Electrum (desktop or mobile) because it is very light in storage space. If you want better privacy, use Bitcoin Core.$450 is too big for a high school student. If you are wanting to invest long term, DCA is good for you to go.https://dcabtc.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "February 19, 2023, 04:32:03 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:13:42 AMCurrently, I am a sophomore in high school. I learned about btc from my dad and btc blew my mind and I was hooked. I've been pretty much putting all that I can into it for a year and a half now. Are there any tips you guys give me? 2/3 of my bitcoin is in Stockpile and the other third is with my dad (I'm not sure how he's storing it). At this moment I own a total of 0.01798185 bitcoin Good luck, 0.01798185 is a large amount for your age.  It's admirable that you own so many bitcoins at this age, but it would be even more admirable if you could hold on to it. Holding Bitcoins is a difficult task that not everyone can do. So you use a non-custodial wallet to hold your bitcoins to keep them secure and when you are able to acquire more bitcoins buy a hardware wallet and store them safely there. Best wishes to you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "February 19, 2023, 04:40:25 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:13:42 AMCurrently, I am a sophomore in high school. I learned about btc from my dad and btc blew my mind and I was hooked. I've been pretty much putting all that I can into it for a year and a half now. Are there any tips you guys give me? 2/3 of my bitcoin is in Stockpile and the other third is with my dad (I'm not sure how he's storing it). At this moment I own a total of 0.01798185 bitcoin Thanks you have undoubtedly done a good job on it. You got into bitcoin while still studying in high school, learned about bitcoin, did a great job. But today maybe because of your father you got so much support. But I think your father is enough to advise you here. After that the advice I would give you is that you can use a hardware wallet to store your invested bitcoins. If you can use hardware wallet then your invested coins will be very safe. Finally I would say hold your bitcoins for a long time and you will own a lot of money at a very young age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "February 19, 2023, 05:04:04 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:50:31 AMQuote from: Jawhead999 on February 19, 2023, 04:26:50 AM~~Also, I will talk to my dad tomorrow or very soon to talk to him about transferring my money out of stockpile and into a hardware wallet. I plan on long-term investing my money into btc. Currently, I can afford to lose all of the 450 dollars of bitcoin that I have. It's not a life-changing amount for me or my family. However, I do plan on investing almost every dime I earn from a job/birthday/holiday (I'm not actually 16 I turn 16 literally next week) I am very excited to get a job so I can get more bitcoin, for me it's like gold, in my mind bitcoin is shiny and awesome looking.For a 16 year old kiddo, that's a huge amount already, but seeing the words \"I can afford to lose all of the 450$ of Bitcoin that I have\", I'm assuming that you came from a rich family or a family of businessman. Am I right? Anyway, I hope that 16 year old kids like you will think of the same here in my place. In my place, 16 year old boy or even a girl is just thinking of ways to go out, have fun, and posting some useless Tiktok videos out there instead of learning about finance. Well, I can't blame though, but it's quite unfortunate. I guess some here gave you already some tips and tricks with your investing journey. I guess that is what I will say. It's not a tip, but good job on investing on Bitcoin at a very young age. You and me are one of the 58% of crypto holders are under 34 years of age (the number is based on this page. Just continue what you're doing and learn more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 19, 2023, 05:36:21 AM",
      "body": "1. Use a hardware wallet. (Ledger/Trezor)2. Try to earn more money by mowing lawns and stuff to be able to invest more3. It's okay to hang out with friends and stuff, but stop buying useless crap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "February 19, 2023, 05:47:21 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 05:41:37 AMdo u know how to change username hahaThis post shows you knew a lot about the forum and you're not a newbie. This thread is fake to find lucky merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "February 19, 2023, 05:47:43 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 05:41:37 AMdo u know how to change username hahaIts not possible for you. Some old members have been successful in changing their username by PM'ing theymos and Cyrus regularly. However theres no chance they will listen to a brand new account. So your best bet would be to make a new one",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "February 19, 2023, 06:41:08 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 06:05:55 AM I'm not sure why I would be wanting respect from a btc community, If mods/admins start to change usernames of all the ppl who request, it will create heck of a confusion between all to differentiate, coz you will have daily scammers trying to scam  other newbies by changing their usernames quietly. I know its not your intention but still.Quote from: mxfwzzwizqbz on February 19, 2023, 06:05:55 AMI would literally receive nothing in return.You are new thats why you dont know but with time you'll understand what respect can give you in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "February 19, 2023, 06:53:22 AM",
      "body": "You can continue what you currently do by investing in bitcoin using DCA to save your money in bitcoin regularly.I suggest you move the bitcoins to another separate wallet and don't combine them with your father's bitcoins.Having bitcoins means you are responsible for those bitcoins so you must know how to store bitcoins properly.You are young but want to learn how to invest in bitcoin so that if you can continue investing in bitcoin, you can earn good returns in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Osh",
      "created_time": "February 19, 2023, 06:58:57 AM",
      "body": "That's a good start. There are lots of people out there who are your age but they are wasting their money on their current pleasures. After all, you only need to put a few percent of your money into such an investment so you can feel the benefits if the price goes up. It would be great if you keep your assets on a hard wallet, or maybe some of the popular exchanges out there right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "February 19, 2023, 07:10:30 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 07:00:40 AMDo you know a good resource for DCA BTC?Do you mean a DCA calculator ? This site provides all the historical data for DCAing: https://dcabtc.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "February 19, 2023, 07:12:14 AM",
      "body": "You are doing the right thing, saving little by little in Bitcoin. Doing that with fiat is pointless as your money is only losing value continuously. Tips? I think you need to learn about hardware wallets. Learn to self-custody what you have. I haven't heard about Stockpile but I doubt it is an open source non-custodial wallet. Also, don't be surprised and lose interest once the market goes through a severe winter. It has discouraged a lot. It has pushed many to panic sell, with a big loss. Learn to develop a diamond hand. It pays off in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "February 19, 2023, 07:22:47 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:13:42 AMCurrently, I am a sophomore in high school. I learned about btc from my dad and btc blew my mind and I was hooked. I've been pretty much putting all that I can into it for a year and a half now. Are there any tips you guys give me? 2/3 of my bitcoin is in Stockpile and the other third is with my dad (I'm not sure how he's storing it). At this moment I own a total of 0.01798185 bitcoin This is a good start for a sixteen year old. You mates are out there playing videogames and wasting money on unnecessary things or activities but you have shown a lot of wisdom and determination. I hope you keep holding this asset until you become an adult and independent. I want to also encourage you to keep adding to your investment now that you are depending on your parents because when you leave them it might become difficult to save. Keep saving mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "February 19, 2023, 07:45:13 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 07:00:40 AMDo you know a good resource for DCA BTC?You can use the site above as DCA calculator, but know that DCA is not something hard. Just taking certain amount of money weekly or every certain period of time and invest it in bitcoin continuously for certain period of time is DCA. As for me, it is not what I need a calculator for, just normal calculator is okay for me, but there are ones like that one above posted by Edwardard that makes the calculation easier.For security and privacy, you will find these topics interesting: Good topics on security and privacy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "February 19, 2023, 08:04:42 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:50:31 AMQuote from: Jawhead999 on February 19, 2023, 04:26:50 AMAm not sure what does you mean about you put all into it, did you refer to how long you invest to learn Bitcoin or you're used all of your money which is $450 to buy Bitcoin? As long as you can afford to lose all of your $450 and you don't need to use that money to buy stuff in your school, you're good to go.Does you mean this app? https://www.stockpile.com/ It's a centralized platform and I see they're ask KYC verification, it's not good for long term holding, you need to use hardware wallet since you're still newbie. Make sure you bought it from official store/seller. Anyway this thread is good to learn Security and Privacy Topics on Guides and Protection. Yes, I do mean stockpile.com. Also, I will talk to my dad tomorrow or very soon to talk to him about transferring my money out of stockpile and into a hardware wallet. I plan on long-term investing my money into btc. Currently, I can afford to lose all of the 450 dollars of bitcoin that I have. It's not a life-changing amount for me or my family. However, I do plan on investing almost every dime I earn from a job/birthday/holiday (I'm not actually 16 I turn 16 literally next week) I am very excited to get a job so I can get more bitcoin, for me it's like gold, in my mind bitcoin is shiny and awesome looking.I don't know about stockpile.com either, but if you already own a hardware wallet, don't hesitate to move all your bitcoins to a hardware wallet, it's the safest wallet by far. If it's money won't affect your life even if it disappears so hold your bitcoins as long as possible. Another thing is, bitcoin is more precious and better than gold, it completely outperforms gold in terms of returns. But you're only 16 years old, which means you're still of school age, so you still have to focus on your studies, don't be too passionate about making money and neglect your studies. Education is your future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "February 19, 2023, 08:47:49 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 04:13:42 AMCurrently, I am a sophomore in high school. I learned about btc from my dad and btc blew my mind and I was hooked. I've been pretty much putting all that I can into it for a year and a half now. Are there any tips you guys give me? 2/3 of my bitcoin is in Stockpile and the other third is with my dad (I'm not sure how he's storing it). At this moment I own a total of 0.01798185 bitcoin Buying bitcoin at your age is a good thing and $450 is a big money in some countries and if you will remain consistent you can be referred to as a future millionaire. But I read where you said you put your all into bitcoin. I want to understand if you invest all your money in bitcoin. But it is bad, you only need to invest what you are able to lose. Please don't be addicted to investing what you cannot afford to lose. Focus on long term investment of small amounts at a time in a manner that it will not affect you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "February 19, 2023, 09:05:07 AM",
      "body": "Quote from: mxfwzzwizqbz on February 19, 2023, 07:25:26 AMQuote from: Darker45 on February 19, 2023, 07:12:14 AM~snip~Yeah most likely I'll probably lose some money but at the end of the day I own bitcoin. Plus I'm going for a long-term investment, not a short-term one. Investment is not always uphill. Diamond hands hahaha    I tried to get my sister to get in on btc but she said she doesn't like the \"stress\" L sister  You're not really losing. Paper loss is not a loss in the sense that your Bitcoin is intact and that it's only the price that has decreased. And it's normal for a highly unpredictable and volatile asset like Bitcoin. Well, it's strictly an unrealized loss, but that doesn't mean anything unless you will sell your Bitcoin. The only thing that would make you lose is if you sell at a loss. So if there will come a time when you want to sell, do it with a realized gain not loss. To be honest, if you're new it could indeed be stressful. If the price value of your Bitcoin portfolio has fallen 70%, you could possibly get stressed. But that's the tendency only if you focus on its short-term to medium-term price fluctuations. If you zoom out the entire Bitcoin chart, you will see how things will eventually get better in the end.  The last laugh always belongs to the one who's got the diamond hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}