{
  "id": "topic_5467209",
  "title": "DVlog",
  "author": "DVlog",
  "created_time": "September 18, 2023, 12:45:37 PM",
  "content": "QuoteBitcoin Mining and Clean Energy: Bloomberg Intelligence reported Bitcoin miners now meet the 50% clean energy threshold. Jamie Coutts shared the latest on X (formerly Twitter), saying, “The Bitcoin energy narrative is flipping! A new note out this morning on the Bloomberg Terminal looks at the rapid rise of sustainable energy sources in BTC mining.” In 2021, Elon Musk announced that Tesla (TLSA) would resume accepting BTC when miners reach the 50% clean energy threshold.Genesis Ceases Crypto Trading Services: On Thursday, news hit the wires of Genesis halting crypto trading services permanently. Genesis previously announced the end of spot trading by September 30. Derivatives trading services will cease immediately.SEC v Stoner Cats 2 Draws Condemnation: Stoner Cats 2 LLC became the latest victim of the SEC onslaught on the US digital asset space. The SEC announced charges against Stoner Cats 2 LLC for conducting an unregistered offering of crypto asset securities in the form of NFTs that raised $8 million to fund Stoner Cats, an animated web series. Ripple CLO Stuart Alderoty called out the SEC move. SEC Commissioners Hester Peirce and Mark Uyeda dissented.Deutsche Bank Enters the Crypto Space in Earnest: German banking giant Deutsche Bank (DB) and Taurus SA announced a partnership to offer crypto and tokenized asset custody services to institutional clients. Deutsche Bank Global Head of Securities Services Paul Maley reportedly said, “As the digital asset space is expected to encompass trillions of dollars of assets, it’s bound to be seen as one of the priorities for investors and corporations alike.Source: https://www.nasdaq.com/articles/crypto-news:-clean-energy-bitcoin-mining-threshold-puts-elon-musk-and-tesla-in-focusOne of the biggest criticisms of bitcoin was its carbon emissions and its environmental impact. Elon and Tesla were at the forefront of this criticism. Despite this, Tesla held bitcoin but sold it to the market later on. This news will have a positive impact throughout the industry, and companies like Tesla are likely to come to the market again as, as Elon previously mentioned, Tesla will accept bitcoin when miners reach the 50% clean energy mark. This will be a major boost for the bitcoin industry. Institutional investors are mostly concerned about the environmental impact of bitcoin mining. This opens a path for institutional investors to come onboard.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467209",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 18, 2023, 01:01:03 PM",
      "body": "In 2019 report: Study: Over 74% of Bitcoin Mining is Powered by Renewable EnergyIn 2020 report: Report: 76% crypto miners use renewables as part of their energy mix2022 report: the Bitcoin mining network uses approximately 0.05% of the total energy consumed globallyQuote from: DVlog on September 18, 2023, 12:45:37 PMElon and Tesla were at the forefront of this criticism. Despite this, Tesla held bitcoin but sold it to the market later on. This news will have a positive impact throughout the industry, and companies like Tesla are likely to come to the market again as, as Elon previously mentioned, Tesla will accept bitcoin when miners reach the 50% clean energy mark. This will be a major boost for the bitcoin industry.Bitcoin does not need Elon Musk. He should fuck off. Elon Musk only manipulated for people to leave bitcoin for doge. That man will not accept bitcoin for anything, his mission is doge.After he stopped payment for bitcoin, bitcoin still later increased and got to all-time-high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 18, 2023, 02:35:48 PM",
      "body": "Quote from: Oshosondy on September 18, 2023, 01:01:03 PMBitcoin does not need Elon Musk. He should fuck off. Elon Musk only manipulated for people to leave bitcoin for doge. That man will not accept bitcoin for anything, his mission is doge.After he stopped payment for bitcoin, bitcoin still later increased and got to all-time-high.What about Tesla? I do not like Elon because of his unpredictable nature, and he has made positive and negative statements in the past about bitcoin. I do not like any meme projects as well, but a car company like Tesla can be at the forefront of the bitcoin market in the future. They have a large user base and resources to accept bitcoin for their online payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "September 18, 2023, 02:43:24 PM",
      "body": "Quote from: Oshosondy on September 18, 2023, 01:01:03 PMBitcoin does not need Elon Musk. He should fuck off. Elon Musk only manipulated for people to leave bitcoin for doge. That man will not accept bitcoin for anything, his mission is doge.After he stopped payment for bitcoin, bitcoin still later increased and got to all-time-high.I share the viewpoint that Elon Musk's involvement in crypto industry didn't make any substantial contribution for promotion and adoption of Bitcoin, instead, it seems he leveraged both popularity of Bitcoin and his own influential position to manipulate the price of Bitcoin for his personnel gains. However, the idea of using clean energy in Bitcoin mining is a promising development that aims to reduce the environmental impact of cryptocurrencies mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "September 18, 2023, 02:45:02 PM",
      "body": "When you want to talk about criticism toward Bitcoin, you need to deal with it by visiting this thread Knowledge to help you argue with bitcoin critics Bitcoin mining do consume energy, but it's not big and they already use clean energy. Just close your eyes when institutional entity or someone that self pro claimed to be Bitcoin specialist talk about this particular thing. They're trying to destroy Bitcoin, if they talk about mining consuming energy, money laundering, bubble/tulip mania, etc, they're uneducated people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "September 18, 2023, 03:19:28 PM",
      "body": "Even without this report I already thought it was obvious BTC is a positive, because it can work anywhere.  Power under transmission actually suffers quite severe losses, the big point to the idea of green energy that stops it being a working proposal is the infrastructure to transmit that power from remote areas to cities does not really exist in bulk.  It will take a decade maybe several to put in all the power infrastructure required to get power from hydro power turbines on dams all the way to cities.   Ideally they can do some work today but the excess and waste is something Bitcoin can use right now, ironically its a positive work is locally able to use up that power and monetize it into a transmittable bits of value usable & reusable across the world by those working digitally.  Its always been a positive of BTC, people couldn't see it.  China threw out BTC because it opposes free currency outside communism, they don't want free competition like that and we shouldn't be surprised.  China did benefit from BTC because just like USA or similar giant sized countries with epic mountain ranges, hydro power comes from vast remote areas not near the coastal city centres; theres a natural gap and BTC helps bridge this distance without requiring ten years of building they can do it today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 18, 2023, 03:43:33 PM",
      "body": "Quote from: Oshosondy on September 18, 2023, 01:01:03 PMIn 2019 report: Study: Over 74% of Bitcoin Mining is Powered by Renewable EnergyIn 2020 report: Report: 76% crypto miners use renewables as part of their energy mix2022 report: the Bitcoin mining network uses approximately 0.05% of the total energy consumed globallyQuote from: DVlog on September 18, 2023, 12:45:37 PMElon and Tesla were at the forefront of this criticism. Despite this, Tesla held bitcoin but sold it to the market later on. This news will have a positive impact throughout the industry, and companies like Tesla are likely to come to the market again as, as Elon previously mentioned, Tesla will accept bitcoin when miners reach the 50% clean energy mark. This will be a major boost for the bitcoin industry.Bitcoin does not need Elon Musk. He should fuck off. Elon Musk only manipulated for people to leave bitcoin for doge. That man will not accept bitcoin for anything, his mission is doge.After he stopped payment for bitcoin, bitcoin still later increased and got to all-time-high.It's true, and I agree with what you said, dude. Elon Musk has nothing to do with raising the price of Bitcoin. He can have a positive impact, but not to the point where Bitcoin will be 100k each. Then another strategy of Elon Musk so that he can get a huge profit is always targeting the meme coins. Even though those coins are still shit, he knows that the market value will kick in.Although he also holds Bitcoins, it is not insignificant that he holds more Dogecoin and Shiba Inu for sure; we just don't know if he is also planning to promote meme coins that are currently sleeping giants in the market.But anyway, let's see and wait for the step he will take in that matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "September 18, 2023, 03:51:51 PM",
      "body": "Cars and industries are leading causes of the environmental hazards in the world today yet we still use cars and definitely use products made from industries in our day to day lives and we believe that Bitcoin mining all of a sudden is our main problem?Bitcoin mining should not be the big headache to the world in terms of environmental issues although I encourage any alternative cleaner source of energy but Tesla not trying to contribute to the solution is cowardly seeing that they produce electric vehicles, it should be a collective effort because Bitcoin is for everyone and everyone would benefit from it's global adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "September 18, 2023, 03:54:57 PM",
      "body": "Quote from: DVlog on September 18, 2023, 12:45:37 PMOne of the biggest criticisms of bitcoin was its carbon emissions and its environmental impact. Elon and Tesla were at the forefront of this criticism. Despite this, Tesla held bitcoin but sold it to the market later on. This news will have a positive impact throughout the industry, and companies like Tesla are likely to come to the market again as, as Elon previously mentioned, Tesla will accept bitcoin when miners reach the 50% clean energy mark. This will be a major boost for the bitcoin industry. Institutional investors are mostly concerned about the environmental impact of bitcoin mining. This opens a path for institutional investors to come onboard.Everyday Elon wakes up and think what chaos can I cause in the cryptocurrency space. Well, gone are the days when his opinion on Bitcoin holds any water. Right now nobody gives two fucks about it. We in grown beyond his manipulation. There's already so much data on miners using solar energy, wind turbine, hydropower and other renewable sources of energy for mining and the impact on the environment is close to zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 18, 2023, 05:04:33 PMLast edit: September 18, 2023, 05:15:37 PM by franky1",
      "body": "elon loves DOGE(or thats what he wants the public to see)funny part is doge is hobby mined by residents which means miners have no electric source controlbitcoin is majority asic farmed, in locations specifically chosen for the electricity source.in short, bitcoin has always been cleaner than doge even before elon made his erroneous comments",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "September 18, 2023, 05:29:02 PM",
      "body": "Quote from: Oshosondy on September 18, 2023, 01:01:03 PMIn 2019 report: Study: Over 74% of Bitcoin Mining is Powered by Renewable EnergyIn 2020 report: Report: 76% crypto miners use renewables as part of their energy mix2022 report: the Bitcoin mining network uses approximately 0.05% of the total energy consumed globallyBitcoin Mining Council has many reports.Bitcoincleanup.comEnd the energy fud against BitcoinCambridge Bitcoin Electricity Consumption Index. Greenhouse gas emission.Quote from: Oshosondy on September 18, 2023, 01:01:03 PMElon Musk only manipulated for people to leave bitcoin for doge. That man will not accept bitcoin for anything, his mission is doge.After he stopped payment for bitcoin, bitcoin still later increased and got to all-time-high.Elon Musk knows Dogecoin has smaller marketcap than Bitcoin. It is more centralized than Bitcoin so it more sensitively to be manipulated if he holds enough Dogecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "September 18, 2023, 05:33:54 PM",
      "body": "Quote from: DVlog on September 18, 2023, 02:35:48 PM I do not like Elon because of his unpredictable nature, and he has made positive and negative statements in the past about bitcoin. I do not like any meme projects as well, but a car company like Tesla can be at the forefront of the bitcoin market in the future. They have a large user base and resources to accept bitcoin for their online payments. I don't like Elon Musk either, but that unpredictableness that he possesses could actually make or break Bitcoin and he has done this several times.But if we ask around if we still need Elon in our corner, I would say yes because his companies can complement what crypto is all about for example, SpaceX could easily adopt BTC as a currency for the future, or maybe make it possible for users to make subscriptions on X via btc ....the possibilities are just endless... Quote from: Oshosondy on September 18, 2023, 01:01:03 PMIn 2019 report: Study: Over 74% of Bitcoin Mining is Powered by Renewable EnergyIn 2020 report: Report: 76% crypto miners use renewables as part of their energy mix2022 report: the Bitcoin mining network uses approximately 0.05% of the total energy consumed globallyThese numbers are way above average  , and am wondering why Musk went on a rampage citing several reasons why he was disowning Bitcoin and went on with dropping it from its accepted modes of payment for his Tesla EVS & not forgetting the carbon footprint that comes from Bitcoin mining.With the numbers looking green does this mean MUsk will be back with his crypto rants to push the market price up as he did when he did some damage during his time of attacking miners...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 18, 2023, 05:37:48 PM",
      "body": "Quote from: BIT-BENDER on September 18, 2023, 03:51:51 PMCars and industries are leading causes of the environmental hazards in the world today yet we still use cars and definitely use products made from industries in our day to day lives and we believe that Bitcoin mining all of a sudden is our main problem?Bitcoin mining should not be the big headache to the world in terms of environmental issues although I encourage any alternative cleaner source of energy but Tesla not trying to contribute to the solution is cowardly seeing that they produce electric vehicles, it should be a collective effort because Bitcoin is for everyone and everyone would benefit from it's global adoption.i believe, this dilemma has been highlighted by media. so they are just focusing on its negative impact to the surroundings. when in fact, there are so many industries that have more environmental concerns than this btc mining.for sure, even if you show the stats, these media people won't acknowledge the truth. and do remember, media is one source of getting info by most people. not many are doing their job to learn the truth about such info.well, a lot of crypto mining farms have the goal of using clean energy. so don't know if these people will still blame this type of mining later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 18, 2023, 06:15:02 PM",
      "body": "Quote from: DVlog on September 18, 2023, 02:35:48 PMQuote from: Oshosondy on September 18, 2023, 01:01:03 PMBitcoin does not need Elon Musk. He should fuck off. Elon Musk only manipulated for people to leave bitcoin for doge. That man will not accept bitcoin for anything, his mission is doge.After he stopped payment for bitcoin, bitcoin still later increased and got to all-time-high.What about Tesla? I do not like Elon because of his unpredictable nature, and he has made positive and negative statements in the past about bitcoin. I do not like any meme projects as well, but a car company like Tesla can be at the forefront of the bitcoin market in the future. They have a large user base and resources to accept bitcoin for their online payments. We can't underestimate the Tesla and the users who use the Tesla cars but if the owner of the company is against Bitcoin then we should not expect anything good from a person like Elon Musk. His main hobby is to promote doge and earn huge amount of returns from his holdings and that's it. He isn't interested in Bitcoin anymore and that's why even if all Bitcoin miners use clean energy he will find another excuse to reject Bitcoin and support that meme coin Doge. I know that there are so many users who basically are using Tesla cars and they can be very useful for Bitcoin if Elon adds it as a payment method, but even if he doesn't add it the Bitcoin won't get impacted at all. He loves Doge a lot that one day he may invest a lot of money into it to pump its price, and I'm sure he has such plans that he will execute during this bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 18, 2023, 06:18:17 PM",
      "body": "The criticism directed at Bitcoin is mostly for creating FUD and influencing speculators, so what is important is that this news that talks about 30%, 50%, or even 99% will not change the nature of mining or the price of Bitcoin.For more than 5 years, I have been hearing about China’s ban on Bitcoin, including John McAfee, and now FUD has become clean energy. During this time, you will find positive or negative articles, many of which may be true or misleading, depending on who wants to move the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "September 18, 2023, 06:18:21 PM",
      "body": "Quote from: DVlog on September 18, 2023, 12:45:37 PMQuoteBitcoin Mining and Clean Energy: Bloomberg Intelligence reported Bitcoin miners now meet the 50% clean energy threshold. Jamie Coutts shared the latest on X (formerly Twitter), saying, “The Bitcoin energy narrative is flipping! A new note out this morning on the Bloomberg Terminal looks at the rapid rise of sustainable energy sources in BTC mining.” In 2021, Elon Musk announced that Tesla (TLSA) would resume accepting BTC when miners reach the 50% clean energy threshold.Genesis Ceases Crypto Trading Services: On Thursday, news hit the wires of Genesis halting crypto trading services permanently. Genesis previously announced the end of spot trading by September 30. Derivatives trading services will cease immediately.SEC v Stoner Cats 2 Draws Condemnation: Stoner Cats 2 LLC became the latest victim of the SEC onslaught on the US digital asset space. The SEC announced charges against Stoner Cats 2 LLC for conducting an unregistered offering of crypto asset securities in the form of NFTs that raised $8 million to fund Stoner Cats, an animated web series. Ripple CLO Stuart Alderoty called out the SEC move. SEC Commissioners Hester Peirce and Mark Uyeda dissented.Deutsche Bank Enters the Crypto Space in Earnest: German banking giant Deutsche Bank (DB) and Taurus SA announced a partnership to offer crypto and tokenized asset custody services to institutional clients. Deutsche Bank Global Head of Securities Services Paul Maley reportedly said, “As the digital asset space is expected to encompass trillions of dollars of assets, it’s bound to be seen as one of the priorities for investors and corporations alike.Source: https://www.nasdaq.com/articles/crypto-news:-clean-energy-bitcoin-mining-threshold-puts-elon-musk-and-tesla-in-focusOne of the biggest criticisms of bitcoin was its carbon emissions and its environmental impact. Elon and Tesla were at the forefront of this criticism. Despite this, Tesla held bitcoin but sold it to the market later on. This news will have a positive impact throughout the industry, and companies like Tesla are likely to come to the market again as, as Elon previously mentioned, Tesla will accept bitcoin when miners reach the 50% clean energy mark. This will be a major boost for the bitcoin industry. Institutional investors are mostly concerned about the environmental impact of bitcoin mining. This opens a path for institutional investors to come onboard.It's a bit of an illusion really and not one that most governments are going to fall for in terms of calling bitcoin \"clean\". The real calculation is whether Bitcoin is comparatively clean when being utilized in calculating sums in order to get \"rewards\" for a small group of people versus other potential uses of that energy. Would it be better if the energy from a hydroelectric dam is used to power 50,000 homes than a server farm mining bitcoin for the benefit of one person or company? The general public would definitely vote for the former over the latter if it was displayed in this way. If it energy costs ever shoot back up again, these sort of calculations will again be under the microscope and governments will not hesitate to ban this sort of energy usage, they will frame it as wasteful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "September 18, 2023, 06:33:28 PM",
      "body": "Quote from: hugeblack on September 18, 2023, 06:18:17 PMThe criticism directed at Bitcoin is mostly for creating FUD and influencing speculators, so what is important is that this news that talks about 30%, 50%, or even 99% will not change the nature of mining or the price of Bitcoin.For more than 5 years, I have been hearing about China’s ban on Bitcoin, including John McAfee, and now FUD has become clean energy. During this time, you will find positive or negative articles, many of which may be true or misleading, depending on who wants to move the price.I feel like Musk is very close to McAfee in the way he's hyping people and then backing out of it. Just to compare: Musk said Tesla would be accepting bitcoin, then quickly stopped accepting it when Musk got his profits from selling some of his coins, then claimed it was due to lack of green energy mining and that Tesla would accept it again if it becomes 50% green. I'm willing to bet he's not going to accept it anyway, despite bitcoin reaching 50% renewable energy, just like McAfee did not eat his dick on live TV.Musk is great at making false promises. His former wives and girlfriends have something to say about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 18, 2023, 07:09:29 PM",
      "body": "Quote from: hugeblack on September 18, 2023, 06:18:17 PMThe criticism directed at Bitcoin is mostly for creating FUD and influencing speculators, so what is important is that this news that talks about 30%, 50%, or even 99% will not change the nature of mining or the price of Bitcoin.For more than 5 years, I have been hearing about China’s ban on Bitcoin, including John McAfee, and now FUD has become clean energy. During this time, you will find positive or negative articles, many of which may be true or misleading, depending on who wants to move the price.They have used several topics to spread FUD, but institutional investors are often subject to environmental, governance, and social mandates that force them to invest in sustainable sectors. Their main criticism was bitcoin mining and its carbon emissions. Now that miners are shifting to renewable energy sources to mine bitcoin, this institution can invest in bitcoin without any obligation from society.Bitcoin mining can boost the development of the renewable energy sector as well by increasing its demand throughout the bitcoin mining sector.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "September 19, 2023, 12:30:12 AM",
      "body": "Quote from: hugeblack on September 18, 2023, 06:18:17 PMThe criticism directed at Bitcoin is mostly for creating FUD and influencing speculators, so what is important is that this news that talks about 30%, 50%, or even 99% will not change the nature of mining or the price of Bitcoin.Clean or not clean, in fact Bitcoin mining not completely clean but still cleaner and more sustainable than many industries, profit for Bitcoin miners and price of Bitcoin will depend on cost to mine each bitcoin by miners, supply and demand. It is for long term price but market is affected by liquidations on exchanges too. So weak downs or strong spikes are artificial prices by manipulations and liquidations. When Bitcoin is in stable price range, it is more accurately reflect its value.Realized price is an interesting chart for investors with long term investment plans but of course it does not reflect initial cost of miners to mine each bitcoin.QuoteFor more than 5 years, I have been hearing about China’s ban on Bitcoin, including John McAfee, and now FUD has become clean energy. During this time, you will find positive or negative articles, many of which may be true or misleading, depending on who wants to move the price.They did not fud other industries that have lower sustainable energy consumption but only aimed at Bitcoin mining and FUD it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 19, 2023, 12:50:32 AM",
      "body": "Bitcoin switching towards renewable energies may be inevitable in the end, don't you all think?There have been jurisdictions which have Bitcoin mining, unless it is done using renewable energies and in general, as the world pushes towards replacing oil and gas as our main source of energy, then so also will Bitcoin.If a miner is connected to the grid and the grid is owner by a government who is ecologically conscious, then the miner may get into green energy without even noticing. (Hopefully they may not notice through an increase on their electricity bills an drop on profitability).Also, it is interesting to point out that since the most developed countries are the ones first trying to replace fossil fuels, then miners who can afford to may move to developing countries where fossil energy would become cheaper, thanks to the decrease on global demand.Let us see what happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}