{
  "id": "topic_5445727",
  "title": "pingu39",
  "author": "pingu39",
  "created_time": "March 20, 2023, 09:24:25 PM",
  "content": "The future of Web3 is being built in Belgrade.With 1.5M citizens and 50+ web3 companies in the vibrant, ever-growing community, Belgrade is definitely one of the Web3 capitals of the world. Some of the biggest names like Polygon, Tenderly, DeFi Saver and more were established and are still being developed in Belgrade.And time has come for Belgrade to get it's own blockchain week.Belgrade Blockchain Week is a week-long in-person gathering of the greatest Web3 minds and professionals. It features independent events organized by top-tier companies and communities throughout the week along with official conference: ETH Belgrade.Main eventConference2-4 June, 2023An official conference of the Belgrade Blockchain Week and the CEE region's premier ETH conference dedicated to the Ethereum and the Ethereum ecosystem.Hackathon5-6 June, 2023An official hackathon of the Belgrade Blockchain Week and the ETH Belgrade conference.ETH Belgrade Website:https://ethbelgrade.rs/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445727",
  "comments": [
    {
      "author": "Framelover",
      "created_time": "April 29, 2023, 12:50:49 PM",
      "body": "Belgrade is a burgeoning hub for Web3 companies and is hosting its own Blockchain Week, which includes an official conference called ETH Belgrade from June 2-4, 2023, and a hackathon from June 5-6, 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "May 09, 2023, 06:07:30 AM",
      "body": "Yes, it's great news to finally have a credible event in the region!I will be present for the whole week in Beograd, I look forward to seeing you all there.I'm looking forward to hearing the views and discussing the recent hack on ETH with Michelle Wu. I just think it's a shame to sell tickets for ETH Belgrade at that price, 250 euros is a fortune in Serbia and neighbouring countries, and it's clearly a shame to sell them at that price considering the speakers expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}