{
  "id": "topic_5453041",
  "title": "Marcellin9",
  "author": "Marcellin9",
  "created_time": "May 17, 2023, 07:52:20 AM",
  "content": "In my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. Personally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453041",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 17, 2023, 09:29:52 AM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMIn my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. Personally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.Where are you from? Because most of countries are currently at tightening stage fallowing US in increasing interest rates.In my country (poland) the Monetary Policy Council set the interest rate at 6.75% in October 2022 and there is no indication that they will lower it. On the contrary, with inflation at 15%, it would be useful to raise it even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 17, 2023, 10:32:20 AM",
      "body": "Is it possible that the interest rates are declining and the real estate sector is collapsing at the same time?I don't believe that having affordable mortgages would have any negative impact over the real estate sector.The fiscal and monetary policies of many governments around the world tend to be less and less effective. Financial discretion done by the government seems more like a mistake nowadays. The right thing to do is to cut more government spending and put the national budget deficit under control.I don't know where do you live. The situation is my country is difficult as well, but the real estate sector is still in good shape and the inflation levels are slowly declining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 17, 2023, 10:44:51 AM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMWhat is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.After the recent economic crisis and inflation, we are facing the same thing here. The worst thing in this country is once something's price goes up, it will never go down. So the poor will always suffer no matter what. The government ain't taking any action to resolve this problem. I think this country will go bankrupt soon. We are short on electricity supply and the debt to Singapore is over $300 million. In 2-3 weeks we will face power loss all over the country. I don't know in which direction is this country going.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 17, 2023, 10:52:53 AM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMPersonally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.I don't really think you knows the purpose of your investment, how do you think and see cryptocurrency investment or do you take it to be a ponzi scheme or quick get rich scheme where you invest some certain amount and get back some folds?As I usually say to any around me cryptocurrency investment doesn't require impatient people or investors, you must know the kind of invest you wants to venture into be it short term or long time at least they both required 5 months to 1 year patient before you could start witnessing the bull trend otherwise investing today and expecting to start seeing the bull sign is a very wrong mentality, so change your perspectives towards cryptocurrency investment and exercise patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "May 17, 2023, 11:07:37 AM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMIn my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. How does boasting about the economy work? Is it just by setting up a few policies to increase the tax rate, interest rate, etc.? Has this method actually worked in moving a country with a shite economy to one with a very stable economy?To me, I believe the economy of a country is highly influenced by the creation of job opportunities for its citizens, which will reduce poverty in that country since poverty can't be completely eradicated.If you set up a friendly policy that will attract foreign investors to the countryside, there will be more job creation. And countries should also normalize using their own products and not be fully dependent on imported products; this alone increases the country's high demand for foreign currency and reduces its own local currency value, which is one way of telling people that the country is not in economic balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 17, 2023, 11:13:30 AM",
      "body": "There are many factors that can impact your investment in the crypto currency but not the one you are describing here. For example in you analysis there would be two important points to discuss. The first one is there is no direct impact of your government and their policies on the local currency in respect to the recession. It won't affect on the larger scale. It may affect it minds of local investors but it wont have huge effect on the crypto currencies. What can impact it on global scale is something getting implemented in the USA which is not in the favor of crypto. I barely doubt, your nation's government will have such large scale impact. You may be surprised that your investments in the crypto gone up positively even in the recession and that's because they are free style (decentralized). They have hundreds of other factors on which they depend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "May 17, 2023, 11:31:41 AM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMIn my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. It is really worrying if the value and price of Real Estate in your area collapses at this time, because assets such as Real Estate that are there should not experience a collapse in price so that Real Estate investors can be helped a little by the global economic recession. But if the government there is still carrying out policies to stimulate the people's economy, I don't think you need to experience an excessive dilemma because the government is still quite concerned about the economic problems of its own country.QuotePersonally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.The situation and conditions where I live are still quite safe in terms of the economy, because everyone can still work in their respective fields while continuing to invest and save to keep themselves alive safely and peacefully and not experience difficulties. And for the prices of necessities or asset prices such as real estate, they also did not experience a collapse so that conditions remained as usual and did not experience any disturbance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "May 17, 2023, 11:35:18 AM",
      "body": "The world is moving to a digital economy, gone are the days we all hoped completely on natural resources to survive. The government capitalized on those resources such that citizen didn't profit much from the gift of nature. I see us in a world where our natural resources are now implanted in the brain of everyone. People should come up with ideas that'll change their finance and boost personal economy. If you must spend the money at hand, do it wisely. Money works in different ways, you can invest the funds on affiliate marketing if you need faster returns, that's if you're excellent with Ads. Keeping the money in the bank doesn't add up, sometimes I see it as a waste of time. It's better you use the money to promote a profitable product.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "May 17, 2023, 12:14:30 PM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMIn my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. Personally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.All countries are now in a difficult economic situation (just in some countries the economy is suffering a complete collapse, while in others there is a gradual deterioration in the economic situation).  This is due to the transformation of the economic structure of the world economy.  There is a global transition from the industrial way to the information one.  At the same time, the elites of many countries are striving to slow down this transition, using social models of the 20th, 19th and 17th centuries for this.  As a result, there will be more and more wars, economic crises and man-made disasters in the world.  It looks like we have entered a period of global social turbulence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 17, 2023, 01:09:11 PM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMIn my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. Not in all places that real estate is collapsing. There are certain areas where these properties are going down but not for all. I still see in some of the areas that have been skyrocketing. Yes, this is true and I don't understand why it's like that. Maybe all about these capitalists that have been predicting the prices.But I'd still believe that real estate is no doubt one of the best investments. So, if it's collapsing where you are right now and you've got piles of cash ready for investments then you may take some of those lands and houses.Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMPersonally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.What cryptos did you invest? If it's with Bitcoin, there is no doubt that you'll take profit soon but you need to be patient. In my observation to most economies right now, the first world countries are still fine, the same goes with second world countries but some of them are experiencing hard inflation.And for the developing countries, it's known that many of them are still struggling due to the incidents that's happening globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "May 17, 2023, 01:25:56 PM",
      "body": "Quote from: tjtonmoy on May 17, 2023, 10:44:51 AMQuote from: Marcellin9 on May 17, 2023, 07:52:20 AMWhat is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.After the recent economic crisis and inflation, we are facing the same thing here. The worst thing in this country is once something's price goes up, it will never go down. So the poor will always suffer no matter what. The government ain't taking any action to resolve this problem. I think this country will go bankrupt soon. We are short on electricity supply and the debt to Singapore is over $300 million. In 2-3 weeks we will face power loss all over the country. I don't know in which direction is this country going. Commodity prices rise and never fall, even when inflation and interest rates fall. That has become a cultural feature in my country for a long time, nothing new  . I think the reason is that the financial authorities have loosened their management and have not done well in regulating prices in the market, from which mercians have colluded with each other to profit. The situation in my country is not as bad as what you describe, but things are also suffocating the lives of the poor, and government policies have never been implemented for the poor. These are all just empty promises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "May 17, 2023, 01:31:42 PM",
      "body": "In all honesty, I really don't know anymore. Things are just getting more and more complicated worldwide and even more so here in my country. The prices for services, other necessities and other needs are steadily increasing while the people's wages never increases and for those that did increase, it didn't even increase that much. Even I am already getting confused with all the diversifying that I do with my investments. Since the ones that I thought that wouldn't be affected that much are already being affected massively by the economic changes not just in my country but with other countries as well. Although at some point, I already expected something like this to happen in the future back then but not to this extent.Seriously, I don't even have the energy to start pointing fingers as to whose fault all of these are. I'd rather just focus on rearranging my investment strategies and portfolios to at least be able to protect my family's future. sigh. . .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 17, 2023, 01:37:58 PM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AM[....]Under the backdrop of the global economic recession, no government will be able to outperform others easily.I'm seeing some realignments for political and economics reasons. I don't know where you are from but if your Government is in active discussions with leading organizations in the Middle East and Asia then your country will probably reap the benefits in the years to come. This is under the assumption that there would be no more wars involving the current superpowers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "May 17, 2023, 04:16:09 PM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMIn my country over the past few months, the interest rates have been declining. Our government aims to stimulate the economy through a set of financial policies but there seems to be less effective than before. Under the backdrop of the global economic recession, no government will be able to outperform others easily. The dilemma we are facing now is that we are actually losing whether to spend the few money we have at hands or to save it in banks for less and less interest. Real estate is collapsing and even the rich people have no options to invest. Personally I have invested in cryptocurrencies but due to the current market, there is no sign that I will profit any time soon, so I guess the result of the investment remains unknown. Although I still have steady income from my job, uncertainties will not diminish as I hope for a stable feed for my family and for savings as much as possible. What is your situation in your country ? Are you going to experience some economic turmoil as well ? Please let me know.During the economic recession, it is a common practice of governments to take range of measures aimed at stimulating the economy. One of these measures often includes lowering interest rates. However, the desired results of such measure often takes long time to materialize, addressing as economic challenges requires consistency and patience.It is true that crypto space is undergoing rapid technological advancement, making it attractive investment opportunity. However, it is important to keep in mind the risk of its significant volatility before taking any investment decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "May 17, 2023, 04:26:20 PM",
      "body": "Still the same, as inflation affects the prices of goods in the market the salary of an average person still remains at bare minimum. Sadly our current president couldn't even handle the situation that the economy facing right now. Since the citizen of the country couldn't manipulate it's prices if the supply and demand affect the market. Mostly of the people are just surviving to the current status of the economy it's like they save $5 dollars per month if we minus the bills and needs. Hopefully i nthe future we could see some changes made by the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "May 17, 2023, 04:45:39 PM",
      "body": "Nothing different here mate. My country is struggling as well. But what turns matters worst is the high level of corruption in my country. The pandemic permanently closed a lot of our businesses here and I also lost all my source of income. I have investments in our local stock market but it turned into a nightmare with some stocks performing worse than crypto's altcoin market in a bear season.Despite all of these trials, we need to strive harder than ever. I am actually looking forward to crypto's bull run next year and 2025 as my biggest hope of recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 17, 2023, 05:00:18 PM",
      "body": "Quote from: Marcellin9 on May 17, 2023, 07:52:20 AMReal estate is collapsing and even the rich people have no options to invest. If someone can think of an investment plan in the middle of a recession, it means that he is able to maintain a stable financial condition, while in the midst of a \"collapse\" the real estate business is a good investment opportunity to start in that sector. Why \"no choice\"? Unless you state where you're from, some countries are simply not suitable for real estate business in various global economic situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "May 17, 2023, 05:52:40 PM",
      "body": "Quote from: davis196 on May 17, 2023, 10:32:20 AMIs it possible that the interest rates are declining and the real estate sector is collapsing at the same time?I don't believe that having affordable mortgages would have any negative impact over the real estate sector.The fiscal and monetary policies of many governments around the world tend to be less and less effective. Financial discretion done by the government seems more like a mistake nowadays. The right thing to do is to cut more government spending and put the national budget deficit under control.I don't know where do you live. The situation is my country is difficult as well, but the real estate sector is still in good shape and the inflation levels are slowly declining. That seems to be the case in a couple of countries one of which is China. A lot of real estate owners out there are getting their properties foreclosed and repossessed by banks due to defaulting on loans. With interest rates rising everywhere, I'm lead to think that the global economy is definitely going to shitter by the day. It's not helping that the Global Currency Standard, the USD, is also having its own problems due to their lenience and overprinting back in the days of COVID finally coming back to bite their asses, which will definitely cause some sort of domino effect to countries that are allied or connected somehow to US. In any case, perhaps we'll just have to brace ourselves this time while we plummet to the ground.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 17, 2023, 05:58:01 PM",
      "body": "The harsh economic situation is not being experienced in just one part of the world; I think that almost all parts of the world are facing the same issues: dedollarization, high interest rates, and inflation leading to greedflation and shrinkflation. A lot is really happening, and one thing to do is to keep readjusting to the changes so as not to be too depressed by the kind of situation that some people are already facing. The economic situation is very bad in some countries. If one has one source of income, look for a side hustle to support yourself if your income is not really enough to handle a good number of your bills. Also, it's not really now that people should just be stacking their money in the bank because of devaluation, which will still reduce the purchasing power of that money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}