{
  "id": "topic_5456160",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "June 12, 2023, 06:08:42 PM",
  "content": "President Tinubu Signs Student Loan Bill Into .This bill is a welcoming develop as we use to hear about such only in Western countries and a very few African countries, and am convince that some many other African countries would be influenced to follow this same road map as a way to encourage those with passion for education but doesn't have sponsor to go to school. Quote“The education system is to change. We would overhaul it and tinker with some areas with the philosophy that no one would be left behind. There will be student loans for all. We are going to reform the Almajiri system, We are equally going to build more schools, recruit more teachers and train them,”  https://www.facebook.com/groups/1439702759499956/permalink/2693479117455641/On the other hand, it shouldn't just be like one of those other many bills we have had in the past that is dormant and being swept under the carpet without it effect being felt by those the bill is intended for. Let there be available and easy means as to any students that's interested and in need of such educational loan to fund his education and there should be made a working means of punishment or consequences to any bank that may want to deny any student that have passed through the appropriate corridors necessary to be eligible for such loan. Cause from what we have all seen in the past, it's not about signing in bills into law but promulgating it to meet the purpose for which it was made to exist.What's your take on this development?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456160",
  "comments": [
    {
      "author": "Asiska02",
      "created_time": "June 12, 2023, 06:44:45 PM",
      "body": "It is a very welcome development but I still feel they signed the right bill at the wrong time. Instead the issue of massive unemployment should be tackled first before initiating this. What’s the essence of finishing the school with the loan taken without a means of paying back after school? Does that makes sense?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 12, 2023, 09:21:39 PMLast edit: June 13, 2023, 08:27:25 AM by Charles-Tim",
      "body": "Quote from: Asiska02 on June 12, 2023, 06:44:45 PMWhat’s the essence of finishing the school with the loan taken without a means of paying back after school? Does that makes sense?The loan will be paid back after the person is employed. If what I watched about it is true, the loan payment will be spread over years, probably in a way that will be convenient for the borrower. I agree about the issue of unemployment. But it is good to have education than to remain illiterates.  If we are not literates, we will not be on this forum to engage in world discussion about bitcoin and cryptocurrencies in general. Also in making money, there are many Nigerians that do not rely on government and private jobs today. Online jobs in Nigeria have increased and education helps too. So, student loan for students is better than nothing at all.What I see about this is if the federal government will continue this, because inflation persistent in Nigeria and naira do devalues. In short, what I am implying is that the amount of naira borrow will be higher in value than the amount that will later be paid because of inflation and naira devaluation. But implementing it is very good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 12, 2023, 10:00:53 PM",
      "body": "Quote from: letteredhub on June 12, 2023, 06:08:42 PMWhat's your take on this development?It’s a welcome development seriously, this seems more like a better initiative than free school policy because with this you have an entitlement or obligation and not just going to school without putting in effort to get good grades or graduate just because it is free. With it being a loan the government will definitely have to take responsibility of finding job for the citizens they are fully aware that it is the only way to pay back. My biggest fear now it is execution because almost everything in Nigeria even those meant for the less privilege are most at times hijacked by the higher class or they would request for tip off before granting them the law. So I think the government shouldn’t just set up a central office just yet. The approval should come from each school. When a student can’t get funds to register for a session then the school should be in a position to grant him that loan. This will maybe reduce the number of student that could request for this loan and probably not still in academic year either through graduations or have been expelled out of the school.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iadegbola34",
      "created_time": "June 13, 2023, 06:39:37 AM",
      "body": "It is a very welcome development. My only concern is how they intend to put it into implementation knowing that many such other development has been exploited in the past to the detriment of the masses. Again, government do not have enough data about its citizenry to enforce the repayment plan, if at all they get the implementation right. How do they intend to collect the money back from a graduate who is now working in the private sector and remotely? How will they know that the person now actually has a job that can pay back the loan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "June 13, 2023, 06:53:14 AM",
      "body": "Quote from: Charles-Tim on June 12, 2023, 09:21:39 PMQuote from: Asiska02 on June 12, 2023, 06:44:45 PMWhat’s the essence of finishing the school with the loan taken without a means of paying back after school? Does that makes sense?The loan will be paid back after the person is employed. If what I watched about it is true, the loan payment will be spread over years, probably in a way that will be convenient for the borrower. I’m not sure about the employment status before the person can pay back the loan but the repayment of the loan will commence two years after NYSC. I just hope employment is readily available for such graduates within the two years after NYSC, so that they can pay back on time and the process remains swift for the betterment of all Nigerian students.Quote from: Zaguru12 on June 12, 2023, 10:00:53 PMMy biggest fear now it is execution because almost everything in Nigeria even those meant for the less privilege are most at times hijacked by the higher class or they would request for tip off before granting them the law. So I think the government shouldn’t just set up a central office just yet. The approval should come from each school. When a student can’t get funds to register for a session then the school should be in a position to grant him that loan. This will maybe reduce the number of student that could request for this loan and probably not still in academic year either through graduations or have been expelled out of the school. Before the bill was being passed it must have a passed a lot of scrutiny by top officials and the president  is already briefed and aware of how it will be executed, I hope the process doesn’t favour the elites only. Part of the process of acquiring the loan is that the student must not have being convicted for any drug related offences, not engaged in dishonesty or fraud, not caught engaging in examinations malpractices in school or in the past, also if they or the parents have not defaulted in any loan in the past. If this process is followed strictly, then we’ll get some level of transparency in the whole process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "June 13, 2023, 06:55:31 AMLast edit: June 13, 2023, 09:58:53 PM by Mr. Big",
      "body": "Quote from: Iadegbola34 on June 13, 2023, 06:39:37 AMIt is a very welcome development. My only concern is how they intend to put it into implementation knowing that many such other development has been exploited in the past to the detriment of the masses. Again, government do not have enough data about its citizenry to enforce the repayment plan, if at all they get the implementation right. How do they intend to collect the money back from a graduate who is now working in the private sector and remotely? How will they know that the person now actually has a job that can pay back the loan?There are procedures and requirements to meet for one to access the loan, although to me the requirements are taskful  and difficult cause there are many indigent students struggling for themselves in school that don't have or know how to have access to these persons that are required to stand as sureties such as two guarantors: civil servants not less than level 12;  a lawyer with not less than 10 years call in to the bar, a judicial Officer or justice of peace. (All of these can be found in the reference link I provided). All these requirements alone is enough to discourage students from having a second thought on going to seek for such loan and just like in other laws signed the purpose may end up being defeated by the laid down procedures.Quote from: Charles-Tim on June 12, 2023, 09:21:39 PMQuote from: Asiska02 on June 12, 2023, 06:44:45 PMWhat’s the essence of finishing the school with the loan taken without a means of paying back after school? Does that makes sense?The loan will be paid back after the person is employed.A point to correct here mate. To be precise, It's not just about after the person is employed but rather the beneficiary is said to compulsorily start paying the loan two after NYSC. Knowing how hard it's hard these days to get a job in the country as a graduate, but then I ask what if the person hasn't gotten a job yet after the two years of NYSC what would be the fate of such a person?Only the reality of unemployment's in the country can discourage eligible sureties from standing for you as a student cause they are not sure you may be able to get a job or talk more of a good paying job to meet up with the loan after two years of the NYSC. Like there are so many issues to consider surrounding this student loan bill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "June 13, 2023, 08:42:32 AM",
      "body": "My concern for this new student loan bill is this; if upon failure to repay the loan within the stipulated date, the defaulter would be charged to court and would be fined #500k. The question we ask is, the someone who couldn't complete repayment of loan, would he/she be able to pay the loan fine of #500k? Will this not see more persons indebted and prosecuted upon failure?If and only if the economy of the country would be better upon graduation and completion of NYSC service, I e, a job is secured or a means to earn is sure, then this is the best bill yet that has been signed and worthy of accolades. But what has these universities and tertiary institutions board, have to say about this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 13, 2023, 09:13:25 AM",
      "body": "Quote from: Cryptomultiplier on June 13, 2023, 08:42:32 AMMy concern for this new student loan bill is this; if upon failure to repay the loan within the stipulated date, the defaulter would be charged to court and would be fined #500k. The question we ask is, the someone who couldn't complete repayment of loan, would he/she be able to pay the loan fine of #500k? If the person can not pay the fine, the person is liable to 2 years imprisonment. Or both. Which means the judgement will be based on how guilty the borrower is. Assuming if able to pay the loan and have enough money but just evading, that can result to fine and imprisonment, I guess. Quote from: Cryptomultiplier on June 13, 2023, 08:42:32 AMWill this not see more persons indebted and prosecuted upon failure?You can watch this news and an interview with one of the president strategy team: https://youtu.be/8RnIOSg2gW0Start watching from 4 minutes 30 seconds of the video. He talks about how the borrower would have been employed. We do not know yet how this would be, but the government won't be a wolve in sheep cloth about this. People that have knowledge about court cases will understand this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 13, 2023, 10:19:48 AM",
      "body": "I no understand why people dey so concerned about this loan bill, no be like say na by force to take the loan. I sure say the government don see how people do palmpay and other loan agencies so if them won put penalties for defaulters make them go ahead. Who know say the thing go hard am to repay go avoid taking the loan. E sure me say na means for politicians to tiff money be this…before the end of the year NTA go carry news say government don spend 20billion naira for student loans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "June 13, 2023, 01:12:41 PM",
      "body": "Quote from: letteredhub on June 13, 2023, 07:24:57 AMOnly the reality of unemployment's in the country can discourage eligible sureties from standing for you as a student cause they are not sure you may be able to get a job or talk more of a good paying job to meet up with the loan after two years of the NYSC. Like there are so many issues to consider surrounding this student loan bill. The unemployment is not the main issue but the fact that the benefactors may not want to pay and then blame it on unemployment or any other factors. Before taking loans one would have considered his/her plans in repaying the loan, we speak of unemployment often and some has this yardstick to quit school, using the popularly known tag School na scam but they later go into fraud because in the end no matter the unemployment rate being a degree holder is still better especially when opportunities arises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "June 13, 2023, 01:30:33 PM",
      "body": "Quote from: letteredhub on June 12, 2023, 06:08:42 PMWhat's your take on this development?We Nigerians are a special breed of humans. Any policy by the government is always greeted with skepticism. This is normal. One side of the argument is that education bank bill will create opportunities for Nigerians that are disadvantage to have access to school and have access to education so that no one is will say their parents didn't have money to send them to school or sponsor them so they will drop out of school. But then, my question to these folks is based on the requirement how will the poor and disadvantage have access guarantors \"Guarantors: Each applicant must provide a minimum of two guarantors. The guarantors must fall into one of the following categories: (i) Civil servants of at least level 12 in the service, (ii) Lawyers with a minimum of 10 years of post-call experience, (iii) Judicial officers, or (iv) Justices of the peace.\"Excuse me but if you can actually provide these guarantors then you can not be classified as a disadvantaged Nigerian. We keep watching to see the first beneficiaries and how it would work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 13, 2023, 02:49:00 PM",
      "body": "I also saw the circular and what first came to my mind is that if they can utilize well the subsidy removal scheme and effectively utilize the funds for the national building, things could have been well administered accordingly, because what the newly elect president said was that he didn't meet a budget on subsidy on ground which means they have been diverting these a long time ago to themselves in power, maybe this could be the first avenue to avoid and kicked against funds misappropriation in the country with the new regime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "June 13, 2023, 06:21:13 PM",
      "body": "Education is incredibly important, and nearly everyone aspires to obtain it. However, some people choose not to continue their education or even drop out of school because they are unable to pay their tuition during their entire time at the higher institution. Student loans, in my opinion, will undoubtedly assist persons with weak hands in their ability to further their education. But how some people will repay their loans once they graduate from school and take out loans to further their studies  that could be a challenge.With regard to the problem of not job opportunities everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "June 14, 2023, 12:40:31 AM",
      "body": "Quote from: letteredhub on June 12, 2023, 06:08:42 PMPresident Tinubu Signs Student Loan Bill Into .What's your take on this development?It is a wonderful idea and development but I doubt this is going to work effectively cuz the system is still corrupt. This is still only going to be accessed by “connections” with the high and mighty. The common man is only still going to suffer or only a few of the “common man” will be able to benefit. President ABT should focus more on fixing the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "June 14, 2023, 07:07:12 PM",
      "body": "Tinubu signing this is a welcome development but I'm more concerned about the process that you will undertake before getting the student loan, I hope you also looked or consider the process involved before we start congratulating president bola Ahmed tinubu because to me if you have the names or the number of persons that will shortee you before the loan will be given to you I don't think you'll be needing any help from anybody before going to school because they have the capacity to train you to any level. I think our president wants to catch the interest of the youth who he knows never supported his ambition of becoming the president that he is today. I know many of us will disagree with me here but we should also consider the method which other countries have used to assist not just students but all here citizens with the help of the credit card I doubt if the process of getting it will be as tedious as what we are seeing on the student loan in Nigeria today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 14, 2023, 08:23:06 PM",
      "body": "Quote from: Amphenomenon on June 13, 2023, 01:12:41 PMThe unemployment is not the main issue but the fact that the benefactors may not want to pay and then blame it on unemployment or any other factors. Before taking loans one would have considered his/her plans in repaying the loan, we speak of unemployment often and some has this yardstick to quit school, using the popularly known tag School na scam but they later go into fraud because in the end no matter the unemployment rate being a degree holder is still better especially when opportunities arises.President Bola Ahmed Tinubu's administration is just a few weeks old, of which for him to have brought up this idea of students loan, he has a plan for creating more jobs & employment to the already existing graduates & those that will be graduating with the help of the students loan, so as to enable them pay back the money to the federal government, because the truth of the fact is that each year people are retiring from work, people are dying and yet none is being employed to replace those vacant offices, but yet salaries are been disbursed by Federal government for monthly payments of both ghost & the real workers.So to me, the issue of this student loan is a welcome development, of which I look forward to seeing it been implemented without tribalism or religious difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 14, 2023, 08:41:07 PM",
      "body": "When I hear the news I dey laf dey. Any leader who understand students suffering I'm schools will not give loan to students and still give them condition of two year imprisonment. I don tok am social media say, students go collect di loan pay their school things and graduate and ready to serve the jail term and come back again. Because there will no money to pay back. How can you give such condition without job. It is not done in anywhere. Job first so dat has dem dey commont from school dem go work and pay back the loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 15, 2023, 11:45:48 PM",
      "body": "Omo I read this news begin laugh. So tey assu don put mouth for the matter say student go run from school if government continue with the loan say make government no try am. Me too come dey ask myself questions. Government no fit guarantee job employment for the society and e be say every year university dey graduate thousands of students wey no get  job for the society so tell me how them want to take meet up na?.Just as the previous poster says students will be ready to serve the jail terms come out and continue their life after all there is no job employment so how would they cope in paying back the students loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 16, 2023, 07:14:31 AM",
      "body": "Quote from: CryptSafe on June 15, 2023, 11:45:48 PMSo tey assu don put mouth for the matter say student go run from school if government continue with the loan say make government no try am.ASUU are not talking about the loan. The federal government wants free education not to be no more. This means that all government owned tertiary institution like college of education, polytechnics and University will begin to pay tuition fee. The school fees will become expensive.Quote from: CryptSafe on June 15, 2023, 11:45:48 PMJust as the previous poster says students will be ready to serve the jail terms come out and continue their life after all there is no job employment so how would they cope in paying back the students loan.I believe no one will be jailed if they have no job and have no alternative way to pay the loan. But did you know that some Nigerians will have job and will still want to evade the loan? In everything in life, there must be laws.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}