{
  "id": "topic_5444448",
  "title": "grahammiranda13",
  "author": "grahammiranda13",
  "created_time": "March 11, 2023, 08:17:32 AM",
  "content": "I have been here since 2017 and have Total time logged in: 16 hours and 55 minutes.How does this Merit thing work? I am defiantly not asking for free or just handouts but I don't understand it.If I want to give someone a Merit can I not because I am a Newbie? Or do I need to upgrade membership first?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444448",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "March 11, 2023, 08:22:44 AM",
      "body": "You can give merits if you're a newbie, but you don't have any. Someone must first give you some merits, in order for you to be able to send them to other people. For every 1 merit you receive, you get 0.5 sMerits (merits you can send).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 11, 2023, 08:33:40 AM",
      "body": "All explanations are here >> https://bitcointalk.org/index.php?topic=2818350.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "March 11, 2023, 08:41:49 AM",
      "body": "You have been here since 2017 but you do not know about how merit and smerit work? That is funny. If you have quality posts and visiting this forum, learning about what newbies supposed to learn, you would have gone far than being a newbie. Start to learn and read more about this forum for you to be able to send merit to people to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "grahammiranda13",
      "created_time": "March 11, 2023, 08:46:02 AM",
      "body": "Quote from: _act_ on March 11, 2023, 08:41:49 AMYou have been here since 2017 but you do not know about how merit and smerit work? That is funny. If you have quality posts and visiting this forum, learning about what newbies supposed to learn, you would have gone far than being a newbie. Start to learn and read more about this forum for you to be able to send merit to people to.\" but you do not know about how merit and smerit work? \"If I did know would I ask?\"about what newbies supposed to learn\"Supposed to learn? I dont want to learn it is just a question lol\"Start to learn and read more about this forum for you to be able to send merit to people to.\"I did not know this forum is just about Merits and that this is the only forum in the world. Thanks for letting me know",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 11, 2023, 08:58:08 AM",
      "body": "Try to make topics/posts that are constructive and with useful information for the community, by doing this the other members will give you merits. Merit is like a compliment, applause, or confirmation of a good job for your post or transmitted information.Doing this is difficult, maybe not. Surely you read posts and articles on subjects you know well. Then share your knowledge with the community and you will certainly receive merits.If in doubt, it's good to ask. I've always heard that it's better to ask stupid questions than to be stupid for not knowing. But, it's also good to learn by researching.Another tip: don't post multiple posts in a row to respond to multiple quotes. You can make several quotes in the same post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 11, 2023, 09:18:35 AM",
      "body": "OP, why do you need merit? You do not look like a person who is interested in the forum, it is clear from your posts that you are doing your business here, and still very rarely appear on the forum.For you, something else is more important, not to spoil your reputation. In order for the users you communicate with to trust you, you need to be honest with them. I think you will also be interested in another topic. Not getting a negative tag from DT members at some point is more significant than having a few merits.https://bitcointalk.org/index.php?topic=5191802.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "March 11, 2023, 10:20:19 AM",
      "body": "Quote from: lovesmayfamilis on March 11, 2023, 09:18:35 AMOP, why do you need merit? ✂️maybe grahammiranda13 has now been 'checked' and he would like to get more involved in the forum in order to increase/improve his reputation in order to be able to apply for various BTC signature campaigns in the future and in the long term.Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMI have been here since 2017 and have Total time logged in: 16 hours and 55 minutes.How does this Merit thing work? I am defiantly not asking for free or just handouts but I don't understand it.If I want to give someone a Merit can I not because I am a Newbie? Or do I need to upgrade membership first?to point 1: your current logtime has very little to do with itto point 2: if you create a very informative post/thread then the probability is high that you will get a merit. if you have collected a total of 2 merits, you can send 1 merit to another user in return - if you have 4 merits then you can distribute 2 and so on...to point 3: newbies can also receive/send merits. through the number of merits you receive and through your activity in the forum, your userrank will increase after some time. if you want to read up more on these points, some of the previous posters (rat03gopoh and lovesmayfamilis) have already posted some interesting links on this topic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "March 11, 2023, 11:17:06 AM",
      "body": "Quote from: _act_ on March 11, 2023, 08:41:49 AMYou have been here since 2017 but you do not know about how merit and smerit work? That is funny.May be, it's not that funny. Life happens. We can go with the flow that OP is the original owner of that account but only went on a hiatus here so as to concentrate on other stuff. Merit system then happened in their absence and took them by storm. Again, that someone has been here longer than you're doesn't mean they know much about the forum than you're. I've come across veteran members in rank who post like rookies. BTW, I know OP has got the response to their question. So, it's pointless adding any more suggestions to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "March 11, 2023, 12:09:38 PM",
      "body": "Nobody is been penalised due to questions, but most of the members believe that by now you would have known the system of merit and how it comes to circulation.Responding to your questions: Merit can only be given to another person when you have received merit from someone and if merit is given to you, and it happens to be two (2) merit you received, from that two merit you received you have a one (1) sendable merit  which  is called ( Smerit) to give another person. But the process whereby you received four (4) merits, you have two (2) smerit to give out. So I want you to understand that you will most earn a merit before having an smerit to give someone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "March 11, 2023, 12:22:11 PM",
      "body": "Quote from: Mpamaegbu on March 11, 2023, 11:17:06 AMMay be, it's not that funny. Life happens. We can go with the flow that OP is the original owner of that account but only went on a hiatus here so as to concentrate on other stuff. Merit system then happened in their absence and took them by storm. Again, that someone has been here longer than you're doesn't mean they know much about the forum than you're. I've come across veteran members in rank who post like rookies. BTW, I know OP has got the response to their question. So, it's pointless adding any more suggestions to them. Can't blame them. I mean, who wouldn't find the idea of getting payments just from posting weekly enticing?Not everyone is an influencer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "March 11, 2023, 01:03:10 PM",
      "body": "Every rank in the forum can send out merits when they have a sendable merit. When you a member of the forum finds your post helpful and meaningful they reward you by meriting your post so you just have to keep making meaningful posts and and engage in discussions when you have something meaningful to contribute and when your post is useful then you might be lucky to receive a merit. When you receive a merit you also receive a sendable merit (s merit) which you can send to someone other member you find their post meaningful. For Every merit received you also receive Smerit worth half of it e.g when you have 2 merit you also have 1 smerit and so it goes.Everything is explained better here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "March 11, 2023, 01:16:27 PM",
      "body": "Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMI have been here since 2017 and have Total time logged in: 16 hours and 55 minutes.How does this Merit thing work? I am defiantly not asking for free or just handouts but I don't understand it.If I want to give someone a Merit can I not because I am a Newbie? Or do I need to upgrade membership first?For your question above you don't need to buy membership in order to give some merits all you need is to earn merits cause when you receive 1 merit then you will be given a 0.5 sMerits which means before you can send 1 merit to other user you must receive at least 2 merits.Op good day as I observe when I looked up your profile all I can say is that you need to improve a lot of things in order to receive merits. And one of that is you need to expand your text with good message that can help other users or else making post that contributes to the forum then you will be given a merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "March 11, 2023, 01:24:18 PM",
      "body": "Quote from: _act_ on March 11, 2023, 08:41:49 AMYou have been here since 2017 but you do not know about how merit and smerit work? That is funny. If you have quality posts and visiting this forum, learning about what newbies supposed to learn, you would have gone far than being a newbie. Start to learn and read more about this forum for you to be able to send merit to people to.It’s understandable on his case that he didn’t know merit system despite he registered in the forum last 2017 because he mostly dealing on the marketplace section of the forum by selling good and services. He became inactive last 2019 and just recently came back last week to burst post probably to get merit for his rank up requirements. The sudden interest change from digital goods for 2 years to ranking up now is enough reason that literally new on merit system. PS: This user just recently woke after long period of inactivity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "March 11, 2023, 02:29:04 PM",
      "body": "OP, I see that you haven't been active on this forum for a long time, but like everywhere else on the Internet, you can get the answer to every question in the fastest and easiest way through the search function.The merit question is the most frequently asked question on this forum and there are already thousands of answers  In short, you can't get something for nothing.If you can contribute to the members of this forum in any way, they will know how to appreciate it and reward it with merit.It all depends on your work and the effort you put in to help others in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "March 11, 2023, 02:51:22 PM",
      "body": "Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMI have been here since 2017 and have Total time logged in: 16 hours and 55 minutes.If you were active during that time you would have received some merits as they were airdropped based on your rank at that time which you can know from the merit thread linked above.Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMHow does this Merit thing work? I am defiantly not asking for free or just handouts but I don't understand it.For every good post you make or any member thinks it's helpful post he/she can send you merits for the same and there are merit sources also to help you around.But if you feel you have made good contributions still your posts have not been noticed you can share them here : [self-moderated] Report unmerited good posts to Merit Source but you don't have any at this time so you need to work on making some posts first of all.Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMIf I want to give someone a Merit can I not because I am a Newbie? Or do I need to upgrade membership first?You can send merits as a newbie also but for that you need to earn them first of all but you need only one merit to rank up to junior rank as you have enough activity for the same but only lag merits.So you can gain them by above mentioned ways by increasing your knowledge and contributing more to forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 11, 2023, 05:26:33 PM",
      "body": "Quote from: grahammiranda13 on March 11, 2023, 08:46:02 AM\"Start to learn and read more about this forum for you to be able to send merit to people to.\"I did not know this forum is just about Merits and that this is the only forum in the world. Thanks for letting me know  This is not the only forum in the world but it is the best, oldest, largest, most popular and most recommended of all forums related to Bitcoin and cryptocurrency.This forum is not only about Merits as you mentioned, it is an educational forum and for exchanging dialogue and discussions among members in the first place.Merits plus activity is a system to upgrade a member's rank in the forum and get some extra features, if you don't want to upgrade your rank in the forum you don't have to earn Merits and you can just write posts, but you won't lose many other features in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "March 11, 2023, 05:40:28 PM",
      "body": "Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMI have been here since 2017 and have Total time logged in: 16 hours and 55 minutes.How does this Merit thing work? I am defiantly not asking for free or just handouts but I don't understand it.If I want to give someone a Merit can I not because I am a Newbie? Or do I need to upgrade membership first?You have been here since before the implementation of bitcointalk, but not really active so you didn't know about merits and all other forum activities which isn't really necessary for everyone to know but if you're will its actually there so all you need to do is start learning which can be achieved by reading more.Simply to have one sMerits you need to earn 2 Merits then only you can send someone a merit and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "March 11, 2023, 06:59:05 PM",
      "body": "Quote from: grahammiranda13 on March 11, 2023, 08:46:02 AM\"about what newbies supposed to learn\"Supposed to learn? I dont want to learn it is just a question lolIf you are not interested in learning, why ask the question?Quote from: grahammiranda13 on March 11, 2023, 08:46:02 AM\"Start to learn and read more about this forum for you to be able to send merit to people to.\"I did not know this forum is just about Merits and that this is the only forum in the world. Thanks for letting me know  No, this forum is not the only one in the world, but it is very similar to other online forums, so many things that apply in other forum communities apply here as well, such as:* Follow the forum rules and guidelines* Be respectful to other members* Use appropriate language and tone* Avoid spamming* Use the search function before asking a question, to avoid repetition* Be open to different perspectives and opinionsSo, in the future, I suggest you ditch the whole \"attitude\" thing when interacting with fellow members, especially when seeking their help or input for your questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 11, 2023, 08:24:14 PM",
      "body": "Quote from: grahammiranda13 on March 11, 2023, 08:17:32 AMI have been here since 2017 and have Total time logged in: 16 hours and 55 minutes.How does this Merit thing work? I am defiantly not asking for free or just handouts but I don't understand it.If I want to give someone a Merit can I not because I am a Newbie? Or do I need to upgrade membership first?This still got me surprised after being on the forum since 2017 and you're having just 67 activities and posts,I wonder what you've been doing all these while on the forum, evenem though I understand that not every member is chanced to be active like that but even from all you've posted till date not to have received any merit means you need to improve well on the quality of what you post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}