{
  "id": "topic_5399126",
  "title": "mikeywith",
  "author": "mikeywith",
  "created_time": "May 18, 2022, 05:10:42 AM",
  "content": "Have you ever heard the quote \"bad money drives out good.”? while this was first mentioned somewhere between 1519 and 1579, Bitcoin is just a living example of how that law is perfectly valid.So the short explanation of Gresham's law according to Wikipedia is this:QuoteUnder Gresham's Law, \"good money\" is money that shows little difference between its nominal value (the face value of the coin) and its commodity value (the value of the metal of which it is made, often precious metals, nickel, or copper).Simply put, people tend to spend the \"bad money\" first, imagine you have $30,000 in the bank, and 1 bitcoin in your wallet, you go to buy a new car, and the dealer accepts both fiat and bitcoin, you (or at least the majority of people) will rather spend the fiat first, this has led to a very low \"fresh\" supply of bitcoin which keep shirking with every cycle.Fun facts, as of today;Code:13%    of the supply has not moved for 10+ years6.6%   of the supply has not moved for 7 to 10 years3.8%   of the supply has not moved for 5 to 7 years14.7% of the supply has not moved for3 to 5 years6.6%   of the supply has not moved for2 to 3 years20.0    of the supply has not moved for 1 to 2 yearsIn plain English, 65% of the total supply has not changed hands for at least 1 year, we have never seen this much HODLing throughout bitcoin's history, despite the massive drop in its evaluation against the dollar, HODLers are HODLing stronger than ever.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399126",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "May 18, 2022, 05:55:38 AM",
      "body": "Yes, not only have I heard about Gresham's Law but I often mention it a lot in the forum. In fact I have it so internalized that a while ago I responded in a thread along the lines of what the Law says without mentioning it, although on many other previous occasions I have done so.Still, there are people on the forum who don't seem to believe in it very much, let's see if they come around here and give their arguments.Edit: I see that you have responded in that thread after me mentioning the law. I think we quite agree on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 18, 2022, 07:05:35 AM",
      "body": "Quote from: mikeywith on May 18, 2022, 05:10:42 AMCode:6.6%   of the supply has not moved for 7 to 10 yearsI fall into this category Which is what I always tell those who mention \"lost coins\" that they are talking about my coins too and they are not lost at all. I just have no reason to move that part of my coins.Quotedespite the massive drop in its evaluation against the dollarTo be fair, when speaking of long term, there has never been any \"massive drops\" ever. There is only constant rising in long term. For example in 2014 price was $300 and today it is $30000 and I don't see any \"massive drop\" in this 100x rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 18, 2022, 11:15:00 AM",
      "body": "Yeah, the Gresham's law has been mentioned a hundred times in the forum so far.I've studied about Gresham's law at university. I used to study Economics and I have a bachelor's degree, but I think that I've wasted my time.Anyway, the massive amount of HODLers means that many people have faith in the future of Bitcoin, which is great.I assume that the HODLers are the only reason why the BTC price keeps staying around 30K USD right now. Imagine if the people hoarding Bitcoins were way less than the current amount, the Bitcoin price would have been below 10K USD probably. The demand for BTC had dropped severely, due to panic and insecurity, but this will be temporary and I'm sure that another bull run will come after several months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 18, 2022, 11:42:48 AM",
      "body": "Quote from: mikeywith on May 18, 2022, 05:10:42 AMwe have never seen this much HODLing throughout bitcoin's history, despite the massive drop in its evaluation against the dollarFor the entirety of bitcoin's life, inflation in the majority of Western countries has generally been pretty low, in the region of 1-2% per year. Now, for the first time in bitcoin's life, large parts of the world are seeing inflation rates pushing 10% or even higher, which they previously hadn't seen since the 70s and 80s, with no real sign of it slowing down any time soon. Given that the vast majority of fiat investments won't outperform inflation, and the stock market not looking so good at the moment either, then there are few places left to store value which are easily accessible to the average person. Sure, bitcoin might be volatile, but at least it goes up as well as down (and always goes up if you just zoom out on the charts), as opposed to fiat, which only goes down and is now going down more rapidly than ever. It is only logical that more and more bitcoin is being used for long term storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 21, 2022, 02:10:56 PM",
      "body": "Is the data for coins that haven't been moved based purely on blockchain data? Because there are flaws in this methodology. For example, a person could move coins between their own wallets, to consolidate their coins, move to a new address format, change their software, etc. Also, what about change? If I have 0.5 BTC, send someone 0.01 BTC - does this methodology count 0.5 BTC as moved, or 0.01?Anyway, it's no secret that hodling is #1 use case for Bitcoin. However, it's also not practical to use as a currency for most people, so it isn't just about being good or bad money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "May 21, 2022, 02:42:57 PM",
      "body": "Quote from: hatshepsut93 on May 21, 2022, 02:10:56 PMIs the data for coins that haven't been moved based purely on blockchain data? Because there are flaws in this methodology. For example, a person could move coins between their own wallets, to consolidate their coins, move to a new address format, change their software, etc. Also, what about change? If I have 0.5 BTC, send someone 0.01 BTC - does this methodology count 0.5 BTC as moved, or 0.01?Anyway, it's no secret that hodling is #1 use case for Bitcoin. However, it's also not practical to use as a currency for most people, so it isn't just about being good or bad money. well are your examples if true mean that 65% is too low and that 70% is more likely to be true.If you think about it any rich person. Can easily hold all their btc if it is under 12% of their holdings.example you have 10,000,000 in wealth and 1,200,000 is btcholding that 1,200,000 is easybigger numbers50,000,000 in wealth means holding 20% in btc is easy that is 10,000,000",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "May 21, 2022, 08:14:45 PM",
      "body": "Quote from: hatshepsut93 on May 21, 2022, 02:10:56 PMAnyway, it's no secret that hodling is #1 use case for Bitcoin. However, it's also not practical to use as a currency for most people, so it isn't just about being good or bad money. Holding bitcoin could be a great usecase for right now, it could even be the biggest, but we need to realize that money moving all around internationally could be done a lot cheaper in the crypto world.People are focusing on how I can send my friend some 10 bucks without paying much and near instantly via bank transfer and that seems like the situation we are in right now. But that's wrong, we are talking about someone sending money from Uganda to Sweden or vice versa and send like 10 million dollars and only pay very small amount and do it in under half an hour. There aren't that many places that would be able to do this in the fiat world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "May 21, 2022, 09:46:47 PM",
      "body": "Its why all metal coins have been taken out of circulation and reformed from the cheapest possible metals that can be found.   Our currencies have all lost over 90% of their value so the metal has become far more valuable then the nominal figure on the front.   So this the kind of effect they are referring to, markets cant be controlled in this way people will always throw the trash out and sit on what is usable over many years.    In the next ten years its likely scrap merchants get rich because they will deal in trash that is somehow more valuable then the ongoing failure of currency, hence their debts lag their profits made or thats how its been in prior instances I heard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}