{
  "id": "topic_5467943",
  "title": "Jocuserious",
  "author": "Jocuserious",
  "created_time": "September 24, 2023, 05:12:16 PM",
  "content": "In my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467943",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 24, 2023, 05:19:34 PM",
      "body": "No one should gamble because they are looking for ways to to make money and choose gambling. What that will end it is addiction and further loss of money. The best way gamblers can be disciplined is to only have 5% of monthly income for gambling and it should not surpass that amount. This has been the strategy that has been helping me since long time ago till now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "September 24, 2023, 06:31:58 PM",
      "body": "Each casino has its own system and winnings will not always come to every player. This is like a random system that gives a win of 1x and a loss that may be more than 2x and this is also based on luck in some gambling games such as slot gambling. But for bets like football, it's not all luck because you need research to see how the players are and what factors will make them win or lose. Gambling should not be the main place to make money, it is just an entertainment game and if you get a profit it is a bonus. Dedicating all the money to gambling would not be justified, because there must be a limit on how much will be played in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "September 24, 2023, 06:37:26 PM",
      "body": "Luck?!?No it's wrong! gambling is all about mathematics and statistics! You should never think \"I am lucky or not...\"It's like thinking \"there is karma\" out here, yes probably yes but however you can't count only in karma or in luck That's why I will not focus too much on \"luck\".... moreover I will not think about it.Yes it can be counted as a part but it's not \"magic\" and has a clear explanation/evidence just.... with science!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 24, 2023, 06:38:11 PM",
      "body": "Quote from: Oshosondy on September 24, 2023, 05:19:34 PMNo one should gamble because they are looking for ways to to make money and choose gambling. What that will end it is addiction and further loss of money. This is the secret many people have not known... the moment you have the mindset that you want to make money from gambling and you add some kind of desperation, hell will be let loosed and the cycle of doom will set in. On the other hand, when you are playing for fun and do not desperately need the money, the winning will flow naturally over little efforts. I don't know why gambling work that way, but I am sure it has to do with psychology. Quote from: Oshosondy on September 24, 2023, 05:19:34 PMThe best way gamblers can be disciplined is to only have 5% of monthly income for gambling and it should not surpass that amount. This has been the strategy that has been helping me since long time ago till now.This is risk management in practice. It requires a great deal of courage and discipline to implement but if fully implemented, it will lead to a kind of balanced psychology, peace of mind and better performance. Many people missed it in gambling when they play without setting the targets and calculating their acceptable risk exposure before even getting started.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "September 24, 2023, 06:42:01 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PM<...>However, we all have some kind of luck so we should strive for what is possible for us.We're all well aware that in 99.99% of cases, gambling isn't exactly a get-rich-quick scheme. At least that's what the rational gamblers among us should think. Yet, here we are, defying the odds, rolling the dice, and crossing our fingers, hoping that we're the mythical 0.01% destined to hit that jackpot and walk away with with full pockets. Because we are a bunch of hopeful idiots!  Is gambling all about luck? Absolutely! Sure, there are some exceptions, like improving your poker skills through practice. But when the chips are down, it still comes down to luck when those cards hit the table.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 24, 2023, 06:42:16 PM",
      "body": "Quote from: kamvreto on September 24, 2023, 06:31:58 PMEach casino has its own system and winnings will not always come to every player. This is like a random system that gives a win of 1x and a loss that may be more than 2x and this is also based on luck in some gambling games such as slot gambling. But for bets like football, it's not all luck because you need research to see how the players are and what factors will make them win or lose. Gambling should not be the main place to make money, it is just an entertainment game and if you get a profit it is a bonus. Dedicating all the money to gambling would not be justified, because there must be a limit on how much will be played in gambling.when it comes to sportsbetting, it is not all the same as with luck-based games. the more you know the sports, the better chance for you to win. however, still not a guarantee that you will always go home as a winner owed to various factors involved in the outcome of the game. for most casino classics such as crash, hi-lo, dice and others, luck is your best companion to win in any of these games, no matter what known strategy you would apply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "September 24, 2023, 07:06:17 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.The system is designated for us to record heavy losses, it keeps collecting from us until we're wise and have full essential knowledge on how the system operates. We're in the system because we expects good results in our prediction, always keeping edge ready for games, and not minding the general instances of the system. Making cool cash from gambling is not easy, a complicated effort just to be able to withdraw one's earnings from the system. I consider it  to be based on luck and solid predictions, and not some kind of random analysis that will make one record heavy losses. Winning from gambling depends on the accurate ratio of your analysis and predictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "September 24, 2023, 07:17:03 PM",
      "body": "Most people say things like that, that when talking about winning in gambling means talking about luck.\" But not me personally, who where I'm not too fixated on luck. and I assume that \"when we talk about gambling we are talking about luck and chance.\"Why is that.? Because if we only talk about luck then even a stupid person can win gambling as long as he gambles. But we must remember that everyone has luck, but not everyone is able to create an opportunity to win. and you can get this opportunity only through increasing your understanding, knowledge, abilities and skills in gambling. Then you can get a chance to win on the bets and gambling you do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "September 24, 2023, 07:19:05 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.While luck plays a majority and crucial factor in winning games, gambling is not always about luck. There are certain instances where the game mechanics, skills, and techniques may play a vital role in order to gain a slight advantage whenever you attempt to play a single gambling game.For example, the game of Poker is the game of cards against your opponents. You can employ various strategies that can either give you a winning advantage or a losing position at the end depending on how you would be able to execute it.While gambling and luck are two things that are often associated with each other, there is still that degree of skill involve that can turn the tides in your favour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "September 24, 2023, 07:20:34 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.That is absolutely true for most slot games,dice,roulette and other completely luck based games.There is a slight possibility that people can make money from sport betting,I have seen a lot of high rollers in different casinos which implement the copy a bet feature that quite some of these persons win money over the long run.I personally though love the slot machines as some games from Pragmatic Play provider are very engaging and sometimes you can even win up to x5000 to well over x30000 of your bet and that is what keeps people coming back playing slot machines,not for nothing slot machines are the most played games in every casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 24, 2023, 07:24:10 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.Of course, gamblers already knows that, the odds are against them, the numbers will be pretty much stack against you specially if you play in the long run.That's why the best advise is that if you have won already, just stop and withdraw, and that is the trick.The thing with gamblers is that they are going to play though, push their \"luck\" for that day, it's like YOLO.And then at the end, you will see and hear them having this regrets that they should have quit while on top.There are also no system in the world that kind beat the casinos, so don't believed any person that try to sells a supposedly method in the internet because there are none.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 24, 2023, 08:10:26 PM",
      "body": "Odds will always stack against the gambler, because the house with even a 0.1% house edge compared to a 99.9% luck of the player, the house still wins in the long run. That in itself isn't a reason to stop gambling, especially if it's being viewed as a form of entertainment from the perspective of the gambler. It's just that no one should be looking at gambling as a way to make money, as obviously it is not the case and they will just lose more money if they do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "September 24, 2023, 08:18:35 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.Obviously, considering gambling a form of income or a sort of money-making scheme shouldn't be a usual practice as it's not possible for everyone. Yes, there are few gamblers who are able to keep their gambling career as their main source of income but they were able to reach that status because they build it alongside their unique skills. Aside from that, I found it too risky if we rely on our financial needs for something that requires luck + skills just to have a good and decent winning in return. Is gambling all about luck? Simply, yes but there are gambling types e.g. sports betting, strategy-based games, etc. that do not rely and depend too much on luck but rather gamblers on these fields are working on something to somehow increase their winning chance rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n00ber",
      "created_time": "September 24, 2023, 08:34:49 PM",
      "body": "Quote from: qwertyup23 on September 24, 2023, 07:19:05 PMQuote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.While luck plays a majority and crucial factor in winning games, gambling is not always about luck. There are certain instances where the game mechanics, skills, and techniques may play a vital role in order to gain a slight advantage whenever you attempt to play a single gambling game.For example, the game of Poker is the game of cards against your opponents. You can employ various strategies that can either give you a winning advantage or a losing position at the end depending on how you would be able to execute it.While gambling and luck are two things that are often associated with each other, there is still that degree of skill involve that can turn the tides in your favour.Yes, in gambling, the element of luck must always go hand in hand with the part of skill. We cannot play a game without understanding it, and we must understand its concepts and principles. Skills are still necessary, but luck will be the deciding factor in winning or losing. A good gambler will not be as good as a lucky person. Of course, luck is not always available. We feel enough and stop playing at the right time. That is a blessing for ourselves and our family. And also in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "September 24, 2023, 08:47:15 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.It naturally isn't. Cash is involved in gambling simply to add a thrill to a really simple game. Let's be real here after all, the majority of the people here would not enjoy two dice going up and down showing it's results and telling you that you won/lost every time without anything involved. Well, you can consider it like an entrance fee of sorts for a tournament that scales up/down depending on the amount you put in. Generally you lose money in the long run due to house edge so it isn't really fun to consider money in the long run, but I guess the thrill of receiving a big amount immediately, regardless of the amount spent is the actual fun part instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "September 24, 2023, 08:54:49 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.Luck is something complex to define, i mean, you need a lot of luck to hit $10 on x100, but with less luck you can hit $500 on x2. Both bets would pay the same, but one of them was with a lower value.I would say true luck is a big multiplier with a big bet because while bigger the bet it means we have fewer rolls. So, we need more luck to hit it.Says the guy who hit a x9900 today https://just-dice.com/roll/6150731012",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 24, 2023, 08:55:57 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.Most of the game yes though there are still games that you need to analyze and make a good decisions in order for you to win against other gamblers. Sports betting didn’t depend on any luck as you have to analyze and winning are more possible in betting. Luck is important in gambling and you are lucky if its present every time you gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pusaka",
      "created_time": "September 24, 2023, 09:04:55 PM",
      "body": "You believe in luck so you have to try as hard as possible... isn't that wrong? Will luck come every day or week? No one knows..You should not expect too much in gambling because the results will not match your expectations! Gambling is a game scheme that must please you. If you expect more than that, it will be bad or become a problem in your life.Many people say gambling is for fun... Use cold money... if you lose don't worry about stress or anything...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "September 24, 2023, 09:05:50 PM",
      "body": "Quote from: Jocuserious on September 24, 2023, 05:12:16 PMIn my opinion making cash from gambling is not a good option and the statistical probability that you will win every game at every casino is very low. I think winning or losing every game is completely in your head, so your individual tricks are not there. However, we all have some kind of luck so we should strive for what is possible for us.Well, that is quite obvious. That is why there are advices everywhere on this forum telling you to only gamble with money you can afford to lose and to never chase your losses. Only the minority of gamblers will be able to make considerable profit from gambling through big wins and jackpots. Anyway, if they keep playing, losses will be faced on long term, without any doubts. So, if you are a lucky gambler, make sure to use your earnings wisely instead of spending everything in another bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}