{
  "id": "topic_5485046",
  "title": "Kakmakr",
  "author": "Kakmakr",
  "created_time": "February 13, 2024, 05:22:39 PMLast edit: February 13, 2024, 05:35:34 PM by Kakmakr",
  "content": "Let's not forget that more and more coins are going from individuals to centralized platforms. Private ownership and equal distribution of coins are being reduced. Now for many people this is not a problem, because they are making good profits from the coins that are being gobbled up by the ETFs. I have no problem with that, because ownership of coins should not be restricted, but it is sad to see our coins going into centralized platforms, where people do not have control over the private keys. (The private key are controlled by the trading platform)It feels to me, like we are selling the keys to our soul and the legacy of Satoshi Nakamoto.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5485046",
  "comments": [
    {
      "author": "franky1",
      "created_time": "February 13, 2024, 05:37:07 PM",
      "body": "right now ETF are not gobbling up much new coinmost of the coin that go into things like fidelity/blackrock/ark came from... wait for it.. [drum roll] grayscaleso basically its one institution shuffling to another institution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "February 13, 2024, 05:42:00 PM",
      "body": "I do agree with you OP. I was never in favor of ETF at the first place. The amount of money these corporates control, it's very easy for them to position themselves as a dominant player of the market and can control the market as per their wish. Most importantly, the decentralized nature of Bitcoin will be gone with all these centralized invasions. We are just seeing the beginning of this shift and we really don't know what the future holds. ETF has been approved by the US only. Think what will happen if every major economies start introducing Bitcoin ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "February 13, 2024, 06:24:01 PM",
      "body": "Quote from: Kakmakr on February 13, 2024, 05:22:39 PMLet's not forget that more and more coins are going from individuals to centralized platforms. Private ownership and equal distribution of coins are being reduced. Now for many people this is not a problem, because they are making good profits from the coins that are being gobbled up by the ETFs. I have no problem with that, because ownership of coins should not be restricted, but it is sad to see our coins going into centralized platforms, where people do not have control over the private keys. (The private key are controlled by the trading platform)It feels to me, like we are selling the keys to our soul and the legacy of Satoshi Nakamoto.  I have accepted one thing about trying to let people understand decentralization, just accept that people are going to do anything that will make them happy irrespective of what you said to them, your option doesn't matter and that's why you see people selling their bitcoin, it's their by the way and they do what they like with it on exchanges they warned them about.ETF has money, they know it's what many wana be investors of Bitcoin want and that's why the are buying and stocking anyone they got their hands own and you can't blame them, money rules the world. Institutional investors are just clown who want bitcoin but feel native bitcoin isn't something they want to have thier hands own, they prefer to have it inform of ETF, they supply the money because they have it and ETF keep pilling up.I have learned that what is mine is mine and no one can take that from me and I will hold mine because nobody will have access to it, if the new investors can't keep the Satoshi legacy, we can and it will remain solid if we keep it the conventional way of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 13, 2024, 06:40:20 PM",
      "body": "Quote from: avikz on February 13, 2024, 05:42:00 PMI do agree with you OP. I was never in favor of ETF at the first place. The amount of money these corporates control, it's very easy for them to position themselves as a dominant player of the market and can control the market as per their wish. Most importantly, the decentralized nature of Bitcoin will be gone with all these centralized invasions. We are just seeing the beginning of this shift and we really don't know what the future holds. ETF has been approved by the US only. Think what will happen if every major economies start introducing Bitcoin ETF. If we look at the situation that was even surrounding the approval of this ETF bitcoin one could actually see manipulation cards been anticipated. My first thought was why did the government that has actually rejected it before simply turned its ears to it, maybe they seemed to see that it is the only chance to have this big institutions trying to get into bitcoin at one place and then probably kill off not just privacy of the investors but also to try and manipulate the market. Although I still stand that the manipulation wouldn’t be easy as they would hardly control one-third of the coins, but one thing that will definitely help them is the spread of FOMO, it happened when Garyscale started selling there coins off, many follow suit and it affected the market. Personally I am not bothered because this kind of panic are definitely for short term holders, as the market change will affect them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 13, 2024, 07:28:44 PM",
      "body": "Quote from: franky1 on February 13, 2024, 05:37:07 PMright now ETF are not gobbling up much new coinmost of the coin that go into things like fidelity/blackrock/ark came from... wait for it.. [drum roll] grayscaleso basically its one institution shuffling to another institutionNot true. If you look up some stats, it's actually miners that have been holding bitcoin when it was below 40k sold the ETF news on Jan 12. There's a chart showing coins held by miners, you can look it up, and that decreased by a lot in January, while before that it was growing for months. For an institution to buy OTC there has to be someone willing to sell OTC and if they're willing to buy over 1k BTC they're not going to contact normal people like us, but mining companies who have the supply to satisfy their demand.Also, GBTC sells using spot bitcoin exchange, while BlackRock and others buy OTC, so your theory of GBTC selling to BlackRock doesn't hold. If this was happening we wouldn't see such a large negative pressure in January from GBTC because they'd sell everything OTC to other funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "February 13, 2024, 09:02:32 PM",
      "body": "What we can do, is we can't buy the whole BTC supply circulating in the market, and neither we can stop people from selling BTC, they don't know whom they are selling, whether they are on CEXs or are on DEXs, they are just selling and buying without thinking and there is nothing bad in it until they don't consider this fact you talked on. I also know more and more BTC going into the custody of centralized exchanges will mean BTC won't be in the hands of individuals, instead, they will be in the hands of big institutions who will be trading BTC in between. They might not release it in the market.For example, Grayscale sold BTC and was bought by BlackRock and there are many other examples like of ARK's selling BTC future shares to buy its own BTC spot share (ETF). I mean, this can be used to manipulate the market and that's what is happening till now after the approval.But what we can do about it, as I aforementioned we can't buy, can't stop, so all we can do is take profit from the shortage of supply and hold onto what we have now, because the way BTC's supply is going I assume BTC is ntoffar away from touching $250k per unit value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "February 13, 2024, 09:21:47 PM",
      "body": "This is an interesting take at ETFs. I have seen almost everyone in favor of Bitcoin ETF and I am sure that it has something to do with how it will affect the price. Right now though since it has only been approved, there might not be as much companies buying bitcoin and they are not yet the ones who hold the most amount of bitcoin.To us, this might be a great news because these corporations holding bitcoin will definitely drive the price up. We can not do anything regarding this. We can not stop anyone from buying and holding bitcoin. I do wonder if Satoshi expected this to happen. Being the genius he is, I think he did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "February 13, 2024, 10:24:14 PM",
      "body": "This is bound to happen. It was just the community itself and Bitcoin folks that are into this and wishing that the institutions will join the game and they finally did. Realizing that these things have to happen for Bitcoin to grow more in value. But it's true that you've said that it seems that majority of the sold Bitcoins are going to them and for their own benefit and that's normal business for them and we'll never know when they're going to sell it all in a blow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 13, 2024, 10:43:51 PMLast edit: February 13, 2024, 11:09:53 PM by franky1",
      "body": "Quote from: coolcoinz on February 13, 2024, 07:28:44 PMQuote from: franky1 on February 13, 2024, 05:37:07 PMright now ETF are not gobbling up much new coinmost of the coin that go into things like fidelity/blackrock/ark came from... wait for it.. [drum roll] grayscaleso basically its one institution shuffling to another institutionNot true. If you look up some stats, it's actually miners that have been holding bitcoin when it was below 40k sold the ETF news on Jan 12. There's a chart showing coins held by miners, you can look it up, and that decreased by a lot in January, while before that it was growing for months. For an institution to buy OTC there has to be someone willing to sell OTC and if they're willing to buy over 1k BTC they're not going to contact normal people like us, but mining companies who have the supply to satisfy their demand.Also, GBTC sells using spot bitcoin exchange, while BlackRock and others buy OTC, so your theory of GBTC selling to BlackRock doesn't hold. If this was happening we wouldn't see such a large negative pressure in January from GBTC because they'd sell everything OTC to other funds.you should check that GBTC was offering alot of coin on the same platform as blackrock and some other ETFsGBTC and blackrock both use coinbase prime(part of the custody OTC suite) not the standard coinbase public exchange..  know the differenceif you look at how many coins GTBC had jan 10th. compared to now. and then look at how many coin all other ETF have now compared to jan 11th.. you will see the shuffling clearerwhen you look at thishttps://platform.arkhamintelligence.com/explorer/entity/blackrockhttps://platform.arkhamintelligence.com/explorer/entity/grayscaleand thisit becomes clearerfunny thing is it was miners doing the negative pressure on the standard exchanges, because they were not part of the coinbase prime(custodian swap) deals of exiting one etf to enter the othersas for your miner speakthe amount of coin that came from GBTC was high.. the amount of coin that came from random miners was near ZEROhowever there are some ETF that invested into marathon POOL. and they done their own closed door deals(not on public exchange) with ETFs but that amount was not as much as the deals with GBTC other miners who sell pressured in january had nothing to do with the custodian deals. and instead were just selling coin on the open spot exchangeknow the differenceif still unsurelook at this image below. notice the gray[scale] below the 0 line.. note the shape and angle of depletion.. compared to the other ETF above the 0 lines and angles of accumulation.. coincidence of consequence.. you choosenote the exact points of the 12th, 16th,19th,22nd the pattern[mirror] explains itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "February 13, 2024, 11:55:59 PM",
      "body": "OP, it was clear that the majority of coin ownership would eventually shift to centralised platforms. The government has never supported Bitcoin technology and has long sought to centralise it.They were unable to beat bitcoin, so they had to join them by claiming to be reliant on holding coins for the big whale investors in order to act as market manipulators when they now own a large portion of it. This is completely contrary to Satoshi's visions, but it will have no effect on the censorship and path that bitcoin was launched on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 14, 2024, 12:11:06 AM",
      "body": "Quote from: Ndabagi01 on February 13, 2024, 11:55:59 PMOP, it was clear that the majority of coin ownership would eventually shift to centralised platforms. The government has never supported Bitcoin technology and has long sought to centralise it.They were unable to beat bitcoin, so they had to join them by claiming to be reliant on holding coins for the big whale investors in order to act as market manipulators when they now own a large portion of it. This is completely contrary to Satoshi's visions, but it will have no effect on the censorship and path that bitcoin was launched on. correct title of topic should beBTC to Bitcoin ETFs - The ownership are shifting from centralized to other centralized ownership we have yet to see the mass individual sell off to then shift to centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "February 14, 2024, 02:01:43 AM",
      "body": "For many, Bitcoin is an investment, and they do not even want to read about the basics of Bitcoin and how to set up a wallet correctly. Some even leave their money in central services or closed-source, disreputable wallets such as freewallet. For them, investing through an ETF is much better than wasting their currencies to them. Scammers, but if you are thinking beyond investment, then surely the only real Bitcoin is the one that you (alone and no one else) has its private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "February 14, 2024, 02:04:43 AM",
      "body": "Quote from: Kakmakr on February 13, 2024, 05:22:39 PMNow for many people this is not a problem, because they are making good profits from the coins that are being gobbled up by the ETFs. I have no problem with that, because ownership of coins should not be restricted, but it is sad to see our coins going into centralized platforms, where people do not have control over the private keys. (The private key are controlled by the trading platform)Those Bitcoin Spot ETFs mostly use Coinbase as their custodian partner and this means your worry is true. Investors in those Bitcoin Spot ETFs have to trust those Bitcoin Spot ETFs and Coinbase to buy and store bitcoins transparently and handle those bitcoin safely as well as without shady activities to steal money from investors.Those investors have their money, their choices and they can make different decisions, by buying shares of Bitcoin Spot ETFs with above risk; or to buy bitcoin by themselves and be self-custodian for their bitcoins.I agree with risk you raised here and it's know by senior bitcoin investors. Not your keys, not your bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "February 14, 2024, 02:07:31 AM",
      "body": "OP, as a bitcoiner, sure its sad. But as a realist, nothing wrong with it. People can use bitcoin any way they want to. People storing bitcoin in centralized ways for convenience, whether in ETFs or just having their bitcoin custodied by companies, means those services of convenience get better. Convenient services always increases adoption for a technology. Increasing adoption is good for Bitcoin. Gate-keeping Bitcoin only to purists is not good for Bitcoin. For example, if we expected everyone to run their own node and custody their own Bitcoin, Bitcoin would never be all that useful because most people would never bother owning any Bitcoin. An analogy:It'd be like if you expected everyone who owns a car to know how to do all the repairs on their own car. If that were the case not enough people would own cars to have it be worthwhile for the govt to build roads everywhere and thus transportation would be much worse which would hinder society. Sure, ideally, we all can fix our own cars, but in reality only a minority of people will be that hardcore group.Now of course key management is much easier than learning automobile repair, but its the same situation. There's going to be a certain amount of people taking full advantage of all of Bitcoin's powers - self-custody, running their own node, maybe even operating a mining machine. While there are going to be a lot more people self-custodying but not running their own node. While there will likely be even more people using an entire industry's apparatus for allowing them to own and/or use their Bitcoin conveniently without worrying about how Bitcoin works. Sure, you lose power with convenience, but you can still be a Bitcoin participant by taking the convenient and less powerful route.Humans appreciate convenience, and people tend to have a limited amount of things or areas that they want to be 'hardcore' about. For many people they may want bitcoin but Bitcoin is not going to be one of the areas they care to become an expert in. Just like your average stock investor is just putting away a bit of money each paycheck into an index fund for retirement, rather than reading up on company quarterlies and picking stocks based on a bunch of their own research. Just like most people are going to pay someone to fix their car, even very simple things like changing a bulb or changing the oil, rather than learn about how to do it themselves. Just like, well everything, in which most people will choose to pay for convenience over needing to apply their own bandwidth to be self-sufficient, because everyone has limited bandwidth.People are free to use Bitcoin at any level, whether it is the ideal monetary sovereignty level taking full advantage of Bitcoin, or the \"this is just an investment held in a bank or investment firm\" level. As bitcoiners we can always recommend people the best way to have Bitcoin is to take advantage of as many of its revolutionary powers as possible, but we have to accept lots of people aren't gonna want to bother with that. And that is entirely natural and expected, and not something to fret over, or claim Bitcoin is no longer decentralized because of (as some people do). You can only control your own actions. If you hold your own Bitcoin, be proud of that, and be thankful that your self-custodied Bitcoin is becoming ever more useful as more people adopt Bitcoin in whatever way they desire, because greater adoption means greater Bitcoin acceptance and eventually we get to the point where you can largely live on a Bitcoin standard instead of a fiat standard, if that is your ideal goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 14, 2024, 02:15:49 AMLast edit: February 14, 2024, 02:26:16 AM by franky1",
      "body": "there are no issues in how people want to use bitcoin, but we should atleast strive to point out the risks and not just play promotion platitude ass kissing(people on this forum have already heard the word bitcoin to have even found this forum. so they do not need the cheerful whispers of utopian promotional recruitment speak, they are now looking for the real, factual information and risks they need to be aware of)bitcoin in CEX have no insurance. so unlike a bank you do not have the $250k FDIC insuranceuse a CEX if you day trade where depositing/withdrawing is a hassle but realise the risks. and note the \"you can lose all your investments\" sloganholding long term because you have no intent to sell anytime soon. its best to suggest storing on ones own private key. but note the risks of different wallet, software and what they do or dont offer..those taking advantage of ETF share buys. should know although they get tax advantages whilst getting exposure to the spot price. they need to know their broker, ETF trust at their sole discretion can close the share offering. and shares are not claims to any rights to any asset held. you cannot redeem bitcoin spot ETF for actual bitcoin. you only have price exposure at a share ratio to bitcoin price based on the Nav number the ETF trust chooses and can change at their sole discretion without needing to give notice or get votes from share holders",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 14, 2024, 02:24:05 AM",
      "body": "ETF this, ETF that, I think that people are now reasoning better, this is unlike how it was so lousy before the approval. Even then, I wonder what difference the ETF would make in the crypto space if not for Bitcoin shifting hands from one means to another, and from personal storage to company storage. I see no big deal in this, but it's nevertheless the hype of people. However, it is plainly the means by which the corporate entities will be able to control Bitcoin indirectly. The more we make it accessible to them, the more centralised it becomes.Sincerely, I just didn't feel it the way people felt it at that filing time, Bitcoin was already accessible before it, so what? As it is now, I do not know the model at which they will operate eventually and start allowing people access as they've not started fully, but no way this will not increase government oversight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 14, 2024, 02:36:07 AM",
      "body": "Quote from: EarnOnVictor on February 14, 2024, 02:24:05 AMETF this, ETF that, I think that people are now reasoning better, this is unlike how it was so lousy before the approval. Even then, I wonder what difference the ETF would make in the crypto space if not for Bitcoin shifting hands from one means to another, and from personal storage to company storage.many people pre etf launch expecting grayscale to hold onto its hoard. and not shuffle it over to other ETF. they thought ETF's would buy their own coin from the open market..however january shown just a institutional shuffle from one etf to the others.however there is only so much coin Grayscale has.. (72%) left. meaning 28% lost in one montheventually other ETF's are going to syphon coins from the open spot market instead of shuffling. and these large basket purchases will directly affect spot price..as for the effect on the other ecosystems such as merchant use and services offered.. well gold is not used in retail purchases of goods or services, so not much positive impact on merchant use due to being seen as an investment asset..what bitcoiners need to do is not wait for ETF investments to spark some commercial investment into fixing bitcoin utility annoyances, because so far those commercial investments have produced unfinished sandbox subnetworks used as workaround of work around of work around to the annoyances that prevent bitcoin utility, all of which have not helped bitcoin utility, but just promoted people should use bitcoin less.. so no positive impact therewe need a fresh set of eyes, a fresh set of devs to go back to scratch and propose different strategies to solve bitcoin scaling/utility. that actually benefits bitcoiners. ETF businesses have put a stake in the ground to say they see bitcoin as something that will be around for years. but now we have to get on and actually start proposing proper proposals to make bitcoin easy, cheaper to use for the benefit of bitcoiners instead of waiting for commercialised flawed sandboxes to solve things for us",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "February 14, 2024, 02:44:11 AM",
      "body": "Quote from: avikz on February 13, 2024, 05:42:00 PMI do agree with you OP. I was never in favor of ETF at the first place. The amount of money these corporates control, it's very easy for them to position themselves as a dominant player of the market and can control the market as per their wish. Most importantly, the decentralized nature of Bitcoin will be gone with all these centralized invasions. We are just seeing the beginning of this shift and we really don't know what the future holds. ETF has been approved by the US only. Think what will happen if every major economies start introducing Bitcoin ETF. I think ETF is in other countries.here is a list from https://thecryptobasic.com/2023/11/08/here-are-countries-with-functional-bitcoin-spot-etf-products/Of the nearly 200 sovereign states and territories across the globe, only a handful of eight have operational Bitcoin spot ETFs that are publicly traded on stock exchanges.The countries, compiled by the crypto aggregation platform Coingecko, include Canada, Germany, Jersey, Brazil, Liechtenstein, Guernsey, Australia, and the Cayman Islands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "February 14, 2024, 02:53:33 AMLast edit: February 14, 2024, 03:24:42 AM by bbc.reporter",
      "body": "Quote from: franky1 on February 13, 2024, 05:37:07 PMright now ETF are not gobbling up much new coinmost of the coin that go into things like fidelity/blackrock/ark came from... wait for it.. [drum roll] grayscaleso basically its one institution shuffling to another institutionHowever, the warning signs are there for what might occur in the future of bitcoin. If enough of these high networth individuals buy the bitcoin spot ETF, I reckon Blackrock and the others can own much of the supply and have a gated market where people can only invest in bitcoin through their ETFs. This will not be right for the real purpose of bitcoin as peer to peer cash. However, this is not the fault of the people. Similar to what has been argued before, this might be the fault of bitcoin's monetary policy.I shared this before many times but it was ignored because much of the people in bitcointalk.org did not want to address this. I reckon this might become more recognized at present because more people have begun to understand that there might be a problem.https://docs.grin.mw/wiki/extra-documents/monetary-policy/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}