{
  "id": "topic_5426906",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "December 08, 2022, 12:41:03 PM",
  "content": "Apos a queda do FTX o Banco Central Europeu, escreveu um artigo a demonstrar uma posição antiquada e mal informada, sobre o Bitcoin.O pior é que muitos irão ler esse artigo e a fixar ideias erradas sobre o Bitcoin. Reparem nisto:QuoteHowever, Bitcoin's conceptual design and technological shortcomings make it questionable as a means of payment: real Bitcoin transactions are cumbersome, slow and expensive. Bitcoin has never been used to any significant extent for legal real-world transactions.Caras e demoradas!? Raramente consigo fazer transferências do mesmo dia na banca tradicional, e normalmente pago uma fee de 1€.  Outra nota:QuoteSince Bitcoin is based on a new technology - DLT / Blockchain - it would have a high transformation potential. Firstly, these technologies have so far created limited value for society - no matter how great the expectations for the future. Secondly, the use of a promising technology is not a sufficient condition for an added value of a product based on it.Será que eles percebem alguma coisa de tecnologia? Devem ter escrito o artigo, numa maquina de escrever e depois deram a um estagiário para colocar no site...E estão cheios de medo:QuotePromoting Bitcoin bears a reputational risk for banksSince Bitcoin appears to be neither suitable as a payment system nor as a form of investment, it should be treated as neither in regulatory terms and thus should not be legitimised. Similarly, the financial industry should be wary of the long-term damage of promoting Bitcoin investments - despite short-term profits they could make (even without their skin in the game). The negative impact on customer relations and the reputational damage to the entire industry could be enormous once Bitcoin investors will have made further losses.Pois... pois... Que as pessoas podem gostar de ganhar 5, 10, 20% ao ano (ou mais), em vez de continuarem a fazer depósitos a prazo com ganhos de 0,015%.Artigo: https://www.ecb.europa.eu/press/blog/date/2022/html/ecb.blog221130~5301eecd19.pt.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426906",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "December 08, 2022, 05:17:53 PM",
      "body": "Quote from: joker_josue on December 08, 2022, 12:41:03 PMApos a queda do FTX o Banco Central Europeu, escreveu um artigo a demonstrar uma posição antiquada e mal informada, sobre o Bitcoin.Isso está incorreto. Isso não é a posição do BCE. É um artigo d opinião,  que reflete apenas a opinião do autor:QuoteThis ECB Blog post appeared as an opinion piece in Handelsblatt. The views expressed in each blog entry are those of the author(s) and do not necessarily represent the views of the European Central Bank and the Eurosystem.Artigo: https://www.ecb.europa.eu/press/blog/date/2022/html/ecb.blog221130~5301eecd19.pt.htmlQuoteO pior é que muitos irão ler esse artigo e a fixar ideias erradas sobre o Bitcoin. Reparem nisto:QuoteHowever, Bitcoin's conceptual design and technological shortcomings make it questionable as a means of payment: real Bitcoin transactions are cumbersome, slow and expensive. Bitcoin has never been used to any significant extent for legal real-world transactions.Na verdade o artigo é bem fraco, com argumentos antigos e já derrubados há bastante tempoHj o bitcoin é uma das criptomoedas mais baratas e rápidas. Certamente a mais segura, e com as taxas razoavelmente estáveis.Ainda conta com soluções como a lightning. Infelizmente o BCE divulgou o artigo, mas não e a posição do BCE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 08, 2022, 05:40:17 PM",
      "body": "Quote from: bitmover on December 08, 2022, 05:17:53 PMIsso está incorreto. Isso não é a posição do BCE. É um artigo d opinião,  que reflete apenas a opinião do autor:Realmente tens razão. É a opinião do Ulrich Bindseil que é apenas um dos Diretores Gerais do BCE e do Jürgen Schaaf e um dos principais consultores do BCE.Se os principais decisores do BCE promovem essas ideias, qual é a probabilidade de continuarem a dificultar a \"vida\" ao Bitcoin?Para não falar que o Ulrich Bindseil é um dos principais idealistas do Euro Digital (CBDC).EDIT: Até pode não ser a posição oficial do BCE. Mas a divulgação desse artigo, nos seus canais oficiais, é um corroborar dessa posição. O site do BCE não é um canal de noticias, é a representação dessa instituição na internet e no Mundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 08, 2022, 06:54:24 PM",
      "body": "Quote from: joker_josue on December 08, 2022, 05:40:17 PMRealmente tens razão. É a opinião do Ulrich Bindseil que é apenas um dos Diretores Gerais do BCE e do Jürgen Schaaf e um dos principais consultores do BCE.Tem também a opinião do Fabio Panetta, membro do conselho executivo do ECB, nesta semana: \"Cripto dominós: o estouro das bolhas das criptomoedas e o destino das finanças digitais\"Um pouco mais pesado que o texto de seus colegas: https://www.ecb.europa.eu//press/key/date/2022/html/ecb.sp221207_1~7dcbb0e1d0.en.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 08, 2022, 07:08:00 PM",
      "body": "Quote from: sabotag3x on December 08, 2022, 06:54:24 PMTem também a opinião do Fabio Panetta, membro do conselho executivo do ECB, nesta semana: \"Cripto dominós: o estouro das bolhas das criptomoedas e o destino das finanças digitais\"Num discurso feito nesta quarta-feira, ele afirmou que \"não é apenas uma bolha que está a estoirar. É como a espuma: várias bolhas estão a estoirar uma após a outra. O medo dos investidores de perder parece ter-se transformado em medo de não conseguir sair\".https://pplware.sapo.pt/informacao/banco-central-europeu-quer-regular-as-criptomoedas-urgentemente/Por isso, de forma indireta o BCE que realmente criar regras castradoras as cripto, indo mais alem do que tem sido feito e dito até agora.Muitos amiguinhos desses políticos devem ter perdido muito dinheiro do FTX e agora querem vingança!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 10, 2022, 03:27:12 PM",
      "body": "Eu não acho que nesse caso dê pra dizer que não é a posição do BCE. Acho que ser um tag de opinião funciona só como uma máscara tosca, mas dado o cargo do cara e os canais onde foi publicado, pra mim é a posição ''filosófica'' do BCE. A única diferença é que dela não derivou uma 'obrigação', mas pode derivar. Mas realmente checa a ser HILÁRIO alguém dizer que o Bitcoin é lento quanto consideramos como funciona o sistema de transferencia internacional hoje né. É um sacrifício sem precedente utilizar esses meios institucionais pra economias e necessidades real-time e globais. Mas as vezes eu nem sei quem ta mais louco. Porque imaginar que essas pessoas são burras é absurdo também. Mas quando pensarmos na dificuldade de usar o BTC ou um meio tradicional pra uma transferencia internacional, fica muuuuuuito evidente a diferença",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 10, 2022, 06:00:10 PM",
      "body": "Quote from: Disruptivas on December 10, 2022, 03:27:12 PMMas as vezes eu nem sei quem ta mais louco. Porque imaginar que essas pessoas são burras é absurdo também. Mas quando pensarmos na dificuldade de usar o BTC ou um meio tradicional pra uma transferencia internacional, fica muuuuuuito evidente a diferença E utilizar o desconhecimento generalizado das pessoas e a necessidade do dinheiro fiat que as pessoas tem no seu dia a dia, para tentar enfraquecer algo que poderia prejudicar o seu negocio.Eles não são burras... antes pelo o contrario, querem usar a sua influencia, para manter as coisas a funcionar no modelo que lhes é mais vantajoso.Lembra a serie que viu sobre o Spotify? Sem fazer spoiler (mas fazendo), vimos num dos episódios um produtor que era contra o PirataBay, apos ver o filho a usar o sistema, percebeu realmente o que as pessoas queriam. Isso fez ele mudar de ideias? No imediato não. Foram depois outros fatores que ajudar nesse sentido.Neste caso é algo parecido. Eles sabem como isto funciona, não tem é interesse que isso seja amplamente divulgado, então é ir alarmando para afastar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 10, 2022, 06:24:55 PM",
      "body": "Quote from: joker_josue on December 10, 2022, 06:00:10 PMapos ver o filho a usar o sistema, percebeu realmente o que as pessoas queriam.Christine Lagarde (presidente do BCE) já admitiu que o filho investe em criptomoedas Fonte: https://twitter.com/MartyBent/status/1529570794057224192",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 11, 2022, 01:49:07 PM",
      "body": "Quote from: joker_josue on December 10, 2022, 06:00:10 PMLembra a serie que viu sobre o Spotify? Sem fazer spoiler (mas fazendo), vimos num dos episódios um produtor que era contra o PirataBay, apos ver o filho a usar o sistema, percebeu realmente o que as pessoas queriam. Isso fez ele mudar de ideias? No imediato não. Foram depois outros fatores que ajudar nesse sentido.Quote from: sabotag3x on December 10, 2022, 06:24:55 PMChristine Lagarde (presidente do BCE) já admitiu que o filho investe em criptomoedas Fonte: https://twitter.com/MartyBent/status/1529570794057224192Conclusão da conversa, o sistema financeira muda de acordo com o nascimento das novas gerações e a medida que os filhos rebeldes se revoltam contra o paradigma dos pais, mostra uma outra perspectiva dentro de casa e a medida que as coisas ocorrem, eles precisam ceder. Ontem inclusive eu vi uma outra série que mostrava também a importancia dos filhos pra novas decisoes. Era um filme de época de reis e ai mostrava os principes mais jovens tentando aprovar questoes mais modernas, como por exemplo gastar dinheiro em uma nova ferrovia ao invés de gastar com a guerra. E essa questõ da negociação com pai vs com filho apareceu algumas vezes. Talvez realmetne seja uma força de mudança.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 12, 2022, 12:56:07 AM",
      "body": "Quote from: Disruptivas on December 11, 2022, 01:49:07 PMConclusão da conversa, o sistema financeira muda de acordo com o nascimento das novas gerações e a medida que os filhos rebeldes se revoltam contra o paradigma dos pais, mostra uma outra perspectiva dentro de casa e a medida que as coisas ocorrem, eles precisam ceder. Ontem inclusive eu vi uma outra série que mostrava também a importancia dos filhos pra novas decisoes. Era um filme de época de reis e ai mostrava os principes mais jovens tentando aprovar questoes mais modernas, como por exemplo gastar dinheiro em uma nova ferrovia ao invés de gastar com a guerra. E essa questõ da negociação com pai vs com filho apareceu algumas vezes. Talvez realmetne seja uma força de mudança.São os miúdos de hoje, que irão liderar amanha.Então, sejam os pais a fazer as mudanças ou mais tarde os filhos, elas irão surgir. Quem fica no meio é que acaba por não conseguir usufruir corretamente nem de uma coisa nem de outra. Vamos nos safando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 12, 2022, 01:01:36 PM",
      "body": "Quote from: Disruptivas on December 10, 2022, 03:27:12 PMEu não acho que nesse caso dê pra dizer que não é a posição do BCE. Acho que ser um tag de opinião funciona só como uma máscara tosca, mas dado o cargo do cara e os canais onde foi publicado, pra mim é a posição ''filosófica'' do BCE. A única diferença é que dela não derivou uma 'obrigação', mas pode derivar. Em uma democracia,  ainda mais em uma tão complexa como a união europeia, todas as decisões são tomadas de forma Colegiada (ou seja, por um voto de um grupo de pessoas ). Nunca estudei  , mas aposto também q o mandato desse diretor não é vitalício e um dia chegará ao fim (deveres durar poucos anos)Por mais alto que seja o cargo desse fulano, ele tem pares. E a competência dele tem limites.Certamente nem todos os pares deles concordam com a posição dele (ainda mais uma opinião com tantos erros) e logo em baixo está escrito que o texto não reflete o posicionamento oficial do banco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}