{
  "id": "topic_5467993",
  "title": "FirmWars",
  "author": "FirmWars",
  "created_time": "September 25, 2023, 05:56:42 AM",
  "content": "Crypto Investment MYTH.Never marry your crypto bag.... Investment RealityEvery freaking rich crypto millionaires married their bags so hard that they refused to let go and in the end it work out for them. Many people are confused when they are told not to ever get married to their bags and yet they are told to HODL, so which one is which? Bitcoin holders years ago married their bags, today, they are all whales and bosses of their own, the same with Ethereum and BNB, I believe this is a bad advice for all crypto investors. It's a advice that is mixed up, I believe the right advice should be, never marry your altcoin bag, easy to say right? It's not the same to Bitcoin and ETH, marry your bags and get set forever. Years ago, there was not many people telling people to hold their Bitcoin, because no one knew its going to be the giant of crypto world in future, well Ethereum comes into play and it was on sale for 0.99$ years ago, if you marry an ETH bag, today your life will never be the same, BNB came into play again and many lives are changed, now tell me, is it over?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467993",
  "comments": [
    {
      "author": "Orpichukwu",
      "created_time": "September 25, 2023, 06:24:59 AM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMnow tell me, is it over? It's only over when you think it's over. Because the mentioned coins have done very well in the past and those who were early on made some fortune out of them, it does not mean the end of the road for those who have not yet or who were not lucky enough to be among the so-called early investors. No, it's not yet over. Provided that the blockchain is still alive, it's never over. More potential projects will always come up, but the question is, will you be able to identify one when you see it? That's what happened back then, even in the time of bitcoin when it was growing. Many saw the opportunity but didn't grab it and later regretted their action, so such can still happen in new projects, which might be like those of ETH or BNB. Many will fall into the hands of the wrong project, which might appear to be potential, but deep down, the owners are just their own rug pull. For the main time, casing after a new project that will make a name in the near future shouldn't be the goal, but you can also start by filling up your bag for the ones you forgot to do when you had the chance when Bitcoin was still low in price. You can buy now and wait for when the price will double again. This might not happen anytime soon, as you never can tell when it will, just as no one knows when its adoption has increased to what it is now. I don't even know the best place for this thread, if it's on the altcoin discussion or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 25, 2023, 06:46:05 AM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMIt's a advice that is mixed up, I believe the right advice should be, never marry your altcoin bag, easy to say right? It's not the same to Bitcoin and ETH, marry your bags and get set forever.Ethereum was said to be created to solve some bitcoin problem? But ether fee is high and it brings more scammers and it makes privacy to become zero. But this is about investment, I think ether is good, but if someone is holding bitcoin already, is ether needed? I do not think so, though they are worth holding too, including the centralized BNB. If I am holding bitcoin, I do not need either of these coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "September 25, 2023, 06:47:46 AM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMYears ago, there was not many people telling people to hold their Bitcoin, because no one knew its going to be the giant of crypto world in future, well Ethereum comes into play and it was on sale for 0.99$ years ago, if you marry an ETH bag, today your life will never be the same, BNB came into play again and many lives are changed, now tell me, is it over? Firstly you stated well by saying when they say marry your coin they mean bitcoin but you ended adding Ethereum and BNB later. I think this two should just be right there with the other Alticoins or probably at the top of log on alticoin part when you are considering just alticoin. But overall I would say just hold on to bitcoin and stack all Alticoins long enough at your own risk. The two top Altcoins you mentioned are not to be trusted to hold for at least five plus years, yes they grew in price over the last years just like what other coins have done although they stayed longer because they have better project management. But the question remains if any of the two can hold if say bitcoin falls? No. The transition of ETH from POW to POS and causing the highest stakes controlling the larger portion of the coin has made it difficult for it to be trusted because many perceived that it can easily be manipulated by those whales and this doesn’t seem right for a coin that should be held for long. Also BNB is just like other coins but with just an hype because of binance. This same binance is the reason why you don’t need to marry it also because any day anything happens to binance then down goes BNB too. A clear example is the FTT token built by FTX exchange. It raised up to almost $85 but due to the saga around FTX it has fallen heavily to a price of around $1 currently. The raise of it now depends on FTX future. So coins like this who are attached to entities aren’t worthy of marrying for a long time either",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 25, 2023, 07:48:11 AM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMNow tell me, is it over? Definitely won’t be the last, another will come and the hype will make people delve into it which in turn will make the price rice and after some time it will still drop back. Like you mentioned, marry your coin isn’t for all projects… they are people who actually help unto so many coins hoping it will be the next Ethereum or any of the top ten coins but if they should open their wallet you’ll see that majority of them are now worth shits while some have been delisted, removed liquidity and some projects have also shutdown. So most of the people the people that actually held onto some coins that eventually made them rich are of two types one, they know their shits in the crypto space so they are able to spot a light project that will break the market once they launch so they’ll first accumulate some of the coins while the others were just lucky to have been holding that token/coin at that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 25, 2023, 07:51:19 AM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMCrypto Investment MYTH.Never marry your crypto bag.... Investment RealityEvery freaking rich crypto millionaires married their bags so hard that they refused to let go and in the end it work out for them. Many people are confused when they are told not to ever get married to their bags and yet they are told to HODL, so which one is which? Bitcoin holders years ago married their bags, today, they are all whales and bosses of their own, the same with Ethereum and BNB, I believe this is a bad advice for all crypto investors. It's a advice that is mixed up, I believe the right advice should be, never marry your altcoin bag, easy to say right? It's not the same to Bitcoin and ETH, marry your bags and get set forever. Years ago, there was not many people telling people to hold their Bitcoin, because no one knew its going to be the giant of crypto world in future, well Ethereum comes into play and it was on sale for 0.99$ years ago, if you marry an ETH bag, today your life will never be the same, BNB came into play again and many lives are changed, now tell me, is it over? it will be over if someone stops if you have started Bitcoin and other currencies, you will find out that it's just a cycle and it's only a matter of when to cash in and cash out, you can't blame people for letting go of what they have, since we don't know the story maybe they really need the money, I'm pretty sure they learn their lessons and made a comeback, my one friend told me TP when your happy, there is no other things to think about no what if's, and move on to the next cycle prepare for it, and it always works, thinking of the past will just haunt you and will make bad decisions in your current situation, maybe you know elon musk do you think he will be this rich if he dwell on failures no, I'm not saying you should be elon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 25, 2023, 10:30:24 AM",
      "body": "It is true that keeping Bitcoin is much better than keeping alternative currencies, but investing without knowledge and without a strategy will end in losing your money, regardless of the type of asset you invest in, especially if it is high risk, as is the case with Bitcoin.Therefore, advice such as whether to buy Bitcoin or not to sell Bitcoin should be based on a stronger foundation than meaningless comparisons. The price of Bitcoin 10 years ago does not mean that it will rise in the same year 10 years from now, and the same applies to Ethereum or any other investment.DYOR and Don’t invest recklessness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 25, 2023, 12:10:06 PM",
      "body": "If you're holding Bitcoin, you really have to marry it until you can finally settle and decided to sell. Whether you think it's a bad advice, apply what you think is best and suits your investing style.While those that are marrying their bags and thinks that they're better with that, you can't do anything with them but they'll have to hold as much as they can because that's what they think is best for them.It's not a myth but it's either good or bad advice depending on the person that sees it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 25, 2023, 12:32:53 PM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMEvery freaking rich crypto millionaires married their bags so hard that they refused to let go and in the end it work out for them.It is important to know that not all cases of these worked out, some had suffered losses and we don't hear about them, only the few and successful ones make the story up and present it to the public, if you're considering this first, then you have to know the kind of crypto investment you're putting into consideration, it's acceptance, the value and the risk as well involved, you can always make bitcoin your choice to help reduce the risk involved from having other cryptocurrencies investments and risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "September 25, 2023, 01:52:42 PM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMMany people are confused when they are told not to ever get married to their bags and yet they are told to HODL, so which one is which? Bitcoin holders years ago married their bags, today, they are all whales and bosses of their own,I’ve been used to seeing “hodl” and it’s not a permanent technique, a person can hold for a specific period of time to make profits and then sell their coins. So, it’s different from marrying your bag, which I’m seeing for the first time, in a brief understanding of what you mean by that phrase  it means holding forever with no intention of selling, unless when u divorce your bag  that’s why I quoted the whales, because they held for a long period of time, today they’re enjoying profits. In today’s market, people are advised to hold, so they can make profits in the market. Nobody knows what the long term outcome of bitcoin will be, hence marrying it isn’t talked much, could be why I've not been seeing it too. Remember that these whales got bitcoin almost free and mined easily with a pc, it contributed to the long term holding of their bag without any thought of selling. The price today is expensive and people will definitely need their funds for other things, only a few investors can forget 100k dollars invested in bitcoin and not require it in the nearest future. Unlike the whales that bought in 2010. Same is applicable to the altcoins you mention, if Satoshi shows again with a new coin what do you think will happen, everyone will invest and purchase the new coin hoping that it’ll boom like bitcoin. Unfortunately, if it doesn’t, they’ll lose their funds. Same thing happened to many others who ventured into shitcoins and ended up losing out a lot of money, they thought those coins will perform like bitcoin. I think the term don’t marry your bag is referring to such people; shitcoin investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "September 25, 2023, 10:25:10 PM",
      "body": "Quote from: FirmWars on September 25, 2023, 05:56:42 AMCrypto Investment MYTH.Never marry your crypto bag.... Investment RealityEvery freaking rich crypto millionaires married their bags so hard that they refused to let go and in the end it work out for them. If they refused to let go then they could still be holding their bags until now and have not sold anything yet thus, they should have not realized their profit.  I believe these people are long time holder.  They do not intend to sell their stash in a glimpse of profit but rather they wanted it to be a life changer for them.QuoteMany people are confused when they are told not to ever get married to their bags and yet they are told to HODL, so which one is which? Marrying a coins I believe is to not let it go, while holding is like taking time until their target price is realized.QuoteBitcoin holders years ago married their bags, today, they are all whales and bosses of their own, the same with Ethereum and BNB, I believe this is a bad advice for all crypto investors. The sanctity of marriage is to be together forever, that is what it means when saying marrying their stash.  QuoteIt's a advice that is mixed up, I believe the right advice should be, never marry your altcoin bag, easy to say right? It's not the same to Bitcoin and ETH, marry your bags and get set forever. It should be never marry your investment, just hodl and sell when the target price is realized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}