{
  "id": "topic_5448334",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "April 11, 2023, 04:47:13 AM",
  "content": "Last month my trade was great, I make some dooh but this month is cashloss experiment. I don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. The system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  and this things happens anytime the market looks like bitcoin wants to boom. I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448334",
  "comments": [
    {
      "author": "mk4",
      "created_time": "April 11, 2023, 05:12:46 AM",
      "body": "\"Seasonal\" is probably a decent term to describe it, but it's simply the fact that certain/individual strategies won't work consistently forever/all the time. It's the same both with technical analysis and fundamental analysis. Adaptation and reflexivity is the key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 11, 2023, 05:15:42 AM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMLast month my trade was great, I make some dooh but this month is cashloss experiment. I don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. The system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  and this things happens anytime the market looks like bitcoin wants to boom. I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.You must learn the basics of trading before doing actual trades. There are two sides of a coin and there are two different outcomes of trading, winning and loosing. There is no magic behind trading. Anyone can learn it and there is nothing mystical about it. Nobody is regulating the system it's the user's mistake who put their money into trading without getting proper knowledge about trading in first hand. Trading will give you profits every week if you learn to trade properly. Without a proper plan, and strategy trades will go towards loss. It's mandatory to learn trading and then put money into it, don't blindly follow influencers, their advice is really harmful. As far as you trade safely you will not be hit by market. Even if your trades are in loss just hold them as Hodling is part of crypto trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "April 11, 2023, 05:32:58 AM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMLast month my trade was great, I make some dooh but this month is cashloss experiment. I don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. The system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  and this things happens anytime the market looks like bitcoin wants to boom. I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.While I cannot deny that suspicion of yours nor say that it's true since there is no concrete evidence to prove either speculation, I believe that it isn't something that can really beat up a good trader. Yes, losses are always present in trading but that doesn't mean that the frequency of losing vs winning trades cannot be influenced by the actual trader. If that were the case, no one would even think about trading.The best way I know to save one's self from suffering too much losses is to be fully equipped with the proper knowledge or at least the basics when it comes to trading. And of course a good temperament along with a good amount of experience. With these, a trader can make lots of profits and minimal losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "April 11, 2023, 06:21:00 AM",
      "body": "Market is not only seasonal but also cyclical. Cyclical is bigger than seasonal trait.When you say seasonal, your view is a little bit mid-term but when you say cyclical, your view is wider and long-term.If you have good plan for market cycle, you can reduce risk and increase your chance to get decent profit. You can not use leverage or futures with plan is built on cyclical view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 11, 2023, 06:30:59 AM",
      "body": "How can you say that the market is seasonal if you need help understanding the mechanics of the market? Saying that it's \"mystical magic\" doesn't explain anything. It's best to know that there is a primary reason you always kept winning trades: market sentiment. It's a bullish market; everyone would benefit from it and keep winning. It would be hard to regulate, but the people who can are the whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ItsCrafty",
      "created_time": "April 11, 2023, 06:37:36 AM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMI see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.This is true that there is no 100% expert in crypto trading and no one can give you 100% accurate signal about amy coin or Market condition for specific time. Market condition can change according to buy and sell pressure. Experts can give you only possibility of market. For this they look for different factor like chart analysis, expected some positive or negative news about btc or crypto, previous 4 year crypto cycle and other factorsMarket is also now a big whale game. When many experts says that next month market will likely to be bullish and most of people become over confident to invest then they increase sell pressure to make profit in this stage. similar big exchange also liquidate users in this state. For this they sell fake news to spread fud and they able to buy from down again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 11, 2023, 07:12:33 AM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMThe system dash you small cash this week and collect big cash from you next week.If you are buying bitcoin for a week and you are selling the coin, that means you are still trading. Do you know that not selling for just a week is swing trading? Scalping, day trading and swing trading are all trading and they are risky, although swing trading will consume little time of studying the chart and analyses and it is not risky like the other two. If you are holding, the coin can reduce in price, but that does not mean that you are losing, it is just an unrealized loss. If you sell the coin is when it becomes an unrealized loss. So if you buy and sell within a week with losses, that means you lose. But if you have a long term goal and not sell the coin when the price is low, it is an unrealized loss and the price will increase again. Trading and investment are not the same, you need to differentiate them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "April 11, 2023, 07:28:19 AM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AM[snip]I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.Because here is the fact --the market is unpredictable and no one really knows what will happen in the future, I don't even believe that there is a crystal ball that will have the ability to predict the market, so even experts or traders that gained a lot of experience have a chance to have a loose position. However, always remember as a trader to accept that losses will perhaps occur and to learn from them, rather than letting them negatively affect their trading psychology. With the right mindset and risk management strategies, even a losing streak can be turned around and profitability can be achieved over the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 11, 2023, 12:55:14 PM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMbut this month is cashloss experiment. The month can still give you profit don't be depressed.Quote from: JamesBorn on April 11, 2023, 04:47:13 AMI don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. There are no mystical magic or power to it. That is the way it is and that is why you need to confirm your trade before entering and give space for stop loss because market will chase the stop loss as if it was waiting for your order.Quote from: JamesBorn on April 11, 2023, 04:47:13 AMThe system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  Nobody likes to lose, trade with caution.Quote from: JamesBorn on April 11, 2023, 04:47:13 AMand this things happens anytime the market looks like bitcoin wants to boom. I think that is chase for stop loss. I think usually when market shows you a good entering position, it doesn't just start giving you profit but it starts to trade contrary to the position and chasing you or other traders off their stop loss before it starts to profit. So that depends on the range of stop loss set for the trade, if it is closer then it will be easier to take you out faster.Quote from: JamesBorn on April 11, 2023, 04:47:13 AMI see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.The market can only favour you more than you lose if you keep to the professional way to trade which are good money management and use of stop loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DevilSlayer",
      "created_time": "April 11, 2023, 01:32:38 PM",
      "body": "Quote from: mk4 on April 11, 2023, 05:12:46 AM\"Seasonal\" is probably a decent term to describe it, but it's simply the fact that certain/individual strategies won't work consistently forever/all the time. It's the same both with technical analysis and fundamental analysis. Adaptation and reflexivity is the key.There is a thing called market cycle in trading and it consists of Uptrend, Downtrend, and Sideways. The strategies in uptrend is not applicable in downtrend, the strategies in sideways are not applicable in uptrend and vice versas. It is common mistakes of the traders nowadays wherein they think that their strategies will work 100% of the time without knowing and understanding the nature of trading and also the market cycle. The market already transition to sideways in to bullish wherein the proof is the current breakout of the bitcoin in the $29,000 - $30,000. What we should expect after what happened earlier? There is a high probability that the price will appreciate in these following days and weeks and we can also expect that some altcoins will go crazy momentum.For those who are asking about what is the best trading strategy in the current market cycle which is uptrend, is to buy at support or to buy at breakout. Identify yourself first if you are a swing trader of if you are a momentum trader. A swing trader usually buying at support level and it took weeks to months before they take profit while momentum trader can be called as a quickie trader who usually take tp within minutes, hours or few days after their order. Analyze a lot of chart and make a small thesis that can help you to familiarize on some trading strategies that can help you to make profit in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "April 11, 2023, 01:37:30 PM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMLast month my trade was great, I make some dooh but this month is cashloss experiment. I don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. The system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  and this things happens anytime the market looks like bitcoin wants to boom. I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.Even if we think that we already know how to trade but the fact that market is unpredictable then those losses is quite normal especially when you are of control in your trades. Learn from those past mistakes and see how those seasons goes then set some trading plan so that you can develop good trades which is more beneficial for you in the long term.Everyone can experience loss even those experience person but they can manage their trades and have set up game plan in terms of cutting there losses then set up another entry for possible reversal of their trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "April 11, 2023, 09:38:44 PM",
      "body": "I am expecting this week to be Bullish because the market is already gaining some good sights and 30K is broken by the Bitcoin, I do agree with the OP that the Market is seasonal but this seasonal market behavior provides the investors a risk-free opportunity to take entry and book some decent profits. Forking and Hitting I would like to say Time changes dude Spring Blossom cant be forever this is how nature works if something is rising then before and after there was dark fall. If this doesn't happen then what to expect we won't get new opportunities to enter.For the rest of the case on the expert trader as bro, you are not controlling the market it's based on different aspects so we can predict with some sort of efficiency we can't judge. Predictions / Speculation are based on the previous market behaviors and the maximum of times it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 11, 2023, 09:54:01 PM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMLast month my trade was great, I make some dooh but this month is cashloss experiment. I don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. The system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  and this things happens anytime the market looks like bitcoin wants to boom. I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.The bull run is seasonal but the market is active at all times. You gotta see how the market works for both investors and traders. If you're an active trader, you can make everything for all seasons. But if you're an investor then you have to wait for the right time to see how the profits will come out. And that's where being seasonal is going to come in, we don't know if the future might be good for specific altcoins you're holding and trading but, if you're holding bitcoin then the chances are higher than one can expect. It all depends on your trading capacity and the reality of it is that traders are losing more, honestly. And if the latter is your description of yours being seasonal, it's true. Today might your lucky day but tomorrow, you don't know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "April 11, 2023, 10:36:54 PM",
      "body": "Quote from: crwth on April 11, 2023, 06:30:59 AMHow can you say that the market is seasonal if you need help understanding the mechanics of the market? Saying that it's \"mystical magic\" doesn't explain anything. It's best to know that there is a primary reason you always kept winning trades: market sentiment. It's a bullish market; everyone would benefit from it and keep winning. It would be hard to regulate, but the people who can are the whales. Actually the market is seasonal, because relating it to bullish season and bearish season,  its safe explanatory that market happens to be positive seasonal and some times it happens to be negative in some points, so if Op portray that market is seasonal I don't that the reasons or point are not cogent,  relating it to the aspect of Trading you will note that in trading not every period you trade it become profitable, it neither be positive or negative, so base on Op experience that is while it throw the ideas on air.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "April 11, 2023, 10:46:40 PM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMLast month my trade was great, I make some dooh but this month is cashloss experiment. I don't really understand the mystical magic behind the technological process of this trading as if someone or something is regulating the system. The system dash you small cash this week and collect big cash from you next week. Is not sweet to bear big loss than gain,  and this things happens anytime the market looks like bitcoin wants to boom. I see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.And this what makes this market special on which it is really that not prone to manipulation because the entire community are ones who do dictate out when it comes to price movement.Its not really that something shocking because this market had been unpredictable since from the start.You might be able to make the best TA analysis out there but there would be no assurance that it would precisely work 100% most of the time.This is why when you are a trader then you should really be making yourself at least aware on how this market behaves or works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "April 11, 2023, 10:57:55 PM",
      "body": "In summer there is usually less activity, and in spring there is often an active growth phase (at least once every two years). So yes, we can say that the market depends to a certain extent on what time of year it is. Although there are always exceptions to the rules, so you can't be absolutely sure it will always be like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "April 11, 2023, 11:39:51 PM",
      "body": "Quote from: Unbunplease on April 11, 2023, 10:57:55 PMIn summer there is usually less activity, and in spring there is often an active growth phase (at least once every two years). IMO, it could be.Many traders may take time off during holidays, which could lead to lower trading volumes and increased volatility.  As we noticed, in the past few weeks there are too many holidays I think many traders took a break for vacation. Quote from: JamesBorn on April 11, 2023, 04:47:13 AMI see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.Yes, that's the point because the market is highly unpredictable and subject to a wide range of factors that can impact its performance.So even them, they may experience losses too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 12, 2023, 12:11:39 AM",
      "body": "Quote from: JamesBorn on April 11, 2023, 04:47:13 AMI see that there is no complete expert trader, at a point everyone experience loss both robots. That's means the market is kind of seasonal, it can favor you today and hit you tomorrow.It’s easy to celebrate winnings and ten times hard to take a loss. There is no perfect trader, the best can only try to make their winnings higher and keep their losses at minimal. I agree the crypto market is seasonal, that’s why traders study trends, previous price movements and history, and follow the news. However I do not see crypto trading as a game of luck, if it’s as simple as the toss of a coin anybody can be successful trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "April 12, 2023, 08:31:31 PM",
      "body": "Quote from: DevilSlayer on April 11, 2023, 01:32:38 PMThere is a thing called market cycle in trading and it consists of Uptrend, Downtrend, and Sideways. The strategies in uptrend is not applicable in downtrend, the strategies in sideways are not applicable in uptrend and vice versas. It is common mistakes of the traders nowadays wherein they think that their strategies will work 100% of the time without knowing and understanding the nature of trading and also the market cycle. The market already transition to sideways in to bullish wherein the proof is the current breakout of the bitcoin in the $29,000 - $30,000. What we should expect after what happened earlier? There is a high probability that the price will appreciate in these following days and weeks and we can also expect that some altcoins will go crazy momentum.I do not think that anyone has explained this any better than this. What you just said is so true and something that people need to learn a lot. Even when we are talking about long term, the reaction we are giving are different and should be considered that way. I personally have a situation where I get to invest whenever I want to, but that means I am not going to be able to do the same.For example, I buy a lot more when it is going down, and I mean a lot more, 10x more than usual, and when it is sideways I just buy a bit, a small amount, to keep it growing, and when it is going up I do not buy at all. That's how we should approach this thing without a doubt, that's how it is treated and makes a profit for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}