{
  "id": "topic_5478059",
  "title": "Thy7ace",
  "author": "Thy7ace",
  "created_time": "December 15, 2023, 09:16:01 PMLast edit: December 15, 2023, 09:33:57 PM by Thy7ace",
  "content": "This time around is more learning, less posting for me  but just want to drop this one.   Most of you are already familiar with this, many of Una don hear of those Moni platform make you deposit certain amount of money to get bigger amounts later.    For example dem go say make you deposit 10k to get 20k.And many pipo don fall as victims some  even go further to invest their school fees and house rent on d Moni platform wey go later crash with their  cash. Which have lead to alot of frustrations and sometimes losses of lives (suicide). Dem go pay for  certain periods of time to ginger pipo to invest more as dey invest dem go just closed the platform.    Why don't invest on Bitcoin, normally risk dey too we know! But that Moni platform Naim dey risky pass by far. Just jewelry buy your Btc store am for your paper wallet. Hold am for long because in a long run your profit sure and you'll be in a safer side.  Conclusions  : Please try your best to stay away from such scam projects  if you know you are having the mindset of investing in such, please remove such mindset Bcus the time e go burst customer care nor go answer you dem go run with your hard earn funds.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478059",
  "comments": [
    {
      "author": "Amphenomenon",
      "created_time": "December 15, 2023, 09:40:24 PM",
      "body": "The truth is any body that falls for this kind of scam are naive and greedy soul and most of us have had our share of such scam before waking up to reality that all that glitters is not gold buying and HODLing bitcoin is better than many investment plans though there are risk involves but the gains is far more. Also secured way of saving bitcoin is not only the use of paper wallet which has some risk of losing bitcoin and so much investors opt for hardware wallet which is currently the safest and having lesser risk of coin lost but in general you need to save your coins in a non-custodial wallet even if you are using desktop or mobile device avoid custodian wallets and Centralise Exchanges (not your keys not your wallet) . Some best bitcoin wallet for mobile and desktop devices are : Bluewallet, Wasabi wallet, Electrum and some others",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuclikk",
      "created_time": "December 15, 2023, 09:51:54 PM",
      "body": "Quote from: Thy7ace on December 15, 2023, 09:16:01 PM   For example dem go say make you deposit 10k to get 20k.And many pipo don fall as victims some  even go further to invest their school fees and house rent on d Moni platform wey go later crash with their  cash.Yes e better make we dey careful with the kind platform wey we dea invest. But on way or the other how person go risk his / her school fees for this kind thing and you know say if you no register for the semester you are not a member of the school, you will just be sent home. And you as a man of the house u go carry money go invest and whereby landlord dea, dey wait you, wetin landlord dea do nowadays be say first come first serve na Shi shi dea talk this kind yeye platform wey they carry people money run make we dea careful oo. Quote from: Thy7ace on December 15, 2023, 09:16:01 PM   Why don't invest on Bitcoin, normally risk dey too we know! But that Moni platform Naim dey risky pass by far. Just jewelry buy your Btc store am for your paper wallet. Hold am for long because in a long run your profit sure and you'll be in a safer side. BTC sweet for investment oo, but na long time investment na him go bring better com, but if you dea invest too try make sure say you don clear your necessary debt like school fees and house rent e.t.c because you dea carry money go invest in the sense you go end up with nothing na another danger you go fall into.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "December 15, 2023, 10:27:43 PM",
      "body": "They have scammed alot of my friends with such way before and the painful thing that I've been trying to convince dem in to  cryptocurrencies investment but most are saying there's still risk. Sometimes I will be like I wish  you know what you missing out on because dey get d money to invest and gain good profits but dey decide to waste am for stupid naira investment and before though I normally lose alot in this crypto space till I know this forum I con know d way to manage am. So lucky me e dey work well for me so thanks mate for d updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 15, 2023, 10:30:55 PM",
      "body": "When you see scam for someone eh easy to detect because we no need any spiritual eye to see say who they promise us Watin even bank no fit promise their customers as daily profit as profit that one alone nah enough reason to no trust those people, Watin dem wan carry the money way u give them do in less down that time way dem wan use refund you way go make them they profit way fit reach them to take hold their side come still pay you, if u see where dem say bring diz and get this my broda just japa no even allow the person finish. Talking about scam and how to escape am, hope say this thing way I they read and see online concern MMM being back no body for here go still they foolish enough to say them wan go give am try, because December don reach and people they fine means to carry level enter town some people go also use this means go back village reman their as result of them to they fine quick money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 16, 2023, 01:51:19 AM",
      "body": "Quote from: Thy7ace on December 15, 2023, 09:16:01 PM   For example dem go say make you deposit 10k to get 20k.And many pipo don fall as victims some  even go further to invest their school fees and house rent on d Moni platform wey go later crash with their  cash. Which have lead to alot of frustrations and sometimes losses of lives (suicide). Dem go pay for  certain periods of time to ginger pipo to invest more as dey invest dem go just closed the platform. I think wetting dey cause that thing na greediness or playing smart in the wrong direction. Those platform wey dey do all those things have the motive of defrauding people and Dem get time frame and e no dey pass 1 or 2 months. And if you wan make money from them na just the first time wey them go come wey Dem they find customer wey you go fit chop them, but when e don dey pass one month just comot your money because na go e don dey go. No be say I dey advice people on wetting no nice but I dey talk base on expirence. Because you fit take advantage of any opportunity be it good or bad depending on how smart you are. Those people just be like some memecoin wey Dem launch e go pump for sometimes come dump and na early investors go make money comot hand while late investors go fall victim.The advice I fit give people be say there is no free money anywhere. Because where and how ona think say them dey make there money wey you go invest 10k get 20k so when you see that kind offer, just run for safety except you wan try luck. One thing wey dey baffle me na how people dey ignorant to the extent of falling victim of ponzy scheme countless time. After mmm don come many other come but people dey always fall victim all because them wan make quick money. Quote from: Thy7ace on December 15, 2023, 09:16:01 PM   Why don't invest on Bitcoin, normally risk dey too we know! But that Moni platform Naim dey risky pass by far. Just jewelry buy your Btc store am for your paper wallet. Hold am for long because in a long run your profit sure and you'll be in a safer side. Normally most of them for like to invest on bitcoin but they even think say na Bitcoin naim be the real ponzy scheme. Because them dey hear say naim Yahoo boys dey use cash out due to misinformation.While some wey Dem don give information about bitcoin think say Bitcoin too slow for the kind money them dey expect due to impatient. The funny part be say some wey get money for bitcoin go sell am go invest for ponzy scheme they think say them go make quick money not ontil there money go dey traped before there eye go open. So make we dey always dey careful for investment we dey do because get rich quick scheme dey be like say na juju them dey use, where as na our greediness naim dey push us enter even say we know say e fit crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "December 16, 2023, 06:55:46 AM",
      "body": "People no go like learn lesson from others till themselves don fall victim, all those stuffs na ponzi scheme and must surely crash.I just dey 3 days ago na so one of my friend come send me this link for whatsap say make I go register den deposit money say every day I go dey earn Nine hundred Naira if I start with 3k, the higher the money you use start the higher your income omor I just react with laughing emoji him self confuse as e be say normally man need money and him don feel say na better update him share me na so I calm down talk to am say all this go crash very soon e no dey pass 2 to 3 months.Make we dey very careful no be everything we see we go rush put our money inside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "December 16, 2023, 08:34:04 AM",
      "body": "Na greed they make people dey go invest their hard earned money in those platforms. Sometimes I feel like lack of knowledge too dey cause all these things. Sometimes people fail to ask the question these people am investing my money with what are they dealing on that such profit will come in within a short period of time. Also the desire to get rich overnight is what makes lots of people involves themselves with these investment platforms that always crash. But one thing I have discovered is that most people have money to invest but lacks the opportunity on where to invest it. Not everyone is privileged to know Bitcoin investment as you and I does. Am sure no member of this Lb can fall victim of those platforms after the knowledge we are getting here everyday. The best way we can help some people is by sharing the knowledge we have with them and tell them to stay away from those ponzi schemes. We can tell them about Bitcoin and if they like the idea they can invest on it willingly without you forcing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 16, 2023, 06:21:47 PM",
      "body": "Quote from: Thy7ace on December 15, 2023, 09:16:01 PM   Why don't invest on Bitcoin, normally risk dey too we know! But that Moni platform Naim dey risky pass by far. Just jewelry buy your Btc store am for your paper wallet. Hold am for long because in a long run your profit sure and you'll be in a safer side. Bitcoin is also seen as a risky investment by some people but what differs it from all those money making platforms that ask you to deposit and get double of your amount is that it is decentralized and you’re the owner and holder of your own money. No any third party can come in between you both unless you let it lose and allow someone to have access to your money that you’ve saved in bitcoin. Bitcoin is different from all of them and it is better to invest in bitcoin that invest in them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "December 16, 2023, 07:55:57 PM",
      "body": "In 2016 to 2017 na only this business been dey reign well well for we naija. And people fall like mongus. Sometime when they deposit the 10k when it is their turn to receive payment everything Casablanca. And for a long period of time I have not seen this kind of Ponzi schemes again. Those Ponzi schemes are not working again everyone has known their format. Nobody nis doing those things again so there is no need to warn people again on that. Even scammers are bringing new formats and whatever format dey bring we dey detect am so they can't lure us to those ones again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "December 16, 2023, 08:56:59 PM",
      "body": "Normally this kind update Dem don full this forum, I been don even drop thread wey get same information, but anyway there is always I need for reminder for topics like this, person wey go fall for those kind of scam na greed cause am, because how you go put money come dey expect your fellow human being wey na still work e dey work to just double your moni like that, who does that. Even if na 50% just know say na better scam project be that, I don see my neighbor live wey been put moni for one agricultural investment something like this , the first on work well for am, em still do again Dem pay am, but the last one wey e come top em game naim Dem carry em money run till today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "December 16, 2023, 09:43:59 PM",
      "body": "I think we refer to this as ponzi scheme , this a scam that has trend for sometimes and it is a well known scam that many people have idea about.  If their are people who still fall for ponzi scam it will be so disappointing because by now I expect people to know that things like this does not work. Their is no place for people to earn free money without working for it, every ponzi  scheme that existed have always end up running with people money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "December 16, 2023, 09:51:06 PM",
      "body": "The simple truth is if everyone can accept the fact that there's no free money and learn how to work hard for more money the rate of scammers go reduce small, a lot of people dey borrow money just to gain more profit, let's just imagine if free money dey like that you believe say person go tell you or rather na their family members go first receive the good news and benefit, let's check those people that offer platforms like this how them resemble, are they super rich with car or what, I hate hearing things like this cause it sounds nonsense, I know of someone who borrowed money from working place, bank, and local places just to invest in one platform unknowingly to him the platform na fake when the news came to him he  fainted, just imagine the stress people are facing just because of the love of money, make we dey guided like e good make everybody dey wise to avoid such heartbreak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}