{
  "id": "topic_5447455",
  "title": "albon",
  "author": "albon",
  "created_time": "April 03, 2023, 08:34:54 PMLast edit: April 03, 2023, 09:35:20 PM by albon",
  "content": "مرحباً اخوتى الأعزاء,تفاجأت اليوم بهذا الخبر الذى أعتقدت انه خدعة إبريل لكن اليوم اصبح حقيقة بأن التويتر استحوز على عملة الدوجكوين وتم تحديث شعار تويتر القديم الذى استمر على تويتر لمدة 17 عام الى شعار الدوجكوين وهى عملة الميم الشهيرة التى كان إليون ماسك رجل الاعمال الشهير يقوم بالترويج لها بشكل مباشر وغير مباشر في تغريداته على مدار السنوات السابقة, فهل سيكون هذا الشعار الجديد لتويتر مؤقتاً ويعود الشعار القديم فى رئيكم؟ ايضاً فى ظل هذا الخبر إرتفع سعر الدوجكوين الى اكثر من27% اليوم وارتفع بشكل كبير فهى يتم تداولها الآن على 0.096 , رايكم بحركة تغير لوجو تويتر للوجو الدوجكوين هل حركة جيدة وبداية بول ماركت ام تلاعب واستغلال المجتمع؟ وماذا عن مستقبل عملة الميم هذه ما توقعاتكم اذا تم اعتمادها كوسيلة فى الدفع لتويتر؟[1] https://twitter.com/elonmusk/status/1642962756906418176",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447455",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "April 03, 2023, 09:19:50 PM",
      "body": "والله صراحة أنا تفاجأت بالخبر أخي، إيلون ماسك متعود دائما على المفاجأت والمغامرات المجنونة. أعتقد أن هذه الحركة ستشعل سعر دوجكوين من جديد وربما تصل لمستوياتها السابقة في البول ماركت السابق. ليس من الواضح بعد إذا كان هذا التغيير دائم أم مؤقت، لكنه بكل الأحوال سيشعل سعر العملة بشكل كبير وحسب رأيي هذا هو المطلوب، ربما يكون إيلون ماسك قد استحوذ على كميات خيالية من دوجكوين ويريد تصريفها الآن ليعوض الأموال التي أنفقها في صفقة تويتر. لكن شخصيا أستبعد أن يكون التغيير نهائي، لأن شعار تويتر يعتبر علامة تجارية عريقة جدا تساوي المليارات ولايمكن التضحية بها بهذه السهولة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 03, 2023, 11:58:09 PM",
      "body": "هي على الأغلب عملية تلاعب مثل ما عودنا الون ماسك.كان بإمكانه التلاعب بكل السوق بمجرد نشر بعض التغريدات (بعض الكلمات) فما بالك بما يستطيع القيام به الآن و هو يملك إحدى اكبر منصات التواصل و أكثرها تاثيرا على الرأي العام.تغيير شعار تويتر برأيي مغامرة كبيرة حتى و ان لم تستمر لفترة طويلة. من الصعب الحكم اذا كان هذا الشخص متهور جدا او ذكي جدا!فقط لا أعرف سبب تعلقه بعملة دودج رغم وجود مشاريع أخرى افضل منها بكثير؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aseemhamza",
      "created_time": "April 04, 2023, 12:12:48 AM",
      "body": "سيغيرها فى النهاية بعد فترة ويدعى أنه كان يمزح وأنها كانت عبارة عن كدبة أبريل",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "April 04, 2023, 02:38:11 PM",
      "body": "Quote from: khaled0111 on April 03, 2023, 11:58:09 PMهي على الأغلب عملية تلاعب مثل ما عودنا الون ماسك.كان بإمكانه التلاعب بكل السوق بمجرد نشر بعض التغريدات (بعض الكلمات) فما بالك بما يستطيع القيام به الآن و هو يملك إحدى اكبر منصات التواصل و أكثرها تاثيرا على الرأي العام.تغيير شعار تويتر برأيي مغامرة كبيرة حتى و ان لم تستمر لفترة طويلة. من الصعب الحكم اذا كان هذا الشخص متهور جدا او ذكي جدا!فقط لا أعرف سبب تعلقه بعملة دودج رغم وجود مشاريع أخرى افضل منها بكثير؟ Quote from: aseemhamza on April 04, 2023, 12:12:48 AMسيغيرها فى النهاية بعد فترة ويدعى أنه كان يمزح وأنها كانت عبارة عن كدبة أبريلبما انه لم يتم التصريح ان كان هذا التغيير دائما فان الامر على الاغلب لا يتجاوز كونه احدى شطحات الون ماسك التي عودنا بها. و التفسير الاقرب للتصور هو ان سلطات الرقابة الامريكية كانت قد رفعت ضده قضية تتهمه فيها بالابتزاز باستخدام حملة ترويجية لعملة دودج (جميعنا نتذكر تغريدات ماسك الداعمة دودج كوين). ومع ذلك ، قدم فريق ماسك القانوني التماسا لرفض الدعوى على أساس أن تغريداته كانت قانونية و ان ملف الادانة فارغ لانه لا قانون يمنعه من نشر تغريدات. و في نفس هذا المنطق فان قرار تغيير الشعار هو في نفس ذلك الاطار بحجة ان لا قانون يمنعه من استعمال شعار دودج بما ان عملة دودج تقريبا لامركزية بالكامل اي لا احد يمكن ان يشتكي من شيء. تماما مثل ان تستعمل شعار البيتكوين على موقعك فهذا لا يسمى سرقة حقوق فكرية او اي شيء. و من جهة اخرى فهي فرصة لالون ماسك لتحقيق ارباح جديدة بعد ان قفز سعر العملة 20 بالمائة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 04, 2023, 06:37:35 PMLast edit: May 14, 2023, 05:18:53 PM by yhiaali3",
      "body": "حتى على وسائل التواصل الاجتماعي الجميع يشك في نوايا إيلون ماسك، الجميع تقريبا متفق على أنه يقوم بالتلاعب. مثلا اليوم رأيت هذه التغريدة معبرة: ربما يكون هذا ما حدث بالفعل، بكل الأحوال لا يمكننا لومه بعد أن دفع المليارات لشراء تويتر، لو لم يكن يعلم أنه سيربح أضعاف مضاعفة لم يقم بهذه الصفقة الكبيرة، لذلك من الطبيعي أن يحاول الاستفادة من تويتر بأي طريقة بعد أن أصبح ملكه.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 06, 2023, 10:42:59 PM",
      "body": "اليوم إيلون المجنون يقوم بإعادة شعار تويتر الأصلي ويزيل شعر الدوج كوين مما تسبب في هبوط حاد للعملة إلى 0.085$ في هذه اللحظة. بالفعل هذا الرجل مجنون.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "April 07, 2023, 02:45:17 AM",
      "body": "Quote from: yhiaali3 on April 06, 2023, 10:42:59 PMاليوم إيلون المجنون يقوم بإعادة شعار تويتر الأصلي ويزيل شعر الدوج كوين مما تسبب في هبوط حاد للعملة إلى 0.085$ في هذه اللحظة. بالفعل هذا الرجل مجنون.لا ليس مجنونًا بل ذكياً أخي لقد قام بصنع كذبة أبريل من خلالها تمكن الكثير من المتداولين شراء عملة دوجوين طامحين في تحقيق عوائد مضاعفة لقد شهدنا في الأيام القليلة الماضية إرتفاع سعر العملة و ها نحن نرى هبوطها من جديد ربما سيكون أيلون المستفيد من هذه العملية لأنه يملك الكثير من هذه العملة لذا اعتقد في هذه المرحلة قام بالبيع و الشراء مرةً أخرى بسعر أقل و ظبط من جديد طريقة تؤثر على مسار سعر العملة و بهذا سيكون قد حقق أرباح",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "April 08, 2023, 02:21:39 PM",
      "body": "Quote from: Ulven on April 07, 2023, 02:45:17 AMQuote from: yhiaali3 on April 06, 2023, 10:42:59 PMاليوم إيلون المجنون يقوم بإعادة شعار تويتر الأصلي ويزيل شعر الدوج كوين مما تسبب في هبوط حاد للعملة إلى 0.085$ في هذه اللحظة. بالفعل هذا الرجل مجنون.لا ليس مجنونًا بل ذكياً أخي لقد قام بصنع كذبة أبريل من خلالها تمكن الكثير من المتداولين شراء عملة دوجوين طامحين في تحقيق عوائد مضاعفة لقد شهدنا في الأيام القليلة الماضية إرتفاع سعر العملة و ها نحن نرى هبوطها من جديد ربما سيكون أيلون المستفيد من هذه العملية لأنه يملك الكثير من هذه العملة لذا اعتقد في هذه المرحلة قام بالبيع و الشراء مرةً أخرى بسعر أقل و ظبط من جديد طريقة تؤثر على مسار سعر العملة و بهذا سيكون قد حقق أرباحلا اعرف ان كان يجوز ان نسمي هذا ذكاء بقدر ما يمكن اعتباره نوعا من التلاعب المقصود قائم على فكرة \"ايهام الناس بالربح\" من اجل تحقيق منافع شخصية. الاشكالية الوحيدة هي انه لا يمكن اثبات انه حقق ارباحا فعلا ليكون هناك ملف ادانة كامل الاركان. وحدها التحليلات المنطقية تقول ان ايلون ماسك لابد ان يكون حقق ارباحا طائلة خلال الايام القليلة الفارطة. و نفس تلك التحليلات تثبت ان تويتر تمر بازمة انقة تحت قيادة ماسك و انها لا تحقق عوائد و الا لما وجد مديرها التنفيذ لابداع الحيل.كما سبق و اشرت ان تويتر شركة خاسرة الى حد الان، و الان هناك دعوى قضائية ضد الوم ماسك على خلفية تغريداته بشأن تويتر السنة الماضية، اضف اليها الطفرة في مجال الذكاء الصناعي التي ستؤثر بالتأكيد على المحتوى الذي سيتم نشره.جميع التحليلات تشير الى ان السبيل الوحيد لانقاذ تويتر هو ان تحقق احدى مشاريع ماسك الاخرى ارباحا اكثر لتغطية نفقات تويتر و التمكن من اعادة هيكلتها وفق رؤية جديدة و هذا طبعا ليس ضمانا على نجاح الانقاذ و لكنها افضل المحاولات التي يمكن القيام بها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karam22",
      "created_time": "April 08, 2023, 05:53:43 PM",
      "body": "ايلون ماسك اعتقد انه يحب المزاح لو اراد التركيز في عمل مؤسسي جديد وهو قادر بامكانياته الجبارة يمكن ان يحقق في اي مجال يدخل ويستثمر به ان ينجح نجاح كبير .لكنه يحب ان يذكر اسمه اولا قبل عملة .وهذه وجه نظري فيه",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "April 08, 2023, 07:34:50 PM",
      "body": "Quote from: Kavelj22 on April 08, 2023, 02:21:39 PMQuote from: Ulven on April 07, 2023, 02:45:17 AMQuote from: yhiaali3 on April 06, 2023, 10:42:59 PMاليوم إيلون المجنون يقوم بإعادة شعار تويتر الأصلي ويزيل شعر الدوج كوين مما تسبب في هبوط حاد للعملة إلى 0.085$ في هذه اللحظة. بالفعل هذا الرجل مجنون.لا ليس مجنونًا بل ذكياً أخي لقد قام بصنع كذبة أبريل من خلالها تمكن الكثير من المتداولين شراء عملة دوجوين طامحين في تحقيق عوائد مضاعفة لقد شهدنا في الأيام القليلة الماضية إرتفاع سعر العملة و ها نحن نرى هبوطها من جديد ربما سيكون أيلون المستفيد من هذه العملية لأنه يملك الكثير من هذه العملة لذا اعتقد في هذه المرحلة قام بالبيع و الشراء مرةً أخرى بسعر أقل و ظبط من جديد طريقة تؤثر على مسار سعر العملة و بهذا سيكون قد حقق أرباحلا اعرف ان كان يجوز ان نسمي هذا ذكاء بقدر ما يمكن اعتباره نوعا من التلاعب المقصود قائم على فكرة \"ايهام الناس بالربح\" من اجل تحقيق منافع شخصية. الاشكالية الوحيدة هي انه لا يمكن اثبات انه حقق ارباحا فعلا ليكون هناك ملف ادانة كامل الاركان. وحدها التحليلات المنطقية تقول ان ايلون ماسك لابد ان يكون حقق ارباحا طائلة خلال الايام القليلة الفارطة. و نفس تلك التحليلات تثبت ان تويتر تمر بازمة انقة تحت قيادة ماسك و انها لا تحقق عوائد و الا لما وجد مديرها التنفيذ لابداع الحيل.كما سبق و اشرت ان تويتر شركة خاسرة الى حد الان، و الان هناك دعوى قضائية ضد الوم ماسك على خلفية تغريداته بشأن تويتر السنة الماضية، اضف اليها الطفرة في مجال الذكاء الصناعي التي ستؤثر بالتأكيد على المحتوى الذي سيتم نشره.جميع التحليلات تشير الى ان السبيل الوحيد لانقاذ تويتر هو ان تحقق احدى مشاريع ماسك الاخرى ارباحا اكثر لتغطية نفقات تويتر و التمكن من اعادة هيكلتها وفق رؤية جديدة و هذا طبعا ليس ضمانا على نجاح الانقاذ و لكنها افضل المحاولات التي يمكن القيام بها.فعلاً هذا ما قصدته بما أنه يستطيع التلاعب بمشاعر المتابعين فهذا يؤكد أنه ذكي جداً أخي، نعم هناك تراجع ملحوظ في أسهم شركة التويتر و لكن سخصية أيلون ماسك قادرة على العودة بالشركة إلى مكانها أو أكثر من ذلك الآن الشركة تمر بأزمة حقيقية و لكن لا نعلم متى تعود و ما هي الإجراءات التي سيتم إتخاذها في الفترات القادمة لعودة القطار إلى مساره الصحيح.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}