{
  "id": "topic_5415353",
  "title": "volsebnik007",
  "author": "volsebnik007",
  "created_time": "September 29, 2022, 01:09:11 PMLast edit: September 29, 2022, 01:54:27 PM by Xal0lex",
  "content": "Токен WEB5 сейчас стоит 0,001$, он увеличится до 0,01$ 1 октября 2022 года, после чего последует ещё 2 повышения до 0,10$ и 1$ к моменту запуска. (Апрель 2023) Web5 использует децентрализованные узлы для ретрансляции между браузерами на всехустройствах, а это означает, что вам больше никогда не придется использовать сторонние приложения.MASTERCARD одобрили этот проект, кто зарегистрируется в проекте Web5, получит РАБОТАЮЩУЮ карту Mastercard Debit, ваш баланс Web5 будет автоматически загружаться на карту, которую можно использовать в банкомате по всему миру и в Интернете с большинством розничных продавцов.Присоединяйтесь ПРЯМО СЕЙЧАС и получите 1000 WEB5 Token  https://www.web5project.ioНачисление БЕСПЛАТНЫХ токенов за каждого бесплатного реферала на 2 уровнях: Уровень 1: Заработайте 250 WEB5 Token за реферала! Уровень 2: Заработайте 100 WEB5 Token за реферала!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415353",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "September 29, 2022, 01:38:24 PMLast edit: September 29, 2022, 01:53:42 PM by Xal0lex",
      "body": "Ваша ссылка не реферальная, так зачем прятать адрес основного сайта? Почему просто не опубликовать его в нормальном виде? Тем более, ссылка не длинная https://www.web5project.io Зачем прятать ссылку за какими-то сервисами?UPDА если реферальная, то такие ссылки на форуме не приветствуются, тем более завуалированные с помощью сторонних сервисов. Прочтите инфо по поводу рефссылок Про реф. ссылки",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gradovalik",
      "created_time": "October 13, 2022, 10:38:14 AM",
      "body": "Настораживает еще то, что на сайте нет ни одной соц сети. Только на почту вот постоянно шлют письма с якобы всякими обновлениями)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}