{
  "id": "topic_5425826",
  "title": "CryptoGPU",
  "author": "CryptoGPU",
  "created_time": "December 05, 2022, 10:19:21 AMLast edit: December 05, 2022, 11:10:24 AM by CryptoGPU",
  "content": "\"On Nov. 15, 2022, a post was created on the forum website bitcointalk.org and the thread’s creator asked people to share signatures tied to some of their oldest mined bitcoin blocks. 11 days later, a newly created bitcointalk.org profile, called “Onesignature,” shared a signed message tethered to an extremely old block reward created on Jan. 19, 2009. The key was associated with bitcoin block 1,018 which was created 16 days after Satoshi Nakamoto launched the network.\"(source) https://news.bitcoin.com/an-unknown-individual-signed-a-message-associated-with-btc-block-1018-reward-was-minted-16-days-after-satoshi-launched-bitcoin/This signature is related to the project:old Bitcoin addresses as 'NFT' on the Bitcoin blockchain - a signature chain (https://bitcointalk.org/index.php?topic=5425241.0)They didn't mention it.If you want to discuss this project, please do it there.Here on this thread, it's about the January 2009 signature.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425826",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 05, 2022, 10:21:29 AM",
      "body": "Why referring to another site when everything was and has been on this forum, it would have been better to refer to it on this forum directly.Who has/had the oldest mined Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGPU",
      "created_time": "December 05, 2022, 10:30:18 AMLast edit: December 05, 2022, 10:48:37 AM by CryptoGPU",
      "body": "Quote from: Charles-Tim on December 05, 2022, 10:21:29 AMHere on this thread it's only about the story. Maybe people can tell something about it.Bitcoin Mysterious Miner Posts Oldest Signature: Is it Satoshi?(source) https://watcher.guru/news/bitcoin-mysterious-miner-posts-oldest-signature-is-it-satoshiThe Patoshi pattern is linked to Satoshi, but how can we be sure that Satoshi didn't mine with other computers that were not Patoshi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 05, 2022, 10:44:40 AMLast edit: December 07, 2022, 02:06:17 PM by franky1",
      "body": "topic creator is a user that has made alt accounts casinotester0001 and OneSignature who are the same person as CryptoGPU.. and this guy with the 3+ alt accounts has got the private key of the 2009 address which he got from someone recently and is falsely pretending to sell control/ownership of the 2009 used addressto casino:oh please casino/onesig.. stop making alt accounts trying to sell something no one actually gets to ownyour are foolishly spamming the forum trying to sell autographs(signed messages) thinking they have value when they dont.. and pretending that a chain of autographs is \"owning\" a famous historic address from 2009 when it is notplease stop your scheme. you got caughtgo make a different project that actually does something and has moral ethical value discovery in it of actual meaning and purpose.. or just stop edit to respond to below..its obvious you are the same person as casinotester.. you are just spamming the forum with new altcoins advertising casinotester accounts game while pretending you are not selling it.. even though you are advertising itjust stop spamming the forum with your subtle but worthless adverts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGPU",
      "created_time": "December 05, 2022, 11:03:35 AM",
      "body": "Quote from: franky1 on December 05, 2022, 10:44:40 AMI don't want to sell anything. On the other thread they're discussing the project. If you want to discuss the project, please do it there.Here you can tell what you know about this January 2009 signature and not about the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGPU",
      "created_time": "December 07, 2022, 12:48:20 PM",
      "body": "Chico Crypto checked it and found other clues:https://www.youtube.com/watch?v=F6USltJKuk4Satoshi Nakamoto Returns & Is ALIVE@franky1: please don't say that I'm Chico Crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 07, 2022, 01:14:52 PMLast edit: December 07, 2022, 02:07:26 PM by hZti",
      "body": "Quote from: CryptoGPU on December 07, 2022, 12:48:20 PMhttps://www.youtube.com/watch?v=F6USltJKuk4Satoshi Nakamoto Returns & Is ALIVEIf He is satoshi why doesnt he say it in the message? Seems not even the owner of the adress wants to pretend the BS that you spread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2022, 02:15:41 PMLast edit: December 07, 2022, 03:10:34 PM by franky1",
      "body": "looking at the casino guy (that is onesig) casino guy has been BUYING old used wallets/addresses for a whilecasino(onesig) is not satoshi. the original owner of the 2009 promoted address only had a wallet of addresses that DO NOT correspond to the satoshi pattern of mining(Patoshi Pattern (developed by Sergio Demain Lerner) )http://satoshiblocks.info/the address in question was mined as block 1018checking the pattern block 1018(green) was not mined by the satoshi pattern(blue)there were 5-7 defined 'lines' of nonce pattern meaning 5-7 people were mining on the day that the promoted address was mining(satoshi=blue dots up high)4-6 others=green dots and different colour lines showing their mining path)(.. the promoted address was mined on green dot of the other 6) checking a blockexplorer of the spending of the promoted address coins in 2011 also reveals other addresses that the same wallet controlled in 2009none of them were part of the satoshi patternin short satosh mined alot of coins and a few other people mined occassional blocks. and the addresses being promoted was not part of the satoshi stash",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGPU",
      "created_time": "December 07, 2022, 05:57:30 PM",
      "body": "Yes, this chart shows us how many machines mined these early days.Satoshi's 'Patoshi machine' mined 7/24 to let the network up (blue points) with a special software where the extraNonce increased after a block was found, therefore this different slope of the blue line. These mined blocks he did not transfer.And as you say correctly we can see that ~6 PCs mined at that time with the regular downloadable Bitcoin software. But that does not mean that Satoshi didn't mine with one (or more) other PCs running the regular software too.My opinion is that Satoshi mined with other PC(s) along with the Patoshi machine. And these Bitcoin he transferred and used.Quote from: franky1 on December 07, 2022, 02:15:41 PMlooking at the casino guy (that is onesig) casino guy has been BUYING old used wallets/addresses for a whileTo be honest, would you sell the private keys of an early address (like this one) if you mined back then? Yes, 2012 - 2013 private keys were sold to let the buyer claim other coins, but I haven't seen a 2009 key being sold.Quote from: franky1 on December 07, 2022, 02:15:41 PMcasino(onesig) is not satoshi. I think that too that casinotester is not Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2022, 10:03:54 PM",
      "body": "the other machines were not 24/7 they were popping in and out a few times a day satoshi was a 24/7 miner and debugger. thus separate peoplealso satoshis debugging and testing transactions in blocks and payments was only done from his one machine with the one list of satoshi stash addresses of the blue lineit makes no sense to turn on and off other machines randomly if youare not doing anything with them but mine. its more obviously that its random other people coming in and out each day but not really caring to be all day online",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "December 07, 2022, 10:31:43 PM",
      "body": "Quote from: CryptoGPU on December 05, 2022, 10:19:21 AM\"... a newly created bitcointalk.org profile, called “Onesignature,” shared a signed message tethered to an extremely old block reward created on Jan. 19, 2009. The key was associated with bitcoin block 1,018 which was created 16 days after Satoshi Nakamoto launched the network.\"Personally, I have no idea what the excitement is all about.Is it because someone still has access to a private key from 2009? Is it because that person may have been of the earliest miners?What makes this person so newsworthy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2022, 10:59:07 PM",
      "body": "Quote from: odolvlobo on December 07, 2022, 10:31:43 PMWhat makes this person so newsworthy?he is notusernames{casinotester0001, OneSignature, cryptoGPU, illusivereserve}are all one guy using alt accounts,  self promoting using alt accountsand then making several topics of the same pre-emptive advert for a ICO/new network scheme.. and then sending the links to crap coin media outlets to promote him further.its all silly business of a guy that is trying to scam other people by getting them to buy his autographs of children of previous autographer while pretending they are NFT ownership claims of a 2009 address without ever handing the keys over..he has no idea or clue of how value creation/price discovery works, nor the purpose or function of ownership transfer or NFT works nor how to protect a possible financial system from abuse.. its nonsense and the idiot doing so needs to stop and find another project that actually has purpose and solves a problem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}