{
  "id": "topic_5474994",
  "title": "kentrolla",
  "author": "kentrolla",
  "created_time": "November 22, 2023, 02:47:00 AM",
  "content": "There was a time people would trade unlimited in CoinDCX, Coinswitch and WazirX but since government started taxing every single trade many of them have migrated to exchanges like Binance, Kucoin and gate.io and even the trading volume from India has reduced greatly because Indian based exchanges had food UI and features like instant conversion from any pair to INR which is something Binance is trying to implement but what about the user database ? Have they stopped trading all together or still using any hack or trick to trade in these taxable exchanges?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474994",
  "comments": [
    {
      "author": "Bitcoin Smith",
      "created_time": "November 22, 2023, 05:00:34 AM",
      "body": "I am not using any exchange since the implmentation of taxation but when I want to convert INR then I go with Paxful now where TDS is not mandatory from many traders and also you no need to mark it as revenue from cryptos which is the loophole but if you are using indian based exchange like Wazirx or others then all the data will be shared with income tax so if you didn't pay your taxes then you may face legal issues later.I am not sure about the situation with Binance because its not operating from India also most of the Indian crypto users use Binance for their trades and only government knows that those users are paying their taxes or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 22, 2023, 06:40:30 AM",
      "body": "Quote from: Bitcoin Smith on November 22, 2023, 05:00:34 AMI am not sure about the situation with Binance because its not operating from India also most of the Indian crypto users use Binance for their trades and only government knows that those users are paying their taxes or not.Binance is gonna get rekt after the news of CZ getting arrested came out last night. I am now feeling that the SEC is acting like a frontman in extorting money from big exchanges in the name of fines. Last year they did the same thing with Kraken and as usual, Kraken did comply with them and paid the fine which was in billions of USD. This year they have again placed another fine on them and now it is Binance's turn. I think they should fight this in court rather than pay the SEC and settle it out of court.Coming back to the topic, I was using Binance earlier for its P2P service. I stopped when cases were coming up of scam money getting credited to the bank account from P2P merchants. I am now using a P2P exchange about which I have created a topic some time back on the local board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 22, 2023, 11:44:09 AM",
      "body": "Quote from: kentrolla on November 22, 2023, 02:47:00 AMThere was a time people would trade unlimited in CoinDCX, Coinswitch and WazirX but since government started taxing every single trade many of them have migrated to exchanges like Binance, Kucoin and gate.io and even the trading volume from India has reduced greatly because Indian based exchanges had food UI and features like instant conversion from any pair to INR which is something Binance is trying to implement but what about the user database ? Have they stopped trading all together or still using any hack or trick to trade in these taxable exchanges?I do not know how Binanca operates as I do not use that exchange. What I am aware of is that there are a lot of International P2P exchanges, which do not require KYC and have a decent amount of merchants to convert your crypto to INR. For trading purposes, I still prefer using a DEX or a centralized exchange like MEX. For me, Indian exchanges are a waste as they do not have pairs that generate potential high earnings. Another reason is using them would attract a good amount of tax and TDS. While I am okay with paying the tax, the TDS is unbearable as 1% for every trade is not an acceptable amount for any trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 22, 2023, 01:15:34 PM",
      "body": "Quote from: Bureau on November 22, 2023, 11:44:09 AMQuote from: kentrolla on November 22, 2023, 02:47:00 AMThere was a time people would trade unlimited in CoinDCX, Coinswitch and WazirX but since government started taxing every single trade many of them have migrated to exchanges like Binance, Kucoin and gate.io and even the trading volume from India has reduced greatly because Indian based exchanges had food UI and features like instant conversion from any pair to INR which is something Binance is trying to implement but what about the user database ? Have they stopped trading all together or still using any hack or trick to trade in these taxable exchanges?I do not know how Binanca operates as I do not use that exchange. What I am aware of is that there are a lot of International P2P exchanges, which do not require KYC and have a decent amount of merchants to convert your crypto to INR. For trading purposes, I still prefer using a DEX or a centralized exchange like MEX. For me, Indian exchanges are a waste as they do not have pairs that generate potential high earnings. Another reason is using them would attract a good amount of tax and TDS. While I am okay with paying the tax, the TDS is unbearable as 1% for every trade is not an acceptable amount for any trader.As far as my understanding Binance doesn't share the data with income tax or any regulator in India but we have seen bank account getting freezed due to some discrepancy in P2P transaction as you don't know if you are exchanging your token for Fiat with a scammer or a trader. My friend's bank account got freezed by cyber crime department stating the sender was part of online scammer. Yeah in echo your voice about taxing every trade as no one can bear it and it would be end of once theiving Indian crypto exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 22, 2023, 05:29:07 PM",
      "body": "I am currently not trading on any Indian exchange. I do trade on foreign exchanges in order to get the USDT<>BTC multiplication whenever bitcoin drops or rises but I am not selling for INR. I am worried about the taxation and unless the government makes some leninent moves with crypto I will continue like this because bitcoin is not the main source of earning for me, but a side earning.I will continue to use giftcards though, mostly for groceries and shopping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 22, 2023, 07:22:59 PM",
      "body": "Quote from: TheUltraElite on November 22, 2023, 05:29:07 PMI am currently not trading on any Indian exchange. I do trade on foreign exchanges in order to get the USDT<>BTC multiplication whenever bitcoin drops or rises but I am not selling for INR. I am worried about the taxation and unless the government makes some leninent moves with crypto I will continue like this because bitcoin is not the main source of earning for me, but a side earning.I will continue to use giftcards though, mostly for groceries and shopping.When will the government make it some bold decision.such as reducing the TDS and the tax is unknown. To be precise I don't think they will roll back as I have never head or read petrol prices, gas prices or general tax being reduced. It is either better to hold or use international exchanges in the meantime. Quote from: kentrolla on November 22, 2023, 01:15:34 PMAs far as my understanding Binance doesn't share the data with income tax or any regulator in India but we have seen bank account getting freezed due to some discrepancy in P2P transaction as you don't know if you are exchanging your token for Fiat with a scammer or a trader. My friend's bank account got freezed by cyber crime department stating the sender was part of online scammer. Yeah in echo your voice about taxing every trade as no one can bear it and it would be end of once theiving Indian crypto exchanges I doubt that Binance will not share data if asked by the government. CZ and his team will only bow down when they feel they might get shutdown in any country. India being the one of the second biggest investor hub on cryptocurrency after China as per my understanding can place a pressure on Binance to reveal the data of Indian users. You never know they might have already done it or in the process. My advice never take the government casually they can and they will get their money when they want to get it from a middle class individual like us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 23, 2023, 05:03:53 PM",
      "body": "Quote from: Bureau on November 22, 2023, 07:22:59 PMWhen will the government make it some bold decision.such as reducing the TDS and the tax is unknown. To be precise I don't think they will roll back as I have never head or read petrol prices, gas prices or general tax being reduced. It is either better to hold or use international exchanges in the meantime.  A group of crypto based companies are together forming a lobby to be the mouthpiece for the public and their own in front of the government's idiocy. Not a single politician is educated enough to be able to understand the \"c\" in cryptocurrency let alone discuss about its development from India. I hope that in future this lobby can persuade the government to get better regulations and taxation systems in process.Till then we are stuck in this cycle but all is not in vain, fingers crossed as always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 23, 2023, 06:33:51 PM",
      "body": "If I speak from the technical perspective, Indian cryptocurrency exchanges are quite good. Asop mention they have good UI instant conversion as well as same day bank settlement facilities. But 30% tax from the government has ruined their customer base. I have completely stopped using Indian exchanges since that 30% rule has came into effect. Another pain is the KYC requirement. So if you ask me what is my favourite Indian cryptocurrency exchange, I would say none!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "November 23, 2023, 06:49:41 PM",
      "body": "Quote from: kentrolla on November 22, 2023, 02:47:00 AM..... Indian based exchanges had food UI and features like instant conversion ...*Good UI you mean ? ZebPay is a good exchange but they stop exchanging all of a sudden sometimes. I will keep exchanging on BInance though I lost 7k INR while exchanging because someone bought crypto from me from a hacked account. When owner came to know , he complained in MoH and the money is still in Hold though I gave my bank every single detail .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 24, 2023, 02:39:11 PM",
      "body": "Quote from: CCMS on November 23, 2023, 06:49:41 PMQuote from: kentrolla on November 22, 2023, 02:47:00 AM..... Indian based exchanges had food UI and features like instant conversion ...*Good UI you mean ? ZebPay is a good exchange but they stop exchanging all of a sudden sometimes. I will keep exchanging on BInance though I lost 7k INR while exchanging because someone bought crypto from me from a hacked account. When owner came to know , he complained in MoH and the money is still in Hold though I gave my bank every single detail.Good UI and instant credit doesn't mean anything in today's time. We are living in a time when every paisa that we earn is being taxed by the government. It is a time when we should stop counting the problems and find a solution.Considering the way we were born we never thought we might end up in such complex environment. Let's stay focused with our goal and become financially independent unless you feel it not worthy for materialistic goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "November 24, 2023, 03:22:15 PM",
      "body": "QuoteLet's stay focused with our goal and become financially independent unless you feel it not worthy for materialistic goal.It looks like the money you earn is never enough. What do you think about money system? Early days when you could exchange food for money were better?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 24, 2023, 04:50:59 PM",
      "body": "Quote from: CCMS on November 23, 2023, 06:49:41 PM*Good UI you mean ? ZebPay is a good exchange but they stop exchanging all of a sudden sometimes.  I remember installing ZebPay on my devices and hoping to make an account a few years back and then one fine morning I find out that they have stopped their services in India. Before that Benson Samuel's exchange was also running well before it also shut down.QuoteI will keep exchanging on BInance though I lost 7k INR while exchanging because someone bought crypto from me from a hacked account. When owner came to know , he complained in MoH and the money is still in Hold though I gave my bank every single detail . Could you tell us more about this event in detail in a separate thread under \"Buyer/Seller Reputation\"? Maybe the information could help some fellow Indian member from losing money in a similar manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "November 25, 2023, 06:46:33 PM",
      "body": "I recently transfered around INR3000 via bank transfer from wazirx without any issue and transaction was very fast in INR arrived in 1-2sec. I don't know about sending big figures.On fee detail section on wazirx there is written:\"From 1 July 2022, TDS (Tax Deducted at Source) of 1% (5% in exceptional cases) of the trade value will be deducted on each trade as per the Government’s guidelines issued on Virtual Digital Asset (VDA) transfers. This TDS can be claimed while filing your ITR.\"Means we need to claim this TDS and 30% tax while filing ITR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 27, 2023, 12:48:39 PMLast edit: November 27, 2023, 01:01:46 PM by libert19",
      "body": "Quote from: kentrolla on November 22, 2023, 01:15:34 PMwe have seen bank account getting freezed due to some discrepancy in P2P transaction as you don't know if you are exchanging your token for Fiat with a scammer or a trader. My friend's bank account got freezed by cyber crime department stating the sender was part of online scammer. Same happened to me years ago during blanket ban of RBI, I used p2p exchanges to convert to INR back then. I received the money, gave confirmation that I received money, after about a week, money was chargebacked. Quote from: cafter on November 25, 2023, 06:46:33 PMI recently transfered around INR3000 via bank transfer from wazirx without any issue and transaction was very fast in INR arrived in 1-2sec. I don't know about sending big figures.On fee detail section on wazirx there is written:\"From 1 July 2022, TDS (Tax Deducted at Source) of 1% (5% in exceptional cases) of the trade value will be deducted on each trade as per the Government’s guidelines issued on Virtual Digital Asset (VDA) transfers. This TDS can be claimed while filing your ITR.\"Means we need to claim this TDS and 30% tax while filing ITR.You can use colodax to save on tds [1]. Ganesh chaturthi offer still live. [1] https://colodax.freshdesk.com/support/solutions/articles/47001229074-ganesh-chaturthi-offer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "November 27, 2023, 06:18:15 PM",
      "body": "Quote from: TheUltraElite on November 24, 2023, 04:50:59 PMseparate thread under \"Buyer/Seller Reputation\"? ...... As requested by you, I have created a detailed topic and now you know what not to do !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}