{
  "id": "topic_5274302",
  "title": "hangash",
  "author": "hangash",
  "created_time": "September 08, 2020, 06:31:16 AM",
  "content": "Hi, im the real owner of the bitcoin wallets1FeexV6bAHb8ybZjqQMjJrcCrHGW9sb6uF12ib7dApVFvg82TXKycWBNpN8kFyiAN1dr 12tkqA9xSoowkzoERHMWNKsTey55YEBqkvJUST wanted to let you guys know that..The story goes I lost my account information and keys and phrasesMy computer was water damaged that hosted 12ibIf you notice 12tk and 12ib in value almost match 1feeI was going to buy another wallet that matched 12tk and 12ib in 1 wallet but decided to spend alittle more and ended up with what fee is today... I mean who doesn't love bitcoin that much and look whats its become today. If your wondering why I haven't logged in or used my accounts for so long its nothing more than the computers that hosted my accounts are fried and I didn't keep any backups as I was 18years old/19 years old when I bought these accounts.. If anyone from blockchain or bitcoin could get in touch with me that would be perfect so I can get access into my accounts again, im officially tired of them popping up as \"unclaimed\" and other people claiming these coins are theres to scam people... its a terrible thing to do and very illegal... Anyway have a good time guys thanks for liking my accounts and please feel free to comment... Thanks for all the donations also!! I really have been making good efforts to get back into my accounts lately now that bitcoin has skyrocketed to a reasonable 10,000$ a coin which I always invisioned since I first purchased these accounts.. ALSO one more thing, these are truly my accounts, not stolen from mtgox and not unclaimed and not tied to anything else... there is a lot of skepticism and rumours about my accounts but let it be known that as the days go by im getting closer and closer to accessing my long lost funds and WOW what a long journey its been since I purchased these haha! I will say 10 years flies when your having fun watching your money grow. I hope all you other bitcoin investors are doing as well as I and may you guys have a wonderful rest of your Labor Day.~Anonymous!~P.S. these accounts are too valuable to not be accessible again that doesn't make sense nor is correct. Far too much money to go missing and I must say I've been dealing with quite a lot since getting in contact with blockchain and bitcoin over recovering my accounts... Not the best experience and I still am yet to gain access to my accounts.. Quite the shame. Maybe after reading this message something or someone will figure out how to help me from blockchain. Thanks Again and LET ME INTO MY ACCOUNTS IM TIRED OF WAITING!! ITS LIKE CHRISTMAS WITH NO PRESENTS HAHA!!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5274302",
  "comments": [
    {
      "author": "YOSHIE",
      "created_time": "September 08, 2020, 07:07:41 AM",
      "body": "Quote from: hangash on September 08, 2020, 06:31:16 AMHi, im the real owner of the bitcoin wallets1FeexV6bAHb8ybZjqQMjJrcCrHGW9sb6uF12ib7dApVFvg82TXKycWBNpN8kFyiAN1dr 12tkqA9xSoowkzoERHMWNKsTey55YEBqkvI'm not saying anything bad happened to you.It's ironic if you claim the above BTC address, you own it.Nothing has fallen into the new drama that you verified.And how about all this, what a joke that ever happened here.Quote from: nutildah on June 13, 2020, 10:55:59 AMThe address in question: 1FeexV6bAHb8ybZjqQMjJrcCrHGW9sb6uFLink: https://bitcointalk.org/index.php?topic=5256425.msg54640831#msg54640831Link: https://bitcointalk.org/index.php?topic=5250960.msg54609711#msg54609711Link: https://bitcointalk.org/index.php?topic=905254.msg52596884#msg52596884Link: https://bitcointalk.org/index.php?topic=5241792.msg54258228#msg54258228",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 08, 2020, 07:09:48 AM",
      "body": "Quote from: hangash on September 08, 2020, 06:31:16 AMIf anyone from blockchain or bitcoin could get in touch with me that would be perfect so I can get access into my accounts againwhen you say \"from blockchain\" you mean blockchain.com(.info) web wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hangash",
      "created_time": "September 08, 2020, 07:23:56 AM",
      "body": "In response to pooya87- Yes this is a large amount of money and lots of fakes claiming they own my accounts or can help me recover them for a fee, not interested.In response to YOSHIE- HAAA!!! What a joke, this guys clearly like mentioned above, another fake/scammer trying to claim up on someone else's intermittent issues of not being able to log in... Skies the limit with scammers these days.Im still amazed at how much attention my accounts have received over the past years and am in disbelief I have come so far with these accounts, my goal was 10,000$ a bitcoin when I first purchased any bitcoin period and here we stand as bitcoin wallet holders in 2020 and wow was I correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 08, 2020, 07:47:47 AM",
      "body": "Quote from: hangash on September 08, 2020, 06:31:16 AMHi, im the real owner of the bitcoin walletsYou know that ownership has to be proven, right?If you don't have account info or even better the private keys, I'm not sure who can help you.About blockchain.com, if you have been using their services for those wallets, you can try their support (although imho your chances are nearly 0). And this would mean that you can prove you had an account there and they will provide you your private keys or a working account.\"Anyone from bitcoin\" clearly cannot help you. That's is not a private company and the only way to access those funds is if you have the private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 08, 2020, 07:48:56 AM",
      "body": "Quote from: hangash on September 08, 2020, 07:23:56 AMSkies the limit with scammers these days.Hello, whoever comes here can say the same thing as you, that is mine.By risking a beginner account as the spearhead, man, your known this forum since 2017, where have you been, did it have an impact on the pandemic, so this joke was made.All the members on this forum talking about that address have run out of wits, to investigate that BTC address, now you wake up, funny, funny, very funny, toast.(🍺).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hangash",
      "created_time": "September 08, 2020, 07:57:41 AM",
      "body": "Ive been on this forum since 2010. My old SN SmokeTooMuch  isn't logging in right now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 08, 2020, 07:57:52 AM",
      "body": "Supposing that the story is true, I don't understand how people can put such a huge amount of eggs in one basket. We see it frequently, people claiming that they have a lot of BTC that they had in one wallet.If I had just one million, not one billion, just one million, I would have it in three or four different wallets and not more than one would be a web wallet. I would have the keys hidden in different places as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 08, 2020, 08:08:44 AM",
      "body": "Quote from: Lorence.xD on September 08, 2020, 08:04:35 AMQuote from: Poker Player on September 08, 2020, 07:57:52 AMSupposing that the story is true, I don't understand how people can put such a huge amount of eggs in one basket. We see it frequently, people claiming that they have a lot of BTC that they had in one wallet.If I had just one million, not one billion, just one million, I would have it in three or four different wallets and not more than one would be a web wallet. I would have the keys hidden in different places as well.OP has three addresses, is that not enough? This is a lesson learned for me because this could be me if I am not careful with my wallets, hope you can claim them and give us an update if you can.He has three addresses in Blockchain web wallet, which is as having one. Someone more sensible would have one there, another in a Trezor and another in a Ledger Nano. Most importantly, he would have the keys safely stored in different places, but he is saying he was 18 at the time so it's not so surprising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "grabpopcorn536",
      "created_time": "September 08, 2020, 08:42:50 AM",
      "body": "Sadly, someone who has a lot of bitcoins like you don't have a love for bitcoins. I hope you get your money back soon, but please continue to keep your bitcoins and not sell them as soon as your account is active again. Currently, there are a lot of people who are losing money and want to get back the money they lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "September 08, 2020, 08:57:33 AM",
      "body": "Quote from: @Abdul10012 on September 08, 2020, 07:55:31 AMI will though curse you if you market sell all of thatSee this? You better not lying or a curse will be lift up.Quote from: hangash on September 08, 2020, 07:57:41 AMIve been on this forum since 2010. My old SN SmokeTooMuch  isn't logging in right nowCould you still login on it by now because you were active last Feb 2020, I suppose this doesn't happen just recently, am I right? By the way, judging from the writing style of you (\"SmokeTooMuch\" really wannabe) and the real SmokeTooMuch there's really some discrepancies. Nice try though but I'll help that your real address is this 1Q9bTRCFWXBFXHVjXnpK3CebRSEU6hbb5D from your profile.I'd be damned not having some backups of PKs or have it on some cold wallets having that huge amount of bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 08, 2020, 09:08:36 AM",
      "body": "Quote from: hangash on September 08, 2020, 07:23:56 AMIn response to pooya87- Yes this is a large amount of money and lots of fakes claiming they own my accounts or can help me recover them for a fee, not interested.for your information, blockchain.info (which is not using .com) didn't exist when the first address received its first transaction. the company was created more than a year later",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 08, 2020, 09:23:21 AM",
      "body": "Quote from: pooya87 on September 08, 2020, 09:08:36 AMfor your information, blockchain.info (which is not using .com) didn't exist when the first address received its first transaction. the company was created more than a year later I doubt the OP cares too much about it, because he doesn't say he created those accounts himself anyway, but that he bought them :Quote from: hangash on September 08, 2020, 06:31:16 AMAnyway have a good time guys thanks for liking my accounts and please feel free to comment... Thanks for all the donations also!! I really have been making good efforts to get back into my accounts lately now that bitcoin has skyrocketed to a reasonable 10,000$ a coin which I always invisioned since I first purchased these accounts...I have also seen many millionaires on this forum claiming to have locked crypto wallets that they cannot access, but also that each of them is asking for donations - I do not believe this is a coincidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 08, 2020, 09:54:02 AM",
      "body": "Quote from: pooya87 on September 08, 2020, 09:08:36 AMfor your information, blockchain.info (which is not using .com) didn't exist when the first address received its first transaction. the company was created more than a year later Quote from: Lucius on September 08, 2020, 09:23:21 AMI have also seen many millionaires on this forum claiming to have locked crypto wallets that they cannot access, but also that each of them is asking for donations - I do not believe this is a coincidence.It doesn't smell good. In addition, OP's password was changed recently. It smells like a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xembin",
      "created_time": "September 08, 2020, 10:52:02 AM",
      "body": "I think, if you still have all The details of your bitcoin address with you, very easy to claim your money back. Next time don't put all  your money in one wallet in case something good or bad happen to you, you  can easily claim them back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "welovedcrypto",
      "created_time": "September 08, 2020, 10:55:28 AM",
      "body": "So you had millions of dollars in Bitcoin and you didn't even tried to contact pro or experience developer or hacker to crack wallet. You should do this deal offline instead of online so you can know whith whom you are dealing.BTW it is still hard to believe that you had this much amount of Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "September 08, 2020, 11:16:21 AM",
      "body": "QuoteI haven't logged in or used my accounts for so long its nothing more than the computers that hosted my accounts are fried and I didn't keep any backups as I was 18years old/19 years old when I bought these accounts.. I don't understand.You bought theses accounts,or you bought the Bitcoins in the accounts?From where have you bought those Bitcoins and what was the Bitcoin price when you bought them?QuoteIf anyone from blockchain or bitcoin could get in touch with meBitcoin isn't a company so nobody can \"get in touch\" with you.Blockchain.com has customer support,but you will have to provide your private keys,which you don't have,so they can't help you.Anyway,assuming you are the real owner of those BTC,I guess that this is one of the many horror stories of early adopters,who lost their Bitcoins due to damaged computers,forgotten passwords and keys and BTC sent to the wrong address.Yeah,that sucks,but nobody can help you.You could hire someone to crack the passwords/keys,but this will take 1 million years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SomeJasonGuy",
      "created_time": "September 08, 2020, 11:30:36 AM",
      "body": "Quote from: NeuroticFish on September 08, 2020, 07:47:47 AMQuote from: hangash on September 08, 2020, 06:31:16 AMHi, im the real owner of the bitcoin walletsYou know that ownership has to be proven, right?If you don't have account info or even better the private keys, I'm not sure who can help you.About blockchain.com, if you have been using their services for those wallets, you can try their support (although imho your chances are nearly 0). And this would mean that you can prove you had an account there and they will provide you your private keys or a working account.\"Anyone from bitcoin\" clearly cannot help you. That's is not a private company and the only way to access those funds is if you have the private keys.A common mistake a lot of folks make is that they don't take the adequate precautions when it comes to securing their funds. A small amount of study and understanding is required when it comes to storing funds securely before getting all hyped up about bitcoin. Sadly, there's no end in sight for such occurrences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "September 08, 2020, 12:08:04 PM",
      "body": "Please stop making lies in here. What @Yoshie said https://bitcointalk.org/index.php?topic=5274302.msg55153996#msg55153996 is enough for us to think that the owner of this wallet is not you actually. And then you have asked us for some donation and send to the wallet that you have no control over it? How can you make withdrawals with those instances? Maybe only a stupid person will buy this drama and make such donations. You'd likely to make us a fool and I don't think that you will win for this. Sorry if it hurts you, but this what I can say, and I hope it was clear for you to understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "July 20, 2021, 12:39:34 AM",
      "body": "Archived for future reference: [1a]Quote from: doubletoptrader on July 20, 2021, 12:33:44 AMAddress: 1FeexV6pL37DdCnFcRysjEXSnJkzkKAqfU - Send 0.005 BTC to this hash to break it's virginity!PrivKey:  5KWyL3bQ2nFcXhgZkXMmk62DRrVSc8YCS1Beware the above wallet address is a feeble attempt to impersonate the real wallet address as quoted below and made by the OP of the thread.Quote from: hangash on September 08, 2020, 06:31:16 AMHi, im the real owner of the bitcoin wallets1FeexV6bAHb8ybZjqQMjJrcCrHGW9sb6uF12ib7dApVFvg82TXKycWBNpN8kFyiAN1dr 12tkqA9xSoowkzoERHMWNKsTey55YEBqkvIf you send any funds to *any* of these wallet addresses, then you WILL loose your crypto and have no chance of recovering any funds _ever_",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}