{
  "id": "topic_5423640",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "November 27, 2022, 06:59:13 AMLast edit: November 27, 2022, 07:22:38 AM by tech30338",
  "content": "I have been wondering how you guys secure your network from the ground up, from internet connection computer, and wallets here is how I do it, since I saw others experience loss funds and more encryption of files and need to pay in bitcoin or other altcoins just to reclaim their possession, I have decided to not 100% safe but to have a bit of ease think I have protection, we all know that connecting your wallets other network is one of the easy way or scheme for your assets to get stolen like in my previous post where my friends funds are getting transfer to hackers wallet ill post the link here so that it may help you if you experience this issue, it may or not help you but better share this:https://bitcointalk.org/index.php?topic=5423200.msg61349625#msg61349625Here is how i protected my network since all is going to pass here I have created a network firewall no expenses are use only a pc and its an opensource and securing and setup are guides by other people with the same setup, you can also use virtual machine if you wantblock pop ups this are links that where very suspicious links like an exchanges or a site, also blockThis one are most common, even though your not going there maybe some of people connected to the network might go in here, as experience before, porn sites can make your pc infected with viruses that put your assets and computer in riskAntivirus some people ignore this and sometimes my clients saw a popup that the site or file he/she are about to open are infected but ignores itTry opensource operating system like ubuntu, centos, etc., not only they use less resources windows virus sometimes not work or run in them, well mostly they don't. Note: I'm not saying they are 100% safe but since i use ubuntu and centos never experience anythingAvoid connecting your wallet to networks that are given to telegram double check the legitimacy of the poster first, but to be sure do not entertain personal message for someone saying you'll get rich or saying he get rich its all lie and they are just baiting.Never just click links from someone, even with your friends, because this days accounts that are hack were use to pretend that your friend send the message and when you click the link, they will now full access of things in your pc something like that.I know some can't use my setup, so my personal recommendation, is just make sure to check everything before opening or connecting, always use antivirus, avoid links from emails from unknown or known people, just what i said above.Hoping that everyone who has almost the same or better will be able to share so that we can improve or use your ways, because the top priority of everyone is always save assets away from hackers, i know everyone have better ways hoping we will be able to share even small info is much appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423640",
  "comments": [
    {
      "author": "PrivacyG",
      "created_time": "November 28, 2022, 04:02:19 PM",
      "body": "If you are accessing all sorts of weird links and websites, it is very advisable you move your funds over to a device that is only going to be used for this purpose.  If you mix up Cryptocurrency and all these unknown websites, chances are you will end up with an empty wallet and an infected device.Do you have an old computer or laptop?  Use that just for Cryptocurrency activity.  Separate risk from your assets as much as you can.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "November 28, 2022, 10:39:40 PM",
      "body": "Quote from: tech30338 on November 27, 2022, 06:59:13 AMHere is how i protected my network since all is going to pass here I have created a network firewall no expenses are use only a pc and its an opensource and securing and setup are guides by other people with the same setup, you can also use virtual machine if you wantblock pop ups this are links that where very suspicious links like an exchanges or a site, also blockThis one are most common, even though your not going there maybe some of people connected to the network might go in here, as experience before, porn sites can make your pc infected with viruses that put your assets and computer in riskAntivirus some people ignore this and sometimes my clients saw a popup that the site or file he/she are about to open are infected but ignores itTry opensource operating system like ubuntu, centos, etc., not only they use less resources windows virus sometimes not work or run in them, well mostly they don't. Note: I'm not saying they are 100% safe but since i use ubuntu and centos never experience anythingAvoid connecting your wallet to networks that are given to telegram double check the legitimacy of the poster first, but to be sure do not entertain personal message for someone saying you'll get rich or saying he get rich its all lie and they are just baiting.Never just click links from someone, even with your friends, because this days accounts that are hack were use to pretend that your friend send the message and when you click the link, they will now full access of things in your pc something like that.Your experience summarizes all the practical steps that any Internet user must master to ensure safe surfing, while always being careful to follow up on forwarded updates and news.In terms of preserving and using crypto savings, the best solution is to use a hardware wallet for storage, use an offline computer to sign transactions, and then broadcast on a connected device. Unfortunately, not all networks provide this possibility, but most of them and the important ones provide this feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 28, 2022, 11:59:22 PM",
      "body": "For almost 5 years already here in this space. I've never been experienced of hacking/scams. Either my emails, any kind of accounts and especially crypto wallets, never been. Always been cautious of everything what i did up this year and still keep following that practice of security and privacy since then. That... - double check links, hover anchor text before actually clicking it.- never click unknown/suspicious links, - always use 2fa, - use hardware wallet if you afford (well, anyone here can afford for a $60 hardware wallet imo).- read and learn what are the latest scams, then think/read on how to avoid then- buying premium anti-virus helps- if it's too good to be true, it actually it is.- then repeat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 29, 2022, 03:13:03 AM",
      "body": "Protect your device from Internet exposure- Don't use public Wifi at public locations like McDonald, KFC, Highlands, ...- Buying and using good Internet Security softwares. Don't try to save a little bit money and use free softwares that have some limited features for you. It's worse if you use cracked softwares that can contain hazardous elements inside.Protect your capital with good wallets- Non custodial- Open source- Use strong password for your wallet file- Always make backups and make sure backups are usable- Store your backups safelyIt's important to hide what you are doing. I mean you should never tell others that you are a cryptocurrency investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 29, 2022, 07:00:02 AM",
      "body": "Quote from: BlackBoss_ on November 29, 2022, 03:13:03 AMBuying and using good Internet Security softwares. Don't try to save a little bit money and use free softwares that have some limited features for you. It's worse if you use cracked softwares that can contain hazardous elements inside.Are you talking about those anti-virus/malware apps with online protection or something similar? While this is not a bad idea, we can also stop relying on such software if the purpose is just to protect ourselves from visiting or downloading a fake app. Most wallets or crypto software usually have a hash that you can verify to check if the files are legit or not, some anti-virus even flagged them as software instead (false positive). By all means, buy them if you can and want to do it, but don't stress over them, and just learn to be more cautious instead if you can't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 29, 2022, 07:03:58 AM",
      "body": "In all, it is good to always keep in mind that cold storage is a safer option, having and protecting an online wallet is what it is worth for small amount of bitcoin, if having large amount of coin, better just go for a cold storage wallet or a hardware wallet while still being conscious of attacks and avoid them.These are good links to avoiding online attacks: Good topics on security and privacy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 29, 2022, 07:39:52 AM",
      "body": "In crypto there are lots of potential threat to security and breach. The main thing to do on protecting your asset is through careful execution of its owner. They have mentioned already how to deal with it like using non custodial wallet, avoid links of phishing and spam messages. These can be avoid if you dont have the desire to earn easy money or free money cause chances that they are fake are real.Hackers are getting smarter each time and if we keep feeding on them then there are times that crypto industry will be just flagged as scam grounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ice18",
      "created_time": "November 29, 2022, 02:21:35 PM",
      "body": "One way I usually do after I use my PC is to securely save my wallets in my portable hdd and usb since I have no hardware wallets at the moment after I lost it a year ago, this is one of the best way to keep your crypto files from hackers or whatever links that steals your data in your PC, just erase all your saved wallets in your storage that use to connect to internet and your safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 29, 2022, 03:04:40 PM",
      "body": "Quote from: ice18 on November 29, 2022, 02:21:35 PMOne way I usually do after I use my PC is to securely save my wallets in my portable hdd and usb since I have no hardware wallets at the moment after I lost it a year ago, this is one of the best way to keep your crypto files from hackers or whatever links that steals your data in your PC, just erase all your saved wallets in your storage that use to connect to internet and your safe. It is true that such files are safer if you store them offline, but at some point you will use them again on your computer that has access to the internet, right? In that case, you should still be extremely careful in terms of which websites you visit and what files you download - because the malware will not leave your computer if it finds nothing, but will wait until you make a wrong move.Lost your HW? So how can this happen if we know that such a device should be stored in a special way, it is not something that you carry in your pocket like a wallet or keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}