{
  "id": "topic_5434326",
  "title": "Myleschetty",
  "author": "Myleschetty",
  "created_time": "January 11, 2023, 09:47:46 PM",
  "content": "El Salvador Adopts Law to Support \"Volcano Bond\". In the Legislative Assembly, the digital asset bill received 62 yes votes and 16 no votes and this law will create a regulatory framework for Bitcoin and all cryptocurrencies in El Salvador.After this news broke, I think we should expect more bullish trend in the market for now.What is your opinion?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434326",
  "comments": [
    {
      "author": "Chrlie95",
      "created_time": "January 11, 2023, 11:43:35 PM",
      "body": "This is huge news for crypto! El Salvador adopting a law to support Bitcoin and other digital currencies is a huge step in the right direction for mainstream acceptance. It will be interesting to see how this \"Volcano Bond\" plays out and the impact it has on the market. I hope to see similar steps from other governments...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 12, 2023, 12:09:10 AM",
      "body": "i find it weird that for the 6 months of 2022 where alot of \"shorters\" were then doing deals and bets. to hold the price at under $17k. which allowed 6 months of buying cheap coins ..but, this legislation only passes now the ankle cuffs are removed and the price can rise again(somewhat)i hope he took the initiative and bought 60k coins below $17k so he can instantly reap the benefits now that bitcoins price is not as shackled as it wasim all for people buying at whatever price they want above value. but when there was a great opportunity for a country to invest. seems like they wasted a few months waiting out for something that made them lose the best deal they could get 2022+",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "January 12, 2023, 01:11:13 AM",
      "body": "Quote from: Myleschetty on January 11, 2023, 09:47:46 PMEl Salvador Adopts Law to Support \"Volcano Bond\". In the Legislative Assembly, the digital asset bill received 62 yes votes and 16 no votes and this law will create a regulatory framework for Bitcoin and all cryptocurrencies in El Salvador.After this news broke, I think we should expect more bullish trend in the market for now.What is your opinion?For those who are interested to read, here's the link,https://www.coindesk.com/policy/2023/01/11/el-salvador-passes-law-paving-the-way-for-volcano-bonds/QuoteAlthough initially planned for March 2022, the bond issuance had to be postponed several times, mostly due to last year's brutal bitcoin bear market. The digital assets bill was finally introduced in the Legislative Assembly at the end of November 2022, where Bukele's party, Nuevas Ideas, has a large majority. Sixty-two legislators voted for the law today, and 16 voted against.Maybe this is one reason why the price is going up in the last 24 hours? it's now climbing above $18k.So yeah, this could be a welcoming news for everyone. And again, El Salvador never ceases to amaze us with this bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pesona1",
      "created_time": "January 12, 2023, 01:36:23 AM",
      "body": "El Salvador became the first country to fully adopt bitcoin and they have become a haven for bitcoin users today, with this law El Salvador has shown the world that they still continue to believe in bitcoin even though the crypto market is down, I think the goal president Bukelele implemented the law to further reinforce their commitment to making bitcoin the foundation of their country financial economy, besides that the existence of this law will make it easier for both national and private investors to continue to invest in the country and it is clear that this will make El Salvador economy even better in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 12, 2023, 01:39:29 AM",
      "body": "Bitcoin-backed bond aka Volcano bond is not interesting for me.If you want Bitcoin, buy Bitcoin.Don't considering to buy Wrapped Bitcoin tokens or Bitcoin-backed bond.GBTC from Grayscale is not safe.If El Salvador go with their national bankruptcy, how will their bond investors can get their initial capital?It is more correct to call their bond as El-Salvador-backed bond, not Bitcoin-backed bond.The country has very high Government Debt to GDPGovernment debt to GDPIt's more than 84%. Will they be fine next few years?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "January 12, 2023, 02:02:21 AM",
      "body": "Quote from: TravelMug on January 12, 2023, 01:11:13 AMMaybe this is one reason why the price is going up in the last 24 hours? it's now climbing above $18k.So yeah, this could be a welcoming news for everyone. And again, El Salvador never ceases to amaze us with this bitcoin adoption.I don't think bitcoin is bullish on this news, although it is notable news from El Salvador. Today US CPI will be released, and all predictions are optimistic, so it is possible that the market reacted before the official news was released, bitcoin has done this before with CPI news. If CPI is released and stays as low as predicted, we are likely to see an even stronger rise in bitcoin in the short term. Not only cryptocurrencies, but also the stock market had a bit of a recovery at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "January 12, 2023, 02:05:34 AM",
      "body": "Well, it's a great time right now to launch it.  Bitcoin prices are low but Bitcoin is about to go up again. Halving is just a year away and world economy is getting stronger again. Recent investment decisions seemed to \"play safe\" and therefore, high-risk assets like Bitcoin have been sold. But now, high-risk assets are getting more attractive again. Very likely to see more money being poured again in BTC soon. After making some losses, El Salvador really deserves it to be a bit less unlucky and timing is looking good currently. Well, losses are only losses if you finally sell and if El Salvador will HODL, even their initial Bitcoin investment could see some considerable returns. At least, timing for Bitcoin Bonds seems to be better this time. It's always a bit of luck, too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "January 12, 2023, 02:59:20 AM",
      "body": "whether this is due to the impact of the Bonds, the market looks better at the moment. this was quite a struggle for El Salvador when they adopted Bitcoin. especially last year which disrupted the economies of many countries. the impact of war and the pandemic has been very strong on the Bitcoin market. we can see quite a lot of Bitcoin released, and El Salvador is quite depressed with the decline that occurred. but they overcome everything with trust. hold their Bitcoin and I think it will be better this year. hopefully so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 12, 2023, 03:00:32 AM",
      "body": "Despite the initial joy, what remains to be seen now is whether this bond, which is a by-product, will be bought. Quote from: BlackBoss_ on January 12, 2023, 01:39:29 AMBitcoin-backed bond aka Volcano bond is not interesting for me.If you want Bitcoin, buy Bitcoin.I don't find it interesting either and I think you are right in your argument. I think that they are betting heavily on bitcoin and that part of their success, with possible debt reduction, is dependent on the attraction of foreign investment in bitcoin and a recovery in the price, which I think is going to happen this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 12, 2023, 05:34:51 AM",
      "body": "Quote from: TravelMug on January 12, 2023, 01:11:13 AMMaybe this is one reason why the price is going up in the last 24 hours? it's now climbing above $18k.So yeah, this could be a welcoming news for everyone. And again, El Salvador never ceases to amaze us with this bitcoin adoption.it was held down not by spot market. but by the futures/options market. of those large investors doing bets that the price would stay under $17k. and so as a side hustle to ensure it were wash trading small amounts to keep the numbers low on the spot exchanges. so that their contracts, when they expired at the new year, would win them their betsnow their contracts have ended, they no longer need to wall the spot market down..as for not offering a bond during a cheap season.. sounds odd for them to say \"fears of bear\" \"brutal bear\"bears are only bad for those already invested. bears are perfect for new/future investorsQuote from: BlackBoss_ on January 12, 2023, 01:39:29 AMBitcoin-backed bond aka Volcano bond is not interesting for me.If you want Bitcoin, buy Bitcoin.Don't considering to buy Wrapped Bitcoin tokens or Bitcoin-backed bond.GBTC from Grayscale is not safe.If El Salvador go with their national bankruptcy, how will their bond investors can get their initial capital?It is more correct to call their bond as El-Salvador-backed bond, not Bitcoin-backed bond.The country has very high Government Debt to GDPGovernment debt to GDPIt's more than 84%. Will they be fine next few years?the way it plays out is that (at current 18k priceel-salv government buys BITCOIN to a tune of 56k btcthe bonds are backed by this amount. which when the bond expiry comes. users get X% of btc future value based on how many % of bond they have. thus best to buy bitcoin in a down market. and not at the hype market of a ATH periodQuote from: Don Pedro Dinero on January 12, 2023, 03:00:32 AMDespite the initial joy, what remains to be seen now is whether this bond, which is a by-product, will be bought. Quote from: BlackBoss_ on January 12, 2023, 01:39:29 AMBitcoin-backed bond aka Volcano bond is not interesting for me.If you want Bitcoin, buy Bitcoin.I don't find it interesting either and I think you are right in your argument. I think that they are betting heavily on bitcoin and that part of their success, with possible debt reduction, is dependent on the attraction of foreign investment in bitcoin and a recovery in the price, which I think is going to happen this year.bitcoiners that wont be visiting el-salv. see the benefit of this as so:a. a country needing to buy 50k+ coins in a short period of time (market demand growth)b. a country sustaining itself without needing IMF relief(loans) then inspires other countries(snowball effect)c. more countries adopting bitcoin and classifying legal tender, = more countries accepting bitcoin as legal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 12, 2023, 05:39:33 AM",
      "body": "Quote from: Myleschetty on January 11, 2023, 09:47:46 PMAfter this news broke, I think we should expect more bullish trend in the market for now.What is your opinion?El Salvador is not a significant enough force to be able to create a bullish trend, specially in the current market that is filled with FUD and panicked buyers who are still too scared to get in after their panic sale at the bottom. Not to mention the global economic situation that is still in a very bad shape despite the recent small market manipulation attempting to \"put lipstick on the pig\" so to speak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 12, 2023, 05:44:10 AM",
      "body": "Quote from: pooya87 on January 12, 2023, 05:39:33 AMQuote from: Myleschetty on January 11, 2023, 09:47:46 PMAfter this news broke, I think we should expect more bullish trend in the market for now.What is your opinion?El Salvador is not a significant enough force to be able to create a bullish trend, specially in the current market that is filled with FUD and panicked buyers who are still too scared to get in after their panic sale at the bottom. if an iphone was $700 in 2021. and now selling for $180.. are you a panicking buyer. or do you see it as nice discount, cheap value compared to a temporary 2021 premiumyes the next cycles iphone will be reaching a higher premium and also its bottom value would be more this this cycles bottom value.. but by buying now at this generation(cycles) discount. and just holding onto it. you get to have the free upgrade at the next cycle(generation of iphone).. thus your cheap iphone now will be exchangeable for the same premium/value new cycle iphone....so what are you afraid of#BuyLowSellHigh#BuyTheDip",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big kid",
      "created_time": "January 12, 2023, 09:41:45 AM",
      "body": "I suppose that was one of the reasons why BTC got to $18K this morning. That's great, what can I say? Both for El Salvador and the HODLers across the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 12, 2023, 11:37:58 AM",
      "body": "Are there still people who believe that El Salvador was or will be the reason for the BTC price to rise or fall? It seems that a lot of you still live with various illusions in your head, so instead of looking at what is happening in the world around you and trying to understand some things, you think that these rather insignificant things affect the price of anything...Look at the stock market indices around the world since the beginning of the year and the turnaround in China's treatment of the pandemic and the economy, and some things might become clearer to you. Maybe the world markets have not reached the bottom, but it is obvious that a good part of investors have just started betting on this option, part of the investments are also going towards Bitcoin, which results in an increase in the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 12, 2023, 11:56:48 AM",
      "body": "the ATH and the correction were not el-salv relatedit was big corp whales of mid 2021 buying. and then shorting in 2022they held the price below a $17k wall q3-s4 2022 because they had futures bets on that the price will be below $17 by year end. so needed to keep the spot price down to win bets...however el-salv could have used the time time of q3-s4 2022 to buy cheap coin. and then when the un-walled rise occurs they reach their goals to finance their projects easierel salv president only holds under 2400btc yet there are other investors that bought a heck of alot more then 2.5k coins in 2021we have michael saylor who bought hundred thousand plusDCG(greyscale) added a couple hundred thousand to its trust after 2020tesla has 10k coins+black rock, and others too have more coin then el salvador",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 12, 2023, 02:34:39 PM",
      "body": "Quote from: franky1 on January 12, 2023, 05:44:10 AMif an iphone was $700 in 2021. and now selling for $180.. are you a panicking buyer. or do you see it as nice discount, cheap value compared to a temporary 2021 premiumyes the next cycles iphone will be reaching a higher premium and also its bottom value would be more this this cycles bottom value.. but by buying now at this generation(cycles) discount. and just holding onto it. you get to have the free upgrade at the next cycle(generation of iphone).. thus your cheap iphone now will be exchangeable for the same premium/value new cycle iphone....so what are you afraid of#BuyLowSellHigh#BuyTheDipThat's comparing apples and oranges. Apple's iPhones are not fungible, but bitcoin is (a bitcoin mined in 2009 is the same as a bitcoin mined in 2023). Not to mention that iPhone's value changes based on their age. Due to technological improvements and market manipulation (consumerism!) an old iPhone is not going to be worth the same as a brand new one released in 2023 even if absolutely nothing were different hardware-wise...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 12, 2023, 03:07:24 PM",
      "body": "Quote from: Myleschetty on January 11, 2023, 09:47:46 PMEl Salvador Adopts Law to Support \"Volcano Bond\". In the Legislative Assembly, the digital asset bill received 62 yes votes and 16 no votes and this law will create a regulatory framework for Bitcoin and all cryptocurrencies in El Salvador.After this news broke, I think we should expect more bullish trend in the market for now.What is your opinion?Providing regulatory framework is a good thing because it paves way towards cryptocurrency adoption. However I am little sceptical about the bond. El-Salvador is a very small country without any significant GDP. So whatever bonds they will release, they will have to honour it in future. Unless we see a significant upward movement in bitcoin price, not sure how are they going to honour the bond repayment commitments. Bitcoin is super volatile. No one should gamble with it at such scale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 13, 2023, 11:21:11 AM",
      "body": "Quote from: avikz on January 12, 2023, 03:07:24 PMBitcoin is super volatile. No one should gamble with it at such scale. If we think about it, it would make sense - but politicians have the luxury of gambling with money that is not theirs but belongs to the state, and the worst that can happen to them is that they do not win power again in the next elections. Even if the whole thing with bonds collapses, the tax payers will pay the debt, and some new politicians who will then be in power will blame their predecessors for everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 14, 2023, 07:57:49 AMLast edit: January 14, 2023, 09:01:43 AM by franky1",
      "body": "Quote from: pooya87 on January 12, 2023, 02:34:39 PMQuote from: franky1 on January 12, 2023, 05:44:10 AMif an iphone was $700 in 2021. and now selling for $180.. are you a panicking buyer. or do you see it as nice discount, cheap value compared to a temporary 2021 premiumyes the next cycles iphone will be reaching a higher premium and also its bottom value would be more this this cycles bottom value.. but by buying now at this generation(cycles) discount. and just holding onto it. you get to have the free upgrade at the next cycle(generation of iphone).. thus your cheap iphone now will be exchangeable for the same premium/value new cycle iphone....so what are you afraid of#BuyLowSellHigh#BuyTheDipThat's comparing apples and oranges. Apple's iPhones are not fungible, but bitcoin is (a bitcoin mined in 2009 is the same as a bitcoin mined in 2023).fungibility is not what you think.. why oh why is every throwing the word fungible around like its a new word they heard so must add it to as many conversations as they can.. here is the thing. i have a stash from 2012 i can sell it at any price from $6+ and profiti have a stash from 2014..i have a stash from 2015.i have a stash from 2018...i have a stash from 2022 i can sell it at any price from $16k+ and profiti have a stash from 2022 i can sell it at any price from $30k+ and profitbut if i sold my 2022 stash at 2012 prices im not profiting!so no they are not all equal and the sameeven tax returns treat them differently as gains vs lossesthey are not all the same in my view and treating them the same affects the value of eachthere are people who bought in 2021 hype mania of $65k plus.. and i guarantee you their emotions and thoughts of value, taxes and desire/stress and their decisions of when to sell are not the same as someone that bought in recent months below $20koh.. and lets get into a lil thing called. tax to test your \"fungible, its all the same\"imagine you got $10k from inheritance imagine you got $10k from share portfolioimagine you got $10k from employerimagine you got $10k from personal loanimagine you got $10k from lotto winyou will NOT pay the same tax rate. becasue the IRS treats each source of funds differently even if its the same denomination/formhave a little think about thatdo you treat the conditions of receiving $10k from an employer. the same as a personal loan.. no. they are differenta merchant receiving bitcoin for goods pay s a different tax rate than a investor withdrawing from an exchangehave a little think about thatand like i said someone mining or investing coin from 2012 has a different value/taxable gain than someone that mined/invested in 2022however my coins from 2012 are able to be sold in 2023 at the new mined coin rate of $15k+ not the old mined coin rate of $6bitcoin 2009-2014 WAS defined as property where 1btc:1btc was a main premisshowever since legally being declared a currency(circa 2014).. everything changed. regulators now step in and delegate businesses to watch customers deposits and withdrawals and transfers . and treat each differentlycurrency is not \"fungible\" in a boolean expression of yes or no. currency is \"fungible\" on a scale/rating with different categoriesi see alot of darknet shady people abuse the \"fungible\" \"1btc:1btc\" narrative. not out of common sense or logic. but out of pure malicious intent to con and scam innocent people out of their 1btc, so that a malicious user can hand them their DIRTY 1btc, while the malicious users takes the clean coinsthe funny thing is these silly dirty malicious people shouting \"fungible\". know its not. else if it was \"fungible\" they would have no need to be using/promoting/creating these mixers, tumblers, AEC'sthey know their coins are dirty and will be treated differently which is why they play these games on others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}