{
  "id": "topic_5435131",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "January 17, 2023, 01:53:58 AM",
  "content": "Do not go to that site (look in the title)!It is a scam giveaway which is masquerading as SpaceX.The scammers have also hacked many YouTube channels and are using them to push an Elon Musk livestream with the link to the scam.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435131",
  "comments": [
    {
      "author": "Edwardard",
      "created_time": "January 17, 2023, 02:03:24 AM",
      "body": "Quote from: NotATether on January 17, 2023, 01:53:58 AMDo not go to that site (look in the title)!It is a scam giveaway which is masquerading as SpaceX.The scammers have also hacked many YouTube channels and are using them to push an Elon Musk livestream with the link to the scam.These types of scams are already too much in the crypto circle and also very well known to the public. I dont think we even need to make a \"scam accusation\" post about them since its too obvious (although newbies will still get scammed by their own greed trying to test something new). I daily used to read \"fraud\" elon musk/michael saylor/jeff bezos/microsoft etc. giveaways on twitter. Just gotta swipe and roll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 17, 2023, 04:29:10 PMLast edit: January 17, 2023, 04:40:43 PM by albon",
      "body": "Quote from: NotATether on January 17, 2023, 01:53:58 AMDo not go to that site (look in the title)!It is a scam giveaway which is masquerading as SpaceX.The scammers have also hacked many YouTube channels and are using them to push an Elon Musk livestream with the link to the scam.Archived: https://archive.ph/Zm1YQThank you for sharing this topic. Yes, this is a scam giveaway site where they promise people to send them 2X of the profits back after they transfer and send an amount of bitcoin or Ethereum to their wallet addresses below. They are taking advantage of Elon Musk's name and his wealth to trap victims as they publish their scam site on social media and they make a funded advertisement for it to reach thousands of people, we must all know that there is no free money, I will put you the domain details and a link to report it,QuoteRegistrar: Reg.ru (IANA ID 1606)Status: clientTransferProhibitedCreation Date: January 16, 2023 (1 day ago)Update Date: January 16, 2023 (1 day ago)Expiration Date:   January 16, 2024Age: 1 dayAdmin Name: Protection of Private PersonAdmin Street: PO box 87, REG.RU Protection ServiceAdmin City: MoscowAdmin State/Province:Admin Postal Code: 123007Admin Country: RUAdmin Phone: +7.4955801111Admin Email: SPACEDEP.COM@regprivate.ruYou can report this domain through the following links: [1] https://phish.report/contacts/REG-dot-RU[2] https://abuse.cloudflare.com/phishing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "January 17, 2023, 05:34:13 PMLast edit: July 19, 2023, 08:23:02 PM by logfiles",
      "body": "Quote from: NotATether on January 17, 2023, 01:53:58 AMDo not go to that site (look in the title)!It is a scam giveaway which is masquerading as SpaceX.The scammers have also hacked many YouTube channels and are using them to push an Elon Musk livestream with the link to the scam.I still wonder why YouTube takes too long to act on such hacked channels that stream scam giveaways but let someone stream porn or a gruesome video. The way they quickly act and delete or block the channel. They should use the same energy to act on the scam giveaways as wellThe good news is that Cloudflare now issues out a warning when on visits the link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "January 17, 2023, 06:25:52 PM",
      "body": "Scammers always looking for ways to scam people of their hard earned resources. I wonder what they think before embarking on such nefarious act. It is unfortunate that people still fall victim of such trick from these scammers. These are the things that put Crypto in a bad reputation all because of these fraud called scam. These people that falls into these traps are non but  new bies which makes it very difficult to believe that bitcoin is not a scam when ever you approach them. As a result of their experience which they have gotten from scammers, they find it difficult to believe anymore that bitcoin is not a scam.I had to access the website to see for myself to ascertain the level of criminality in these act of theirs and I found this.Who on Earth would dear this risk  if not new bie who does not know how the system works. It is unfortunate that people would still fall victim of these scammers through this site. Watch and see, I pray this forum members sees this and help spread it out to the world so others too can know about it very fast.Thanks for revealing this on time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 17, 2023, 07:39:33 PM",
      "body": "Quote from: logfiles on January 17, 2023, 05:34:13 PMThe good news is that Cloudflare now issues out a warning when on visits the link.Good news, I have already reported this scam domain two hours ago on Cloudflare and they have already reviewed the domain and restricted access to it, so we all have to take a positive step when we see such scam sites and report them, the report will not cost us anything but with this warning message that appeared on the domain will protect many people from falling into the traps of scammers, We must not tire of reporting until a scam domain is restricted and permanently banned from Google.Quote from: logfiles on January 17, 2023, 05:34:13 PMI still wonder why YouTube takes too long to act on such hacked channels that stream scam giveaways but let someone stream porn or a gruesome video. The way they quickly act and delete or block the channel. They should use the same energy to act on the scam giveaways as wellThey will take action if you report the channel and its content. The YouTube team is an active team and responds quickly. When they find any channel that violates their policy and publishes fraud and false giveaways, they either delete the videos or delete the channel permanently. Go to the link below to know the correct way to report a YouTube channel or content on YouTube.[1] https://support.google.com/youtube/answer/2802027?hl=en",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}