{
  "id": "topic_5459757",
  "title": "montaga",
  "author": "montaga",
  "created_time": "July 14, 2023, 08:02:08 AMLast edit: July 14, 2023, 04:43:19 PM by montaga",
  "content": "It was always clear as day that it is a security, same as Dash and many others ..... Ripple's institutional sales of XRP were considered unregistered securities offerings in violation of securities law.The SEC's case against Ripple will now continue, as a jury will determine whether Ripple executives aided and abetted the illegal offering of XRP to institutional investors.https://storage.courtlistener.com/recap/gov.uscourts.nysd.551082/gov.uscourts.nysd.551082.874.0.pdf",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459757",
  "comments": [
    {
      "author": "Dave1",
      "created_time": "July 14, 2023, 08:56:27 AM",
      "body": "Yes, but at least it's good to finally hear that this is over for now. And this should be a landmark case against SEC. Not sure if they will appeal to it, but I doubt that they will do that.So congrats to bag holders, it paid off the time that you keep on holding XRP for years now.Time to celebrate and maybe sell some of your stash and get some profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Andrija Branislav",
      "created_time": "July 14, 2023, 09:42:25 AM",
      "body": "even if the claim is rejected by the united stated district judge but I don't think it is 100 percent final because the objection process is still in court as mentioned by @Dave1 and the SEC class will definitely also look for loopholes to be able to appeal again regarding this decision which I think I see from OP's post above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barhavsky",
      "created_time": "July 14, 2023, 11:05:25 AM",
      "body": "this is a good news for Ripple and cryptocurrency, because the price of Ripple will definitely increase very high and of course this will also make market conditions be better, because many investors will start to investing in cryptocurrency again, so from that I hope the bullrun will occur soon and before the bullrun comes, then now is the right time to invest in cryptocurrency and I also suggest you to buy Ripple, because I believe the price of Ripple will reach or create a new ATH price soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 14, 2023, 12:03:14 PM",
      "body": "Quote from: montaga on July 14, 2023, 08:02:08 AMIt was always clear as day that it is a security,You can't simply say that since the ruling is quite \"50-50\" for Ripple and SEC from what I understand. The classification depends on who it is sold to. The token per se isn't a security but it becomes one if it's sold to institutional investors. It's only a utility token if it's bought by the public or traded by regular investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "July 14, 2023, 12:20:08 PM",
      "body": "Quote from: barhavsky on July 14, 2023, 11:05:25 AMthis is a good news for Ripple How is selling a unlicensed security to the public good news? Care to explain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "July 14, 2023, 12:31:41 PM",
      "body": "This is one reason why the crypto market pumped today. Although this is just a partial victory but at least it is the start where they can start fully embrace crypto. We still have long ways to go but a green day always makes us feel great as crypto enthusiasts.It's been years in the making that XRP and SEC are engaged in this kind of battle, but a good thing that the judge not classifying XRP as a security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "July 14, 2023, 12:35:17 PM",
      "body": "Quote from: montaga on July 14, 2023, 12:20:08 PMQuote from: barhavsky on July 14, 2023, 11:05:25 AMthis is a good news for Ripple How is selling a unlicensed security to the public good news? Care to explainDid you read everything carefully before stating your opinion here? the NY court ruled that Ripple did not violate federal securities laws by selling XRP on exchanges.That is the main reason why the price of XRP as well as some cryptocurrencies related to the SEC controversy has a significant increase in price within the past 24 hours. Although it is not a complete victory, the price reaction as well as this news is very positive for the current market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "July 14, 2023, 01:34:30 PM",
      "body": "I think this is misleading. The decision did not generally rule XRP as a security. It was more specific. It said that XRP coins sold on exchanges aren't security. This is a big victory for Ripple. We have now heard of announcements coming from exchanges starting with Coinbase that XRP will now be relisted for trading. Following the decision of the court, the price of XRP has leaped more than 64% in just a matter of hours. On the other hand the decision also specified that XRP sold to institutional investors are unregistered securities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FrozenBit",
      "created_time": "July 14, 2023, 01:46:09 PM",
      "body": "Quote from: montaga on July 14, 2023, 08:02:08 AMIt was always clear as day that it is a security, same as Dash and many others .....I want to ask is this problem serious?It is true that the court has ruled in favor of XRP and as far as I can feel the price increase of XRP was immediate upon receiving that ruling, but regarding the alleged securities between the SEC and Ripple will still be It takes time for things to really clear up, but after the recent news, XRP will soon completely win and bring along a series of cryptos that have been accused by the SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yurkov",
      "created_time": "July 14, 2023, 02:14:03 PM",
      "body": "I don't know why this would be good news for Ripple?If the final decision is that it is a security token/coin, Ripple will face a very difficult legalization process.For Ripple, this can be even more difficult because it is a centralized coin (so it's practically not a cryptocurrency, but an electronic money) and I have no idea how the legislator will approach this. So even if this case will be closed somehow now, the road ahead of Ripple is still very long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 14, 2023, 02:44:37 PMLast edit: July 14, 2023, 02:55:09 PM by tvplus006",
      "body": "Quote from: cheezcarls on July 14, 2023, 12:31:41 PM...It's been years in the making that XRP and SEC are engaged in this kind of battle, but a good thing that the judge not classifying XRP as a security.As I understand it, the judge made such a decision that both sides of the process were satisfied. On the one hand, the decision states that XRP is not a security and this is undoubtedly a victory for Ripple in the process. And, on the other hand, the judge points out that the sale of XRP to institutional investors is the sale of unregistered securities, which is little consolation for the SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "July 14, 2023, 03:02:25 PM",
      "body": "Yes, this is not really final, maybe we will see further action by other SEC officials to appeal, because there were indeed some confusions in the results of this trial by Hawey that made this matter seem not final in his opinion.But I need to congratulate XRP loyal holders, and indeed if you look at the holders they are very strong, the institutions that are with the Ripple ranks are also very loyal to have accompanied them to this point.Congratulations for getting ROI today, don't forget to take profits and wait for the price to drop again so that your XRP has more than before.cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "July 14, 2023, 04:19:26 PM",
      "body": "Today there are many threads discussing XRP's victory over the SEC lawsuit. This is something positive and I think this is why a community like this is needed. Hopefully it will strengthen our community even more and hopefully this XRP victory can be a reference for how a crypto project is made so that it is not subject to lawsuits in the name of securities by the SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 14, 2023, 06:15:04 PM",
      "body": "They both win right? Like they are correct somehow that it's not with securities unless they are sold to a specific set of people/market like the institutional companies versus the individuals. As long as it's going to be good for everyone, I think it's going to be okay. With the rise in recent price of XRP, it's definitely safe to say that news has definitely reached those people who are hesitating to buy it in the first place because of this. Now that it has ended, a lot of people probably bought XRP instead of dumping it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "July 14, 2023, 06:33:54 PM",
      "body": "This is true, everyone knows XRP is a security the way it was offered, but the good news is that the sale of the tokens on exchanges do not constitute a security, this creates a clear path for new projects that wants to list their tokens, I expect more and more project to give more percentage of their tokens to their community through airdrops and maybe Launchpool in the future. I wish the Ripple team all the way in this legal struggle",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 14, 2023, 06:48:42 PM",
      "body": "I'm not one of those that celebrates what has happened to XRP but somehow, I like it that this has happened because it has made the market pumped today.This only means that the market isn't blind if it's about these good news that are coming to the market. And right now, we're starting to see the opposite effect of what the pump has made.It didn't last long but still, it's good to see that it had pumped the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 14, 2023, 06:52:03 PM",
      "body": "Quote from: jacafbiz on July 14, 2023, 06:33:54 PMThis is true, everyone knows XRP is a security the way it was offered, but the good news is that the sale of the tokens on exchanges do not constitute a security, this creates a clear path for new projects that wants to list their tokens, I expect more and more project to give more percentage of their tokens to their community through airdrops and maybe Launchpool in the future. I wish the Ripple team all the way in this legal struggleI agree with you. The case of XRP can lead future projects into right path and not bumping into SEC because of the flaw that involves them in a law that XRP did. Basically, new project and existing project is guided in avoiding suit cases like this. They won partially on their case but I believe that this will be a long process for them as SEC won't stop until they proved that XRP shouldn't be offered in public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "July 14, 2023, 07:28:06 PM",
      "body": "The fact that it has been ruled a security and this caused the price to go up is beyond insane. This is a bad thing, not a good thing and the fact that it's 65%+ higher because it is ruled a security is insane. People should be selling all the XRP they have instead of keep it, and the fact that it has gone up and passed beyond BNB is just not normal. I understand some people may like it, but the fact that this many people put in this many billions of dollars into it is just a proof that people don't know what they are buying. XRP literally has right to print 100+ million more of it and sell it at market, that's the type of power owners have and you still want to invest into it? That doesn't make sense at all and never did, I think it's a big mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "July 15, 2023, 07:24:57 AM",
      "body": "Judge Analisa Torres, has ruled that the defendants in the SEC v. Ripple case committed violations of the Securities Act of 1933. Judge Torres declined to rule on the legality of 99% of XRP trading volume since 2017 the ruling is for 1% of trading volume since 2017.Torres also ruled that Ripple’s co-founders, Brad Garlinghouse and Chris Larsen, should stand trial in front of a jury for their violations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}