{
  "id": "topic_5412862",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "September 08, 2022, 11:14:52 AM",
  "content": "The World's Open Video InfrastructureLivepeer is a decentralized video streaming network built on the Ethereum blockchain.https://livepeer.org/Distributed GPU rendering on the blockchainThe Render Network® is the leading provider of decentralized GPU based rendering solutions, revolutionizing the digital creation process.https://rendertoken.com/Who made money on these services?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412862",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "September 08, 2022, 04:40:16 PM",
      "body": "Quote from: FP91G on September 08, 2022, 11:14:52 AMThe World's Open Video InfrastructureLivepeer is a decentralized video streaming network built on the Ethereum blockchain.https://livepeer.org/Distributed GPU rendering on the blockchainThe Render Network® is the leading provider of decentralized GPU based rendering solutions, revolutionizing the digital creation process.https://rendertoken.com/Who made money on these services?While interesting they may lead to issues since files are going to be sent to you  (rendertoken.com) states you will be sent files to render.  This is a risky practice since your government (any government) can claim your pc is housing illegal info on the files that were sent to you. Not so sure if that is safe for you or me.As for the first one it is built on eth blockchain which will soon suffer a massive price dump as eth will be swapped to etc.simply put 15 million 'frozen\" staked coins are no match for over 107 million free liquid coins.Any one that has eth and coverts them to etc will help crash eth and pump etc.this is a real and present danger that will soon make Mr V.B the next Homero Josh Gara.  Eth will soon be the next paycoin.So I will look at these two efforts to use gpus and consider livepeer.org if and when it abandons the eth block chain.To all say a prayer for Mr V.B. as he is in a world of shit once the merge happens.ETH value is around 188 billETC value is around   5 billwe will see a huge shift here. The value of AMDNvidiaIntelAsusEvgaMsiEvgaSapphireGigabyteAsrockBio-StarBitmainInnosiliconSeasonicCorsairis far more than than ethThey simply will put pressure on eth by dumping their eth and or buying etc or better yet converting their eth holdings into etceth tanks etc moons.Mr V. B. = in a world of shit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "falsealarm_bf1",
      "created_time": "September 08, 2022, 05:31:40 PM",
      "body": "Quote from: philipma1957 on September 08, 2022, 04:40:16 PMThis is a risky practice since your government (any government) can claim your pc is housing illegal info on the files that were sent to you.Sigh, if you are not informed on the project, and won't spend a few minutes to research, pleased DON'T comment. By that logic, mining on, or running a node on any blockchain would be subject to that. Are people running Helium Hotspots at risk for what's riding the IoT network? Are cellular compaines at risk for what conversations take place on the cell phones? What about distributed storage, and cloud solutions like SIA, Flux?You likely won't receive the render files in unencrypted form, or have any knowledge what's being processed. Work will be distributed to multiple nodes in redundancy and no one node will have the entire set. Please stop making arbitrary assumptions, and do some research before responding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 08, 2022, 06:35:51 PM",
      "body": "Quote from: falsealarm_bf1 on September 08, 2022, 05:31:40 PMQuote from: philipma1957 on September 08, 2022, 04:40:16 PMThis is a risky practice since your government (any government) can claim your pc is housing illegal info on the files that were sent to you.Sigh, if you are not informed on the project, and won't spend a few minutes to research, pleased DON'T comment. By that logic, mining on, or running a node on any blockchain would be subject to that. Are people running Helium Hotspots at risk for what's riding the IoT network? Are cellular compaines at risk for what conversations take place on the cell phones? What about distributed storage, and cloud solutions like SIA, Flux?You likely won't receive the render files in unencrypted form, or have any knowledge what's being processed. Work will be distributed to multiple nodes in redundancy and no one node will have the entire set. Please stop making arbitrary assumptions, and do some research before responding.yes or not yes. any time you receive anonymous packets and are willing  to process them your gear is subject to seizure if your gear can store the packet.if your gear only relays the file and does not store it the justification is much harder to prove.So if you have a pc with lots of storage rendering a  set of random files if it is capable of copying the files and storing them you are subject to search and seizure.Does not mean they will.but they can.Ie a rasp pi with a small micro sd = why bothera 5000 usd i7 12700k pc with a pair of 3090ti's and a few 4tb nvme.2    yeah they (any gov) could. since you can copy all info the render service sends to you if you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 09, 2022, 03:51:27 PM",
      "body": "philipma1957, I liked your comments about the law. If it is profitable, then in Russia no one will think about it I understand that these services cannot give a permanent job to all miners, and most of the time the video courts will be busy mining coins, and the profit will soon fall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 10, 2022, 01:28:52 PM",
      "body": "Quote from: FP91G on September 09, 2022, 03:51:27 PMphilipma1957, I liked your comments about the law. If it is profitable, then in Russia no one will think about it I understand that these services cannot give a permanent job to all miners, and most of the time the video courts will be busy mining coins, and the profit will soon fall.Yeah my great fear on handling storing and working on anonymous files is that my wonderful government (USA) can use that as a reason to seize gear.So my two high end thread ripper pc's could be taken from my home. Even if they are returned and I am not jailed the government would hold them for at least 18-24 months. I may want to sell them off and simply get 2-3 k per pc as they have good value.I will continue to check the websites and figure if they are worth trying out.At the moment I need to work at restoring my main mining room as we finally got the solar installed and inspected and approved.We will soon be running a 260kwatt solar array at the mine which is a net of 48kwatts 24/7/365We can run all our gpu's on that array.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 10, 2022, 03:15:49 PM",
      "body": "Quote from: philipma1957 on September 10, 2022, 01:28:52 PMQuote from: FP91G on September 09, 2022, 03:51:27 PMphilipma1957, I liked your comments about the law. If it is profitable, then in Russia no one will think about it I understand that these services cannot give a permanent job to all miners, and most of the time the video courts will be busy mining coins, and the profit will soon fall.Yeah my great fear on handling storing and working on anonymous files is that my wonderful government (USA) can use that as a reason to seize gear.So my two high end thread ripper pc's could be taken from my home. Even if they are returned and I am not jailed the government would hold them for at least 18-24 months. I may want to sell them off and simply get 2-3 k per pc as they have good value.I will continue to check the websites and figure if they are worth trying out.At the moment I need to work at restoring my main mining room as we finally got the solar installed and inspected and approved.We will soon be running a 260kwatt solar array at the mine which is a net of 48kwatts 24/7/365We can run all our gpu's on that array.We have the same thing, there are no laws on mining, so mining equipment can be seized, and they can return it in a year or two, when its price drops a lot. As a rule, this rarely happens, because large miners solve these issues in advance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}