{
  "id": "topic_5472977",
  "title": "Victorybit1",
  "author": "Victorybit1",
  "created_time": "November 05, 2023, 08:42:55 PM",
  "content": "Given the increasing cost of TV subscriptions in my country like GOTV, DSTV, etc. I often find myself watching the same movies every month. Sometimes, I can't even watch them due to a lack of power supply, making me feel like I'm wasting my money. So, I've had an idea: what if I were to invest the money I usually spend on my GOtv subscription, which often goes unused, into Bitcoin? Many people pay for these subscriptions but aren't satisfied with the content. I'm just thinking out loud, but by diverting the funds from TV subscriptions into Bitcoin, I believe I could potentially achieve greater satisfaction.The package I do is Gotv Supa which is about 6400 every month. I'm thinking of reducing my package to a lower one like  Gotv Jinga which is about 2250 for the sake of the kids so they can watch their favorite cartoon and I  get to save 4150 amount into Bitcoin.What do you all think about this idea?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472977",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "November 05, 2023, 08:50:51 PM",
      "body": "Ultimately, television serves little to no purpose to human development...on the internet you can:- Dig and find more important news.- Potentially find the same shows, movies, and so on.- Find cooking videos and recipes - Look at international shows, news, events etc....And isn't that really all that a TV has to offer these days? I think I am even being generous by not mentioning the negative effects that it can have on the brain.Of course, if what you pay for TV can be avoided, your Bitcoin balance will not only increase at a faster rate, but your brain will probably be better off too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 05, 2023, 09:02:24 PM",
      "body": "If you usually have a particular amount that you normally allocate to your TV subscription and perhaps you have lost interest on the TV shows, the money will definitely go to another budget if you are no longer subscribing, and if you have decided to allocate the money for your Bitcoin investment, I think it's a wise choice.There's one of my in-laws who only subscribes to the TV channel when his children are on holiday; otherwise, the TV can go unsubscribed for two months or more, as long as the children are still in school.I think you have a good idea, mate. Just like the first comment said, you can get most of the information you want on the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 05, 2023, 09:02:35 PM",
      "body": "For almost 5 years, I haven't had any TV connection. Using smart TV through the Internet is better; I don't need to pay any extra TV subscription bills. Because almost everything is available on the Internet and most of our local channels have online broadcasts, For kids, there are a lot of YouTube cartoons, which is enough for them. I don't have much time to watch TV or use my mobile to watch movies, etc. during free time. So I think your decision to invest in Bitcoin instead of a TV subscription is more appropriate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "November 05, 2023, 09:14:40 PM",
      "body": "As for me, I often watch via the internet, although I have a paid subscription to Netflix to watch movies for around $7 monthly for almost a year. So do you mean instead of paying for my monthly subscription to Netflix for $7, I should shift it to buying Bitcoin?  I mean, I will implement DCA using my 7$ instead of paying it at Netfilix, and I will just watch movies for free monthly on the internet via YouTube and more. Is that right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "November 05, 2023, 11:04:32 PM",
      "body": "Quote from: Victorybit1 on November 05, 2023, 08:42:55 PMWhat do you all think about this idea?If you use TV subscription money for investment, what will you watch on TV? TV subscription may seem unnecessary, but you can also make budget for it in your monthly bill as you make budget for investment, you do not have to bore yourself to death because you are trying to invest in bitcoins, it should be enjoyable and everything necessary to make yourself not bored because you are trying to invest should be encouraged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 05, 2023, 11:16:01 PM",
      "body": "Quote from: Victorybit1 on November 05, 2023, 08:42:55 PMWhat do you all think about this idea?What is there to think, saving money is always good. Just don't expect to get super rich from a small investment, because you need money to make money. The days of 100x returns in Bitcoin are gone, so the most realistic scenario is that if you'll save a year worth of tv subscription you'll make 3-5 years worth of tv subscriptions if you invest the money in BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 05, 2023, 11:28:27 PM",
      "body": "As has already been stated, saving money is of course always a good thing and directing your savings or at least a part of it to Bitcoin is very likely a good idea. It probably won’t change your life, but it shows that you’re willing to sacrifice and save to build yourself a better future. Over time this line of thinking can bring you major financial benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "November 05, 2023, 11:38:01 PM",
      "body": "This is a really smart decision and I'm hoping that you're not just saying but will implement it. Considering that the movies shown are always repeated, I do not see any reason why you shouldn't cut that off already and redirect the money to somewhere else. Also, to save more money, you can download cartoon videos for your kids in a flash and they can watch them from there. Maybe every month you download a new set of cartoons for them instead of doing any subscription at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 06, 2023, 01:12:25 AM",
      "body": "Quote from: Victorybit1 on November 05, 2023, 08:42:55 PMGiven the increasing cost of TV subscriptions in my country like GOTV, DSTV, etc. I often find myself watching the same movies every month. Sometimes, I can't even watch them due to a lack of power supply, making me feel like I'm wasting my money.With Internet nowadays, with Youtube, with free learning courses and more, I no longer need to use television many years. Honest with you, I never watched television many years and I even don't have the need for it. I agree with you that it is a waste of money if what you intend to use your television is only for watching movies.It will be different if you subscribe it for your children to learn English, living skills and more, which are helpful for your children and you can continue to do it. If you don't use television at home this way, it's a waste of money.QuoteSo, I've had an idea: what if I were to invest the money I usually spend on my GOtv subscription, which often goes unused, into Bitcoin?What do you all think about this idea?You can do it if television is not actually helpful for you and your children. I don't spend too much time daily for entertainment and I don't need television as said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "November 06, 2023, 03:07:07 AM",
      "body": "Quote from: Victorybit1 on November 05, 2023, 08:42:55 PMGiven the increasing cost of TV subscriptions in my country like GOTV, DSTV, etc. I often find myself watching the same movies every month. Sometimes, I can't even watch them due to a lack of power supply, making me feel like I'm wasting my money. So, I've had an idea: what if I were to invest the money I usually spend on my GOtv subscription, which often goes unused, into Bitcoin? Many people pay for these subscriptions but aren't satisfied with the content. I'm just thinking out loud, but by diverting the funds from TV subscriptions into Bitcoin, I believe I could potentially achieve greater satisfaction.Thinking out loud comes with advantages as it allows you to know other people's perspective on something you do personally and the chances this forum have availed us to think out our opinions loudly have solved so many problems for people out there.I have stop subscribing for long a while now because I rarely have that time to watch the TV. Plus there's practically everything on the internet now so instead of those subscription, I prefer to leave my TV for my game console alone. Since it's a smart TV, I prefer to go on the internet to watch my programmes including football games. Although many may still see this as a personal decision to take, like single people won't see the need to pay for subscriptions, many married couples will see a reason to that.QuoteThe package I do is Gotv Supa which is about 6400 every month. I'm thinking of reducing my package to a lower one like  Gotv Jinga which is about 2250 for the sake of the kids so they can watch their favorite cartoon and I  get to save 4150 amount into Bitcoin.What do you all think about this idea?What you did can be called recognizing value for money. It is better to invest than to subscribe in any instances but all lies on the interest of the beholder. Some people can go extra to satisfy their pleasure as they won't mind to go for multiple subscriptions where they could have saved such money for investments.Your 4150 in Naira I presume will amount to around 4 dollars when converted to USDT and saving as little as that in a year can give you up to 50 dollars worth of investment. It could even go more than that in the event that the prices skyrocketed in the market. And that in itself is a great idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 06, 2023, 03:32:47 AM",
      "body": "A wonderful idea of course. You should implement it immediately. I am fundamentally surprised at how you pay all these amounts for TV subscriptions? We are now in the era of the Internet and YouTube, and people in my country here have almost given up watching television altogether.My kids watch their favorite cartoon shows on YouTube and rarely watch TV, so it is better for you to reduce your TV subscription or even cancel it completely and save this monthly money for the Bitcoin DCA strategy. You will never regret your decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 06, 2023, 05:22:01 AM",
      "body": "Pretty sure most people these days don’t have any cable tv or satellite subscription. Almost everybody has an Netflix, Disney Plus or just uses YouTube. I think one of the reasons is that it’s onDemand. You don’t need to view the TV guide and wait for a favorite show to start. Plus with a normal Netflix subscription there are no ads in the middle of your movies and shows. The cable tv model is a dying business pretty much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 06, 2023, 05:29:16 AM",
      "body": "Well, it doesn't sound like a bad idea, especially if, as you say:Quote from: Victorybit1 on November 05, 2023, 08:42:55 PMI often find myself watching the same movies every month. Sometimes, I can't even watch them due to a lack of power supply, making me feel like I'm wasting my money. In the end, the \"budget\" you have (even if you don't explicitly draw it up) is unique: it consists of income and expenses. If you want to invest in Bitcoin an amount that you do not invest now, you will have to take it out of some other expense. From what you say they are small amounts but accumulated over a couple of cycles can become significant after one or two cycles and more in your country. I would also recommend as I usually do, that you try to increase your income, that way you can spend more and invest more in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 06, 2023, 06:16:59 AM",
      "body": "Quote from: iBaba on November 06, 2023, 03:07:07 AMYour 4150 in Naira I presume will amount to around 4 dollars when converted to USDT and saving as little as that in a year can give you up to 50 dollars worth of investment.The question is, purchase in what way? That won't happen with p2p purchases because network fees will cut bitcoin even more. Or just hope there's an exchange out there that will accept $4 deposits (plus OP has to do KYC).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 06, 2023, 08:40:31 AM",
      "body": "It's getting tiring watching the same movie over and over every month. If you know that you hardly benefit from it anymore and you've also mentioned that you're not satisfied with it, it's better to allocate that to something else, like considering and planning to invest in Bitcoin for potential gains. Just go for the lower subscription for the kids. But before you do that, you should also be aware of the associated risks and the possibilities that may occur, not just the potential benefits. If you're sure and comfortable with it, then go for it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 06, 2023, 09:22:19 AM",
      "body": "Actually this is a good idea...but do not just focus on the money you saved from getting away from your subscription expense but try to see many other fees and costs which can be unnecessary or you can practically downgrade for the purpose of saving more money. As far as I know, no one died because he canceled his subscription to any entertainment program. Another good idea is curtailing one's budget for unhealthy foods and choose less expensive natural alternatives...like instead of soda you can just drink plain water. Or maybe instead of going out for dinner or lunch, why not spend time at home and do the cooking. All the money saved can be used to buy Bitcoin instead...do this and one day you can be rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 06, 2023, 02:05:50 PM",
      "body": "Quote from: Victorybit1 on November 05, 2023, 08:42:55 PM~snip~What do you all think about this idea?How much can you save per year if you reduce or completely cancel the subscription? If it is a significant amount for you and you want to divert it to some investment (Bitcoin in particular), I don't see why not to try, especially if you yourself claim that the content you pay is repeated from month to month.However, think about whether there is something else you can save on that is not necessary for your life - for example cigarettes, alcohol, fast food and the like. In the meantime, there are some free solutions when it comes to watching TV, so even though it's not about premium content, you don't have to pay anything to watch it - whether it's a smartTV or a smartphone -> https://www.plex.tv",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 06, 2023, 04:17:36 PM",
      "body": "I actually don't think you should be aggressive about your Bitcoin investment, Bitcoin isn't going anywhere, if you invest $5 a week or two weeks in Bitcoin consistently you can accumulate a good amount, don't let the coming Bitcoin halving pressure you into FOMO.This is the second time I am seeing someone talking about how they want to deprive themselves of things.Quote Quote from: alastantiger on November 05, 2023, 07:46:51 AMI turned my apartment into a shared one, meaning I got a flatmate and used the money paid to buy more Bitcoins. No more buying new clothes, shoes, phones, or electronic devices. No more eating out. I'll cook all my meals. The money saved will be used to buy more Bitcoins.This month, I'm selling off my car and I'll start using the train for commuting to work or any other essential place. Therefore, unless it is absolutely necessary, my social life is going to suffer for a little while. This delay of gratification is worth it.  I didn't renew my gym membership. I purchased some dumbbells and barbells to start working out from home. The money supposed to be spent on the gym membership will be used to buy more Bitcoins.There's a flip side to this. After the halving, my Bitcoin investments would have doubled. I plan to reward myself with the profit by:- Visiting Mongolia, one of the most beautiful countries in the world. I've seen a lot of  documentaries about Mongolia on YouTube. How do you plan to make the most of your Bitcoin investments before the halving in 6 months? Investing this way can lead to panic and even depression if things does not go accordingly, does suffocate yourself just to squeeze out funds to invest in Bitcoin, you can invest with the little you have without it being a strain to your livelihood.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 06, 2023, 04:41:00 PM",
      "body": "Quote from: Victorybit1 on November 05, 2023, 08:42:55 PMGiven the increasing cost of TV subscriptions in my country like GOTV, DSTV, etc. I often find myself watching the same movies every month. Sometimes, I can't even watch them due to a lack of power supply, making me feel like I'm wasting my money. So, I've had an idea: what if I were to invest the money I usually spend on my GOtv subscription, which often goes unused, into Bitcoin? Many people pay for these subscriptions but aren't satisfied with the content. I'm just thinking out loud, but by diverting the funds from TV subscriptions into Bitcoin, I believe I could potentially achieve greater satisfaction.The package I do is Gotv Supa which is about 6400 every month. I'm thinking of reducing my package to a lower one like  Gotv Jinga which is about 2250 for the sake of the kids so they can watch their favorite cartoon and I  get to save 4150 amount into Bitcoin.What do you all think about this idea?TV used to be known as dumd box for a reason. It doesn't help you in anything apart from wasting your time. Old people, who have already crossed their working age, it's their time to watch TV. But if you do not belong to that age group, it doesn't make sense for you to watch TV. So if you are investing into Bitcoin, it will serve a good purpose and might become very handy for the future. But when it comes to investing, do not forget other options like stocks and precious metals. They provide capital protection to some certain extent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}