{
  "id": "topic_5465439",
  "title": "swogerino",
  "author": "swogerino",
  "created_time": "September 02, 2023, 08:10:06 PM",
  "content": "I am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465439",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 02, 2023, 08:14:07 PM",
      "body": "Because what someone likes may not be what another person will like, while another other person may like both. That is just life. Have you hate something before and you told a friend or someone and the friend or person told you that he like the thing instead and you will be surprised.Skill in betting? The analyses. I understand that, but the odds in sport betting is small if risks are compared. Just that people like sport and they will like to use it to gamble. People use anything they have idea about to gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Docnaster",
      "created_time": "September 02, 2023, 08:21:58 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?The sports bettors continue to bet because the result of Sports Betting is real-time and maybe it required skills also and as well as luck as you have noted, so when they have known that almost every weekend a very big team or big teams will lose their matches. They will have to take precaution and that is why it has become gambling. If every week all the big teams have to win their matches and the next week to come we are very sure that all the big teams will also win their matches, it is no longer a gambling. I don't know if you have not reasoned it from this concept. Sports Betting is still my favourite type of gambling because it is as a result of your luck and experience and the results are real time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "September 02, 2023, 08:24:51 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?Luck is consider first because without it, there's no presence of winnings. Sport betting is easier and we ought to be on the winning side, because it's never going to be an easy path. Weekend are for the big games, gambling and relaxation of the mind. Leagues getting more interesting because average clubs tends to compete with elite ones. Sport betting favours some gamblers that have the experience and analytical data to utilized for these games. I'm getting acquainted with gambling space and I know essentially what to expects and games to place my wagers on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "September 02, 2023, 08:29:12 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?Entertainment of course!Not all the time we do really get enjoyed or entertained on pushing out that roll button or having seeing those rolls in automation which is on dice and crash or roullete games. We know that there are really indeed moments on which we do find ourselves getting bored on what we are doing for a period of time and since people do have the option and as long he has the moneythen they could anytime make out some switch up in terms of the games that they are currently interested into.  Even myself do have this kind of switch up on gambling gamesbecause there are indeed sports on which im interested in and cant really be avoided for me to be able to make bets specially on E-sports (dota2) which is a long time gamewhich im known on.Speaking about on other physical sports then im interested on Boxing and Basketball. Upsets? It could happen but doesnt mean that it would make me stop on betting.Gambling is for fun and everything could really be in random because it cant really be called gambling in the first place if it was predictable or people would really be juststicking into those better teams or favorites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "September 02, 2023, 08:40:03 PM",
      "body": "Quote from: Oilacris on September 02, 2023, 08:29:12 PMQuote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?Entertainment of course!I don't consider entertaining when Napoli loses,Chelsea loses,Valencia loses,and every week some team does that.On a side note I tried a low bet today by playing 3 teams from Georgian league where the 3 teams I choose I saw them playing in Champions and Conference League preliminaries and they should have not had any problems winning their game yet one of them lost at home,Dila Gori against a very weak team,again reinforcing my view that in such remote leagues the gambling companies can do whatever they like and that is for sure while I am surprised that even the big leagues are being may be manipulated although this is just my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "September 02, 2023, 09:26:23 PM",
      "body": "If you are a sports lover, you will definitely find means to bet regardless of what sport it is. Sports betting is not only through skills or analysis, but it also comes with luck. That’s why even if some gamblers are not updated with the latest sports betting games, but they still try gambling through random betting because luck at some point can be quite helpful. If you think the stronger teams are mostly losing these days, then probably skills in gambling will never be prioritized but as long as there’s luck into it, gamblers will never lose their passion and hope from sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 02, 2023, 09:32:46 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?It's because it's sport betting we depend on our analysis, of course it will not be 100% guaranteed to be hit, there were times that there will be upset in sports. But at least it's not just base on pure luck alone, I mean it's like some card games, it's base on how you look at the game and what will be your strategies to be able to win.In slots, you are not in control, you just based it when the machine will give you the pay-outs and most likely it won't if you are not that lucky.Definitely, if you have big capital and bet big, sooner or later you will have a good chance to win a bonus round. And probably this is what makes slot very attractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "September 02, 2023, 09:33:09 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?Are ypu trying to says slots have better odds because if so you are wildly wrong.  Amd with that being said yeah there are days where lock bets still lose that's why it's called ablijg.  If it was a sure fire way to win every time no betting house would offer that game up...it's gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "September 02, 2023, 09:34:16 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMWhat is the reason that sport bettors still continue to place sport bets?Because there’s a big chance of winning in sports bet and also many gamblers are into sports as well like they are a big fan of those specific sports. I personally prefer to bet on a big sporting events since you can easily get the data about the teams and the players where you can use it to analyze and know where to bet. Sports betting are more profitable compare to the gambling games that depends on a pure luck, this is why many love this option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 02, 2023, 09:35:34 PM",
      "body": "Quote from: mirakal on September 02, 2023, 09:26:23 PMIf you are a sports lover, you will definitely find means to bet regardless of what sport it is. Sports betting is not only through skills or analysis, but it also comes with luck. That’s why even if some gamblers are not updated with the latest sports betting games, but they still try gambling through random betting because luck at some point can be quite helpful. If you think the stronger teams are mostly losing these days, then probably skills in gambling will never be prioritized but as long as there’s luck into it, gamblers will never lose their passion and hope from sports betting.if you do love sports, you definitely will continue to place bet on this sports. for most bettors, it is one of their favourite pastimes they allocate their time to. so there's no doubt they will bet so long they strongly feel about such sport especially if the teams that are playing are their favourites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 02, 2023, 10:14:02 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMWhat is the reason that sport bettors still continue to place sport bets?First and foremost, it's fun. Secondly, it's not purely dependent on luck. I know beimg lucky is important but you can tip the odds in your favour if you know what you're doing. It's similar to the way trading works. Most people are outright losers but there are people who know what they're doing and that gives them the edge over others. For sport betting, if you know the team well enough and their opponent, you can tell the results before the start of game. For luck-based games, not so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 02, 2023, 10:28:37 PM",
      "body": "I think a game one knows so well as football would come easy to bet on if given the chance to. I don't really bet much, but when I do I know exactly why I am doing so. It comes easy to do so firstly because I take out time to either view a live match on my device or at a viewing centre, and I enjoy doing so. Even if the skill is lacking for now to bet and win big, I know it takes a consistent effort at betting to develop one and a good read of the teams to bet on. Also, it's a choice. Peer pressure or social influence can make one develop the nack to bet, but it comes down to the individual to know if that's what they really want to be doing consistently or occasionally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 02, 2023, 10:31:01 PM",
      "body": "You're looking at the wrong direction, then.There are still profitable bets out there that not a lot of people see. This is where some sports bettor place their bets on, and they win big. If some bets lose and some bets don't, wouldn't it be the same case to casino games wherein some rolls you win, and some rolls you lose? Saying that sports betting is no longer profitable nor enjoyable is just plainly wrong. We still enjoy watching sports and putting a little $ in the mix to take chances of getting something more back. You can't always win it all no matter the game, but you can enjoy watching it and betting on it anyways so you're just like playing to watch if you lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 02, 2023, 10:31:14 PM",
      "body": "I feel like sports bets are the only bets where you can be sure that everything is on the up and up. It’s honestly the only betting I do with any level of seriousness. I like being able to use my knowledge of sports to try and beat the odds, plus you get to watch more sports. Why wouldn’t someone want to bet on sporting events?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "September 02, 2023, 10:34:22 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?The surprise result was unique one in the gambling,Sometimes you get winnings without expecting.The chance of winning without expecting is the key factor of gambling.The sports betting we get most of the time the desired result,because we are betting based on the probability and the sports person knowledge.So the performance of such player will change only if the player was not in good health or that day was not the day of that player.Because we can’t say even Ronaldo score goal on all the match.In recent match Ronaldo not scored goal,only he had assist in two goals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "September 02, 2023, 10:41:30 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?A lot of people are attracted to the sport and they are playing it because of the joy they derive from it and some people are into sports betting because they know alot about the sports and it better to bet on games you can predict and not just bet based on pure luck. I also prefer sports betting to every other kind of bet because i know the strength of most of the clubs and it’s easier to predict the outcome even though sometimes it doesn’t always happen just like what happen today. A different outcome other than the anticipated one always happen every week, one of the so called big teams will surely fumble and lose to a certain small team so it is left to us to find out the one to likely lose of pray for luck instead. Gambling is a game of luck, and whether you prefer sports betting, slot machines, or any other form of gambling, the results are always determined by luck, regardless of how well you know the teams' strengths. The analysis doesn't provide a 100% assurance of success, it just serves to lower the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 02, 2023, 10:47:52 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMWhat is the reason that sport bettors still continue to place sport bets?In sport betting you can also apply your analysis skills and also your knowledge of the sports helps you in your betting but in slot it’s entirely dependent on luck. So that contributes to why you still have people that still chose to go for sport betting rather than slots.For example, one of my friends have never used slot in his casino account ever since he created despite when we both discuss about sports and gambling comes up and I jnform him of my wins he’s never convinced no matter the amount I win he’s always betting on sports most especially football matches, so I’m his case we could refer to passion for the sport as a factor behind it and that’s the same for most bettors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "September 02, 2023, 10:49:33 PM",
      "body": "Quote from: swogerino on September 02, 2023, 08:10:06 PMI am checking that in every single league of the big ones we have seen at least some surprise result and this is the typical weekend of many of the sport bettors.I wonder why do people still place sport bets because in slot machines I can understand,they run after the maximum payout and they know it is a game of pure luck,yet in here in sport betting it is not only pure luck,there is also skill involved and seeing many of the stronger teams lose their game today means that it is not worth doing anymore sport betting.What is the reason that sport bettors still continue to place sport bets?Just a typical day for sports bettors that they just want to continue what they like to do.There's an interest that's why there's an eagerness to just play and play. It's like a regular habit now for these bettors to place a bet no matter what especially if te match or league is their favorite to watch and follow even prior to engaging in the sports betting world.Aside from that, there are lots of sports bettors who don't want to just rely on luck playing slots. Gambling is already risky, why they should add another risks by just depending only on their luck to win?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "September 02, 2023, 10:54:14 PM",
      "body": "What is the purpose of spending on slots and other casino games. Just on the hope of winning we make the bets and we don't know the outcome. Here we couldn't use our analytical skills. Everything is upon pure luck. With sports betting we can have hope based on the information we have got related to the match and the players into the game. In that way sports betting is fair than and gives with the better winning probability based on skills rather than spending based on luck. It is unfortunate that the favourite loss and the underdog winning the match. Such things happen and often sports betting people also try going against the odds which is a way to examine the luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}