{
  "id": "topic_5451889",
  "title": "reality18",
  "author": "reality18",
  "created_time": "May 08, 2023, 12:16:38 AMLast edit: July 04, 2023, 07:56:47 AM by reality18",
  "content": "Earn Network is a liquid marketplace for yield-earning opportunities via the provision of smart contract infrastructure to connect liquidity providers & pool creators in a completely non-custodial manner.What's our Mission?The mission has always been simple and the same; To onboard millions of new people to the blockchain and cryptocurrency world. This is practicable through the expertise of our team with a profound experience within this space. How to Get Started?With our easy-to-use DeFi staking platform, users can \"CONNECT\" their non-custodial wallets (MetaMask) to stake any of the listed assets.  DeFi staking allows users to earn rewards by staking their cryptocurrency assets on the platform. The platform has already integrated BNB Smart Chain with a few initial pools, including popular cryptocurrencies such as Shiba Inu (SHIB), Litecoin (LTC), HOLOLOOT (HOL), Dogecoin (DOGE), and Green Metaverse Token (GMT). Customizable Staking Solutions!This feature allows projects to create and manage their staking pools geared toward the specific needs of their community. Here, the project may choose which method works best for the project and its community - either Flexible staking or Locked Staking.Follow the official channels for more updatesWebsiteTelegramDiscordLinkedInTwitterFacebookMediumRedditWhitepaperAre you interested in partnering with this lifelong DeFi solution? Reach out to our Partnership TeamStuck and need assistance? Write to our SupportEarn Network Partners With DecimalChainThe goal is to provide an easy and efficient way for all projects deployed on the DecimalChain to implement staking mechanisms for their assets without having to build complex smart contracts from scratch.Facilitating increased adoption and expansion by providing a competitive advantage over other base layersAttracting new users to join Defi staking which will lead to more assets locked on the Decimalchain to enhance network strength and securityDecimal will be added to the list of supported networks of Earn Network's platform, allowing every asset deployed on it to launch staking solutionsTeams are able to deploy two comprehensive staking methods: Locked & Flexible, which will save them thousands of dollars on developing and auditing dedicated staking smart contractsConstantly extending the range of assets and staking options for them, which is possible thanks to official partnerships with projects such as DecimalAnother strategic partnership with ALTA Blockchain Accelerator. The goal is to Empower ALTA Projects with Staking Mechanisms and Maximize staking rewardsThe latest partnership with CRONOS LABS is geared towards bringing seamless staking solutions to all CRONOS network projects.Earn Network Partners with Onyx (XCN) for Expanded Staking Opportunities on BNB Smart Chain",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451889",
  "comments": [
    {
      "author": "reality18",
      "created_time": "May 08, 2023, 07:01:12 AMLast edit: June 24, 2023, 07:16:48 AM by reality18",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DisWhale",
      "created_time": "May 09, 2023, 11:10:32 AM",
      "body": "The interface looks user-friendly. Do you plan on adding other coins?I see only Metamask. Is that the only supported wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "May 10, 2023, 07:16:07 AM",
      "body": "Quote from: DisWhale on May 09, 2023, 11:10:32 AMThe interface looks user-friendly. Do you plan on adding other coins?I see only Metamask. Is that the only supported wallet?Definitely, we keep adding new coins. At the moment, yes, MetaMask is the only supported wallet. We are working on adding other wallets like Trust wallet in the coming months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "June 24, 2023, 07:49:35 AM",
      "body": "EARN TOKEN SALESWe are more than excited to announce the successful completion of our 🌱 seed funding round that raised $2.7 million from VCs and angel investors.This immense feat was spearheaded by Shima Capital with support from DFG, Jsquare, LD Capital, Cronos | Cronos Labs, GTS Ventures, Bixin Ventures, ViaBTC Capital, MarsDAO, and Mirana Ventures.Private Round is Live!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "June 26, 2023, 07:49:18 PM",
      "body": "Not many new projects can raise million dollars of seed fund from various investors. And you are still raising funds for your private sale, so what aspect/s of your project you will mainly use those funds?Also, you can easily spread the word here in the forum by holding campaigns like signature campaign as you have funds in place.DeFi Staking is not a new venture in this market, but you need to prove also that you can sustain those competitive staking profits.We will see if your P2P lending will also create noise in the community, and if the required collateral is reasonable enough.Most p2p lending platforms are asking for collaterals that you will feel there's no reason for you to take a loan anymore, because the required collateral is outrageous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "June 27, 2023, 09:10:28 AM",
      "body": "Quote from: TimeTeller on June 26, 2023, 07:49:18 PMNot many new projects can raise million dollars of seed fund from various investors. And you are still raising funds for your private sale, so what aspect/s of your project you will mainly use those funds?Also, you can easily spread the word here in the forum by holding campaigns like signature campaign as you have funds in place.DeFi Staking is not a new venture in this market, but you need to prove also that you can sustain those competitive staking profits.We will see if your P2P lending will also create noise in the community, and if the required collateral is reasonable enough.Most p2p lending platforms are asking for collaterals that you will feel there's no reason for you to take a loan anymore, because the required collateral is outrageous.Good questions 👍. The funds will be channeled to many aspects of the project but a large chunk of it will be used to further develop new product categories such as lending, liquid staking, native restaking, etc. Although Defi staking is live, more staking pools are being added almost every few weeks. BTT bounty program is being discussed and once a conclusion is reached, we'll launch it here. Strategic partnership is one key element for our sustainability. One of our close partners, MyCointainer, is a registered yield-earning company with over 140K+ users and has been in operation since 2018. There will be cross-marketing among these platforms for adequate exposure and in the long run, ensure sustainability. Talk of the Lending category which is yet to be launched, remember just as we stated in the whitepaper, our flexible features which will allow both lenders and borrowers to able to set various parameters that fit into their needs. Some of those include the repayment schedule, APY, repayment token, borrowing token, collateralisation composition, and much more. We believe this will make a great difference in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "July 16, 2023, 08:46:05 PM",
      "body": "Earn Network Partners with Croskull & results in a first staking pool with NFT rewards deployed on the Cronos Chain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "July 17, 2023, 08:04:19 PM",
      "body": "Earn Network Partners with Gemie (GEM) for Launch of Staking Programs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "August 14, 2023, 04:56:05 PM",
      "body": "Earn Network Partnership with Vector Finance results in its first DeFi Staking program deployed on Avalanche",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "August 17, 2023, 07:56:59 AM",
      "body": "Earn Network Collaborates with Yuliverse Exploring NFT-related Opportunites",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "August 18, 2023, 10:09:58 AM",
      "body": "Earn Network Partners with Kingdomverse (KING) for Launch of Staking Programss",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "August 23, 2023, 06:16:50 AM",
      "body": "Earn Network Partnership with Dypius brings exciting staking pools with $10k worth rewards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "August 30, 2023, 12:45:42 PM",
      "body": "Integration of the ThunderCore blockchain into the Earn Network - Unlocking New Staking Functionalities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "September 04, 2023, 12:01:52 PM",
      "body": "Earn Network Partners with TT Farm for Launch of Staking Pools for $FTT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "September 08, 2023, 08:25:58 AM",
      "body": "Earn Network Partners with Ram Protocol to Introduce Staking Pools for $RAM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "October 12, 2023, 01:48:59 PM",
      "body": "Earn Network Partners with MagicCraft to Introduce Staking Pools for $MCRT with exciting NFT rewards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "October 26, 2023, 03:29:13 PM",
      "body": "Earn Network Partners with Kingdom Karnage to explore staking opportunities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "November 04, 2023, 11:15:25 PM",
      "body": "Earn Network Partners with TENET to launch validator and explore staking opportunities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reality18",
      "created_time": "November 07, 2023, 07:23:33 PM",
      "body": "Earn Network Partners with Solus Finance to explore staking opportunities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}