{
  "id": "topic_5473601",
  "title": "Rikafip",
  "author": "Rikafip",
  "created_time": "November 10, 2023, 11:19:24 AMLast edit: November 10, 2023, 02:15:20 PM by Rikafip",
  "content": "There is a rumour spreading on twitter that Poloniex wallet has been drained of at least 50+ million USD and counting. https://twitter.com/peckshield/status/1722931275764474329So far there is no official confirmation but few minutes ago Poloniex announced that their wallet has been disabled for the \"maintenance\" so it might be that something dodgy has been going on.Quote from: https://twitter.com/PoloSupport/status/1722934043543752968Our wallet has been disabled for maintenance. We will update this thread once the wallet has been re-enabled.edit: Just Sun confirmed that Poloniex has been indeed hacked.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473601",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "November 10, 2023, 12:28:50 PMLast edit: November 10, 2023, 01:00:32 PM by OmegaStarScream",
      "body": "The latest articles are now saying it's +100M $[1] and Justin is now offering a 5% bounty to the hacker[2]A bit off-topic but am I the only one who remembers very low trading volumes (even after shutting down and relaunching)? According to CoinGecko, the exchange now has ~500M/24h. I find that very hard to believe for an exchange that you barely see any mention of anymore.[1] https://cointelegraph.com/news/poloniex-exchange-hack-60-million-drained-5-percent-bounty[2] https://twitter.com/justinsuntron/status/1722951876986204259",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 10, 2023, 12:41:09 PM",
      "body": "Another nail in the statement of: do not store your coins on exchange and/or use an exchange as a wallet. Even though Polo has lost its charm among the new members with the influx of DEXs and other exchanges taking its place, I still remember Polo being the go-to exchange when I first attended this forum. It only shows that no exchange is ever safe from hacks or shutdowns and the user's money is always at risk. Even though they are promising to reimburse funds, a lot of paperwork ups and downs will happen to recover funds.Fingers crossed to see how this situation develops.As usual, stop using exchanges as wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 10, 2023, 01:49:16 PM",
      "body": "They guess the hack because of private key compromise, but a year ago they stated if they maintain 95% of their funds in cold storage where it requires multi signature to access it. I think $100M isn't 5% of their total funds, they're not really big.How can the hacker access the multi signature wallet? is the exchange hold few keys in a same place?  that's kill the purpose of multi signature wallet.Quote from: https://cointelegraph.com/news/poloniex-exchange-hack-60-million-drained-5-percent-bountyAccording to blockchain security firm CertiK, the incident was likely a “private key compromise.” Quote from: https://poloniex.com/blog/poloniex-is-committed-to-providing-a-secure-crypto-trading-platformCold storage: We always aim to maintain a 95% cold storage ratio. This means that most of your assets are sitting in cold storage with ultra-tight security in place (requires multisignature to access). We never keep assets outside of our hot and cold wallets.Wild guess: is there a breach about personal identity too?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 10, 2023, 02:12:43 PM",
      "body": "Quote from: OmegaStarScream on November 10, 2023, 12:28:50 PMThe latest articles are now saying it's +100M $[1]Huh, amount stoleni ncreased quiet a bit. At the moment I shared the news number was $18.5M which I then edited to $50M and if I have to guess i would say that $100M is not the final amount.Quote from: OmegaStarScream on November 10, 2023, 12:28:50 PMand Justin is now offering a 5% bounty to the hackerIirc he did the same for that recent HTX hack and allegedly it worked. Quote from: OmegaStarScream on November 10, 2023, 12:28:50 PMA bit off-topic but am I the only one who remembers very low trading volumes (even after shutting down and relaunching)? According to CoinGecko, the exchange now has ~500M/24h. I find that very hard to believe for an exchange that you barely see any mention of anymore.All exchanges bullshit about their trading volume to some degree so yeah, that number indeed seems unrealistically high.Quote from: TheUltraElite on November 10, 2023, 12:41:09 PMAs usual, stop using exchanges as wallets.As usual, those who do that won't change their habits, even if they have money on Poloniex and can't get it out at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "November 10, 2023, 02:53:10 PM",
      "body": "I was checking other sources and found an interesting bit in coindesk,see: https://www.coindesk.com/business/2023/11/10/poloniex-hot-wallets-hacked-65m-seemingly-stolen-on-chain-data/So apparently, hackers bought $20M worth of TRX which bumped the price. But if it's for pump and dump scheme, why TRX of all altcoins? shouldn't there be easier coins?However in another source, hackers appeared to have sent away $2.5 million lolQuote from: https://decrypt.co/205465/justin-sun-owned-crypto-exchange-poloniex-hacked-60mIn one instance, however, the hacker appears to have fat-fingered at least one transaction, sending $2.5 million in stolen Golem tokens (GLM) to the token contract rather than the secondary addresses in their control. It will be impossible for them to recover this sum.I'm not sure if we're being played or they're just dum dums.Quote from: OmegaStarScream on November 10, 2023, 12:28:50 PMA bit off-topic but am I the only one who remembers very low trading volumes (even after shutting down and relaunching)? According to CoinGecko, the exchange now has ~500M/24h. I find that very hard to believe for an exchange that you barely see any mention of anymore.and on May 31st, reported volume is only at 63M, see: https://web.archive.org/web/20230531012234/https://www.coingecko.com/en/exchanges/poloniexbut even this $63M may have been mixed with fake volume though I would guess the percentage of inflated volume is a lot less compared to now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "November 10, 2023, 02:57:08 PM",
      "body": "Surprisingly, The market is not heavily affected anymore on this kind of hack especially now that we on a bullish momentum. Typically, this kind of news is already being use to FUD the market yet crypto market is behaving as usual without any trace of FUD.Quote from: OmegaStarScream on November 10, 2023, 12:28:50 PMThe latest articles are now saying it's +100M $[1] and Justin is now offering a 5% bounty to the hacker[2]I believe the hacker might take this offer since it’s a clean money already without any trouble for potential criminal case when caught. All the crypto stolen can be easily tracked through chain analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 10, 2023, 03:26:45 PM",
      "body": "Quote from: dimonstration on November 10, 2023, 02:57:08 PMSurprisingly, The market is not heavily affected anymore on this kind of hack especially now that we on a bullish momentum. Typically, this kind of news is already being use to FUD the market yet crypto market is behaving as usual without any trace of FUD.Aside the fact that we are in a bullish period, I personally does not expect this hack to have any negative effect on the market, since the exchange involved in the hack isn't so much of a great one, gone are the days when poloniex had such influence, let say for example, that we are still in 2015 or 2016 right now when poloniex was the world's largest crypto exchange, then rest assured that the entire crypto market will be going through a bloodbath at the moment, and also know that the amount of money involved in this hack would have been much greater as well.But today, only crypto OGs and very few newbies know that an exchange named poloniex exist, so there is no way this will affect the overall market sentiment at the moment, let's say that it was one of the exchanges in the top 5 ranking according to coinmarketcap that was involved in this hack, then the market would have possibly experienced some reasonable decline before it turns back bullish again after a few days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 10, 2023, 05:16:34 PM",
      "body": "If I am not mistaken, this is the second platform linked to Justin Sun to be hacked in less than 90 days, and again he is offering a 5% white hat bounty agreement if they return the stolen funds within the next seven days.If the hackers returned it, could this be a way to evade taxes or indicate a problem? It is difficult to think that it is something random. Let's see what happens in the coming months.https://mobile.twitter.com/justinsuntron/status/1722951876986204259?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 10, 2023, 09:59:36 PM",
      "body": "Quote from: dimonstration on November 10, 2023, 02:57:08 PMSurprisingly, The market is not heavily affected anymore on this kind of hack especially now that we on a bullish momentum. Typically, this kind of news is already being use to FUD the market yet crypto market is behaving as usual without any trace of FUD.That just tells you how relevant Poloniex is at the moment. With that being said, I don't think that any exchanges getting hacked other than Coinbase and Binance would affect the market, and it would have to be a big amount of money stolen. Quote from: Yamane_Keto on November 10, 2023, 05:16:34 PMIf I am not mistaken, this is the second platform linked to Justin Sun to be hacked in less than 90 days, and again he is offering a 5% white hat bounty agreement if they return the stolen funds within the next seven days.Yep. According to him, hackers gave back money stolen from HTX but since there is no way to prove and he is known bullshitter, I tend not to believe him. Who the hells what is going over there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 11, 2023, 03:25:36 AM",
      "body": "Justin Sun seems to be gifted; he's got the opposite of the Midas touch. LOL! And he also gets to remain nonchalant despite another debacle, this time happening in his other platform. It must also be another gift. He seems to have been well prepared for this that he's just recycling his old script. Having your platforms hacked one after another has certain advantages; you just have to Ctrl+C and then Ctrl+V, rephrase a little, and, voilà, there's your familiar statement.Anyway, for the nth time, everybody's reminded of the dangers of centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 11, 2023, 07:39:39 AM",
      "body": "This is one of the OG exchanges out there that have been one of the most popular when I was still new. Quote from: Darker45 on November 11, 2023, 03:25:36 AMJustin Sun seems to be gifted; he's got the opposite of the Midas touch. LOL! And he also gets to remain nonchalant despite another debacle, this time happening in his other platform. It must also be another gift. Yeah, it's always like he's into these deep holes that's making him more noisier again. Before it was with these tron's partnerships everywhere. Now, he's into these hacking incidents but this is more costly to him if it's for real. Quote from: Darker45 on November 11, 2023, 03:25:36 AMHe seems to have been well prepared for this that he's just recycling his old script. Having your platforms hacked one after another has certain advantages; you just have to Ctrl+C and then Ctrl+V, rephrase a little, and, voilà, there's your familiar statement.It seems effective if this is just for another publicity that he's doing and yeah, looks well planned and prepared for it. But for the concern of the users there, hoping everything is fine and before anything crazier happens, they should just remove their funds there and withdraw asap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "November 11, 2023, 08:39:20 PM",
      "body": "Quote from: Apocollapse on November 10, 2023, 01:49:16 PM-snip-Wild guess: is there a breach about personal identity too? The user identities and private key are placed in different storage and I think are handled by different security departments, so it seems unlikely that hackers would target both in one attack.Quote from: dimonstration on November 10, 2023, 02:57:08 PM-snip-I believe the hacker might take this offer since it’s a clean money already without any trouble for potential criminal case when caught. All the crypto stolen can be easily tracked through chain analysis.Actually, that's a dilemma choice, hackers will still be careful about doing it. The slightest carelessness that leaves traces can make him regret taking this offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 11, 2023, 08:42:47 PM",
      "body": "Quote from: Apocollapse on November 10, 2023, 01:49:16 PMWild guess: is there a breach about personal identity too? I think that the way exchanges handle these information is that they do store your Name and address from your KYC verification, but that's normally held in different storage and also exchanges don't keep scan copies of passports/face images etc. Those are supposedly only checked only once by a KYC verification partner and then discarded. At least that's what they usually claim. But still, to get a full picture of what was done poloniex would have to do some incident report. Otherwise it makes no sense to speculate. They should be responsible with their users and end the speculation by admitting to their faults. As it would also help other exchanges protect user funds better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 12, 2023, 02:04:47 AM",
      "body": "Quote from: tabas on November 11, 2023, 07:39:39 AMQuote from: Darker45 on November 11, 2023, 03:25:36 AMHe seems to have been well prepared for this that he's just recycling his old script. Having your platforms hacked one after another has certain advantages; you just have to Ctrl+C and then Ctrl+V, rephrase a little, and, voilà, there's your familiar statement.It seems effective if this is just for another publicity that he's doing and yeah, looks well planned and prepared for it. But for the concern of the users there, hoping everything is fine and before anything crazier happens, they should just remove their funds there and withdraw asap.What do you mean this is effective for publicity? Poloniex is dying. A hack which costs it more than a hundred million dollars might be the final nail in the coffin. It's mind-boggling to call this well-planned and that Justin is prepared for this. Even given that Justin is that eccentric clown, I don't know how this could be used in his favor.Quote from: alani123 on November 11, 2023, 08:42:47 PMQuote from: Apocollapse on November 10, 2023, 01:49:16 PMWild guess: is there a breach about personal identity too? I think that the way exchanges handle these information is that they do store your Name and address from your KYC verification, but that's normally held in different storage and also exchanges don't keep scan copies of passports/face images etc. Those are supposedly only checked only once by a KYC verification partner and then discarded. At least that's what they usually claim. Whatever they claim should be taken with a grain of salt. If only we can fully know how irresponsible these platforms are, all their claims could be discarded right away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 12, 2023, 10:33:44 PM",
      "body": "Quote from: alani123 on November 11, 2023, 08:42:47 PMQuote from: Apocollapse on November 10, 2023, 01:49:16 PMWild guess: is there a breach about personal identity too? I think that the way exchanges handle these information is that they do store your Name and address from your KYC verification, but that's normally held in different storage and also exchanges don't keep scan copies of passports/face images etc. Those are supposedly only checked only once by a KYC verification partner and then discarded. At least that's what they usually claim. That's what i imagine why those third party KYC verification services exists, and what others custodial wallets claims for their kyc structure design. We could hope it's the case for this exchange.As for the incident, the bitcoin price doesn't make a budge much, maybe a dime, but not that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 12, 2023, 11:54:22 PM",
      "body": "Quote from: Darker45 on November 12, 2023, 02:04:47 AMQuote from: tabas on November 11, 2023, 07:39:39 AMQuote from: Darker45 on November 11, 2023, 03:25:36 AMHe seems to have been well prepared for this that he's just recycling his old script. Having your platforms hacked one after another has certain advantages; you just have to Ctrl+C and then Ctrl+V, rephrase a little, and, voilà, there's your familiar statement.It seems effective if this is just for another publicity that he's doing and yeah, looks well planned and prepared for it. But for the concern of the users there, hoping everything is fine and before anything crazier happens, they should just remove their funds there and withdraw asap.What do you mean this is effective for publicity? Poloniex is dying. A hack which costs it more than a hundred million dollars might be the final nail in the coffin. It's mind-boggling to call this well-planned and that Justin is prepared for this. Good or bad publicity, it's still publicity. And with what Justin Sun seems to be an expert on this one, and that's why I think that it's still effective on that way. I'm not saying that it's effective because it's going to make Poloniex alive more. But the hype that Justin creates from doing these publicity stunts is always effective on his end because it's always became the talk of the crypto town everytime he publish something through his own socmed accounts.Quote from: Darker45 on November 12, 2023, 02:04:47 AMEven given that Justin is that eccentric clown, I don't know how this could be used in his favor.A publicity hungry clown would always see this on his favor. He'll ride situations even at the worst just to satisfy his hunger with that. Just as you have said, a recycled old script and that's his style.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 13, 2023, 01:38:28 AM",
      "body": "Quote from: tabas on November 12, 2023, 11:54:22 PMQuote from: Darker45 on November 12, 2023, 02:04:47 AMQuote from: tabas on November 11, 2023, 07:39:39 AMQuote from: Darker45 on November 11, 2023, 03:25:36 AM~snip~~snip~What do you mean this is effective for publicity? Poloniex is dying. A hack which costs it more than a hundred million dollars might be the final nail in the coffin. It's mind-boggling to call this well-planned and that Justin is prepared for this. Good or bad publicity, it's still publicity. And with what Justin Sun seems to be an expert on this one, and that's why I think that it's still effective on that way. I'm not saying that it's effective because it's going to make Poloniex alive more. But the hype that Justin creates from doing these publicity stunts is always effective on his end because it's always became the talk of the crypto town everytime he publish something through his own socmed accounts.LOL! I'm not sure if this applies in this case. But, for sure, that saying isn't absolute. The one thing that's very vital in the business of crypto exchange is security, funds security to be exact. They're custodians, after all. Users are entrusting them their money. I don't know about you but, for me, whether your platform is rumored to be involved in wash trading, whether your platform is notorious in listing shitcoins, whether it has higher fees than its competitors, and so on don't matter much for as long as my money is secure. If the talk in the crypto town is that Poloniex doesn't have good security, and there's proof because hackers were able to get into their system and steal funds, how is that better than not being talked about?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "November 13, 2023, 01:48:53 AM",
      "body": "Quote from: Potato Chips on November 10, 2023, 02:53:10 PMI was checking other sources and found an interesting bit in coindesk,see: https://www.coindesk.com/business/2023/11/10/poloniex-hot-wallets-hacked-65m-seemingly-stolen-on-chain-data/So apparently, hackers bought $20M worth of TRX which bumped the price. But if it's for pump and dump scheme, why TRX of all altcoins? shouldn't there be easier coins?However in another source, hackers appeared to have sent away $2.5 million lolQuote from: https://decrypt.co/205465/justin-sun-owned-crypto-exchange-poloniex-hacked-60mIn one instance, however, the hacker appears to have fat-fingered at least one transaction, sending $2.5 million in stolen Golem tokens (GLM) to the token contract rather than the secondary addresses in their control. It will be impossible for them to recover this sum.I'm not sure if we're being played or they're just dum dums.We can be quite certain that in much of these hacks, we are being tricked by the development teams, the government and the hustlers of the cryptospace. It is very much similar with these declared DeFi hacks. They were only the development teams that wanted to steal the treasury hehehe.On Justin Sun, it would not be very shocking if he wanted the whole cryptospace to dump while TRX pumps heeehehehe. Also, this Poloniex hack might be blamed on the Lazarus group again hehe. How do we know that the Lazarus group is from North Korea? Do they have internet in North Korea?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 13, 2023, 01:56:15 AM",
      "body": "A lot of rumors for sure will start to circulate about what they are trying to do behind the exchange. There could be something that is happening that could be malicious and should be investigated. The corrupt stuff that is happening would really be a great deal to give time on to prevent other exchanges from doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}