{
  "id": "topic_5436073",
  "title": "LeGaulois",
  "author": "LeGaulois",
  "created_time": "January 19, 2023, 11:11:37 PM",
  "content": "Tous les syndicats et partis politique qui se plaignent de la réforme des retraites.C'est pas les mêmes qui ont appelé à voter Macron? Ah ben ca alors! Saperlipopette!Les gens qui vont manifester, dont une grande partie à voté pour lui.<==  Macron, lui qui nous parlait de l’inutilité de reculer l’âge légal de départ à la retraite... Une vraie girouette.Sauver le système des retraites, un système qui n'est pas forcément en danger, ou besoin peut être de marges budgétaire pour masquer le déficit.De nos jours, la moitié des Français ont une retraite décottée, avec la réforme ca sera pire",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436073",
  "comments": [
    {
      "author": "Rocou",
      "created_time": "January 20, 2023, 10:43:04 AM",
      "body": "Quote from: LeGaulois on January 19, 2023, 11:11:37 PMTous les syndicats et partis politique qui se plaignent de la réforme des retraites.C'est pas les mêmes qui ont appelé à voter Macron? Ah ben ca alors! Saperlipopette!Les gens qui vont manifester, dont une grande partie à voté pour lui.<==  Macron, lui qui nous parlait de l’inutilité de reculer l’âge légal de départ à la retraite... Une vraie girouette.Sauver le système des retraites, un système qui n'est pas forcément en danger, ou besoin peut être de marges budgétaire pour masquer le déficit.De nos jours, la moitié des Français ont une retraite décottée, avec la réforme ca sera pireArrêtez de vous plaindre, cela ne changera rien du tout sinon en mal (augmentation des cotisations ou de la dette).Vous êtes bien placés sur ce forum pour savoir qu'il y a d'autres moyens de se constituer une retraite.Ne JAMAIS compter sur autrui surtout si celui-ci fait partie de l'Etat. Ce dernier est incapable de gérer ses propres finances, comment voulez-vous qu'il gère correctement les votres?Pensez \"intérêts composés\". \"L'intérêt composé est la force la plus puissante de l'univers.\" Albert EinsteinC'est très difficile quand on est jeune de penser à sa retraite. D'une part parce que cela paraît très loin et d'autre part parce que l'on se dit qu'il vaut mieux vivre quand on est jeune plutôt que mourir avec un tas d'or.Mais on n'a pas tout à fait raison. Il est impératif de mettre tous les mois un peu d'argent de côté et de le placer et cela dès que l'on commence à gagner sa vie.200 euros par mois par exemple, ce n'est pas énorme mais au bout de 43 ans, cela donne 830 000 euros de pactole pour une épargne laissée sur le CAC40.Et 1 500 000 euros sur le S&P500...Non seulement cela vous fait une retraite très confortable mais en plus vous laissez le reliquat à vos enfants.Et cet exemple basé sur le CAC40 ou le S&P500 c'est à dire sans risque (sur 43 ans). Imaginez un placement crypto sur 43 ans...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 20, 2023, 11:40:22 AMLast edit: January 20, 2023, 12:21:58 PM by Saint-loup",
      "body": "Quote from: Rocou on January 20, 2023, 10:43:04 AMImaginez un placement crypto sur 43 ans...C'est franchement provocateur d'écrire ça quand l'écosystème est en train de littéralement exploser en vol. Ceux qui ont placé leurs fonds sur certaines plateformes en espérant réaliser un bon placement pour leur retraite n'ont aujourd'hui plus rien du tout. Je ne vais pas y revenir mais même les collectibles crypto ne sont pas des placements sûrs comme on vient de le voir. Et pour ceux qui ont gardé leurs bitcoins au chaud dans un cold wallet ils ont gagné $0 en 5 ans, sans même prendre en compte l'inflation... Il faut arrêter de raconter qu'investir dans les cryptos permet de se constituer une retraite, c'est du BS pour gogos. Il n'y a pas de free meal. Ca va peut-être faire x1000 en 43 ans, mais ce n'est pas moins probable que ca divise par le même chiffre, c'est juste du casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "January 20, 2023, 12:00:12 PM",
      "body": "Quote from: Rocou on January 20, 2023, 10:43:04 AMArrêtez de vous plaindre, https://facebook.com/story.php?story_fbid=966127514355047&id=14293154969",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G.Seed",
      "created_time": "January 20, 2023, 03:42:12 PM",
      "body": "QuoteNe JAMAIS compter sur autrui surtout si celui-ci fait partie de l'Etat. Ce dernier est incapable de gérer ses propres finances, comment voulez-vous qu'il gère correctement les votres?Ca, je suis bien d'accord.C'est même pas le fait de ne pas avoir de retraite de l'Etat qui me fait peur, j'ai fait la paix avec ça. C'est l'augmentation du racket fiscal sur les classes moyennes/moyennes-supérieures.Le petit quadra/quinqa, cadre ou petit patron, qui essaie de se mettre bien, qui s'est acheté son petit pavillon, qui a une petite AV, une voiture, je pense que ça va être le sac à foutre de la France pour les années 2020/2030. Celui qui touche trop pour avoir les aides de l'Etat, mais pas assez pour faire de l'évasion fiscale.Je ne sais pas ce que vaudront 830 000 euros dans 43 ans.Vous savez, si à 70 piges, vous devenez dependant, que vous ayez 500 000 euros ou rien, vous serez dans les mêmes maisons de retraite que ceux qui n'ont strictement rien branlé de leur vie. Il faut être à plusieurs millions pour que ça fasse la différence et que vous évitiez la maison de retraite bas de gamme.Si vous n'avez rien, l'Etat vous prend en charge en France, si vous avez juste un appartement et une petite AV, on saisit ça pour vous payer une maison de retraite bas de gamme.Et là vous vous direz, putain, j'aurais jamais dû aller au boulot, j'aurais dû toucher le RSA et essayer de niquer ma voisine.QuoteIl faut arrêter de raconter qu'investir dans les cryptos permet de se constituer une retraite, c'est du BS pour gogos. Il n'y a pas de free meal. Ca va peut-être faire x1000 en 43 ans, mais ce n'est pas moins probable que ca divise par le même chiffre, c'est juste du casino.Oui, c'est du casino, mais je ne connais pas de casino avec une meilleure espérance de gain.Comment on fait quand on a fait son BAC S, son Master tout comme il faut, etc, mais qu'on se rend compte qu'on aura un salaire correct pour vivre mais en bossant comme un chien jusqu'à 67 ans (j'anticipe un peu). Quel est le projet, se taper une croisière Costa en 2050 ? Le prochain bull run crypto, j'espère vraiment, mais vraiment, être dedans, et je te souhaite toi aussi d'être dedans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "January 20, 2023, 04:24:45 PM",
      "body": "Quote from: G.Seed on January 20, 2023, 03:42:12 PMJe ne sais pas ce que vaudront 830 000 euros dans 43 ans.sur un livret / compte épargne ils vaudront toujours 830 000 euros, plus ou moins je sait pas mais tout le monde a intérêt à bien se ramasser d'ici 2025.. le Ed Dames local predit un truc cataclysmique à cette date, qui sait si c'est pas le Kill shot !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 20, 2023, 05:45:42 PM",
      "body": "Quote from: Rocou on January 20, 2023, 10:43:04 AMJe ne me plains pas, ou plutôt si en fait, je me plains des gens-syndicats-partis politique qui se plaignent de la politique de Macron. C'est les même qui ont voté pour lui. Ca les rend inéligible de se plaindre d'après moi. Vous avez voulu Macron, voilà le résultat.Ce monsieur est un traitre et peut être la plus grosse fumisterie de la Vème République.Je n'attend rien de l'Etat pour la retraite. Enfin si, après tout je cotise et je serais bien content le moment venu. Mais si je dois compter que sur ca, je ne veux pas finir avec 900€ par mois comme je vois certains vieux et qui pourtant on travaillé comme des esclaves.Ca ne m'intéresse pas comme vie.La retraite, je la prépare aussi de mon côté, comme beaucoup de gens. J'ai commencé quand j'avais 30 ans, c'est un peu tard, mais qu'est ce que tu veux. Quand tu as la vingtaine, tu as d'autres préoccupations. Puis j'ai pas été éduquer sur ca. Bon avec la crypto, je me suis bien rattrapéEn vérité faut commencer dès que tu commences à travailler(et non je suis pas fou, j'ai quand même des moments de lucidité. j'ai pas tout misé sur la crypto pour la retraite ^^ ).Je suis éligible à la retraite à 60 ans, j'ai pas du tout envie de travailler plus. De toute façon, comment je ferais pour aller à 62 ou 64 ans, je serais trop usé. Déjà à 60 ans, je me vois pas du tout. Je vais te donner aussi un exemple. Mon Papa: retraité en Juillet, décédé en Avril. Rien vu de la retraite.Je me suis dis, ce n'est pas du tout ce que je vivre. Je peux mourir à 60,61,62,63 ou bien après, ou bien avant aussi.Et comme tout le monde, je veux travailler le moins longtemps en touchant le plus possible(Ces enculés, même décédé, ils te font payer des impôts. Vraiment des crevards...)Donc là, on nous impose une réforme, pas forcément nécessaire, qui aura besoin d'être réformé plus tard, et qui va faire in fine que les retraités toucheront moins. Donc encore plus de pauvreté. Les vieux qui galèrent à se nourrir je trouve ca dégueulasse.Pourquoi ne pas chercher à réindustrialiser le pays et créer de l'emploi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rocou",
      "created_time": "January 21, 2023, 05:05:39 PM",
      "body": "Quote from: Saint-loup on January 20, 2023, 11:40:22 AMQuote from: Rocou on January 20, 2023, 10:43:04 AMImaginez un placement crypto sur 43 ans...C'est franchement provocateur d'écrire ça quand l'écosystème est en train de littéralement exploser en vol. Et pour ceux qui ont gardé leurs bitcoins au chaud dans un cold wallet ils ont gagné $0 en 5 ans, sans même prendre en compte l'inflation... En 43 ans, tu penses donc que Bitcoin ne vaudra pas plus qu'aujourd'hui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yohannc",
      "created_time": "January 21, 2023, 11:14:38 PM",
      "body": "Quote from: Saint-loup on January 20, 2023, 11:40:22 AMQuote from: Rocou on January 20, 2023, 10:43:04 AMImaginez un placement crypto sur 43 ans...C'est franchement provocateur d'écrire ça quand l'écosystème est en train de littéralement exploser en vol. Ceux qui ont placé leurs fonds sur certaines plateformes en espérant réaliser un bon placement pour leur retraite n'ont aujourd'hui plus rien du tout. Je ne vais pas y revenir mais même les collectibles crypto ne sont pas des placements sûrs comme on vient de le voir. Et pour ceux qui ont gardé leurs bitcoins au chaud dans un cold wallet ils ont gagné $0 en 5 ans, sans même prendre en compte l'inflation... Il faut arrêter de raconter qu'investir dans les cryptos permet de se constituer une retraite, c'est du BS pour gogos. Il n'y a pas de free meal. Ca va peut-être faire x1000 en 43 ans, mais ce n'est pas moins probable que ca divise par le même chiffre, c'est juste du casino. totalement faux ce que tu ecris, mais alors completement fauxune personne qui a investi il y a 5 ans dans la bitcoin est à environ +184% 21 094,76EUR+13 681,42 (184,55 %)depuis 5 anstu as du laisser tes crypto sur une plateforme qui à fermé pour etre autant aigris.....desolé....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "January 22, 2023, 03:57:36 AM",
      "body": "https://facebook.com/story.php?story_fbid=1193712531519919&id=109196765786671Regardez moi le p d !   pffoui, aujourd'hui s'il faut dire p d, c'est pour dire président général.. ou premier dirigeant !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 24, 2023, 11:57:59 AM",
      "body": "Quote from: yohannc on January 21, 2023, 11:14:38 PMtotalement faux ce que tu ecris, mais alors completement fauxune personne qui a investi il y a 5 ans dans la bitcoin est à environ +184% 21 094,76EUR+13 681,42 (184,55 %)depuis 5 anstu as du laisser tes crypto sur une plateforme qui à fermé pour etre autant aigris.....desolé....C'est à se demander pourquoi les boites du secteur ferment les unes après les autres... Ca doit être des gens aigris qui ne savent pas compter non plus. Ils font certainement des bénéfices sans le savoir. J'aimerais bien que tu nous expliques comment quelqu'un qui a investi il y a 5ans a pu faire \"+184%\", parce qu'à moins que tu connaisses un super investissement je vois mal comment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 24, 2023, 04:01:34 PM",
      "body": "Je trouve les méthodes de la CGT un peu abusé.Couper l'électricité dans des secteurs peut faire de gros dégats. On peut se dire que pour les entreprises c'est pas trop grave, et encore ca c'est très discutable, mais imaginez un particulier vivant avec un respirateur... ou même juste une tv qui claque.Ils ont beau dire qu'ils peuvent faire ca propre, c'est pas du tout le cas, c'est fait à l'arrache.Le comble quant ils veulent trafiquer les compteurs des boulangers pour qu'ils paient mois cher, alors que quelques jour avant certains ont été privés de courant, justement par la CGT.L'incendie SNCF en RP, je suis sûr c'est les cheminots.Moi aussi je pourrais faire le délinquant et prétexter que c'est parce que je milite pour ma cause.  La CGT, la nouvelle racaille? Attention, apparemment les CRS mettent des coups de matraque dans les couilles de manifestants Il a été proposé de revenir sur les 35h et de faire 35,5h. Ca à l'air pas mal comme idée, on pourrait rajouter carrément 1h, c'est pas la fin du monde. Déjà que 35h, c'est pas beaucoup...bref, ca va tourner au vinaigre cette histoireQuoteC'est à se demander pourquoi les boites du secteur ferment les unes après les autres... Parce qu'elles font leur beurre sur des services-produits, pas sur des achats de coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yohannc",
      "created_time": "January 24, 2023, 05:56:19 PM",
      "body": "Quote from: Saint-loup on January 24, 2023, 11:57:59 AMQuote from: yohannc on January 21, 2023, 11:14:38 PMtotalement faux ce que tu ecris, mais alors completement fauxune personne qui a investi il y a 5 ans dans la bitcoin est à environ +184% 21 094,76EUR+13 681,42 (184,55 %)depuis 5 anstu as du laisser tes crypto sur une plateforme qui à fermé pour etre autant aigris.....desolé....C'est à se demander pourquoi les boites du secteur ferment les unes après les autres... Ca doit être des gens aigris qui ne savent pas compter non plus. Ils font certainement des bénéfices sans le savoir. J'aimerais bien que tu nous expliques comment quelqu'un qui a investi il y a 5ans a pu faire \"+184%\", parce qu'à moins que tu connaisses un super investissement je vois mal comment.Beh c'est simple, le cours au 2 fevrier 2018 etait à 7400 euros environ. Donc je dirai que avec un cours en ce moment à 21000 enviiron je suis bien à 180% environ. donc un type qui a investi 7400 euros en 2018 desolé, mais je ne vois comment il a pu perdre de l'argent avec un cours à 21 000 euros aujourd'hui. (a moins que je sois con, les chiffres parlent il me semble.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 24, 2023, 06:34:21 PM",
      "body": "Quote from: yohannc on January 24, 2023, 05:56:19 PMBeh c'est simple, le cours au 2 fevrier 2018 etait à 7400 euros environ. Donc je dirai que avec un cours en ce moment à 21000 enviiron je suis bien à 180% environ. donc un type qui a investi 7400 euros en 2018 desolé, mais je ne vois comment il a pu perdre de l'argent avec un cours à 21 000 euros aujourd'hui. (a moins que je sois con, les chiffres parlent il me semble.)Si c'est ça ta conclusion en faisant parler les chiffres comme tu dis, tout va bien alors. Pourquoi être aussi tendu (\"totalement faux ce que tu ecris\", \"aigri\", \"con\")? Bizarrement on a pas l'impression que ca soit toi le mec confiant et serein ici?   Pourtant la vie est belle si il suffit d'investir dans Bitcoin pour mettre fin à la pauvreté et garantir une bonne retraite à tout le monde. On devrait suggérer cette solution à Macron avant que le Salvador nous pique notre place au G7.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "January 24, 2023, 06:53:42 PM",
      "body": "Quote from: Saint-loup on January 24, 2023, 06:34:21 PMQuote from: yohannc on January 24, 2023, 05:56:19 PMBeh c'est simple, le cours au 2 fevrier 2018 etait à 7400 euros environ. Donc je dirai que avec un cours en ce moment à 21000 enviiron je suis bien à 180% environ. donc un type qui a investi 7400 euros en 2018 desolé, mais je ne vois comment il a pu perdre de l'argent avec un cours à 21 000 euros aujourd'hui. (a moins que je sois con, les chiffres parlent il me semble.)Si c'est ça ta conclusion en faisant parler les chiffres comme tu dis, tout va bien alors. Pourquoi être aussi tendu (\"totalement faux ce que tu ecris\", \"aigri\", \"con\")? Bizarrement on a pas l'impression que ca soit toi le mec confiant et serein ici?   Pourtant la vie est belle si il suffit d'investir dans Bitcoin pour mettre fin à la pauvreté et garantir une bonne retraite à tout le monde. On devrait suggérer cette solution à Macron avant que le Salvador nous pique notre place au G7.    Je peux te conseiller ce site : https://er-bybitcoin.com/stacking-em-volume-29-december-2022/Ça marche pas trop mal pour lui",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yohannc",
      "created_time": "January 24, 2023, 07:15:39 PMLast edit: January 24, 2023, 08:49:01 PM by yohannc",
      "body": "Quote from: Saint-loup on January 24, 2023, 06:34:21 PMQuote from: yohannc on January 24, 2023, 05:56:19 PMBeh c'est simple, le cours au 2 fevrier 2018 etait à 7400 euros environ. Donc je dirai que avec un cours en ce moment à 21000 enviiron je suis bien à 180% environ. donc un type qui a investi 7400 euros en 2018 desolé, mais je ne vois comment il a pu perdre de l'argent avec un cours à 21 000 euros aujourd'hui. (a moins que je sois con, les chiffres parlent il me semble.)Si c'est ça ta conclusion en faisant parler les chiffres comme tu dis, tout va bien alors. Pourquoi être aussi tendu (\"totalement faux ce que tu ecris\", \"aigri\", \"con\")? Bizarrement on a pas l'impression que ca soit toi le mec confiant et serein ici?   Pourtant la vie est belle si il suffit d'investir dans Bitcoin pour mettre fin à la pauvreté et garantir une bonne retraite à tout le monde. On devrait suggérer cette solution à Macron avant que le Salvador nous pique notre place au G7.    je suis totalement serein... c'est la facon que tu as de repondre à Rocou. il y a 5ans blabla en gros c'est la loose aujourd'hui.Je ne suis pas un grand genie, qui sait tout sur tout et qui a explication à tout, Je regarde simplement les chiffres, pour rectifier ce que tu dis c'est tout. donc j'affirme qu'un type qui investi en fevrier 2018 à acheté autour des 7400 euros et si il revend aujourd'hui et bien il revend à 21 000 euros.donc oui, moi j'affirme que en 5 ans les gens ont gagné de l'argent. et je suis encore plus serein pour celui qui a investi il y a 10ans........ Les entreprises qui ferment sont pour la pluspart des escrocs qui ont voulu escroquer les gens en leur vendant ce qu'ils ne possedaient pas.Quand aux fermes de minage qui ferment, et bien c'est le jeu, la preuve avec \"mably\" qui tiens son fils de discussion et qui nous demontre encore que le 20 janvier le hashrate a atteint un nouveau record....... (pourtant des mineurs coulent, mais d'autre arrivent avec des machines toujours plus perfomantes) et je pari que mably ne va pas tarder à nous faire son post d'ici quelques jours avec un nouveau record( vu que la difficulté va changer d'ici quelques jours) donc je ne vois pas bien en quoi le BTC explose en vole, je ne vois que des entreprises qui ont voulu surfer sur le BITCOIN en ayant comme seul but, voler les gens.sinon le BITCOIN se porte trés bien.oui, je suis un maximaliste, j'adore le BITCOIN, et je suis totalement serein.Désolé legaulois pour le HS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G.Seed",
      "created_time": "January 24, 2023, 10:15:25 PM",
      "body": "QuoteJe trouve les méthodes de la CGT un peu abusé.la CGT :- Organisation de manifestations dans les quartiers des classes moyennes/ supérieures (République / Bastille ) jamais dans les quartiers des vrais riches.- Grèves qui emmerdent les classes moyennes (métro / train), on ne va pas bloquer les pistes d'atterrissage des jets privés.- L'essence, pareil.Les syndicats, c'est pour dévier les colères légitimes des gens, ça pourrit notre image, on passe pour un pays d'arriérés, ça coûte la peau du cul, et ça n'a pas empêché la baisse du niveau de vie depuis des décennies parce que les causes sont profondes.Faut être logique, tu fais la guerre aux puissants mais avec le tampon des puissants, en respectant les règles que te donnent les puissants et tu penses que tu vas être efficace.Par exemple, pas de journée \"transport gratuit\" à la place de la grève car les puissants n'en veulent pas.En revanche, oui, un poste de planqué syndicaliste, c'est un bon moyen d'être payé à rien faire et plus si affinitésQuoteIl a été proposé de revenir sur les 35h et de faire 35,5h. Ca à l'air pas mal comme idée, on pourrait rajouter carrément 1h, c'est pas la fin du monde. Déjà que 35h, c'est pas beaucoup...Alors déjà : audit complet des dépenses de l'Etat : - Subvention des médias, où va l'argent, combien sont payés les journalistes ?- Subventions des associations- Subventions \"culturelles\"- Cout de l'UE- les rentes à vie dans la politique- les fraudes et les abus- Les administrations qui pourraient fonctionner mieux et moins cher en acceptant d'entrer dans le XXIeme siècle.Une fois qu'on aura un minimum de confiance dans la façon dont le budget est utilisé, on pourra parler de pomper les pigeons.Que ce soit une heure en plus par semaine, une année en plus avant la retraite, un impôt en plus, ou l'inflation, peu importe.C'est comme demander à une femme si elle préfère se faire violer par le vagin, les fesses ou la bouche.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "February 08, 2023, 10:07:02 PM",
      "body": "'tin, j'ai découvert un truc aujourd'hui: le revenu minimum vieillesse  (c'est pas le nom correct mais passons)Naïvement, je pensais que quelqu'un qui n'a jamais travaillé, au moment de la retraite touchait le RMI.Ben oui quoi, c'est normal, t'es resté sur le canapé pendant 40 ans.Hors je vois donc cette allocation minimum vieillesse, mais j'ai un doute.Genre, tu n'as rien glandé de ta vie et tu vas toucher 960€ par mois! Plus APL, chèque énergie, prime noël, et tout ce qui va avec je présume.On peut arrondir à 1000€ par moisMais je vois plein de retraités qui touchent 1000-1100€ de retraites tout en ayant travaillé pendant des années et de années. Certes pas pendant 43 ans complet, mais des années quand même.J'ose espéré avoir mal compris sur cette allocation vieillesse. Autrement, ca voudrait dire que ca rapporte autant, voire plus d'être au RMIAh et sinon, ces appels téléphoniques anonymes aux députés du RN. Obligé c'est un coup de la nupes ca",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rocou",
      "created_time": "February 09, 2023, 10:19:31 AM",
      "body": "Quote from: LeGaulois on February 08, 2023, 10:07:02 PMJ'ose espéré avoir mal compris sur cette allocation vieillesse. Autrement, ca voudrait dire que ca rapporte autant, voire plus d'être au RMIJe me souviens d'un voisin qui touchait 120€ de retraite (si si, c'est possible) et qui souhaitait compléter avec le minimum vieillesse.Rassure toi, les conditions d'accès sont draconiennes et pour certaines, malhonnêtes.Si vous êtes propriétaire de votre maison, l'administration vous versera le minimum vieillesse mais récupèrera votre maison à votre mort.Si vous êtes logés à titre gratuit (c'était le cas de mon voisin, logé par sa soeur), un loyer fictif est calculé et il est compté comme revenu. Par conséquent vous n'avez pas droit au minimum vieillesse.En outre, cette aide ne s'ajoute pas à ta retraite, elle la complète jusqu'à atteindre les 960€ que tu évoques.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "February 09, 2023, 01:22:32 PM",
      "body": "Quote from: Rocou on February 09, 2023, 10:19:31 AMtiens lui le pauvre toute la journée à traire ses vaches, il préférerait les voir mourir dans leur merde les ptits vieux ..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}