{
  "id": "topic_5445331",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "March 17, 2023, 10:31:01 PM",
  "content": "An interesting read from 2 days ago on how bitcoin transactions can be done using USSD protocol instead of the internet. It's more of a novelty as currently less than 3,000 users and this form of sending information is not encrypted, therefore not very safe - but still interesting.How Africans Are Using Bitcoin Without Internet Accesshttps://www.forbes.com/sites/digital-assets/2023/03/15/how-africans-are-using-bitcoin-without-internet-access/QuoteThere’s a growing population of Africans without reliable internet access that are still using bitcoin for peer-to-peer transactions thanks to a solution called Machankura.In 2022, South African software developer Kgothatso Ngako built a tool, Machankura, for accessing bitcoin despite the continent’s mobile internet connectivity challenge. It offers a way to access the Lightning Network through an Unstructured Supplementary Service Data interface, utilizing mobile phones’ Subscriber Identity Module telecommunication network. USSD is similar to Interactive Voice Response. (...)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445331",
  "comments": [
    {
      "author": "Kakmakr",
      "created_time": "March 20, 2023, 08:53:01 AM",
      "body": "The moment when you are going through some centralized cellphone service provider, it is not decentralized anymore.... right? I know some African countries also use MPESA that are also channeled through Cellphone (mobile) providers. I work part-time in Africa on contract basis and I know first hand how challenging their Internet can be, but they have Internet Cafe's there with WIFI that people are using. One thing I can say..... they are very innovative with their solutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "March 20, 2023, 07:20:29 PM",
      "body": "Quote from: Kakmakr on March 20, 2023, 08:53:01 AMThe moment when you are going through some centralized cellphone service provider, it is not decentralized anymore.... right?The idea is to just replace (also centralised) Internet Service Providers with mobile phones service providers. This doesn't have much to do with (de)centralisation of Bitcoin network. The main concern is whether the app itself (Machankura) has control over your funds or not.Quote from: Kakmakr on March 20, 2023, 08:53:01 AMI work part-time in Africa on contract basis and I know first hand how challenging their Internet can be, but they have Internet Cafe's there with WIFI that people are using. One thing I can say..... they are very innovative with their solutions.   As the old proverb says: necessity is the mother of invention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "March 27, 2023, 11:05:34 PM",
      "body": "Appreciate the initiative of making crypto accessible to users not having smartphones but am sorry this doesn't sound safe one single bit!!And what are the odds that somebody from the inside cant clone your Subscriber Identity Module(sim) to gain unauthorized access to these crypto services???and with this kind of service that doesn't require an extra layer of security such as 2fa authentication, this should be a no go area to be honest. Btw I have read stories of how sim cards are cloned and bank accounts wiped clean, now imagine having to lose crypto which is irreversible and very difficult to track..this tech is just aint ready for security-conscious users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 28, 2023, 04:50:58 AMLast edit: May 15, 2023, 10:53:10 AM by stompix",
      "body": "Not diffing deep into not your keys not your coins, script money that might simply not be there, lack of security, and the fact that once your phone gets stolen or lost you're done for as you have no way of further securing your account, I see another problem with their current status:So the maximum amount you can send is 5000 satoshi or $1.35?Would this mean that for example paying someone a wage even in the poorest countries you're going to have to make 30-40 transactions?A bit rather inconvenient.But the real problem is somewhere else and probably this is the reason for the low number of users:https://drive.google.com/file/d/1BUn47Kh3Umt_w_1QANpyBchlpVMFdJxu/viewYou can only fund your wallet by buying a voucher and those vouchers have, what a surprise:Quote7% commission + processing fee applies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davidoliver",
      "created_time": "April 14, 2023, 06:06:43 PM",
      "body": "Bitcoin transactions require internet access, so it is not possible to use Bitcoin without internet access. However, there are some creative solutions that Africans are using to access the internet and use Bitcoin even in areas where internet access is limited. Here are a few examples:Bitcoin via SMS: Some companies are offering Bitcoin transactions via SMS. Users can send and receive Bitcoin transactions using simple text messages, which can be sent and received via mobile phones even in areas with limited internet access.Mesh networks: Some African communities have developed mesh networks, which are local networks that can operate without an internet connection. These networks allow users to connect to each other and share information, including Bitcoin transactions.Satellite internet: In areas where there is no internet access, some African communities are using satellite internet services. These services provide internet access via satellite, which can be expensive but can allow for Bitcoin transactions.Bitcoin ATMs: Some African countries have Bitcoin ATMs, which allow users to buy and sell Bitcoin without internet access. These ATMs work by connecting to the Bitcoin network via satellite or other means, allowing users to access Bitcoin even in areas without internet access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 23, 2023, 08:06:31 PM",
      "body": "Quote from: Kakmakr on March 20, 2023, 08:53:01 AMThe moment when you are going through some centralized cellphone service provider, it is not decentralized anymore.... right? I know some African countries also use MPESA that are also channeled through Cellphone (mobile) providers. I work part-time in Africa on contract basis and I know first hand how challenging their Internet can be, but they have Internet Cafe's there with WIFI that people are using. One thing I can say..... they are very innovative with their solutions.   For a continent that has limited access to the internet and Android phones, this service is a welcome development. With this service, many people will be aware of Bitcoin as a currency that can be used for payments. But the challenge will be poverty, illiteracy, and unreliable mobile phone network. This service will not be popular because most people in Africa don't have enough to buy Bitcoin. Using Machankura is even more complicated than using a normal Bitcoin wallet, therefore most uneducated people will not accept this service because of its complexities. Sometimes, for days there might not be a mobile phone network in most developing countries in Africa. Lack of or interrupted network connection will hinder the progress of this innovative service. There is a high rate of scams in Africa, so granting an unknown third party the custody of your funds might be very risky. Like stated before, it is a good product that still has the potential for improvement and advancement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "April 24, 2023, 12:56:30 AM",
      "body": "Quote from: pawel7777 on March 20, 2023, 07:20:29 PMQuote from: Kakmakr on March 20, 2023, 08:53:01 AMThe moment when you are going through some centralized cellphone service provider, it is not decentralized anymore.... right?The idea is to just replace (also centralised) Internet Service Providers with mobile phones service providers. This doesn't have much to do with (de)centralisation of Bitcoin network. The main concern is whether the app itself (Machankura) has control over your funds or not.Quote from: Kakmakr on March 20, 2023, 08:53:01 AMI work part-time in Africa on contract basis and I know first hand how challenging their Internet can be, but they have Internet Cafe's there with WIFI that people are using. One thing I can say..... they are very innovative with their solutions.   As the old proverb says: necessity is the mother of invention.I reckon much of everyone in the community underestimates how much centralisation there is in bitcoin's decentralised sphere including development. Similar to what you mentioned, internet service providers are centralised. The same centralized internet providers that give everyone access to Github, also a centralised platform. The creators of the hardware where everything is hosted is a centralisation risk.However, nothing is perfectly decentralised and about this is bad, I reckon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "April 24, 2023, 09:45:23 PM",
      "body": "Quote from: bbc.reporter on April 24, 2023, 12:56:30 AMI reckon much of everyone in the community underestimates how much centralisation there is in bitcoin's decentralised sphere including development. Similar to what you mentioned, internet service providers are centralised. The same centralized internet providers that give everyone access to Github, also a centralised platform. The creators of the hardware where everything is hosted is a centralisation risk.However, nothing is perfectly decentralised and about this is bad, I reckon. Centralised internet providers are not ideal and I'm really hoping to see censorship-resistant, decentralised internet in my lifetime, but it's not like they can effectively ban anyone from accessing the internet - if that happens, you could use a different service, at least for now.Not sure what exactly you mean by Bitcoin development being centralised, feel free to elaborate. But I remember times when many considered Gavin Andresen as having effective control over the entire network. Fast forward, most new Bitcoiners don't even know who he is.And I don't subscribe to the \"all or nothing\" attitude, that if we can't have everything decentralised, we should ditch decentralisation altogether.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "April 25, 2023, 06:13:37 AM",
      "body": "Quote from: bbc.reporter on April 24, 2023, 12:56:30 AMQuote from: pawel7777 on March 20, 2023, 07:20:29 PMQuote from: Kakmakr on March 20, 2023, 08:53:01 AMThe moment when you are going through some centralized cellphone service provider, it is not decentralized anymore.... right?The idea is to just replace (also centralised) Internet Service Providers with mobile phones service providers. This doesn't have much to do with (de)centralisation of Bitcoin network. The main concern is whether the app itself (Machankura) has control over your funds or not.Quote from: Kakmakr on March 20, 2023, 08:53:01 AMI work part-time in Africa on contract basis and I know first hand how challenging their Internet can be, but they have Internet Cafe's there with WIFI that people are using. One thing I can say..... they are very innovative with their solutions.   As the old proverb says: necessity is the mother of invention.I reckon much of everyone in the community underestimates how much centralisation there is in bitcoin's decentralised sphere including development. Similar to what you mentioned, internet service providers are centralised. The same centralized internet providers that give everyone access to Github, also a centralised platform. The creators of the hardware where everything is hosted is a centralisation risk.However, nothing is perfectly decentralised and about this is bad, I reckon. You make a very valid point, but it does not mean that we should develop and support more initiatives that increase centralization. The Bitcoin developers created the Lightning Network and I think the next phase of that project, should be to make it efficient and simple enough to run it on any platform. Africa are flooded with old discarded technologies (older model phones) ....so developers should target that market with new innovation. They are currently developing for 1st world markets, where there are fast bandwidth and smart phones..... so it is just a mind shift that has to take place.. for them to do that. (Developers in India are doing very good work to target 3rd world countries)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}