{
  "id": "topic_5470021",
  "title": "Aisha_jay",
  "author": "Aisha_jay",
  "created_time": "October 11, 2023, 05:55:47 PM",
  "content": "Have you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470021",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "October 12, 2023, 04:42:52 PM",
      "body": "Dreams without goals are just wishes But are wishes without dreams really goals?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "October 16, 2023, 05:44:33 AM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?Well yes I did have some big dreams when I was younger. But it does not make me good to say this but I did not accomplish that many of them.This is why I try to pass this down onto my nephews. If we want to accomplish something we must work very hard from a young age. There is nothing going to come early for us in this world, we must work hard and do it more then other people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aisha_jay",
      "created_time": "October 18, 2023, 02:29:56 PM",
      "body": "Quote from: BADecker on October 12, 2023, 04:42:52 PMDreams without goals are just wishes But are wishes without dreams really goals?Wishes are like the seeds of dreams😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 18, 2023, 04:51:14 PM",
      "body": "Quote from: Aisha_jay on October 18, 2023, 02:29:56 PMQuote from: BADecker on October 12, 2023, 04:42:52 PMDreams without goals are just wishes But are wishes without dreams really goals?Wishes are like the seeds of dreams😉My problem is that I can't find any fertile ground to plant them in. Is it the same for most of us... the poor people? Or don't I know enough about gardening?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "October 18, 2023, 06:53:53 PM",
      "body": "I'm immediately reminded of Denzel Washington, who often shares quotes along these lines. The intriguing point he makes about dreams is the importance of commitment and consistency.In your opinion, do you believe that people lose their value when they lack dreams but have clear goals?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "October 19, 2023, 07:20:35 AM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Yeah, many times and despite that they're big, I'm still dreaming and trying to achieve it in my own way. Just like the quote that I've read before that if your dreams aren't making you scared of how big they are, they're not dreams but just mere wish.Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMDreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?Like franchising restaurants, having my own set of companies like literally group of companies. How I'll be able to make them into reality? I don't know but I'm just doing everything that I can to achieve things little by little.Maybe someday in the future that there will be better people than me that will be the help to achieve my own dreams. They're like the connections that someone needs to pursue their businesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Suzume",
      "created_time": "November 19, 2023, 09:15:14 AM",
      "body": "Everyone has its own dream. Some dreams people see when they sleep some dreams that cannot make sleep people. Those type of dream  you don't do any kind of work for that it's a kind of wish. But those dream you do hard work for that and at the end of monent you are trying to achieve your dream that's the real dream.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ricardo11",
      "created_time": "November 19, 2023, 01:46:16 PM",
      "body": "Dreams are not what people see while sleeping, dreams are what do not let people sleep. Everyone has their own dreams and everyone wants to fulfill their dreams. But for this you need to put in a lot of hard work and set your goals. You should set your goal that you will achieve your dream one day, but you can definitely achieve that dream. All you need is patience, will power, right goals and a lot of hard work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 19, 2023, 02:24:50 PM",
      "body": "Quote from: Suzume on November 19, 2023, 09:15:14 AMEveryone has its own dream. Some dreams people see when they sleep some dreams that cannot make sleep people. Those type of dream  you don't do any kind of work for that it's a kind of wish. But those dream you do hard work for that and at the end of monent you are trying to achieve your dream that's the real dream. clearly op was talking about the main goal of one person not what we see when we sleep it’s usually called a dream because it’s often seen as impossible as they say “dream big” because dreams are endless and there’s tons of possibilities out there we just need to know when to get there don’t be scared and take a leap sometimes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanugarid",
      "created_time": "November 19, 2023, 05:19:18 PM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?Just work hard and never give up and always pray to God to guide you every day, you will achieve all your dreams in life one by one. Just be patient, don't rush. There are many trials that will block your dreams and you have to overcome them. It's free to dream and if you're going to dream, make your dream bigger in life because I believe that nothing is impossible for a person who is hardworking, patient, godly and helpful to others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 20, 2023, 08:53:09 PM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMwhat are your dreams, and how will you turn them into reality with valuable goals?If you have one, then never let others know before it becomes a reality for reasons like they might call you crazy, they can copy your idea and make it as their own before you, discourage you, and start making you believe that it is impossible to achieve that.Yes, I have a goal and I have plans about how to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 21, 2023, 01:33:16 AM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?The title should be \"A Dream Without ACTION\" will remain wishes Because I believe that we must act in every dream and every plans , the more we are actingis the more it becomes reality and will turn into something promising.Have dreamed of having a House ,  worked hard and now I have smaller one yet a House.Dreaming a Car now I have a second hand car.All dreams will come true if we will only true to our self and actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pi-network314159",
      "created_time": "November 21, 2023, 01:14:57 PMLast edit: March 08, 2024, 08:27:07 AM by Pi-network314159",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?Life don gives you what you want. Rather fix you were you belong. There is a difference between dream and wishes.dream is when you have passion for something and have sleepless night over it until it's Achieved or dream are that which don't allow you to sleep according to popular saying.. But wishes is just a kind of exaggeration or what you want to be probably didn't work out.dreams can only be achieved if you work towards it, but failure to work towards it, it becomes a wish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "November 21, 2023, 03:42:13 PM",
      "body": "Most people can't remember their dreams... to say nothing about if their were any goals behind them or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 22, 2023, 03:21:33 AM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?Dreams are dreams , Wishes and Goals are two different thing .Dreams are being used in real life but remember that dreaming means we are sleeping so the truth is  this isn't reality instead Dreams are already forgotten when we woke up(though we still remember some part) but never the totality .Quote from: BADecker on November 21, 2023, 03:42:13 PMMost people can't remember their dreams... to say nothing about if their were any goals behind them or not. We are dreaming everyday but yeah we cannot even remember in the morning .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Suzume",
      "created_time": "November 22, 2023, 05:02:54 AM",
      "body": "Quote from: btc78 on November 19, 2023, 02:24:50 PMQuote from: Suzume on November 19, 2023, 09:15:14 AMEveryone has its own dream. Some dreams people see when they sleep some dreams that cannot make sleep people. Those type of dream  you don't do any kind of work for that it's a kind of wish. But those dream you do hard work for that and at the end of monent you are trying to achieve your dream that's the real dream. clearly op was talking about the main goal of one person not what we see when we sleep it’s usually called a dream because it’s often seen as impossible as they say “dream big” because dreams are endless and there’s tons of possibilities out there we just need to know when to get there don’t be scared and take a leap sometimes  I sayed that goals are that kinds of dream which awake people from sleep. You sayed big dreams are impossible but in my opinion big dreams motivate person a lot to get a good achievement. Suppose you are here and your dream to be a rich person and you are continuously doing hard work for achive your goals. End of the day you achive a place which beacose of your big goals. If you don't have big goals did you do that much hard work. That's I'm try to say that completing big goals age kind of dream but doing hard work for achieving goals and that helps you to achieve a good place in life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DirtyKeyboard",
      "created_time": "November 24, 2023, 02:18:51 AM",
      "body": "Yes.   Goals need plans and action to become reality.I like to think about setting SMART goals.  https://en.wikipedia.org/wiki/SMART_criteriaI don't go through the rigorous process as often as I should, but it does guide my actions towards goals.Good luck and keep stacking.  Oops.  Keep stacking is not a SMART goal.  I should have said, everybody continue to DCA X% of your investment income every 2 weeks at Y exchange.Figuring out the variables is your own due diligence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vinc3",
      "created_time": "November 24, 2023, 02:25:36 AM",
      "body": "Quote from: Aisha_jay on October 11, 2023, 05:55:47 PMHave you ever had big dreams and wondered how to make them happen?Dreams are like the stars in the sky, shining, brightly, and full of possibilities. By setting valuable goals, you're not only turning your dreams into reality, but you're also giving yourself a clear path to follow. So, what are your dreams, and how will you turn them into reality with valuable goals?Definitely a yes to this. Dreams are the blueprint of your future self it depends upon your willingness to go through hardships and fulfill these dreams, the more emotions, perseverance and focus you give into this the more possibilities will be in achieving them. Never give up and stay through the path. We are just passerbys in this world make the best out of it. Hardships and trials are there to make us stronger, and make the DREAMS sweeter. My dream is to become a pro trader, a life coach and very good provider to my family. A father and a husband who is there for his family. Thank you for this post for making my path clear once again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JackieKing",
      "created_time": "November 24, 2023, 03:52:32 AM",
      "body": "Yes, I've had dreams big and small. I have also thought about how to make them a reality. Some dreams, hopes and aspirations of the mind have been fulfilled by the great Lord. Hopes, dreams, needs etc. are involved in human life. It is normal for people to have some dreams and it is abnormal not to have them. Hopes and dreams are of immense importance if we want to enjoy our lives. Not just a dream. We have to work hard and have unwavering faith in the Lord to make our dreams come true. He will fulfill all my hopes one day Insha Allah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}