{
  "id": "topic_5412954",
  "title": "Jiovanni",
  "author": "Jiovanni",
  "created_time": "September 09, 2022, 07:09:25 AM",
  "content": "Queen Elizabeth II died Amid uncertain times in the UK and the world at Large. The Great Loss took place on Thursday at Balmoral Castle in Scotland. Britain’s longest-serving monarch was 96 years old and had reigned for 70 years.“Marketplace” host Kai Ryssdal spoke with Marketplace’s Stephen Beard in London about the mood in the country. The following is an edited transcript of their conversation.From Kai RyssdalThis comes at a turbulent time for the United Kingdom. Inflation, a new prime minister, great uncertainty, which the queen was the very antithesis of, right? She was stability and consistency and all of those things.From Stephen BeardVery much so a symbol of stability, a very decent, steady, dutiful and unpretentious person who had absolutely no enemies in the U.K. And this death was not totally, not entirely unexpected. She’d been in poor health for some months, but it is a very sobering and a sad moment. She’d been a part of everyone’s life here for so long, 70 years on the throne, Britain’s longest-reigning monarch. So not a totally unexpected event, but nevertheless quite a deep psychological blow to Britain at the moment.From RyssdalWell, so on that last point about the psychology of the British public, I was listening to a BBC podcast the other day, and — not to make an awkward turn to the Marketplace part of this — but with inflation, with gas prices, with colder winter coming on, the word that kept coming up on this BBC podcast was “fear.” There is fear now about the economy and what people are going to do. This will be a moment now of a change in national mood as they mourn the queen and try to get through it.From BeardYes, absolutely. She died — although at the age of 96 — too soon. There is, as you say, a mood of tremendous anxiety and fear with inflation spiraling out of control. One forecast suggests it might be as high as 22% in the U.K. in January. A new government taking over, it’s a time of tremendous uncertainty and instability. A time when, boy, we certainly could do with Queen Elizabeth II’s calming influence.www.marketplace.org/2022/09/08/queen-elizabeth-ii-dies-amid-uncertain-times-in-the-uk/amp/____________________________________________________Obviously, this loss will inevitably send the United Kingdom into a frenzy that will cost the British economy billions of pounds. Businesses will close as the nation is brought into mourning, just as Premier league has been placed on hold to honour the Queen's death, new currency will be printed, passports will change, military garb will need refurnished, and the national anthem will be changed as a result. Her death will shake a world that has been so accustomed to her reign to its core, completely transforming the way we see Great Britain today. Owing to the fact that the war between Russia and Ukraine has brought about bear market to Europe and the world at Large. Now adding the fall of London Bridge.  I've got strong feelings that this event would extend the duration of bear market we're currently experiencing now.DO YOU THINK IT'S A BLESSING IN DISGUISE?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412954",
  "comments": []
}