{
  "id": "topic_5523004",
  "title": "bitzizzix",
  "author": "bitzizzix",
  "created_time": "December 16, 2024, 06:59:18 PM",
  "content": "Bitcoin will soon reach $110,000 and currently the price of Bitcoin has reached 107,500 and this makes 2 of my friends very happy.I have two close friends who used to be my music friends or band friends, and now we rarely meet because they are busy working as Pilots and the other one because he works out of town. And we met on November 18th at a place we often visited at that time, and we chatted a lot while asking about our activities and I told them that I was involved or invested in Bitcoin, they knew about crypto especially Bitcoin but didn't know the details and its functions.And they seemed curious to know more and finally I gave a basic explanation along with the benefits that I had gotten and also the real results that I had gotten finally my two friends were interested and I immediately and at that time also made a wallet and so on for my two friends who are still communicating until now, moreover my two friends are smart and immediately understand and can also operate it finally they bought Bitcoin on the night of November 18th and I don't know how much they bought if I'm not mistaken around $90,000+.And earlier my two friends contacted me when the price of Bitcoin reached $107,500 and they were very happy and I was happy to see my two old friends happy because they had made a profit of 18% to 19% from the price they bought on that date and I forgot how much it was at that time.And I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.And I want to know your response, because I also don't want to interfere in their affairs after getting involved with Bitcoin even though it's because of me. But I'm sure they also have intelligence, understanding and also have the ability to grow in this industry and we also always communicate even though I sometimes ignore and divert the conversation because I don't want to feel dizzy.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5523004",
  "comments": [
    {
      "author": "btcwish1",
      "created_time": "December 16, 2024, 08:51:03 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMBitcoin will soon reach $110,000 and currently the price of Bitcoin has reached 107,500 and this makes 2 of my friends very happy.I have two close friends who used to be my music friends or band friends, and now we rarely meet because they are busy working as Pilots and the other one because he works out of town. And we met on November 18th at a place we often visited at that time, and we chatted a lot while asking about our activities and I told them that I was involved or invested in Bitcoin, they knew about crypto especially Bitcoin but didn't know the details and its functions.And they seemed curious to know more and finally I gave a basic explanation along with the benefits that I had gotten and also the real results that I had gotten finally my two friends were interested and I immediately and at that time also made a wallet and so on for my two friends who are still communicating until now, moreover my two friends are smart and immediately understand and can also operate it finally they bought Bitcoin on the night of November 18th and I don't know how much they bought if I'm not mistaken around $90,000+.And earlier my two friends contacted me when the price of Bitcoin reached $107,500 and they were very happy and I was happy to see my two old friends happy because they had made a profit of 18% to 19% from the price they bought on that date and I forgot how much it was at that time.And I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.And I want to know your response, because I also don't want to interfere in their affairs after getting involved with Bitcoin even though it's because of me. But I'm sure they also have intelligence, understanding and also have the ability to grow in this industry and we also always communicate even though I sometimes ignore and divert the conversation because I don't want to feel dizzy.It's great to see you and your friends happy! However, I’d suggest avoiding specific dates when predicting a Bitcoin target price. Bitcoin has a way of surprising and shocking everyone. Instead, you could say, \"Bitcoin will definitely reach $150k if you HODL,\" but avoid attaching a timeframe. There’s no guarantee, and no analyst can promise certainty. It’s also possible that BTC could drop below $100k by the end of the year. If that happens, your friends—especially if they’ve invested at $90k and are still new to Bitcoin’s movements—might feel disappointed or upset. Good luck, and let’s enjoy the ride!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 16, 2024, 09:02:41 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.Rule number one, Don't promise or guarantee anyone over bitcoin price, secondly, don't be overconfidence.Don't be over excited here because bitcoin is a volatile currency, remember that before the recent all time, bitcoin was at $103,000 and here we are now for $107,600 all time high, which tells that we cant predict accurately what the market may turned to be, you can wake up tomorrow morning to discover that the market have already plummet to $90,000 and anything can still happened the more we go, but don't promise on people about a volatile currency, in case of any other time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 16, 2024, 09:06:27 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd earlier my two friends contacted me when the price of Bitcoin reached $107,500 and they were very happy and I was happy to see my two old friends happy because they had made a profit of 18% to 19% from the price they bought on that date and I forgot how much it was at that time.I wonder how happy your friends gonna be if bitcoin drops down to let's say $60k, which is always a possibility.   Anyway, I sure hope you explain to them that in the end there's still some risk involved and there is always a chance (despite how small it is) that they will end up with nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "December 16, 2024, 09:24:29 PM",
      "body": "It's good that your friends made some profit from Bitcoin and shared this good news with you. But what if it was the other way around? It wouldn't be nice if the price of Bitcoin started to fall and they blamed you. That's why I don't give advice like that to anyone. It's good that the price is going up and your/their investments are appreciating because we're in a bull market, but in a crash or a bear market, people will look for someone to blame. I have told many of my friends what Bitcoin is for years. But I never gave buying advice and I never said that the price of Bitcoin will be this much. These are all assumptions, there is no certainty. I believed that Bitcoin would be $1 million one day, even when Bitcoin was in the triple digits, we've already seen 100k. But I would never tell anyone to invest in Bitcoin because the price will multiply 10 times. It's useless to take responsibility for that and it doesn't do me any good. Everyone should make their own investment decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "December 16, 2024, 09:33:29 PM",
      "body": "Quote from: Rikafip on December 16, 2024, 09:06:27 PMQuote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd earlier my two friends contacted me when the price of Bitcoin reached $107,500 and they were very happy and I was happy to see my two old friends happy because they had made a profit of 18% to 19% from the price they bought on that date and I forgot how much it was at that time.I wonder how happy your friends gonna be if bitcoin drops down to let's say $60k, which is always a possibility.   Anyway, I sure hope you explain to them that in the end there's still some risk involved and there is always a chance (despite how small it is) that they will end up with nothing. I can't answer that because I don't think it will happen, and even if it does, I've explained all the risks but I see them looking excited because they also see and find good news about Bitcoin including all the good news about Trump.I don't understand because I think they are smarter than me including my education and they are different, maybe because they are too busy and also have more than enough income so they are not interested in getting involved even though they already know and I assume maybe I am the right person and also his old friend who made him finally get involved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "December 16, 2024, 09:49:18 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.And I want to know your response, because I also don't want to interfere in their affairs after getting involved with Bitcoin even though it's because of me. But I'm sure they also have intelligence, understanding and also have the ability to grow in this industry and we also always communicate even though I sometimes ignore and divert the conversation because I don't want to feel dizzy.While that sounds encouraging, I wouldn't guarantee any of my friend on how it is going to be in the year end or by 2025. I'd give my opinion but I will always say that Bitcoin is highly volatile and it might or might not be able to reach the price that I desire to see. I've learned in my past when I've got these friends as well that became interested when the price is moving up. They didn't sold at the peak but sold at losses during the bear market and put the blame on me even if I've explained everything well to them and I have no control to the prices. If I were you, I'd tell them to sell whenever they are happy and comfortable but Bitcoin is here to stay so that no blame is in you if ever that 18%-19% gain started to drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "December 16, 2024, 09:55:10 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMBitcoin will soon reach $110,000 and currently the price of Bitcoin has reached 107,500 and this makes 2 of my friends very happy.When I saw the price hit $107+k, the first thought was bitcoin will hit $110k before this year will end. Bitcoin is making those who have been investing in long time smile and most of them are selling some unit of bitcoin now while some are still on the hodling journey. That is the investment of bitcoin. Everyone can't be in one page because we all have different thinking and plans. So we don't have to force people to invest the way you did it doing.Making people very now can still make people cry in years to come. Now that the price is $107+k and you are happy and sell your coins then years to come you see bitcoin $500+ and you don't have anything to sell. What will you do? Blame yourself which will be the normal thing to do is to safe small amount of bitcoin even though you sell large quantities. Don't empty your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xmrhopium",
      "created_time": "December 16, 2024, 10:04:32 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMBitcoin will soon reach $110,000 and currently the price of Bitcoin has reached 107,500 and this makes 2 of my friends very happy.Nice atleast your friends found intrested towards, are your colleagues diamond handed? Anyway I can't excatly suggest my real homies as like yours here in my place tho, if certain something goes wrong with Bitcoin like an (epic price drop, ban, key lost) they'd likely gonna kick my b*utt, also expect me to pay all the amout whatever they've invested with profits. So, i found much better shutting my mouth, learn and earn in incognito by self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "December 16, 2024, 11:24:14 PM",
      "body": "This cycle is the most stable bull run I’ve seen. It’s slow but very consistent. Of course, we’ve had some minor dumps, but that’s just part of it... it doesn’t look like a pump-and-dump scheme like in the earlier stages. I’d say the market has matured, and holding now feels much more secure, especially if you tend to panic when you see dips.I believe $110k will happen soon, and $150k might even be possible this year. However, the bull market shouldn’t end this year, as historically, it usually continues into the early months of the following year. For this cycle, I’d love to see that trend break and the bull market continue for the entire year.Same day last year,  Bitcoin’s price was only $41,392.63. That means we’re already up 154% in just one year. Imagine how much more growth we could see in the coming years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moreno233",
      "created_time": "December 16, 2024, 11:46:52 PM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMBitcoin will soon reach $110,000 and currently the price of Bitcoin has reached 107,500 and this makes 2 of my friends very happy.I have two close friends who used to be my music friends or band friends, and now we rarely meet because they are busy working as Pilots and the other one because he works out of town. And we met on November 18th at a place we often visited at that time, and we chatted a lot while asking about our activities and I told them that I was involved or invested in Bitcoin, they knew about crypto especially Bitcoin but didn't know the details and its functions.And they seemed curious to know more and finally I gave a basic explanation along with the benefits that I had gotten and also the real results that I had gotten finally my two friends were interested and I immediately and at that time also made a wallet and so on for my two friends who are still communicating until now, moreover my two friends are smart and immediately understand and can also operate it finally they bought Bitcoin on the night of November 18th and I don't know how much they bought if I'm not mistaken around $90,000+.And earlier my two friends contacted me when the price of Bitcoin reached $107,500 and they were very happy and I was happy to see my two old friends happy because they had made a profit of 18% to 19% from the price they bought on that date and I forgot how much it was at that time.And I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.If you cherish your friendship so much with them, quickly inform them to think beyond the quick profits they are seeing and consider holding Bitcoin for at least 5 years from today because that is when they will truly appreciate Bitcoin the more. If they are so excited about the quick profits and a correction happens in the market where they will see their investment go below the entry price, they might panic and would want to sell to cut down the losses but if you inform them that such things happens and when it does while they are holding that they should not panic rather should hold for the long term",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 17, 2024, 01:36:46 AM",
      "body": "This is where understanding Bitcoin's fundamentals comes in and whether you're convinced of it or not. I don't know how much your friends understand Bitcoin or whether they're interested in it only as an investment, but if they believe in what Bitcoin truly offers, they would keep it regardless of the 19% return after only a month and the prospect of $180,000 next year. They'll even add more. But to each his own. There's a professor from a top university here in my country who supports Bitcoin only in terms of its price appreciation. He invests, takes profit. He doesn't even hodl, doesn't talk about Bitcoin's philosophy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "December 17, 2024, 02:03:03 AM",
      "body": "It may hit that in 2024, or it may not.  It may be in 2025 or not at all.  Make sure they know it isn't a get rick quick thing.  The long term trajectory has been up and it seems likely to continue. Much more so than say 2010, or 2011.  Or 2016 etc.  More people involved means more stability, and now instead of it being 50/50 Bitcoin will succeed, it is much higher but nothing is guaranteed.  There have been times that even the most patient people have been tested, let along people in it for a quick buck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "December 17, 2024, 02:40:42 AM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.I can or can not hit $150,000 or $180,000 but does my hope make you sad?I hope that Bitcoin will stay around low price as long as possible, so a newcomer like me will be given cheap price and more time for my Bitcoin accumulation. My hope might not be satisfied by Bitcoin market, but I am going to DCA bitcoin.My hope signals one big thing for you and early comers in this market, if you guys have bitcoin, bought it at very cheaper price, you are holding your fortune. Will you sell your fortune for $150,000 / BTC or will hold it for some more cycles and take profit at x times than $150,000?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "COBRAS",
      "created_time": "December 17, 2024, 04:31:14 AM",
      "body": "I think btc will be 100 mln",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 17, 2024, 04:37:46 AM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd I want to know your response, because I also don't want to interfere in their affairs after getting involved with Bitcoin even though it's because of me. But I'm sure they also have intelligence, understanding and also have the ability to grow in this industry and we also always communicate even though I sometimes ignore and divert the conversation because I don't want to feel dizzy.You are very fortunate to have introduced them when the price is bullish. Since they intend to keep it for a short time, its an easy and quick return for them. Your story might be different from other people's experiences who got insulted and even attacked for introducing people to buy Bitcoin. A friend had to flee from his home because the people he encouraged to invest in Bitcoin have been coming to insult. They believed he introduced them to a scam when the Bitcoin price was dropping drastically. They didn't understand that Bitcoin is not a get rich quick investment. Since that experience, I only tell people about Bitcoin but they will have to make decisions if they want to invest or not. I also informed them that the price is unpredictable and it is better seen as a long-term investment. However, congratulations to your friends and tell them to be set for another cycle because it will be better to DCA or buy during the bear season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 17, 2024, 04:40:11 AM",
      "body": "Quote from: bitzizzix on December 16, 2024, 06:59:18 PMAnd I continue to motivate them to continue holding or if they want to continue buying periodically because I guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000.Now you will have a problem to keep convincing your friends with your speculation, I wish Bitcoin price only hit $149,999 in this cycle, I want to see how your friends will react. Everyone will happy and become your friends when you give something, but once you stop it, you will know their true face.Regardless they're close friends or not, everyone are same.Quote from: SilverCryptoBullet on December 17, 2024, 02:40:42 AMMy hope signals one big thing for you and early comers in this market, if you guys have bitcoin, bought it at very cheaper price, you are holding your fortune. Will you sell your fortune for $150,000 / BTC or will hold it for some more cycles and take profit at x times than $150,000?Imagine if Bitcoin price cross $450,000 in the next cycle, it means if you keep holding your coins and sell it at $450K, you made 350% return if you bought Bitcoin at $100K.I would choose to sell at $150K, which give me return 50% and then bought Bitcoin when the price fall to $50K, so I hold 3 Bitcoin until $450K, now my money worth $1,350K or 1,250% return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "December 17, 2024, 06:13:57 AM",
      "body": "We are so close to $110,000 day by day. The possibilities to reach that price in this month still wide open so we can wait that and prepares our Bitcoin if we want to sell at that price. But you can not guarantee that in 2024 the price of Bitcoin will reach $150,000-$180,000 because we don't know for sure. You can still motivate them to buy and holding their Bitcoin but you should explain to them what is their target price to sell and when they can sell their Bitcoin.It is good if we can explain Bitcoin to our close friends and they can accepts and trying to invest in Bitcoin. They will see their profit will grow and make a profit from the investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "December 17, 2024, 06:38:21 AM",
      "body": "Quote from: Rikafip on December 16, 2024, 09:06:27 PMI wonder how happy your friends gonna be if bitcoin drops down to let's say $60k, which is always a possibility.   Anyway, I sure hope you explain to them that in the end there's still some risk involved and there is always a chance (despite how small it is) that they will end up with nothing. It's kind of funny that a large number of people don't think of that scenario when investing in Bitcoin. Everything is possible, and to be honest, it's highly probable we'll be in another bear market after the year 2025. As others have already suggested, the OP shouldn't make promises that can't be kept; it's not on you to promise them it'll surpass $150,000. You mentioned 2024, but I'm assuming you meant 2025. Maybe it will, but maybe it won't; the price goes both ways. You've prompted them into buying Bitcoin, but that doesn't necessarily mean that they have full knowledge of how to manage their investment. Being overly confident is as bad as being overly pessimistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "December 17, 2024, 06:41:43 AM",
      "body": "Your friends did well, as well as you yourself, but as it was said out there already - don't promise anything to anybody, due to how they can view it in the perspective if things don't go your way.Sure, BTC will reach all the targets in the future, but the path toward them will be one with dips, corrections, and many other events that will shape the crypto space in general. p.s you've got a typo in the name of the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}