{
  "id": "topic_5441397",
  "title": "santodelemosrjz67@gmail.c",
  "author": "santodelemosrjz67@gmail.c",
  "created_time": "February 27, 2023, 11:22:05 AMLast edit: February 27, 2023, 11:43:59 AM by santodelemosrjz67@gmail.c",
  "content": "I just got scammed by OP (Thread starter), and i post my reviews on thread and my review post has been deleted two times, I am avoid to say it but having doubts on Moderators, I don't care about my scam money, but its help to avoid other peoples get scammed, So I hope this issue will be resolved with better way..Reported Thread: https://bitcointalk.org/index.php?topic=5428203.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441397",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "February 27, 2023, 12:14:24 PM",
      "body": "How did you post your review? If you have sufficient proof make a new thread on scam accusations[1]. Follow the proper rule to post the thread and explain your story there. Sometimes a seller will use a self-moderated thread to remove malicious posts so the fault does not lie on the moderator. Make sure to keep it in mind just in case you want to buy from somebody else in the future.From my experience in this forum, no staff would encourage scammers. In fact, almost all members would actively try to hinder their activities with trust feedback, flags, etc. [1] https://bitcointalk.org/index.php?board=83.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fadhilz123",
      "created_time": "February 27, 2023, 12:37:41 PM",
      "body": "You can report it by completing the proof in a more appropriate thread so that there is a resolution with a better direction. Because you can't accuse the moderator of doubting this. Because it looks like you were scammed by someone else in a very different way and now try to make a complaint about this on the thread that has been suggested by @joniboini just now. Because it is indeed more appropriate for you to make a kind of complaint by completing the evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "February 27, 2023, 12:49:47 PM",
      "body": "OP, you should create a new thread and show evidence for your allegation. I don't know why your previous post was deleted, but the thread you are referring to was not self-moderated by the thread creator. My assumption is someone reported your post to the moderator as spam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "February 27, 2023, 01:02:58 PM",
      "body": "Quote from: santodelemosrjz67@gmail.c on February 27, 2023, 11:22:05 AMI am avoid to say it but having doubts on Moderators,You must be doing it wrong.Did you make a proper thread with proper proof in Reputation? Nope.Did you read the forum rules and tried to understand the way the forum works? I doubt it.I've looked in the history of your (mostly deleted) posts and the fact that you are even asking for proof from a seller already having red tag means that you ask them to show ingenuity in scamming you.Your posts in those topics may have been reported as off-topic, and without proof you just look like a competitor seller that wants to discredit them; hence it's not that odd to see them removed.So... do it right and I'm sure that people will start listening to your points.PS. This very thread should actually be in Meta, I'd say...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "santodelemosrjz67@gmail.c",
      "created_time": "February 27, 2023, 01:21:00 PM",
      "body": "Thanks, everyone for the reply, Now I will follow the Proper way to report about the thread.. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 27, 2023, 02:28:33 PM",
      "body": "Quote from: santodelemosrjz67@gmail.c on February 27, 2023, 11:22:05 AMI just got scammed by OP (Thread starter), and i post my reviews on thread and my review post has been deleted two times, I am avoid to say it but having doubts on Moderators, I don't care about my scam money, but its help to avoid other peoples get scammed, So I hope this issue will be resolved with better way..It's better to create new topic in Scam Accusations section, and provide more evidence there especially since you are a newbie in forum.PSI don't think it's a good idea to use your gmail account as a username in bitcointalk forum.If I was in your place I would contact moderators and asked for username change, that is if you care about privacy at all, and if you don't want to receive bunch of emails from scammers and hackers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "February 27, 2023, 02:40:40 PM",
      "body": "Quote from: santodelemosrjz67@gmail.c on February 27, 2023, 11:22:05 AMI just got scammed by OP (Thread starter), and i post my reviews on thread and my review post has been deleted two times, I am avoid to say it but having doubts on Moderators, I don't care about my scam money, but its help to avoid other peoples get scammed, So I hope this issue will be resolved with better way..Reported Thread: https://bitcointalk.org/index.php?topic=5428203.0Did you create a thread for the report? If no then you didn't do the right thing. You have to create a thread and provide as much evidence as you can provide to back up your claim. And also the reason you previous reports were deleted must be as a result of you posting it in the scammer's (as you have claimed) thread and he reported it as a spam or an off-topic post, so to prevent this from repeating itself just go on with the thread creation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "February 27, 2023, 05:29:48 PM",
      "body": "As others have already said you should open a proper thread in scam accusations board with evidence supporting your accusations on which some discussion can be carried upon and your thread will have some effect on users.Quote from: dkbit98 on February 27, 2023, 02:28:33 PMI don't think it's a good idea to use your gmail account as a username in bitcointalk forum.If I was in your place I would contact moderators and asked for username change, that is if you care about privacy at all, and if you don't want to receive bunch of emails from scammers and hackers.Right and it's not advisable anywhere to use your mails or any personal information as your username so this thing should be looked upon while registering any account.But changing your username is not easy on forum as I think it's in @theymos hands only so it would be tough for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hilariousandco",
      "created_time": "February 27, 2023, 06:39:32 PM",
      "body": "Most of the reports against you have been marked as bad but if you're spamming the same thing multiple times a day then they'll probably be removed for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "February 27, 2023, 06:53:24 PM",
      "body": "Always use escrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "February 28, 2023, 07:33:25 AM",
      "body": "Quote from: OgNasty on February 27, 2023, 06:53:24 PMAlways use escrow.Very straight to the point and I also learnt this in a very hard way.I wouldn't trade with anyone without a reputation to protect without using an escrow and even if there is a reputation, it all depends on how much worth of what we're trading, hence I'm using an escrow.I'm sorry mate @OP and I hope you learnt see good lessons from that incidence but I'm shocked that you traded with someone that already has a red tag on trust and hope you aren't blaming anyone for your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "February 28, 2023, 08:09:02 AM",
      "body": "Quote from: Obari on February 28, 2023, 07:33:25 AMbut I'm shocked that you traded with someone that already has a red tag on trust and hope you aren't blaming anyone for your loss.After being associated with this scam, the fraudster was only recently been identified and tagged with red. It will cost to hire an escrow, especially for small trades. Unless we have an escrow that is willing to make these minor trades and has no minimum fee. Anyhow, trading with these newbie ranks is extremely risky because they may not care about the red tags. A second account could be created in a matter of minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "February 28, 2023, 03:25:18 PM",
      "body": "Quote from: Getmon on February 28, 2023, 08:09:02 AMQuote from: Obari on February 28, 2023, 07:33:25 AMbut I'm shocked that you traded with someone that already has a red tag on trust and hope you aren't blaming anyone for your loss.After being associated with this scam, the fraudster was only recently been identified and tagged with red. It will cost to hire an escrow, especially for small trades. Unless we have an escrow that is willing to make these minor trades and has no minimum fee. Anyhow, trading with these newbie ranks is extremely risky because they may not care about the red tags. A second account could be created in a matter of minutes.Exactly my point because I really don't see any reason to trade with a newbie account with expectations to make a red tag just incase things go wrong.I'm sure that they can easily dump the account and go get a new one so why waste my time on an account that easily be abandoned by the owner?I once traded with a newbie account that made away with over $68 in Hong Kong currency but I wasn't so bothered because I knew there were possibilities of me losing the money and I would have given the user a positive trust if he turned up with the money but I'm sure he was so greedy and earned a red tag from me making his account worthless and I feel bad when I see people been scammed irrespective of the amount been scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "March 01, 2023, 02:11:21 AM",
      "body": "Quote from: Obari on February 28, 2023, 03:25:18 PMI once traded with a newbie account that made away with over $68 in Hong Kong currency but I wasn't so bothered because I knew there were possibilities of me losing the money and I would have given the user a positive trust if he turned up with the money but I'm sure he was so greedy and earned a red tag from me making his account worthless and I feel bad when I see people been scammed irrespective of the amount been scammed.Not too long ago, there was a Hero/ Legendary member that got scammed lending to a newbie account a few hundred bucks under the pretense of waiting for his VIP reload to arrive. Needless to say, it didn't end well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 01, 2023, 02:46:45 AM",
      "body": "Tip: on the internet, there will always be people that will try to steal your money. This dude literally had zero vouches, so you should at least have used a middleman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "March 02, 2023, 03:16:29 PM",
      "body": "I don't like how OP blames Bitcointalk when he is the one not doing research and getting an escrow, moderators have too much work already, and it's not part of their job to check every seller.If he is not comfortable here in Bitcointalk and wants special treatment there are other platforms that he can go to.https://bitcointalk.org/index.php?topic=5441432.0QuoteBitcointalk is going to become a haven for scammers,.... I would like to request to the Moderators, Please Get a Review copy from the seller to check the Quality and see, if he has these items or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "March 02, 2023, 04:41:47 PM",
      "body": "Quote from: santodelemosrjz67@gmail.c on February 27, 2023, 11:22:05 AMI just got scammed by OP (Thread starter), and i post my reviews on thread and my review post has been deleted two times, I am avoid to say it but having doubts on Moderators, I don't care about my scam money, but its help to avoid other peoples get scammed, So I hope this issue will be resolved with better way..Reported Thread: https://bitcointalk.org/index.php?topic=5428203.0Sometimes posting it in the same thread can be considered as off topic so you have to create a thread on scam accusation board with valid evidences to claim your statement.FYI, scams are not moderated in bitcointalk so moderators don't remove any posts or thread even if its created with the intention of scamming but DT comes into play on such occasions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "March 02, 2023, 08:21:20 PM",
      "body": "You are at fault for trusting a newbie account selling goods and not checking the seller's account if there's a red tag or not. Even some higher ranks scam people for money. You should check the account carefully and not trust people right away. No matter where you are there are people who will steal what you have so be very careful about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "March 02, 2023, 08:21:52 PM",
      "body": "Well I think there are other proper way to report a scammer, just from the content of what you said I couldn't get anything meaningful to show that you where scammed of money maybe showing us evidence would have been more better.. also letting it as a warning for people to avoid I think @Lucius already explained it all here.Quote from: Lucius on February 27, 2023, 03:58:22 PMThe accusation of scam has been made - before trading with OP, read it!https://bitcointalk.org/index.php?topic=5441432.0So why do you go trading with him after he warned of being a scammer, I think you are to blame here and however, before dealing with anyone first check their trust rating to know whether such person are legit or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}