{
  "id": "topic_5466431",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "September 11, 2023, 02:34:45 PM",
  "content": "السلام عليكم ورحمة الله وبركاته تحصلت على بطاقة بنكية فيزا من البنك في الجزائر ولدي فيه بعض الاموال التي خصصت للشراء فقط ولا يمكنني سحبها، ولهذا قررت ان اقوم باستبدالها جربت العديد من الطرق وحتى اني فتحت موضوع في القسم الاجنبي لكن لم اجد اي حل والسبب ان البطاقة البنكية لدينا مع الاسف كلها محدودة و تمنع الشراء من معظم المواقع والخدمات الا القليل فقط مثل علي اكسبرس او ربطها مع جوجل بلاي والشراء داخل التطبيقات او الالعاب. وبما ان الامر معروف جدا في دولنا العربية ربما يوجد عضو هنا لديه فكرة او حل لمشكل علما اني توجهت للبنك واخبروني انه ليس من الممكن فتح اي مواقع اخرى والسماح لك بالشراء لانها قد تكون خطيرة ولن نتحمل المسؤولية الى ما ذلك من هراء.اريد ان اعرف اذا يوجد هنالك تطبيق تحويل من جوجل باي الى البيتكوين مثلا اعرف ان بايننس لديها تلك الخدمة لكن غير مسموحة في دول كثيرة ومنها طبعا الجزائر، اتمنى ان اجد تطبيق مثله يدعم تلك الخاصية لاني بحاجة ماسة الى تلك الاموال بداخل البطاقة.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466431",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "September 12, 2023, 09:33:56 PM",
      "body": "لقد ذكرت في البداية Google play ثم قلت google pay.فأي منهما يمكنك استخدامه مع البطاقة؟ لأنهما مختلفين تماما، لأنه استخدامك للبطاقة لشراء رصيد غوغل بلاي لا يعني بالضرورة ان الطاقة سوف تعمل مع غوغل باي.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 13, 2023, 02:45:49 PM",
      "body": "Quote from: OmegaStarScream on September 12, 2023, 09:33:56 PMلقد ذكرت في البداية Google play ثم قلت google pay.فأي منهما يمكنك استخدامه مع البطاقة؟ لأنهما مختلفين تماما، لأنه استخدامك للبطاقة لشراء رصيد غوغل بلاي لا يعني بالضرورة ان الطاقة سوف تعمل مع غوغل باي.اسف على الشرح الذي وضعته حول البطاقة الخاصة ربما لم افسر جيدا، صحيح جوجل بلاي والرصيد الذي بداخله يختلف على طريقة الدفع جوجل باي ولكن حسب ما جربت على بطاقتي فهي تعمل على الاثنين وللتوضيح اكثر فقد قمت بشراء تطبيقات على متجر جوحل بلاي وشحن بعض التطبيقات والالعاب بشكل عادي ونفس الشيء مع الدفع من جوحل باي على تطبيق Ebay الذي يدعم خاصية Google Pay نجحت بالشراء عن طريقه ولهذا أنا متأكد انه يعمل بشكل عادي ايضا.الشراء من مواقع عديدة مثل aliexpress, Ebay, Dhgate, وحتى آبل ستور يعمل بنجاح لكن المشكل مع مواقع التحويل مثل بايننس، MoonPay, CoinBase وغيرها لا تنجح ويتم رفع الدفع من خلال بطاقتي فيزا وكما اشرت اني ذهبت الي البنك الخاص بي واخبروني انه لا يوجد حل لهذا.احد منصات التبادل والتي هي Cex.io تقدم خدمة الدفع عن كريق جوجل باي لكن مع الاسف لا تقبل الجزائر جربت ايضا P2P في بايننس التي تدعم التحويل بين الافراد عن طريق Alipay اين تم قبول البطاقة لكن ومع الاسف البلدان غير الصين فقط لا يمكنهم ارسال اموال و تسمح فقط بالشراء عن طريقها.اضن ان الحل هو ايجاد بائع يتعامل مع احد مواقع الشراء اقوم بشراء منتج منه وهو يقوم بالتحويل لي الى البيتكوين لكن الامر يعتبر مجازفة",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "September 15, 2023, 12:54:33 PM",
      "body": "Quote from: GxSTxV on September 13, 2023, 02:45:49 PMجربت ايضا P2P في بايننس التي تدعم التحويل بين الافراد عن طريق Alipay اين تم قبول البطاقة لكن ومع الاسف البلدان غير الصين فقط لا يمكنهم ارسال اموال و تسمح فقط بالشراء عن طريقها.اضن ان الحل هو ايجاد بائع يتعامل مع احد مواقع الشراء اقوم بشراء منتج منه وهو يقوم بالتحويل لي الى البيتكوين لكن الامر يعتبر مجازفةلكن بمأنك تملك حساب في غوغل باي، الا يمكنك أستخدامه الحساب للتعامل مع أشخاص اخرين؟.https://p2p.binance.com/en/trade/sell/USDT?fiat=USD&payment=GPayhttps://paxful.com/buy-bitcoin/google-pay/?paymentMethod=google-payأو يمكنك ببساطة استخدام بينانس و التعامل بتحويلات بنكية (المحلية)لا أنصحك بموقع باكسفول الا ان كنت في حاجة ماسة لبيع أموالك لأن المنصة أصبحت تحت ادارة مدير اخر و وفقا لما رأيته، يوجد الكثير من المشاكل في المنصة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 16, 2023, 06:08:35 PM",
      "body": "Quote from: GxSTxV on September 13, 2023, 02:45:49 PMجربت ايضا P2P في بايننس التي تدعم التحويل بين الافراد عن طريق Alipay اين تم قبول البطاقة لكن ومع الاسف البلدان غير الصين فقط لا يمكنهم ارسال اموال و تسمح فقط بالشراء عن طريقها.اضن ان الحل هو ايجاد بائع يتعامل مع احد مواقع الشراء اقوم بشراء منتج منه وهو يقوم بالتحويل لي الى البيتكوين لكن الامر يعتبر مجازفةلا علم لي عن فوارق الأسعار بين مختلف طرق الدفع خصوصا على منصة P2P على بينانس و لكن بالتأكيد أنت لن تكون بحاجة الى الدفع عبر قوقل باي. يوجد على بينانس بائعون محليون جزائريون كثر و يمكن التواصل معهم لتحديد طريقة الدفع المناسبة لكلا الطرفين. حسب ما اعتقد فان مجرد فتح حساب بنكي او بريدي يكون من السهل استخدامه عبر تطبيق على الهاتف سوف تكون عملية الشراء سهلة و تقريبا مضمونة مائة بالمائة.يوجد أيضا مجموعات مغلقة على فيسبوك يديرها باعة محترفون و سمعتهم جيدة يمكنهم قبول مدفوعات بأشكال مختلفة و اعتقد ان قوقل باي سيكون من افضل الطرق بما ان العديدين يحتاجونها للاقتناء عبر الانترنت من متاجر قوقل. ليس من السهل ايجاد تلك المجموعات لأنها عادة ما تكون مخفية و لا يتم القبول فيها الا من خلال استدعاء عضو دائم عليها لكن لن يكلفك الأر شيء أن تبحث.شخصيا لا أنصح باستدام بيانات حساباتي البنكية او غيرها على مواقع لم أتعود بها او لا تأكيدات بشأنها و لذلك أفضل طرق الند للند.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "September 16, 2023, 07:01:51 PM",
      "body": "Quote from: OmegaStarScream on September 15, 2023, 12:54:33 PMلكن بمأنك تملك حساب في غوغل باي، الا يمكنك أستخدامه الحساب للتعامل مع أشخاص اخرين؟.https://p2p.binance.com/en/trade/sell/USDT?fiat=USD&payment=GPayhttps://paxful.com/buy-bitcoin/google-pay/?paymentMethod=google-payأو يمكنك ببساطة استخدام بينانس و التعامل بتحويلات بنكية (المحلية)لا أنصحك بموقع باكسفول الا ان كنت في حاجة ماسة لبيع أموالك لأن المنصة أصبحت تحت ادارة مدير اخر و وفقا لما رأيته، يوجد الكثير من المشاكل في المنصة.شكرا على مشاركة الروابط وخدمة P2P التي توفرها بايننس مع الاسف لم اجد عروض شراء للدفع عن طريق جوجل باي فقط عروض بيع لهذا علي ان اقوم ايضا بفتح عرض خاص بي لشراء USDT او اي عملة اخرى مقابل جوجل باي والمشكل هنا ان التعامل سيكون فيه بعض الخطورة لان العملية ستكون على موقع يحدده المشتري مني وربما يكون موقعا للاحتيال. على كل وجدت طريقة افضل واقل مخاطرة وهي عن طريق شراء بطاقات هدايا E-Gift cards واستبدالها او بيعها.Quote from: Kavelj22 on September 16, 2023, 06:08:35 PMلا علم لي عن فوارق الأسعار بين مختلف طرق الدفع خصوصا على منصة P2P على بينانس و لكن بالتأكيد أنت لن تكون بحاجة الى الدفع عبر قوقل باي. يوجد على بينانس بائعون محليون جزائريون كثر و يمكن التواصل معهم لتحديد طريقة الدفع المناسبة لكلا الطرفين. حسب ما اعتقد فان مجرد فتح حساب بنكي او بريدي يكون من السهل استخدامه عبر تطبيق على الهاتف سوف تكون عملية الشراء سهلة و تقريبا مضمونة مائة بالمائة.يوجد أيضا مجموعات مغلقة على فيسبوك يديرها باعة محترفون و سمعتهم جيدة يمكنهم قبول مدفوعات بأشكال مختلفة و اعتقد ان قوقل باي سيكون من افضل الطرق بما ان العديدين يحتاجونها للاقتناء عبر الانترنت من متاجر قوقل. ليس من السهل ايجاد تلك المجموعات لأنها عادة ما تكون مخفية و لا يتم القبول فيها الا من خلال استدعاء عضو دائم عليها لكن لن يكلفك الأر شيء أن تبحث.شخصيا لا أنصح باستدام بيانات حساباتي البنكية او غيرها على مواقع لم أتعود بها او لا تأكيدات بشأنها و لذلك أفضل طرق الند للند.شكرا ايضا لك اخي الفاضل للاهتمام بالموضوع وصراحة خدمة P2P في بايننس كانت مفيدة لي بشكل كبير وانا لا ازال اتعامل معها ولكن للشراء من الجزائر توجد طرق قليلة فقط والسعر في ارتفاع خيالي يوميا حتى انه تجاوز حتى سعر السوق السوداء لانه كما يعلم الجميع فلا يمكننا نحن الجزائريين الحصول على العملة الصعبة بسعر البنك باي طريقة والحالة الوحيدة اين يتمكن المواطن من شراء العملة الصعبة هي في حالة السفر وتقديم جواز السفر للبنك ومنه نتحصل على 100€كاقصى حد وهذا مرة سنويا فقط.ما قمت به انا هو شراء العملة الصعبة من السوق السوداء وشحن حسابي البنكي لبطاقة فيزا وعندما اردت استخراج تلك الاموال تفاجئت بعدم امكانية ذلك ولهذا اردت تحويل تلك الاموال الى البيتكوين او اي عملة مشفرة اخرى. ومع الاسف ايضا لا احبذ مشاركة معلوماتي الخاصة مع اي موقع لكن هذه هي الظروف في العالم العربي",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "February 04, 2024, 10:20:32 PM",
      "body": "^^رغم ان الموضوع قديم بعض الشيئ لكن تعليقك أعاد إثارة الجروح.كلامك صحيح، اغلب الدول العربية تعاني نفس المشاكل للأسف. السبب هو طريقة تفكير الحكام و صناع القرارالتي لم تعد تتماشى مع هذا العصر و التطور السريع في التكنولوجيا و مختلف المجالات. صناع القرار اغلبهم من كبار السن الذين لا زالوا يفكرون بطرق تقليدية اكل عليها الدهر و شرب و يفتقدون لروح المبادرة و المجازفة.الأمل الوحيد لتغيير هذا الواقع هو أن يستلم الشباب المشعل و يصبحوا أكثر تأثيرا. وقتها سيتغير الحال بالتأكيد و نلتحق بركب الدول المتقدمة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arabic Salar",
      "created_time": "April 27, 2024, 04:52:45 PM",
      "body": "وعليكم السلاماستخدام بطاقة الفيزا لشراء مثل هذه الأشياء يشكل مشكلة كبيرة لأن بعض الأشياء لا تحظى بالإذن للشراء. إذا قمت بشراء مثل هذه الأشياء، فقد يتم حظر بطاقتك وقد تواجه مشاكل قانونية. هذا ليس آمنًا بالنسبة لك وقد يجلب لك المتاعب. من الأفضل أن تقتصر على شراء الأشياء القانونية والمعقولة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}