{
  "id": "topic_5411777",
  "title": "Sportsbetio Problems",
  "author": "Sportsbetio Problems",
  "created_time": "August 30, 2022, 08:32:49 PMLast edit: August 31, 2022, 08:23:55 AM by Sportsbetio Problems",
  "content": "Sportsbet.io is troubling meAmount = $1,700 LitecoinsProblem = Withdrawals disabled/ Betting disabled (30 litecoijs balance there, but even on trying to bet 0.01, it says insufficient balance)Reason = Asked VerificationVerification Completed = 3 days agoLive chat = Banned me so that I don't ask them or bother themEmail support = 1 reply, same on repetition \"Security team will reply you\"3rd Day, no updates from themQuotehttps://i2.paste.pics/a0e5655cec329e46accfd119cb8fa80e.png?trs=9be8c687a34e3455405b2fd9451ec04582f72ca0bcefa2d5d5326987f51e2834Quotehttps://i2.paste.pics/a8c96b7ff5c901e88399dc8dd8861c8a.png?trs=9be8c687a34e3455405b2fd9451ec04582f72ca0bcefa2d5d5326987f51e2834The withdrawal is showing same error for around 3 days nowThe 48 hours written there is fakeWhat have I done wrong ? = Absolutely nothing",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411777",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "August 30, 2022, 08:45:04 PM",
      "body": "I think their representative will be able to help you (sportsbet.io). Send him a private message with details about your issue so that he can help you follow up instead of guessing here if you have been scammed or not.I know it's frustrating, but you also have to practice patience sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 30, 2022, 08:49:27 PM",
      "body": "Hope you are not underage (under 18)? Hope you did not manipulate anything? Hope you used original identity card, hope the ID card is not fake? You have posted on their official thread on this forum, let us wait for reply. You can also send PM to their bitcointalk official account user. To be sincere, I hate to hear this kind of news, $1700 is not a small amount of money, I hope this would be settled appropriately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sportsbetio Problems",
      "created_time": "August 30, 2022, 08:59:10 PM",
      "body": "Quote from: Oshosondy on August 30, 2022, 08:49:27 PMHope you are not underage (under 18)? Hope you did not manipulate anything? Hope you used original identity card, hope the ID card is not fake? You have posted on their official thread on this forum, let us wait for reply. You can also send PM to their bitcointalk official account user. To be sincere, I hate to hear this kind of news, $1700 is not a small amount of money, I hope this would be settled appropriately.Underage = NoRules Broken = 0Verification = It got verified instantly because they used an instant verifying service and it resulted in minutesThey first blocked me then asked verificiationWhen I verified, it seems like they got disappointed, they were expecting me to Shut my mouth and not verify and let them keep the money, but no, I'm legit, I have nothing to be afraid of, so I straight ahead went & got verifiedMy history with this website = Too large to be even mentionedThe respect they give me for so much business = Treat me like Dog/InHuman, doesn't matter if I sufferI'm not only disappointed and feared of being scammed, also I'm heart brokenThis website is my daily thing, I have played too much here and given them so much of business, yet they don't care",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dittoup",
      "created_time": "August 30, 2022, 09:41:14 PM",
      "body": "You have nothing to worry about unless you are doing multi-accounting and/or provided fake documents. The security department have a tendency to be a bit slow, so you just have to be patient. Live-chat are unable to help you with stuff like this anyway. How did you manage to get banned from live-chat? I would think it takes quite a lot harassment before they decide to disable the chat option.As suggested from above poster- send a PM to the Sportsbet rep on this forum and he might be able to speed things up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sportsbetio Problems",
      "created_time": "August 30, 2022, 09:46:05 PM",
      "body": "Quote from: dittoup on August 30, 2022, 09:41:14 PMYou have nothing to worry about unless you are doing multi-accounting and/or provided fake documents. The security department have a tendency to be a bit slow, so you just have to be patient. Live-chat are unable to help you with stuff like this anyway. How did you manage to get banned from live-chat? I would think it takes quite a lot harassment before they decide to disable the chat option.As suggested from above poster- send a PM to the Sportsbet rep on this forum and he might be able to speed things upMutli accounting = NopeFalse documents = LOL, I verified live with selfie too + all documents with Live cam through the instant verification service, Verification is NOT pending, it completed 3 days ago, but still they don't give a shit, they still don't let me take my funds or betAlready sent PM but I think it doesn't matter because that user hasn't been active for 2 days either",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sportsbetio Problems",
      "created_time": "August 31, 2022, 08:13:52 AM",
      "body": "Read this tooExtra information about my history with Sportsbet.iohttps://bitcointalk.org/index.php?topic=1458034.msg60857636#msg60857636",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sportsbet.io",
      "created_time": "August 31, 2022, 08:22:58 AM",
      "body": "Hi ***, After looking into the information we have at hand, the verification process is completed and we are comfortable opening your account again.Apologies for the delay.regards, Steve + Team.Sportsbet.io",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}