{
  "id": "topic_5435538",
  "title": "Blawpaw",
  "author": "Blawpaw",
  "created_time": "January 17, 2023, 02:04:10 PM",
  "content": "Coindesk revealed the Bank of America has been researching CBDCs and it seems that they are closer than ever. The report considers CBDCs to have a lot of potential and was a natural evolution of money. According to Alkesh Shah, \"CBDCs do not change the definition of money, but will likely change how and when value is transferred over the next 15 years.\" He thus added that central bank digital currencies have “the potential to revolutionize global financial systems and may be the most significant technological advancement in the history of money.”Central Banks are already exploring the whole notion of developing CBDC systems so this may come sooner than one might think. What do you guys say? Ten years ago, I said that it would take 10 years for governments start adopting CBDCs. Now that 10 years have passed, some countries have already adopted it but it is still not mainstream. How long do you guys think it will take for CBDCs to become the norm?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435538",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "January 17, 2023, 02:27:15 PM",
      "body": "The American's government can just ask every citizens to convert their fiat to CBDC for now to next 7 days, if someone doesn't convert their fiat to CBDC in the next 7 days, any fiat will become worthless and can't be used anymore This will make panic and CBDC can be adopted for 1 week only, but of course it wouldn't happen since they're still think about the risk, especially the smart contract security. The bank will want to make sure the security is really high, but I think hack anytime will happen, I just hope CBDC is covered by bank insurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "January 17, 2023, 02:29:26 PMLast edit: January 17, 2023, 02:49:32 PM by _act_",
      "body": "CBDC is just fiat and nothing different from fiat, it is even controlled by central banks, it is centralized and it is a way government will be able to know more about their citizens money and able to control it. It is the same as fiat and devalues as as fiat. I have been using bank fiat since I was an adult and it is working good and I still prefer to stay in that way no CBDC for me.Quote from: Solosanz on January 17, 2023, 02:27:15 PMThe American's government can just ask every citizens to convert their fiat to CBDC for now to next 7 days, if someone doesn't convert their fiat to CBDC in the next 7 days, any fiat will become worthless and can't be used anymore Why would a government do that? It would be a stupid reason and no government can do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 17, 2023, 02:41:08 PM",
      "body": "Quote from: Solosanz on January 17, 2023, 02:27:15 PMThe American's government can just ask every citizens to convert their fiat to CBDC for now to next 7 days, if someone doesn't convert their fiat to CBDC in the next 7 days, any fiat will become worthless and can't be used anymore There may be laws, or maybe even the Constitution forbidding them do that.In short, I think that access to money is warranted for everybody, without the necessity of hardware, internet, smartphones and so on.And this means that even if, by some miracle, they'd be all on the same page, they still may be unable to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "indah rezqi",
      "created_time": "January 17, 2023, 02:42:58 PM",
      "body": "I was wondering, what is the difference between fiat and CBDC. In fact I doubt it will make much difference as the system is centralized and it's also possible that CBDC are more centralized than fiat at the moment. But maybe, many countries are testing this plan and new technology regarding government currency will be implemented soon. The thing is it's no different than any other fiat or stablecoin so I don't think it will be of much use as an investment asset but it will probably be adopted as a new trading pair on most exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 17, 2023, 02:43:51 PM",
      "body": "The CBDC didn't work in other countries, it's possible that it may not also work in the US. With citizens that are used to wider freedom, I don't see them not revolting against the government. CBDC is good but it has to come with freedom whether they can use it or not. If the option is not present and the government will just enforce it on people, they will fail. And it will take a long time to realize they are failing, more than 10 years probably and while its happening BTC may have been adopted everywhere too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 17, 2023, 03:03:35 PM",
      "body": "Quote from: indah rezqi on January 17, 2023, 02:42:58 PMI was wondering, what is the difference between fiat and CBDC. In fact I doubt it will make much difference as the system is centralized and it's also possible that CBDC are more centralized than fiat at the moment. The difference is a total absence of privacy with CBDCs, as much as the central banks want to say otherwise, and a greater ease of control on their part, with things like putting an expiration date, or punishing you if you consume meat, do not get vaccinated etc. by seizing a % of your money, making it so that you can only spend it in certain places, etc. This is all potentially, I think that at first it will not differ much from the card payment, to which we are accustomed and increasingly we do it more willingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 17, 2023, 03:10:19 PM",
      "body": "alot of people read title and headlines but lack researcha CBDC is nut where everyone in america has a wallet with BoAmericaa CBDC is not where everyone in Gbritain has a wallet with BoEnglandits where BO(A/E) have a blockchain to create coin and designate it to payment providers (commercial banks)people then have wallets with commercial banks on a sub network of smart contractsthink if it like bitcoin  - blockchain coin issuance between central and commercial banks                   liquid - first sub layer network for federated smart contract multisigs between banks for fast reserve swaps                   lightning - second sub layer network for customers of banks to use banks as 'hubs' to 'route' paymentswhere the customers have 2-3 choices of second subnetwork channels(accounts) where imbound balance limits apply depending on typejust like fiat government(politicians) dont watch every transactionjust like fiat regulators(ex-bankers) dont watch every transactionthey get commercial payment providers(banks/hub service) to police/supervise customer payments and report the suspect ones the 2-3 tier wallet choices are like this(based on many countries scope of their systems)bottom tier = £$1k-£$3k with minimal/no KYCmid tier = £$3k-£$10k with basic KYCtop tier = $10k+full KYCthis means playing around with small amounts like part time wage or giftcard amounts or 'virtual visa' amounts has no kyc where as needing to handle $10k+ payments will require you upgrading to top level account/channel which requires full registration, proof of income, etc etc..it will not be the case of \"everyone swap next week\" it will instead be offered as a new 'account' that your local commercial bank offers with probably some sort of feature or benefit promoted to get people to try it. then they will start doing things like increasing fee's for their old system while offering new system cheap/free. heck.. lets play tin foil.. i can imagine extremes of negative interest rates on old style \"accounts\" as a method of pushing people to move over. or simply multiplying the fee's for old style formats of paymentsEG making old style formats 4x more expensive than new style payment formatabove the CBDC chains will be what is known as an \"m-bridge\" which will be the central banks reserve swap system (like the IMF of fiat)which many countries are already trialing out their CBDC and the m-bridge system right now. but in small trials of a few cities commercial banks that then peg up to their nations attempts of CBDC which then peg up to the BIS m-bridge for international reserves",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "January 17, 2023, 03:33:01 PM",
      "body": "Quote from: Blawpaw on January 17, 2023, 02:04:10 PMCoindesk revealed the Bank of America has been researching CBDCs and it seems that they are closer than ever. The report considers CBDCs to have a lot of potential and was a natural evolution of moneyFine and good the government is obviously researching tirelessly on something that the people does not want, why has it not developed more interest on other countries to introduce their own cbdc if they actually think that's what people want, those that have done that already has nothing to show forth as a good and tangible results towards adoption from the people because cbdc is not the solution to the financial economy needs but a decentralized digital currency is which is only found with bitcoin for now.Quote from: Blawpaw on January 17, 2023, 02:04:10 PMAccording to Alkesh Shah, \"CBDCs do not change the definition of money, but will likely change how and when value is transferred over the next 15 years.\"If CBDC can present to this extent then i believe bitcoin can do more better since it can achieve this far within 14 years, i don't believe in much of the theories from this government officials, if they don't defend the government who else will they.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 17, 2023, 04:02:23 PM",
      "body": "Quote from: Dunamisx on January 17, 2023, 03:33:01 PMQuote from: Blawpaw on January 17, 2023, 02:04:10 PMAccording to Alkesh Shah, \"CBDCs do not change the definition of money, but will likely change how and when value is transferred over the next 15 years.\"If CBDC can present to this extent then i believe bitcoin can do more better since it can achieve this far within 14 years, i don't believe in much of the theories from this government officials, if they don't defend the government who else will they. central banks and commercial banks are doing this because the main payment rail is actually VISA for most accounts. their tap and pay means visa get rich for processing payments. and banks want to get away from the visa debit system and be more direct commercial bank<->customer without a visa middleman",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 17, 2023, 04:38:01 PM",
      "body": "Quote from: Blawpaw on January 17, 2023, 02:04:10 PMCoindesk revealed the Bank of America has been researching CBDCs and it seems that they are closer than ever. The report considers CBDCs to have a lot of potential and was a natural evolution of money. BOA is not a central bank, nor can it issue CBDC or influence it in the US, but only gives its insignificant opinions, as was the case over the years when it came to Bitcoin. This \"discovery\" is equivalent to parents discovering that they have to change their child's diapers because the child did what children normally do.Quote from: Blawpaw on January 17, 2023, 02:04:10 PMTen years ago, I said that it would take 10 years for governments start adopting CBDCs. Now that 10 years have passed, some countries have already adopted it but it is still not mainstream. How long do you guys think it will take for CBDCs to become the norm?Was anyone even discussing CBDC 10 years ago? I am even more surprised that a beginner is discussing this on a forum in 2013. I found information that the first mention of CBDC in the UK only dates back to 2015.Quote from: https://quickpenguin.net/history-of-cbdc-discussions-in-the-uk/One of the first public remarks by a government official in the UK on CBDCs came in September 2015 when Andy Haldane, then the Chief Economist at the Bank of England, made a speech about negative interest rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 17, 2023, 04:47:14 PM",
      "body": "Brace yourselves for what? CBDC is pretty much just fiat with a different back-end(possibly tokenized) anyway. I'd imagine that a CBDC would just be a far worse version of USDT or USDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "January 17, 2023, 04:55:09 PM",
      "body": "Now that is some sort of ideocracy I am seeing about the CBDC and how it's being portrayed as if something cool agency to help the fiat gain the technological advancement. Unfortunately they are not what should be and they are trying to be something else. Sounds confusing right? Yes why not, that is how they really work in reality. CBDC and SEC are the devil horns which keep fighting amongst each other to gain the control of few of the mainstream assets around the globe. This is rat race between them and nothing is really getting achieved with this. The claim that they would be mainstream adopter in next 10 years is just another gossip around the corner. It won't happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 17, 2023, 05:17:54 PM",
      "body": "Quote from: mk4 on January 17, 2023, 04:47:14 PMBrace yourselves for what? CBDC is pretty much just fiat with a different back-end(possibly tokenized) anyway. I'd imagine that a CBDC would just be a far worse version of USDT or USDC.It depends on whether you trust private companies that issue some kind of stablecoins and claim that they are backed by something, or whether you trust centrally digitally issued money? It's not that I favor one or the other, but I know for sure which one will fail and become worthless sooner. Of course, CBDC will violate the privacy of all those who will use it, because the authorities will have direct insight into all our transactions, but isn't that the case with card payments today?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "January 17, 2023, 05:42:17 PM",
      "body": "For now, CBDCs are very far from mainstream. I think more countries will adopt them, especially those where digitalization is already at a high level. The situation is harder with Euro due to EU bureaucracy and since EU has both countries with very high level of cashless payments (Sweden) and a surprisingly low level (Italy, Germany). I don't think societies which are used to cash would be open to CBDCs, but those like in the UK which largely already pay by card or phone probably wouldn't feel a big difference. In any case, I hope countries don't fully switch to CBDCs because this can be a huge issue at some point. Here's an example. In Ukraine, if you live in a big city, you can pay by card/phone in any supermarket, in any café, in most modes of transport. However, who would've guessed that we'll have a time of daily blackouts lasting many hours when you can only pay by cash? Imagine being a cashless society which fully switched to a CBDC and doesn't have banknotes any more or even a way of reintroducing them easily because all transactions happen in principle online, and then for some reason which seemed impossible but clearly is possible (like a full-scale war in the 21st century), you can no longer get by without cash. That's a disaster right there. And given that it's still possible in our world (whether due to missiles or due to energy crisis), CBDCs just can't replace fiat yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 17, 2023, 05:44:49 PM",
      "body": "CBDC will take over the fiat market in next few years. It has two legs to it. The first leg is convenience which is the USP for the retail users like us. Another leg is full transparency to the government. Financial Anonymity will become a thing of past with the implementation of CBDC. So whether we like it or not, CBDC will be implemented in all major economies in next few years. Even India has started trial run of CBDC and planning to implement it for commoners like us in next two years. However, it should not impact the crypto market in any way!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 17, 2023, 06:09:45 PM",
      "body": "QuoteBrace yourselves, CBDCs one Step CloserYeah, right!So, this is 2023 and back in 2021 we had the same thing:https://beincrypto.com/bank-of-america-digital-asset-research-team/So the difference between these articles is that now we have this statement:Quote“CBDCs do not change the definition of money, but will likely change how and when value is transferred over the next 15 years,” analysts led by Alkesh Shah wrote, adding that central bank digital currencies have “the potential to revolutionize global financial systems and may be the most significant technological advancement in the history of money.”rather than one on the nearly same tone about transferring value via CBDC and taken two years ago and a timeline that goes to somewhere in the next 15 years something will happen.Not too much \"bracing\" for impact!Quote from: Blawpaw on January 17, 2023, 02:04:10 PMTen years ago, I said that it would take 10 years for governments start adopting CBDCs.Can you link to your 10 year old post where you claimed and discussed that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "January 17, 2023, 06:11:43 PM",
      "body": "Who cares what the government decided to do with their little digital token, I don't see it changing my way of leaving which is most important to me. And from what I know, there is a choice to be made if they eventually made it public. Plus it will still serve as normal fiat which has no big difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "January 17, 2023, 06:21:30 PM",
      "body": "I think Shah is defining more of bitcoin than CBDCs.  Quote from: Blawpaw on January 17, 2023, 02:04:10 PMHow long do you guys think it will take for CBDCs to become the norm?Depending on how the government that has it will start to implement it. They can just announce it and force the people to use it but as long as the interest won't be forcefully pushed then it may still take time.We don't know, as we usually say, just a matter of time until they are already popular and known due to the government's support. That will certainly play a role.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "January 17, 2023, 06:26:28 PM",
      "body": "Quote from: franky1 on January 17, 2023, 04:02:23 PMQuote from: Dunamisx on January 17, 2023, 03:33:01 PMQuote from: Blawpaw on January 17, 2023, 02:04:10 PMAccording to Alkesh Shah, \"CBDCs do not change the definition of money, but will likely change how and when value is transferred over the next 15 years.\"If CBDC can present to this extent then i believe bitcoin can do more better since it can achieve this far within 14 years, i don't believe in much of the theories from this government officials, if they don't defend the government who else will they. central banks and commercial banks are doing this because the main payment rail is actually VISA for most accounts. their tap and pay means visa get rich for processing payments. and banks want to get away from the visa debit system and be more direct commercial bank<->customer without a visa middlemanI quite agree with you on this franky1 that central banks are looking for ways to disconnect from the interconnected fee processing for a visas, master cards and the rest of the other payment processors. CBDCs will offer the banks such facilities but the point to note is that most CBDCs are not blockchain based so at that there is no difference between CBDCs and vs fiat system, the central bank in my country Nigeria is currently developing a national domestic card that will migrate the citizens from visa and other cards processors. But that is after the CBDC e-naira failed to meet up with that role of providing an alternative to cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}