{
  "id": "topic_5413140",
  "title": "dhru9",
  "author": "dhru9",
  "created_time": "September 11, 2022, 07:57:21 AMLast edit: September 18, 2022, 05:03:42 PM by dhru9",
  "content": "They ban me for money laundering  (false accusations) in one account and then  I won  new account that I opened today  for the fight tonight ufc  and took their money. proof of my earnings: thanks nate By this way Stake is a scam. They told me they reply in 24 horus to review my account. they lie its been 7 days and they don't reply in  emails they give in my other account over 400$ (compliance@stake.com))",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413140",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "September 11, 2022, 08:10:00 AM",
      "body": "Congrats I guess.  It was a great fight and I was glad to see Nate Diaz win.  He deserved it after all the drama with his contract and a new last minute opponent.  I'm not sure you should be advertising your ban evasion from the site and I'm pretty sure you were banned for not placing bets in the first place so it's nice to see you're actually using the site for something other than a proxy to move crypto from one wallet to another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 11, 2022, 08:17:07 AM",
      "body": "Is this just to get back on Stake for banning you, I don't see anything wrong in banning you based on what you posted in the scam section, good to know that you still trust Stake.com as you're still playing here, just don't mess again with Stake, after this win I'm sure you'll play here again, they are strict but they are reputable just read their terms and be updated and follow the rules and enjoy playing, and congratulations on your winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dhru9",
      "created_time": "September 11, 2022, 08:23:43 AM",
      "body": "Quote from: OgNasty on September 11, 2022, 08:10:00 AMCongrats I guess.  It was a great fight and I was glad to see Nate Diaz win.  He deserved it after all the drama with his contract and a new last minute opponent.  I'm not sure you should be advertising your ban evasion from the site and I'm pretty sure you were banned for not placing bets in the first place so it's nice to see you're actually using the site for something other than a proxy to move crypto from one wallet to another.  I am MMA fub. Nate is a tough mother fucker and tony is on a downward spiral. He can't handle all the stress like Nate they are built differently.  They have different mindset. Both of them of great chin I knew he gonna win by decision or submission. If you understand yourself you can understand others and make good calls. the bookies make it completely wrong to favor tony and  I took advantage of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "September 11, 2022, 08:24:31 AM",
      "body": "Alright so... what's the point of this thread? What can I say Stake is generous since they can let a fraudster (since you was accused for doing money laundering) to withdraw your winnings.Since you have created multiple accounts in Stake, I hope Eddie, MICRO or other Stake representative confiscated the money on your first account and permanently banned both of your accounts since you're breaking their rules.I'd say you're the wrong here, not Stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dhru9",
      "created_time": "September 11, 2022, 08:31:33 AMLast edit: September 11, 2022, 08:54:37 AM by dhru9",
      "body": "Quote from: coin-investor on September 11, 2022, 08:17:07 AMIs this just to get back on Stake for banning you, I don't see anything wrong in banning you based on what you posted in the scam section, good to know that you still trust Stake.com as you're still playing here, just don't mess again with Stake, after this win I'm sure you'll play here again, they are strict but they are reputable just read their terms and be updated and follow the rules and enjoy playing, and congratulations on your winning.Now I play here :https://duelbits.com/loungeAbout stake.com I win and i dump them no more stake.   i love deubits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 11, 2022, 09:18:46 AM",
      "body": "Quote from: dhru9 on September 11, 2022, 08:31:33 AMNow I play here :https://duelbits.com/loungeAbout stake.com I win and i dump them no more stake.   i love deubitsIt was a win. Congrats. But Stake did not ban you for no reason, be careful on any other gambling site that you are, avoid all means they can be able to ban you and follow their ToS completely. Stake is a good gambling site, you have to be careful while using Duelbit too for you not to be banned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "September 11, 2022, 09:33:35 AM",
      "body": "Quote from: coin-investor on September 11, 2022, 08:17:07 AMIs this just to get back on Stake for banning you, I don't see anything wrong in banning you based on what you posted in the scam section, good to know that you still trust Stake.com as you're still playing here, just don't mess again with Stake, after this win I'm sure you'll play here again, they are strict but they are reputable just read their terms and be updated and follow the rules and enjoy playing, and congratulations on your winning.Is is possible to get banned by stake and you open another account? Isn't that frowned at as ban evasion? I don't have the experience how it works, but I know that one document cannot pass kyc twice. Could it be that OP used another person's document for the verification?If you read down you could see that OP has chosen another company to bet with. I wish him good and wish he could abide by the rules this time. It will be fair for him and the company also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 11, 2022, 09:38:12 AM",
      "body": "Quote from: Apocollapse on September 11, 2022, 08:24:31 AMAlright so... what's the point of this thread? What can I say Stake is generous since they can let a fraudster (since you was accused for doing money laundering) to withdraw your winnings.Since you have created multiple accounts in Stake, I hope Eddie, MICRO or other Stake representative confiscated the money on your first account and permanently banned both of your accounts since you're breaking their rules.I'd say you're the wrong here, not Stake.He just wants to show he made it with his other account. It's true that he still trusts Stake after accusing a scam. You should trust Stake for not banning both and then you won.  But that didn't mean vindication you just pick Nate who I believe has a higher win probability against Tony.This is a gracious loss for Tony though both show a truly great fight between two legendary. Congrats to you and Nate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 11, 2022, 09:42:34 AM",
      "body": "Quote from: rby on September 11, 2022, 09:33:35 AMI don't have the experience how it works, but I know that one document cannot pass kyc twice. Could it be that OP used another person's document for the verification?They don't always force users to pass KYC. They ask users to pass KYC only if they think there may be something suspicious going on. Most probably, OP wasn't asked to pass KYC for the second account at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "September 11, 2022, 09:59:12 AM",
      "body": "Quote from: dhru9 on September 11, 2022, 07:57:21 AMThey ban me for money laundering in one account and then I won in other account easily first win  and took their money. After crying and vehemently denying that your account had any reason to be blocked, now you openly admit that you have multiple accounts, so essentially violated Stake's terms of service twice. Thanks for admitting what a scammer you really are. At least now we know for sure that your accusations against the casino are baseless.Quote from: dhru9 on September 11, 2022, 07:57:21 AMproof of my earnings: And you think that will damage the casino in any way? LOL! Good luck withdrawing those funds, by the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dhru9",
      "created_time": "September 11, 2022, 10:05:33 AM",
      "body": "Quote from: decodx on September 11, 2022, 09:59:12 AMQuote from: dhru9 on September 11, 2022, 07:57:21 AMThey ban me for money laundering in one account and then I won in other account easily first win  and took their money. After crying and vehemently denying that your account had any reason to be blocked, now you openly admit that you have multiple accounts, so essentially violated Stake's terms of service twice. Thanks for admitting what a scammer you really are. At least now we know for sure that your accusations against the casino are baseless.Quote from: dhru9 on September 11, 2022, 07:57:21 AMproof of my earnings: And you think that will damage the casino in any way? LOL! Good luck withdrawing those funds, by the way.  I withdraw already I beat them.  https://www.blockchain.com/btc/tx/4e646742097820367c3046ba09ba08c04f5619b24356e8c8e5c60dc12b0f14cc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 11, 2022, 10:34:14 AM",
      "body": "Quote from: dhru9 on September 11, 2022, 07:57:21 AMThey ban me for money laundering i false accusations in one account and then I won in other account easily first win  and took their money. proof of my earnings: thanks nate According with this image https://imgur.com/i115pV5 I didn't see that your account has been banned here because they are still contacting you with their support regarding your issue, which means that when everything is okay, you can now make withdrawal transactions on stakes.com and my attention Also it looks like you haven't enabled your security on the stakes dude. Because as far as I know, when you earn a lot on the gambling platform and withdraw a large amount, you are obliged to activate the 2FA authenticator so that just in case like that, you can still open your account easily as far as I know.The question is did you follow the rules that the stakes have according to their policy? because if you violated something even though you knew it was illegal and you still did it, you must accept the consequences of what you did. But in fairness you are good in gambling according to your balance dude.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dhru9",
      "created_time": "September 11, 2022, 10:47:05 AM",
      "body": "Quote from: gunhell16 on September 11, 2022, 10:34:14 AMQuote from: dhru9 on September 11, 2022, 07:57:21 AMThey ban me for money laundering i false accusations in one account and then I won in other account easily first win  and took their money. proof of my earnings: thanks nate According with this image https://imgur.com/i115pV5 I didn't see that your account has been banned here because they are still contacting you with their support regarding your issue, which means that when everything is okay, you can now make withdrawal transactions on stakes.com and my attention Also it looks like you haven't enabled your security on the stakes dude. Because as far as I know, when you earn a lot on the gambling platform and withdraw a large amount, you are obliged to activate the 2FA authenticator so that just in case like that, you can still open your account easily as far as I know.The question is did you follow the rules that the stakes have according to their policy? because if you violated something even though you knew it was illegal and you still did it, you must accept the consequences of what you did. But in fairness you are good in gambling according to your balance dude. This is new account i opened for the ufc fight today read the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "September 11, 2022, 10:53:47 AM",
      "body": "You really want inconvenience in your life by opening new account on same casino that ban you. I’m sure you will open another scam accusation thread if ever Stake caught you doing multiple account and use forum as your shield to justify your action. I’m starting to believe that Stake has basis on banning your initial account for money laundering base on your behavior towards gambling account technicalities. FYI Stake will not gonna rekt by just 800$ profit of yours. They are doing giveaway worth million dollars and partnership promotion with different sports team and Drake using huge amount of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 11, 2022, 11:36:32 AM",
      "body": "Quote from: dhru9 on September 11, 2022, 10:47:05 AMThis is new account i opened for the ufc fight today read the thread.You will be found out sooner or later with that. That's easy to recognize by just searching that same balance amount on their system. Ban evasion or multiple accounting really is something to every casino that should not be tolerated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "September 11, 2022, 11:54:52 AM",
      "body": "Quote from: dhru9 on September 11, 2022, 07:57:21 AMThey ban me for money laundering i false accusations in one account and then  I won  new account that I opened today  for the fight tonight ufc  and took their money. proof of my earnings: <...>thanks nate Apparently, it was a matter of principle for you to bet on this fight on stake in order to collect your blocked funds, because you could do the same without unnecessary risk elsewhere. But excitement and resentment sometimes make you do such things, but now that you have reported this, I think you should not continue to play on stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "September 11, 2022, 11:59:35 AM",
      "body": "Quote from: PX-Z on September 11, 2022, 11:36:32 AMQuote from: dhru9 on September 11, 2022, 10:47:05 AMThis is new account i opened for the ufc fight today read the thread.You will be found out sooner or later with that. That's easy to recognize by just searching that same balance amount on their system. Ban evasion or multiple accounting really is something to every casino that should not be tolerated.Stake is a reputable gambling website that already established its name in the horizons of the internet. They were able to acquire Drake as their brand ambassador and they also consistently give rewards to their designated gamblers on their community. As it stands, all gambling websites have their respective TOS where they are free to stipulate anything that they may see illegal, wrong, or prejudicial against them.What you did was you evaded your ban and created another account to bet. As much as you prefer to gamble in Stake, their TOS prohibits the action you just did and you must accept the consequences of your action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "September 11, 2022, 12:03:33 PM",
      "body": "Quote from: Daltonik on September 11, 2022, 11:54:52 AMQuote from: dhru9 on September 11, 2022, 07:57:21 AMThey ban me for money laundering i false accusations in one account and then  I won  new account that I opened today  for the fight tonight ufc  and took their money. proof of my earnings: <...>thanks nate Apparently, it was a matter of principle for you to bet on this fight on stake in order to collect your blocked funds, because you could do the same without unnecessary risk elsewhere. But excitement and resentment sometimes make you do such things, but now that you have reported this, I think you should not continue to play on stake.I think he has something beneficial that he can get on Stake which is the reason he keeps coming back despite the risk involved of his action. Probably the Stake anniversary promo is what he wants to get since it’s giving a cashdrop reward for just doing a certain wagering requiring that other casino doesn’t offer right now. His previous account violation is too serious to be ignored and I hope duelbits will check his account later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "September 11, 2022, 12:08:53 PM",
      "body": "How can they accuse you of money laundering? Does stake has information on people who are suspected of money laundering coming from the authority? If I'm not mistaken, we have the AMLC who issues information, so what is their basis? By the way, can you share some messages from stake about your accusation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}