{
  "id": "topic_5404435",
  "title": "dragospirvu75",
  "author": "dragospirvu75",
  "created_time": "June 29, 2022, 03:36:27 AM",
  "content": "Hello everyone!I was thinking about one thing, Satoshi once said:\"In a few decades when the reward gets too small, the transaction fee will become the main compensation for [mining] nodes. I’m sure that in 20 years there will either be very large transaction volume or no volume.\"As far as I know, in Lightning Network transactions, miners are not paid. So, doesn't this thing affect Bitcoin Network? If miners don't get enough fees to have a decent profit, they will be likely to stop mining.Can someone explain this situation?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404435",
  "comments": [
    {
      "author": "ImThour",
      "created_time": "June 29, 2022, 03:55:51 AM",
      "body": "How come a faster and cheaper alternative of payment for Bitcoin be bad for it? I mean you can instantly pay for your coffee or anything within seconds and that is what the current demand of both the buyer and seller is. Also, Lightning makes it much cheaper. No one is forcing you to set up a Lightning node, and those who are doing it are helping the technology grow without being selfish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 29, 2022, 03:58:02 AM",
      "body": "Quote from: dragospirvu75 on June 29, 2022, 03:36:27 AMAs far as I know, in Lightning Network transactions, miners are not paid. They are paid when you open a channel, so your argument doesn't hold. I don't know if what you think is that miners won't get paid for transactions inside the channel once it's open so they'll go broke, but the LN was created to try to solve the scalability problem, so I'm sure there will be plenty of on-chain transactions for which miners will be able to get paid. It is not incompatible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragospirvu75",
      "created_time": "June 29, 2022, 04:16:45 AM",
      "body": "I agree it's faster, cheaper and more convenient for both buyer and seller, and it's an inovative technology (& scalability problem). I was just thinking that, being a zero-sum game, the more you use lightning network, the less you use the original network, created by Satoshi, and don't contribute to that \"very large transaction volume\" needed for bitcoin to work as intended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "June 29, 2022, 05:37:45 AM",
      "body": "Quote from: dragospirvu75 on June 29, 2022, 04:16:45 AMI agree it's faster, cheaper and more convenient for both buyer and seller, and it's an inovative technology (& scalability problem). I was just thinking that, being a zero-sum game, the more you use lightning network, the less you use the original network, created by Satoshi, and don't contribute to that \"very large transaction volume\" needed for bitcoin to work as intended. In spite of the fact that currently bitcoin base layer is being used by a tiny fraction of the population (106 million according to https://www.buybitcoinworldwide.com/how-many-bitcoin-users/),  we sometimes witness blocks full of transactions and very high fees due to long-lasting congestions in the mempool. What will happen to a bitcoin network when all 8 billion people start utilizing the base layer of bitcoin to make small payments? Given that the bitcoin block is of limited size, the increase in the number of active users will inevitably bring about intensive competition for the right to get into the closest block, which will naturally result in very high fees and the impossibility of making small payments. In other words, there should be some additional layer for making small payments built on top of the bitcoin main layer where people no longer need to fight constantly for scarce space. They will continue using the main bitcoin layer as a settlement layer, but they will do that much less frequently than they would have to were there no additional layers like Lightning Network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 29, 2022, 05:58:42 AM",
      "body": "Quote from: dragospirvu75 on June 29, 2022, 03:36:27 AMHello everyone!I was thinking about one thing, Satoshi once said:\"In a few decades when the reward gets too small, the transaction fee will become the main compensation for [mining] nodes. I’m sure that in 20 years there will either be very large transaction volume or no volume.\"As far as I know, in Lightning Network transactions, miners are not paid. So, doesn't this thing affect Bitcoin Network? If miners don't get enough fees to have a decent profit, they will be likely to stop mining.Can someone explain this situation?You should learn how the Lightning Network works first and then create forum posts asking questions. I'm not an expert on LN, but I don't think that there are \"miners\" in the Lightning Network. However, I might be wrong about this.I guess that we will have to wait until 2029 and see if Satoshi was right. There's still a small possibility that the Bitcoin Core blockchain will have no transactions by 2029. I think that the blockchain will adapt and improve, so we shouldn't worry about that.I'm sure that after the next halving in 2024, the Bitcoin price will move in the 50K-150K USD frame, so the miners will get big enough transaction fees to cover their costs and make profits. The green energy will get cheaper as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 29, 2022, 08:10:35 AMLast edit: June 29, 2022, 08:20:56 AM by franky1",
      "body": "there are many flaws in LNfirst is people dont realise bitcoins never EVER leave the bitcoin network. all the liquidity in LN is based on pegged balance of locked bitcoin. Ln liquidity is not bitocin its a new unit called msat. a 1:1000 unsecured peg(a flaw)anywaysthe more thats locked, the longer its locked the less transactions happen on bitcoin (less users using bitcoin)do not confuse using LN as still considered as being \"using bitcoin\"much like the sayings of custodial services if you are playing with exchange mysql balance your not playing with real bitcoin. same with the stable coins. its not actual dollar your playing withthe flaws of this is that the pegs are not secured on the LN side by a consensus algo. wallets can easily create new msat balance or tweak software EASILY to misrepresent the locked bitcoin pegged balance. to a fake allotment of msat at the LN GUI and people wont know untll they close their channel months laterif anything has been learned recently about the luna stablecoin fiasco is to never trust side networks/altnets/layers as those other networks can easily de-peg or fractional reserve.im not saying that some altnets dont have a niche to service some peoples fast/temporary spends. but by no means does that mean people should lock up value long term in them. other flaws are the mis-understanding of LNpeople call it the bitcoin 2.0, the next gen \"the layer ontop\". (subtle hints that LN is bigger and better and ontop, above bitcoin) suggesting bitcoin is broke/not fit. deadLNs messaging system of payments is not even a bitcoin tx. its instead a message in msat balance. which already mentioned can be messed with as there is no network wide audit of these payments. too many people \"trust2 the GUI display of msats as being the 1:1000 peg. but dont ever truly check that the post \"success\" commitments and the close session conversions of a unconconfirmed unbroadcast bitcoin format did actualy convert back to the amount they expect if they were to broadcast/confirm by closing the channeli know you are probably now going to see some familiar names post after mine throwing insults and then using uptopian dream hype best case scenario advertising scripts to describe how they love and trust LN. but there are many flaws in it. and people should be wary of it.one of the flaws about its \"scalability\"imagine you wanted to pay $10 to someone 5 peers(hops/channel partners) awayfrom:A $10:$0 B $10:$0 C $10:$0 D $10:$0 E $10:$0 Fto :A $0:$10 B $0:$10 C $0:$10 D $0:$10 E $0:$10 Fjust to allow for a $10 payment. the network had to have $40 liquidity to have a successful paymentyep more funds are needed than the network will allow to spend.. (think about that, there are many implications)next up is not every route has liquidityEGA $10:$0 B $10:$0 C $9:$0 D $10:$0 E $10:$0 Fyep c's $9 stops A from making a $10 payment even if b,d,e did have $10 liquiditythis then adds another flaw. people then needing more then one channel and more then one route to a destination..EGA $10:$0 B $10:$0 C $09:$0 D $10:$0 E $10:$0 F  \\$10:$0 Z $10:$0 Y $10:$0 X $10:$0 /and now for A to needs to lock up more coin just to have more liquidity in more channels to the have the chance to pay $10 to F. where by the network now has more then $40 liquidity needed($79) to facilitate a $10 paymentthere is a limit to how many coins can be locked meaning a limit to liquidity of pegged altnets meaning a limit to how much can be used and spend and passed onEG in this case A made his $10 to F.. whereby now those along the route have no spare liquidity to use for themselves to pay F. its already spent by A",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 29, 2022, 08:16:06 AM",
      "body": "Bitcoin Lightning Network is a layer 2 that runs on the Bitcoin blockchain which mean without bitcoin blockchain (when miners paid) you cant use it.In fact, you need one transaction on the network to open the channel and another to close it, so at least you need two transactions.The lightning network is also suitable for daily solutions, which are often less than a thousand dollars, and not transfers of larger amounts, as waiting for 10 minutes will not be long.So it is not a competing solution to the Bitcoin network but you are risking the high security that the Bitcoin network provides so don't put too much money in the lightning channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 29, 2022, 08:25:20 AM",
      "body": "Quote from: Husires on June 29, 2022, 08:16:06 AMBitcoin Lightning Network is a layer 2 that runs on the Bitcoin blockchain which mean without bitcoin blockchain (when miners paid) you cant use it.lightning network is its own independant network. it bridges to multiple networks.. it is not a sole bitcoin feature.people can still use lightning with litecoin and other altcoins. LN is not something uniquely for bitcoin. it just wants to tag on the \"bitcoin\" name and subtly hint its ontop of bitcoin to win instant fame/recognition/trust and steal users over to the LN so they stop using the bitcoin networkrightnow, using the same software i can easily with the same peer(partner) set up channels that are bitcoin pegged, litecoin pegged, ltc testnet pegged, btc testnet pegged..  no problems at all. thus LN is not \"tethered\" to only function with bitcoin..a solution to bitcoin scaling is not to get people to stop using the bitcoin network. yet that is exactly the job of LN. to stop people using bitcoin regularlyim not saying these altnets(Ln, sidechains, de-fi, pegged chains,federated networks, etc) dont have a small value temporal niche service use. but by no means should anyone be declaring it bitcoin 2.0 and the solution everyone should move over to and lock up all wealth long term. LN is too flawed to act as a full mainstream utility to replace bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "June 29, 2022, 08:54:41 AM",
      "body": "Quote from: dragospirvu75 on June 29, 2022, 03:36:27 AMHello everyone!I was thinking about one thing, Satoshi once said:\"In a few decades when the reward gets too small, the transaction fee will become the main compensation for [mining] nodes. I’m sure that in 20 years there will either be very large transaction volume or no volume.\"As far as I know, in Lightning Network transactions, miners are not paid. So, doesn't this thing affect Bitcoin Network? If miners don't get enough fees to have a decent profit, they will be likely to stop mining.Can someone explain this situation?There's only a limited amount of transactions that can fit into a block, so there will always be a fee market, especially since the opening and closing of channels still requires on-chain transactions as mentioned by the others.This means that miners will get their mining fees either way. It's just that the same mining fee payout will cover for a lot more individual transactions than if transactions where to take place purely on-chain.It also implies that block size restrictions are necessary for a profitable fee market further down the road.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tadamichi",
      "created_time": "June 29, 2022, 09:15:25 AMLast edit: June 29, 2022, 09:42:48 AM by tadamichi",
      "body": "Quote from: dragospirvu75 on June 29, 2022, 03:36:27 AMHello everyone!I was thinking about one thing, Satoshi once said:\"In a few decades when the reward gets too small, the transaction fee will become the main compensation for [mining] nodes. I’m sure that in 20 years there will either be very large transaction volume or no volume.\"As far as I know, in Lightning Network transactions, miners are not paid. So, doesn't this thing affect Bitcoin Network? If miners don't get enough fees to have a decent profit, they will be likely to stop mining.Can someone explain this situation?I think it can be argued that lightning is mostly positive for Bitcoin and it would be worse without it. There’s always an incentive to open or close lightning channels, when the on-chain fees are low. This means it actually stabilises transaction volume, when it’s low, because then more lightning channel demand will come in.All of this bashing of Layer 2s is useless, when it’s impossible at the moment to scale the mainchain without getting centralized. Every solution has tradeoffs, but this is one of the more elegant solutions. And Lightning has a ridiculous amount of theoretical troughput, which smokes every chain solution out of the water.Lightning won’t take all the transactions out of the mainchain. It will make Bitcoin more usable for daily transactions, which in turn will make it more attractive to more users. The mainchain will still have enough demand for other kinds of payments, and when demand there is low, lightning is actually helping out.Lightning is also not a good place to store all of your funds, the main chain will always have enough usage for this reason alone. This is to make payments easier, not to lure users out.See:There is almost 84.000 Lightning channels at the moment. Each of them will require one transaction to open and one to close the channel. Which still gives us 84.000 pending transactions at the moment, that will hit the mainchain at some point in the future. And the amount of channels will probably increase in the future. We can speculate how many, but the potential is huge here. There could be millions of pending transactions just because of lightning. Let’s say one Block can take in 2000 transactions every 10 minutes. Does it seem like the mainchain will be struggling to get enough transactions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "June 29, 2022, 09:18:22 AM",
      "body": "Quote from: dragospirvu75 on June 29, 2022, 03:36:27 AMHello everyone!I was thinking about one thing, Satoshi once said:\"In a few decades when the reward gets too small, the transaction fee will become the main compensation for [mining] nodes. I’m sure that in 20 years there will either be very large transaction volume or no volume.\"As far as I know, in Lightning Network transactions, miners are not paid. So, doesn't this thing affect Bitcoin Network? If miners don't get enough fees to have a decent profit, they will be likely to stop mining.Can someone explain this situation?You have to think also about what happened in the next 2140 because all bitcoin is mined, it is the same situation as your think (miners don't get enough fees to have a decent profit). so, I think you don't need to worry about this because both chains will work together in each way, the miner will keep mining in the main blockchain, and the lightning network will still be there also, and both will be chosen by user. we need to know when to use the lightning network we have to exchange it first from BTC main chain to LN, this is also a chance to get a decent profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 29, 2022, 09:39:13 AMLast edit: June 29, 2022, 09:52:20 AM by franky1",
      "body": "completely avoiding the bad sides of another network(which it is) to sell the utopian hype of getting people to use bitcoin less, just to promote the other network. predictable. funny how they all ignore and avoid the liquidity issues of routing. how more channels are needed, more hops required as the network expands to reach everyone and more balance just to get small payments to succeed. let alone the later bottlenecks and thinks like the snowball effect of reblancing that then unbalances other people which sets off a whole stream of events of just moving funds for sake of moving which causes other peoples to do and so on. (goodluck finding a solution to the rebalancing flaw)heck the sily uptopia is that when they show off that their LN fee channel is 0.001sat fee per sat. they are not telling people that it soon adds uptake a $10 amount. LN is not going to cost them 0.001sat(1msat fee per sat spent) to make a payment. of $10($10= 0.00050000). 50,000sat = 50,000msat....so 1 hop away is 50sat feeand in the A-F example in my previous post thats 4x 50sat = 200sat yep just 5/6 hops away ends up being the same as a bitcoin feeso is it really multiple times cheaper than bitcoin.. where a 250byte tx at 1sat/byte is 250. but is confirmed and settled in minutes/hours. instead of promised to be settled after closing in 1 month on LN..again some are ignoring:if 10mill btc were locked up i GUARANTEE not all of that 10mill of coin would be utilised by the person locking it to actually spend on their own personal needsyou those people cant all use that pegged msat for their own purposes. because its already used up by others making their payments. and rebalances. leaving some users unbalanced(causing a cascade effect). i guarantee you people will scam each other by getting people to download specific software offering \"special features\" but are just used to do bad peg conversions beneath the gui, and to offer channels with no locked bitcoin (because its already been done)suggesting the solution out bitcoin is to stop using bitcoin and to trust another network without consensus, without security and without many of the things that bitcoin has got. is not a solution..im not suggesting that another altnet might do better or have a different mechanism to allow free open flow in and out. as a choice. but pretending bitcoin shouldnt be used for users is just shamefuldont think of these altnets as the \"solutions\" or think they are bitcoin 2.0. think of them as niche services for temporary, small amount services. not something to lock up and stay on long term. dont risk more then you are willing to lose, and expect that you are NOT going to get 100% payment success every time. learn the risks and flaws, understand there is no security of network consensus ensuring the pegs remain 1sat:1000msat. learn from the mistakes of other networks that pegged to coins.  that recently broke their pegbe risk aware. dont let people fluff you with trust and utopian while getting you to risk your value. they are not going to pay you back when it goes wrong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tadamichi",
      "created_time": "June 29, 2022, 10:12:07 AMLast edit: June 29, 2022, 11:14:46 AM by tadamichi",
      "body": "Quote from: franky1 on June 29, 2022, 09:39:13 AMcompletely avoiding the bad sides of another network(which it is) to sell the utopian hype of getting people to use bitcoin less, just to promote the other network. predictable. Nah, anyone who goes into lightning should know the risks and then make a personal choice. It’s an optional choice for using Bitcoin off-chain, like when someone makes personal agreements with someone that aren’t officially backed up. This could be done without lightning too, but lightning is the better approach for this, because it makes the process more reliable, easier and more scalable.Quote from: franky1 on June 29, 2022, 09:39:13 AMfunny how they all ignore and avoid the liquidity issues of routing. how more channels are needed, more hops required as the network expands to reach everyone and more balance just to get small payments to succeed. Not ignored, but in practice, how many times are there issues when sending regular amounts around? And lightning is no complete replacement for on-chain transactions, so it’s fine.Quote from: franky1 on June 29, 2022, 09:39:13 AMso is it really multiple times cheaper than bitcoin..It is, now on-chain fees are cheap, but when they will increase again, the savings get higher.Quote from: franky1 on June 29, 2022, 09:39:13 AMi guarantee you people will scam each other by getting people to download specific software offering \"special features\" but are just used to do bad peg conversions beneath the gui, and to offer channels with no locked bitcoin (because its already been done)There’s always some responsibility of users to check the software they’re using is safe. We could also say Bitcoin is unsafe just because scammers could create wallets that can steal peoples private keys. But it’s not. Scamming will go on, but that’s why it’s important to not trust, but verify what you’re using is appropriate, for what you’re trying to use it for.Quote from: franky1 on June 29, 2022, 09:39:13 AMsuggesting the solution out bitcoin is to stop using bitcoin and to trust another network without consensus, without security and without many of the things that bitcoin has got. is not a solution.. No one did this, it makes people use Bitcoin more and finally broke the fud that altcoins are spreading, that Bitcoin cant scale. I know newbies that got into Bitcoin, because of lightning, it was demonstrating that Bitcoin was able to find a better solution, than any scam project could. And combines its features well with other solutions. This generates trust to tackle future problems and keeps people out of altcoins(not everyone).Quote from: franky1 on June 29, 2022, 09:39:13 AMdont think of these altnets as the \"solutions\" or think they are bitcoin 2.0. think of them as niche services for temporary, small amount services. not something to lock up and stay on long term. dont risk more then you are willing to lose, and expect that you are NOT going to get 100% payment success every time. learn the risks and flaws, understand there is no security of network consensus ensuring the pegs remain 1sat:1000msat. learn from the mistakes of other networks that pegged to coins.  that recently broke their pegbe risk aware. dont let people fluff you with trust and utopian while getting you to risk your value. they are not going to pay you back when it goes wrongExactly, but no one is suggesting something else here.————————————————————————————————————————————————————————————————————Also franky i have no problem with that you’re trying to rise awareness for issues, but think about it. Scalability/ low fees isn’t the only requirement for Bitcoin to be used on a daily basis too. Speed of transactions is another factor too. Did you ever pay in a store via wire? It’s slow and expensive, no store is accepting this. Online stores do, but people still choose the fastest form of payment preferably, to get their stuff shipped earlier. Physical stores either accept debit/ credit cards, gift cards, cash etc. Despite their PoS terminals having potential problems for example: fraud potential, chargebacks or transactions not going trough. And you can still use ur debit/ card even if it’s not verified that you have enough funds yet(lightning is way better than this). This is something people are used to, and they’re handling it on a daily basis and it works in practice.Even if lightning fees wouldn’t bring in savings there’s still a necessity for this, that can’t simply be solved in a better way, by using a chain again. With this Bitcoin has a huge advantage over any altcoin, because the acceptability of Bitcoin lightning is way higher than any other method for this. How will you solve a huge amount of transactions that need to be processed fast at the same time, in a better way? Not every payment needs to be recorded forever, just like cash. You could possibly have fake bills and yet we’re using it. The point is, there’s abuse potential in almost every form of payment there is. People will just adapt, and learn how to use it securely. Everything has pros/ cons, and we will need different solutions for different problems. You can’t fit every requirement perfectly into one solution, or we would already have it. So specialisation is the logical path forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "June 29, 2022, 10:35:46 AM",
      "body": "Lightning network is not bad for bitcoin. Lightning network has too fast transcation. You can easily paid your shopping payment, restaurant bill, or any others bill even any online payment  in a second. So it can never be said that the bitcoin lightning network is bad. It can be considered as a sophisticated feature for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 29, 2022, 01:46:06 PMLast edit: June 29, 2022, 02:26:38 PM by franky1",
      "body": "Quote from: tadamichi on June 29, 2022, 10:12:07 AMEven if lightning fees wouldn’t bring in savings there’s still a necessity for this, that can’t simply be solved in a better way, by using a chain again. With this Bitcoin has a huge advantage over any altcoin, because the acceptability of Bitcoin lightning is way higher than any other method for this. How will you solve a huge amount of transactions that need to be processed fast at the same time, in a better way? Not every payment needs to be recorded forever, just like cash. You could possibly have fake bills and yet we’re using it. The point is, there’s abuse potential in almost every form of payment there is. People will just adapt, and learn how to use it securely. Everything has pros/ cons, and we will need different solutions for different problems. You can’t fit every requirement perfectly into one solution, or we would already have it. So specialisation is the logical path forward.your last paragraph makes my point. most of you LN fans are screaming sales pitches that LN is \"the\" solution and nothing else should be done because LN does it all. trying to make Ln the only direction people should go for daily use. and avoid scaling bitcoin avoid expanding bitcoin avoid helping bitcoin, because lightning is the go-to thing. there is not a necessity for \"lightning\". specifically.. it is not \"the\" solutionother networks can make stronger protocols that are more secure in a \"off chain\" method. but lightning has more flaws then other models. im not a fan of the sidechains, but even with their flaws and i emphasis their flaws. lightning has more flaws in comparisonby presuming that LIGHTNING is the necessity everyone has to offramp to. is the human flaw of just parroting the utopian hype advertising scripts.. of getting people to adopt msat pegs instead of real utility btc, or pother options bitcoin could take. lightning is not a thing everyone should shift to and no one should be trying to shout that bitcoin should not scale because lighting can take the scale away by diverting people away. (yet many do, including you)trying to get everyone to shift to lightning is narrowing options and removing bitcoin utility from users.there are many ways to solve large transaction amounts.. without lightning. even if you fear and want to cry if anyone mentions scaling bitcoin and you just want an off-chain solution.. it doesnt have to be lightning that is \"the\" offchain solution. because the lightning model is more flawed then other models.for instance if a better more secure \"off-chain\" network was to be made. people can diversify over several regional variants of that network protocol and then co-communicate across them \"offchain\" . but heck i know the response is to ignore any other option coz you think lightning is the only direction. (standard mindset of lightning fans)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 29, 2022, 01:52:46 PMLast edit: June 29, 2022, 02:11:29 PM by franky1",
      "body": "Quote from: tadamichi on June 29, 2022, 10:12:07 AMQuote from: franky1 on June 29, 2022, 09:39:13 AMdont think of these altnets as the \"solutions\" or think they are bitcoin 2.0. think of them as niche services for temporary, small amount services. not something to lock up and stay on long term. Exactly, but no one is suggesting something else here.Quote from: tadamichi on June 29, 2022, 09:15:25 AMEvery solution has tradeoffs, but this is one of the more elegant solutions. so you say you dont see LN as the SOLUTION .. but then you go and say its a solution.. in the same post.. i didnt even have to check your post history to see how far your leaning into the LN camp of scripted words where you do see it as THE solution, where you pretend its the best/elegant/top, better option.. ..but i could search your post history for other quotes..i can even quote you calling it subtly and overtly as bitcoin2.0 when i see you many times talk about the \"bitcoin L2\" \"bitcoin layer\" and \"ontop bitcoin\", and \"bitcoin lightning network\"heck the way you say bitcoin cant cope bitcoin cant scale.. your soo deep in the salepitch BS of Ln you are literally saying \"bitcoin bad LN elegant\"for someone that pretends they are promoting bitcoin adoption. you are certainly trying to call it crap. and advertise another network instead.. .. LN is not elegant. it has bugs and flaws. and after 5 years+ LN still cant guarantee payment success 100%even now people are needing to add more channels or wait for other days when their route parter a few hops away comes back online.. where they need to close channels or rebalance because OTHERS have used up YOUR funds. setting up and using LN is not elegant. its worse then setting up a bitcoin wallet. Ln has less security then bitcoin. it has many things against it that make it nothing like bitcoin. but you continue to try to make it sound better then bitcoin.LN can still function WITHOUT bitcoin. it is not essential to bitcoin. LN is its own network that can function without bitcoin. accept that fact. you tagging on the word bitcoin does not mean LN is purely a bitcoin thing...when you talk about LN. you are mainly saying about how LNs FEATURE/BENEFIT is to get people away from using bitcoin..a solution to scaling bitcoin and increasing BITCOIN utility. is not to take people away from bitcoin and stifle bitcoin scaling to stop more people adopting it, simply because another network can adopt the people instead. emphasisfor someone that pretends they are promoting bitcoin adoption. you are certainly trying to call it crap. and advertise another network instead.. put it simple..if i was to call LN.. bitcoin \"SV\".. and that is all i have scenario'd.. a name change.. from your bitcoin \"LN\" simply changed the lettering to \"SV. .. suddenly you might see the light of day of the game being played by LN supporters.. trying to get people to stop making bitcoin transactions to instead make transactions on another network.. you might start seeing the debate from the other sidegive it a try.. give yourself a month of calling LN \"bitcoin sv\".. knowing people are trying to take people away fro bitcoin to your \"sv\" network. it might enlighten you. you might even start getting risk aware and looking for the flaws other people see inn your \"sv\" rather then hyping it up and ignoring the flaws",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragospirvu75",
      "created_time": "June 29, 2022, 03:56:59 PM",
      "body": "Wow guys, I didn't expect to receive so many answers (and so complex). I've read them all, some things are too technical for me, but now I have another view on LN. Thanks to everyone for them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tadamichi",
      "created_time": "June 29, 2022, 04:12:54 PM",
      "body": "K I’ll do this discussion once, just to make sure you really didn’t get it or if you just let ur bias rule you, then im out, because i was really always fair to you and now you try to put words in my mouth.Quote from: franky1 on June 29, 2022, 01:46:06 PMyour last paragraph makes my point. most of you LN fans are screaming sales pitches that LN is \"the\" solutionI never said there is „the” solution. It is one of many solutions to transact outside of Bitcoin and in my personal opinion an elegant solution for doing just this. It is not a necessity for anyone to do this and shouldn’t ever be a necessity, it should be an optional, voluntary and informed choice for whoever wants to do this. For the purpose of doing some transactions, not a replacement for anything else.Quote from: tadamichi on June 29, 2022, 10:12:07 AMEverything has pros/ cons, and we will need different solutions for different problems.Quote from: franky1 on June 29, 2022, 01:46:06 PMand nothing else should be done because LN does it all. trying to make Ln the only direction people should go for daily use. and avoid scaling bitcoin avoid expanding bitcoin avoid helping bitcoin, because lightning is the go-to thing. Again i never said this or suggested this or tried to suggest this. Lightning and Bitcoin are two different things. Developed independently. That’s the point of layers, Bitcoin is still being developed independently and needs to be functional without lightning in mind. It should make decisions independently from lightning, like it didn’t exist. Everything should be done to develop their own project as best as possible. I don’t think you understand the engineering principles behind this. Bitcoin shouldn’t avoid anything and be developed as well as possible, and the same goes for lightning. You can use the base layer aka Bitcoin either way, no one will lock you outside of it, or halt it’s development. If one upper layer can specialise to serve different use cases better in practice, then some people might want to use it. Just because i use the word layer doesn’t mean Bitcoin and lightning are one thing, it’s the opposite.Quote from: franky1 on June 29, 2022, 01:46:06 PMthere is not a necessity for \"lightning\". specifically.. it is not \"the\" solutionother networks can make stronger protocols that are more secure in a \"off chain\" method. but lightning has more flaws then other models. im not a fan of the sidechains, but even with their flaws and i emphasis their flaws. lightning has more flaws in comparisonThere is no the solution, but personal choice. Sidechains have advantages, but also disadvantages. I saw some interesting proposals there, but for now once they gain traction they will face the same issues as the main chain in terms of decentralization, security and scalability, this could be fixed in the future tho and then they’re maybe better than lightning overall. I personally like lightning for the use case of fast and many small payments, for the rest the main chain is better in my opinion. That’s why i won’t use sidechains anytime soon, because i have the mainchain for this.Quote from: franky1 on June 29, 2022, 01:46:06 PMby presuming that LIGHTNING is the necessity everyone has to offramp to. is the human flaw of just parroting the utopian hype advertising scripts.. of getting people to adopt msat pegs instead of real utility btc, or pother options bitcoin could take. I made it clear enough now that i don’t want this and that im not parroting this.Quote from: franky1 on June 29, 2022, 01:46:06 PMlightning is not a thing everyone should shift to and no one should be trying to shout that bitcoin should not scale because lighting can take the scale away by diverting people away. Ik.Quote from: franky1 on June 29, 2022, 01:46:06 PMthere are many ways to solve large transaction amounts.. without lightning. even if you fear and want to cry if anyone mentions scaling bitcoin and you just want an off-chain solution.. it doesnt have to be lightning that is \"the\" offchain solution. because the lightning model is more flawed then other models.for instance if a better more secure \"off-chain\" network was to be made. people can diversify over several regional variants of that network protocol and then co-communicate across them \"offchain\" . but heck i know the response is to ignore any other option coz you think lightning is the only direction. (standard mindset of lightning fans)I won’t ignore other options and will gladly listen to different proposal that are made, i want more of them, not less.Quote from: franky1 on June 29, 2022, 01:52:46 PMQuote from: tadamichi on June 29, 2022, 10:12:07 AMQuote from: franky1 on June 29, 2022, 09:39:13 AMdont think of these altnets as the \"solutions\" or think they are bitcoin 2.0. think of them as niche services for temporary, small amount services. not something to lock up and stay on long term. Exactly, but no one is suggesting something else here.Quote from: tadamichi on June 29, 2022, 09:15:25 AMEvery solution has tradeoffs, but this is one of the more elegant solutions. so you say you dont see LN as the SOLUTION .. but then you go and say its a solution.. in the same post.. Quote from: tadamichiI never said there is „the” solution. It is one of many solutions to transact outside of Bitcoin and in my personal opinion an elegant solution for doing just this. It is not a necessity for anyone to do this and shouldn’t ever be a necessity, it should be an optional, voluntary and informed choice for whoever wants to do this. For the purpose of doing some transactions, not a replacement for anything else.Quote from: franky1 on June 29, 2022, 01:52:46 PM i can even quote you calling it subtly and overtly as bitcoin2.0 when i see you many times talk about the \"bitcoin L2\" \"bitcoin layer\" and \"ontop bitcoin\", and \"bitcoin lightning network\"It’s not Bitcoin 2.0 and won’t ever be, and there is no Bitcoin 2.0. And i don’t want a Bitcoin 2.0. It’s still appropriate to describe lightning in layered architecture kind of way despite this, in my opinion.Quote from: franky1 on June 29, 2022, 01:52:46 PMheck the way you say bitcoin cant cope bitcoin cant scale.. your soo deep in the salepitch BS of Ln you are literally saying \"bitcoin bad LN elegant\"Im not, why would i even think Bitcoin is bad. LN is elegant if we want a lot of fast payments being done outside of Bitcoin. It’s also pointless to deny that it’s hard to scale the main chain at this particular moment in time 29th june 2022, i want this to change in the future. But scaling can’t come at the cost of decentralization, if we have a provable way to scale the main chain today, without becoming centralized, then this would be the best way. But we don’t yet and letting a few more payments in now, won’t change the basic problem.Quote from: franky1 on June 29, 2022, 01:52:46 PMfor someone that pretends they are promoting bitcoin adoption. you are certainly trying to call it crap. and advertise another network instead.. I talked about Bitcoin 99% of the time, for you it’s too much if i mention lightning just once or a few times positively.Quote from: franky1 on June 29, 2022, 01:52:46 PM.. LN is not elegant. it has bugs and flaws. and after 5 years+ LN still cant guarantee payment success 100%even now people are needing to add more channels or wait for other days when their route parter a few hops away comes back online.. where they need to close channels or rebalance because OTHERS have used up YOUR funds. setting up and using LN is not elegant. its worse then setting up a bitcoin wallet.  To me the basic idea and design principles are elegant. To me it’s just normal that software takes time to harden, because i work in this field. It is not a elegant solution for the things you mentioned, these were added because they had to be. Just use it optionally for one purpose: fast payments and then it depends on how often you make these kinds of payments to decide if it’s worth opening a channel or not.Quote from: franky1 on June 29, 2022, 01:52:46 PMLn has less security then bitcoin. it has many things against it that make it nothing like bitcoin. but you continue to try to make it sound better then bitcoin.I said that lightning is not a good way of storing funds and just an option for payments, which exactly implies what you said.Quote from: franky1 on June 29, 2022, 01:52:46 PMLN can still function WITHOUT bitcoin. it is not essential to bitcoin. LN is its own network that can function without bitcoin. accept that fact. you tagging on the word bitcoin does not mean LN is purely a bitcoin thing.And Bitcoin can function without lightning, that’s the point of layers. Reducing complexity and being better at one specific thing, for example transaction speed, this has tradeoffs, otherwise we wouldn’t need a another layer in the first place. And then there’s use cases where this trade off is tolerable. I said Bitcoin lightning, because im aware it can be used for other coins too. Bitcoin lightning = using Lightning in a Bitcoin context. That was the meaning. Quote from: franky1 on June 29, 2022, 01:52:46 PMwhen you talk about LN. you are mainly saying about how LNs FEATURE/BENEFIT is to get people away from using bitcoin..Nah and if that is your fear, i think you shouldn’t be concerned about it, because more people will use Bitcoin in the future, lightning is an enabler/entry point for many people and not a threat.Quote from: franky1 on June 29, 2022, 01:52:46 PMa solution to scaling bitcoin and increasing BITCOIN utility. is not to take people away from bitcoin and stifle bitcoin scaling to stop more people adopting it, simply because another network can adopt the people instead. Bitcoin utility is increasing too, regardless of lightning.Quote from: franky1 on June 29, 2022, 01:52:46 PMemphasisfor someone that pretends they are promoting bitcoin adoption. you are certainly trying to call it crap. and advertise another network instead.. I said several times now that Bitcoin is the best money ever created, doesn’t sound like crap to me. Lightning needs Bitcoin not the other way around(Bitcoin is the popular thing). But it’s also foolish to imply that lightning had no single positive impact on Bitcoin overall.Quote from: franky1 on June 29, 2022, 01:52:46 PMput it simple..if i was to call LN.. bitcoin \"SV\".. and that is all i have scenario'd.. a name change.. from your bitcoin \"LN\" simply changed the lettering to \"SV. .. suddenly you might see the light of day of the game being played by LN supporters.. trying to get people to stop making bitcoin transactions to instead make transactions on another network.. you might start seeing the debate from the other sidegive it a try.. give yourself a month of calling LN \"bitcoin sv\".. knowing people are trying to take people away fro bitcoin to your \"sv\" network. it might enlighten you. you might even start getting risk aware and looking for the flaws other people see inn your \"sv\" rather then hyping it up and ignoring the flawsIm not an idiot, i know that they’re not the same and that lightning has flaws. But i can have the opinion that fast payments with small and many amounts are necessary for some use cases, even if it means it’s done in a less secure way, because this can’t easily be done on the main chain now without tradeoffs. The fact is the mainchain cant process an unlimited amounts of payments in a reasonable time frame, so there needs to be some ways to get around this limit, for the time we need/ want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 29, 2022, 04:45:32 PM",
      "body": "The question is pretty good, but I think so far miners are still getting a significant amount of rewards for mining, and for the fees as well because most transactions happen on-chain. Moreover, I agree with witcher_sense that it's reasonable that small payments would be made via an off-chain solution like the Lightning Network, and there are still plenty of transactions for miners to confirm. So I don't think it's anywhere near being a threat and discouraging miners who could've got more payments in transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}