{
  "id": "topic_5432182",
  "title": "BSSI",
  "author": "BSSI",
  "created_time": "December 28, 2022, 05:22:21 PM",
  "content": "Hallo,wie hier https://bitcointalk.org/index.php?topic=1847451.80 schon besprochen, arbeite ich an einem Bot, der Pump and Dumps rechtzeitig erkennt. Funktioniert schon hin und wieder ganz gut und man kann noch nach dem Kauf 30 % oder mehr machen. Wird noch optimiert, um weniger Falschmeldungen zu erzeugen. Die Alarme werden zukünftig auch in diesen Kanal gesendet: https://t.me/CryptocoinsPumpDetectorIn den nächsten Tagen kommt noch ein Update, dann werden die Alarme auch nicht mehr wiederholt. Ist so noch etwas unübersichtlich. Ihr könnt euch ja mal anschauen, ob ihr rechtzeitig kaufen konntet. Bei der aktuellen Einstellung kommt es übrigens häufig vor, dass der Coin erst 5 Min. nach der Meldung richtig steigt. Empfehle, mit Trailing-Stop-Order oder Stop-Loss-Order zu arbeiten.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432182",
  "comments": [
    {
      "author": "Lafu",
      "created_time": "December 29, 2022, 07:59:54 PM",
      "body": "Wie soll man das verstehen kostenlos zwecks tests ?Ist das eine Trail Version deines Pump Detector Bots und nach 30 Tagen oder 14 Tagen muss man dafür zahlen um die Vollversion zu bekommen ?Was für einen Preis hast du dir vorgestellt oder verlangst du dann für diesen Bot , denn umsonst ist auf dieser Welt und vorallem in der Kryptozene nichts.Gibt es einen Github Link für diesen Bot das man sich das ganze mal genauer anschauen und prüfen kann ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "December 30, 2022, 09:00:24 AM",
      "body": "Aktuell ist nicht geplant, den zu verkaufen. Auf jeden Fall läuft der während der Entwicklungsphase kostenlos. Und wahrscheinlich auch danach noch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "December 30, 2022, 12:39:53 PM",
      "body": "Quote from: BSSI on December 30, 2022, 09:00:24 AMAktuell ist nicht geplant, den zu verkaufen. Auf jeden Fall läuft der während der Entwicklungsphase kostenlos. Und wahrscheinlich auch danach noch.Es wird sich hier sicher jemand finden der beim Test deines Bots behilflich sein möchte BSSI Ich selbst bin es nicht aber werde dem Thread hier gespannt folgen und wünsche gutes Gelingen für dein Vorhaben!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "December 30, 2022, 06:53:30 PM",
      "body": "Wünsche dir auch gutes Gelingen und wenn sich jemand aus der deutschen Sektion freiwillig meldet wäre ich auch bereit an einen mir bekannten User ein wenig Spielgeld zu überlassen, damit es erprobt werden kann und da würden bestimmt mehr Leute mitmachen und wir hätten vielleicht eine etwas höhere Summe zum ausprobieren. Aber hinsetzen und selbstständig alles durchzuführen - hierfür fehlt mir aktuell leider vollkommen die Zeit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "December 31, 2022, 05:22:55 PM",
      "body": "Hätte euch gern das Ergebnis des Tests geschrieben, aber ein übereifriger Admin ist der Meinung, dass sei Off-Topic ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "December 31, 2022, 05:25:17 PM",
      "body": "Quote from: BSSI on December 31, 2022, 05:22:55 PMHätte euch gern das Ergebnis des Tests geschrieben, aber ein übereifriger Admin ist der Meinung, dass sei Off-Topic ...Hä? Wieso sollte mole die Testergebnisse in diesem Topic verbieten? Kann ich mir gar nicht vorstellen und wird sich vermutlich um einen Fehler handeln oder aber das Posting hatte überwiegend andere Inhalte die nicht hierher gepasst haben. Mole wird sich bestimmt melden und uns aufklären Die Ergebnisse werden hier einige wissen wollen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "December 31, 2022, 05:28:19 PM",
      "body": "Quote from: Unknown01 on December 31, 2022, 05:25:17 PMQuote from: BSSI on December 31, 2022, 05:22:55 PMHätte euch gern das Ergebnis des Tests geschrieben, aber ein übereifriger Admin ist der Meinung, dass sei Off-Topic ...Hä? Wieso sollte mole die Testergebnisse in diesem Topic verbieten? Kann ich mir gar nicht vorstellen und wird sich vermutlich um einen Fehler handeln oder aber das Posting hatte überwiegend andere Inhalte die nicht hierher gepasst haben. Mole wird sich bestimmt melden und uns aufklären Die Ergebnisse werden hier einige wissen wollen.Dann hat er den Fehler schon zwei mal gemacht. Habe es jetzt in diesem Treath gepostet, da scheint ein anderer zuständig zu sein: https://bitcointalk.org/index.php?topic=1847451.80Erkenne nicht, was daran Off-Topic sein soll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "December 31, 2022, 05:36:02 PM",
      "body": "Bei beiden Threads liegt die Zuständigkeit bei mole0815 aber es können auch internationale Moderatoren zeitweise aushelfen (ich nehme aber aktuell an, dass kein Bedarf besteht). Mole löscht für gewöhnlich keine Beiträge ohne darauf einzugehen aber abwarten, er meldet sich noch bestimmt und klärt uns auf. Deinen Post im anderen Thread habe ich gesehen und da gibt es tatsächlich keinen Begründung zum löschen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "December 31, 2022, 05:36:53 PM",
      "body": "Quote from: Unknown01 on December 31, 2022, 05:36:02 PMBei beiden Threads liegt die Zuständigkeit bei mole0815 aber es können auch internationale Moderatoren zeitweise aushelfen (ich nehme aber aktuell an, dass kein Bedarf besteht). Mole löscht für gewöhnlich keine Beiträge ohne darauf einzugehen aber abwarten, er meldet sich noch bestimmt und klärt uns auf. Deinen Post im anderen Thread habe ich gesehen und da gibt es tatsächlich keinen Begründung zum löschen.Bei der Mail zur Löschung steht: Guest, aber das steht da eventuell immer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "December 31, 2022, 10:05:48 PM",
      "body": "Ich denke das problem liegt daran das es bereits im anderen thread gepostet oder geschrieben war.Aber mole0815 kann da bestimmt mehr dazu sagen , eventuell hat den beitrag von dir irgendwer reportet.Ich war es aufjedenfall nicht , und laut https://ninjastic.space/search?author=BSSI wurde der beitrag hier schon 2 mal gelöscht.Sehr seltsam irgendwie , denn als du diesen geschrieben hattest hab ich das ergebnis hier noch selbst gelesen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "December 31, 2022, 10:26:08 PM",
      "body": "Was versprichst du dir davon, deine Signale hier zu veröffentlichen? Dass Leute deinen Signalen folgen und dadurch diese eher erfüllt werden? Ist glaube ich unwahrscheinlich bei so wenigen Leuten Hast du schonmal drüber nachgedacht eine API anzusprechen und automatisiert Orders zu setzen, wenn dein Bot Alarm schlägt? Dann müsstest du nicht mehr rechtzeitig kaufen, sondern alles wäre automatisiert",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "January 01, 2023, 01:40:09 PM",
      "body": "1.Quote from: Lafu on December 31, 2022, 10:05:48 PMIch denke das problem liegt daran das es bereits im anderen thread gepostet oder geschrieben war.Aber mole0815 kann da bestimmt mehr dazu sagen , eventuell hat den beitrag von dir irgendwer reportet.Ich war es aufjedenfall nicht , und laut https://ninjastic.space/search?author=BSSI wurde der beitrag hier schon 2 mal gelöscht.Sehr seltsam irgendwie , denn als du diesen geschrieben hattest hab ich das ergebnis hier noch selbst gelesen.Nein, im anderen Treath habe ich erst gepostet, nachdem der Beitrag hier zwei mal gelöscht wurde. Und heute macht er genauso weiter und löscht alles.2.Quote from: sam00 on December 31, 2022, 10:26:08 PMHast du schonmal drüber nachgedacht eine API anzusprechen und automatisiert Orders zu setzen, wenn dein Bot Alarm schlägt? Dann müsstest du nicht mehr rechtzeitig kaufen, sondern alles wäre automatisiert Genau daran arbeite ich doch, siehe anderer Treath. Aber ich möchte nicht einfach eine Order setzen, diese Stop-Loss-Order soll automatisiert hoch gesetzt werden, wenn der Kurs steigt. Und nein, das funktioniert bei schnell steigenden Kursen nicht mit der Trailing-Stop-Order. Im Telegram Kanal (https://t.me/CryptocoinsPumpDetector) wird jetzt bei jedem Alarm auch der Kurs bei Alarm angezeigt. Das wäre später dann der EK-Preis. Eben z.B. wurde HOOK bei Kurs 1,2795 $ gemeldet (Siehe: https://ibb.co/qjTzXN7) und stieg dann auf 1,3787 $, also 7,75 % Gewinn.[/quote]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "January 01, 2023, 07:22:02 PM",
      "body": "Quote from: BSSI on January 01, 2023, 01:40:09 PMNein, im anderen Treath habe ich erst gepostet, nachdem der Beitrag hier zwei mal gelöscht wurde. Und heute macht er genauso weiter und löscht alles.Bisher steht dein Beitrag ja noch also alles gut Vielleicht löscht unser Moderator Beiträge von dir, weil du mehrere Threads mit dem gleichen Thema erstellst oder gewisse Forenregeln brichst? Du könntest @mole0815 ja einfach mal fragen, was der Grund dafür ist.Quote from: BSSI on January 01, 2023, 01:40:09 PMGenau daran arbeite ich doch, siehe anderer Treath. Aber ich möchte nicht einfach eine Order setzen, diese Stop-Loss-Order soll automatisiert hoch gesetzt werden, wenn der Kurs steigt. Und nein, das funktioniert bei schnell steigenden Kursen nicht mit der Trailing-Stop-Order. Im Telegram Kanal (https://t.me/CryptocoinsPumpDetector) wird jetzt bei jedem Alarm auch der Kurs bei Alarm angezeigt. Das wäre später dann der EK-Preis. Eben z.B. wurde HOOK bei Kurs 1,2795 $ gemeldet (Siehe: https://ibb.co/qjTzXN7) und stieg dann auf 1,3787 $, also 7,75 % Gewinn.[/quote]Du findest sicher eine Möglichkeit, die Orders genau zu platzieren und dynamisch anzupassen. Dann bleibt nur noch die Frage, warum du das Ganze mit uns teilen möchtest (kostenlos) ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "January 01, 2023, 07:38:32 PM",
      "body": "Ich habe keine Beiträge gelöscht BSSI. Bin aktuell auch nur mobil online und daher etwas eingeschränkt aber ich kann die Tage gerne prüfen was/warum bereinigt wurde. Bin ja nicht der einzige Moderator im Forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "January 01, 2023, 08:23:29 PM",
      "body": "Quote from: mole0815 on January 01, 2023, 07:38:32 PMIch habe keine Beiträge gelöscht BSSI. Bin aktuell auch nur mobil online und daher etwas eingeschränkt aber ich kann die Tage gerne prüfen was/warum bereinigt wurde. Bin ja nicht der einzige Moderator im Forum Ja, hab ich ja schon vermutet, dass es ein anderer war. Ich fände es in dieser Kategorie passender, aber hier wirds gelöscht, im andern Treath gehts. Und nein, die Beiträge haben ich nicht zeitgleich verfasst. Habs im andern Treath gepostet, weils hier gelöscht wurde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "January 01, 2023, 08:40:39 PM",
      "body": "Hier gibt es noch 2 Beiträge die so auch gegen die Regeln verstoßen (wenn man es ganz genau nimmt) da keine 24 Stunden dazwischen lagen… bedeutet es hätte der Edit-Button verwendet werden müssen.https://bitcointalk.org/index.php?topic=1847451.msg61476086#msg61476086Du kannst die Infos gerne nochmal an der von dir gewünschten Stelle posten. Ich werde nicht löschen Und was mit den anderen Beiträgen passiert ist kläre ich noch ab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "January 01, 2023, 09:24:44 PMLast edit: January 05, 2023, 12:23:54 PM by BSSI",
      "body": "Aktuelle Ergebnisse:Test 30.12.2022, 20:24 - 21:45 UhrAlarmWährungKurs bei AlarmHighGewinn20:24KDA0,871 $0,881 $1,15 %20:26DENT0,000718 $0,000738 $2,79 %20:28BSW0,1721 $0,174 $1,10 %20:38TVK0,0298 $0,0301 $1,01 %20:38AUTO223,20 $227,00 $1,70 %20:42PERL0,01419 $0,0144 $1,48 %20:50ACH0,00818 $0,0082 $0,24 %20:50UMA1,492 $1,57 $5,23 %20:58JASMY0,002908 $0,002927 $0,65 %21:04STX0,214 $0,225 $5,14 %21:10FET0,095 $0,096 $1,05 %21:14HFT0,2876 $0,2905 $1,01 %21:22HIVE0,2563 $0,2566 $0,12 %21:26RAY0,1475 $0,1582 $7,25 %21:32BICO0,275 $0,284 $3,27 %21:37REI0,0231 $0,0235 $1,73 %21:45RAD1,534 $1,553 $1,24 %Test 31.12.2022, 20:13 - 20:43 UhrAlarmWährungKurs bei AlarmHighGewinn20:13T0,0168 $0,017 $1,19 %20:13BNT0,36 $0,364 $1,11 %20:18STPT0,02646 $0,03196 $20,79 %20:26STEEM0,1479 $0,1553 $5,00 %20:34GHST0,984 $0,996 $1,22 %20:36FRONT0,1842 $0,1876 $1,85 %20:36VTHO0,000911 $0,000918 $0,77 %20:37CTSI0,1041 $0,1052 $1,06 %20:43QI0,00625 $0,00632 $1,12 %Test 01.01.2023, 12:57 - 15:27 UhrNeue Version: Kurs bei Alarm wird nun angezeigtAlarmWährungKurs bei AlarmHighGewinn12:57TROY0,002687 $0,002689 $0,07 %13:04HOOK1,2795 $1,3899 $8,63 %13:23ARDR0,0696 $0,0706 $1,44 %13:25CHESS0,185 $- 0,5 %Stop-Loss-Order bei - 0,5 % aktiviert.13:37MAGIC0,5078 $0,5287 $4,12 %13:41HFT0,299 $0,305 $2,01 %13:53SLP0,002 $- 0,5 %Stop-Loss-Order bei - 0,5 % aktiviert.13:58DIA0,277 $+/- 0,0 %Weder Price noch Limit der OCO-Order erreicht.14:10BETA0,06708 $0,06858 $2,24 %14:32SANTOS4,491 $4,541 $1,11 %14:37MOB0,893 $0,909 $1,79 %15:00NEBL1,296 $- 0,5 %Stop-Loss-Order bei - 0,5 % aktiviert.15:04HIGH0,865 $+/- 0,0 %Weder Price noch Limit der OCO-Order erreicht.15:12AMP0,0031 $+/- 0,0 %Weder Price noch Limit der OCO-Order erreicht.15:12DYDX1,137 $- 0,5 %Stop-Loss-Order bei - 0,5 % aktiviert.15:27LDO1,032 $- 0,5 %Stop-Loss-Order bei - 0,5 % aktiviert.Test 01.01.2023, 17:29 - 17:49 UhrAlarmWährungKurs bei AlarmHighGewinn17:41JASMY0,003149 $0,003214 $2,06 %17:42FLUX0,488 $0,489 $0,20 %18:54BNT0,385 $0,388 $0,78 %19:09AUCTION4,13 $4,29 $3,87 %19:16MAGIC0,5211 $0,5299 $1,69 %19:27LDO1,074 $1,147 $6,80 %19:48JASMY0,003252 $0,003475 $6,86 %19:49BIFI352,30 $355,00 $0,77 %19:56CLV0,05311 $0,05355 $0,83 %20:01CKB0,00232 $+/- 0,0 %Weder Price noch Limit der OCO-Order erreicht.20:02HOOK1,3018 $1,3317 $2,30 %20:11AUTO224,00 $+/- 0,0 %Weder Price noch Limit der OCO-Order erreicht.20:11BNT0,385 $- 0,5 %Stop-Loss-Order bei - 0,5 % aktiviert.20:14APE3,771 $3,78 $0,24 %Dazu könnt ihr euch ja die passende Strategie überlegen. Es sind zwar ein paar sehr gute Ergebnisse dabei, oft aber im Bereich 1 - 2 %. Da wird es schwierig, mit einer Trailing-Stop-Order zu arbeiten. Erstens wegen dem zu wählenden Trailing Delta, zweitens, weil der Act. Price über dem aktuellen Kurs gewählt werden muss, was bei schnell und wenige Prozent steigenden Kursen schwierig wird. Da muss ich tatsächlich meine Lösung mit dem automatischen hochsetzen einer Stop-Limit-Order umsetzen. Das hätte den Vorteil, dass diese unterhalb des aktuellen Kurses gesetzt werden kann, und nicht erst durch einen weiteren Kursanstieg aktiviert werden muss, wodurch diese schon nahe am High aktiviert werden müsste, was vermutlich häufig schief geht und keine Verkaufs-Order veranlasst wird.Für den Anfang, bis ich mir was besseres überlegt, und auch technisch umgesetzt hab, empfehle ich folgendes:Bei Alarm kaufen und sofort eine OCO-Order erstellen, Verkauf bei - 0,5 % oder + 1 %. Damit macht man voraussichtlich gesamt ein paar Prozent Gewinn.Das Ergebnis würde allerdings viel besser aussehen, wenn man das Potenzial der rot markierten voll ausnutzen könnte. Dazu muss ich die automatische Anpassung der Stop-Loss-Order umsetzen. So könnte ich zu Beginn nach Einkauf den Stop bei - 0,5 % setzen, bei stark steigenden Kursen den Stop aber nicht nur automatisch hoch setzen lassen, sondern auch den Prozentabstand des Stops zum aktuellen Kurs vergrößern. Eine Trailing-Stop-Order mit 3 %, die oben raus nötig wären, würde direkt nach Einkauf bei jedem Fehlversuch zu hohen Verlusten führen. Der Verlust für Fehlversuche muss auf - 0,5 % unter EK-Kurs beschränkt werden. Außerdem wird bei der Trailing-Stop-Order erst ein Stop gesetzt, wenn diese aktiviert wurde. Das bedeutet: Steigt der Kurs nicht bis zum Aktivierungspreis, gibt es keinen Stop nach unten. Arbeitet ihr mit der Trailing-Stop-Order? Wie löst ihr das Problem?Update:Ab voraussichtlich Sonntag funktioniert auch der automatische Kauf. Werde den Bot dann damit einen Tag arbeiten lassen und auswerten, wie gut der arbeitet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BSSI",
      "created_time": "January 17, 2023, 09:29:38 AMLast edit: January 17, 2023, 02:36:11 PM by BSSI",
      "body": "Der Bot hat heute Nacht erstmals automatisch gehandelt. Das ist das Ergebnis:DatumZeitWährungEinkaufVerkaufGewinn16.01.202323:55:18AMP0,00534 $0,0053 $- 0,75 %17.01.202300:03:50DREP0,3402 $0,338 $- 0,65 %17.01.202300:40:18WNXM13,53 $13,55 $0,15 %17.01.202300:59:24ONG0,2831 $0,28 $- 1,10 %17.01.202301:02:30APT8,1387 $8,1772 $0,47 %17.01.202301:05:47LSK0,909 $0,895 $- 1,54 %17.01.202301:18:53GMT0,5086 $0,50 $- 1,69 %17.01.202301:28:26VIDT0,03743 $0,03756 $0,35 %17.01.202301:39:41ACH0,0131 $0,01312 $0,15 %17.01.202301:56:07RAY0,2677 $0,268 $0,11 %17.01.202302:00:06FXS8,932 $8,917 $- 0,17 %17.01.202302:06:11POWR0,1629 $0,1631 $0,12 %17.01.202302:16:25PHB0,9731 $0,9635 $- 0,99 %17.01.202302:24:26AMP0,00558 $0,00557 $- 0,18 %17.01.202302:29:33T0,0244 $0,024 $- 1,64 %17.01.202302:32:40CRV0,905 $0,898 $- 0,77 %17.01.202302:54:48ACH0,01384 $0,01403 $1,37 %17.01.202303:02:43VIDT0,03958 $0,04034 $1,92 %17.01.202303:30:33FET0,2269 $0,232 $2,25 %17.01.202303:51:44POWR0,1631 $0,1672 $2,51 %17.01.202304:16:22GNO105,40 $104,70 $- 0,66 %17.01.202304:26:47STPT0,0353 $0,03614 $2,38 %17.01.202304:35:31AMP0,00547 $0,00555 $1,46 %17.01.202304:38:39REQ0,1043 $0,1039 $- 0,38 %Macht 2,74 %. Abzgl. Gebühren - 0,86 %. Bei Fehlversuchen im Schnitt - 0,88 %, bei Treffern im Schnitt + 1,10 %. Trefferquote bei 50 %. Bedeutet, noch ein wenig Optimierung und zwei, drei Treffer mehr in diesem Beispiel, und dann sieht das sehr gut aus. Dazu kommt dann später noch die Anpassung der Stop-Loss-Order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "January 17, 2023, 09:43:22 AM",
      "body": "Erinnert mich irgendwie an meine Zeit mit dem SpreadBot 1000  https://bitcointalk.org/index.php?topic=911201.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}