{
  "id": "topic_5434387",
  "title": "Hispo",
  "author": "Hispo",
  "created_time": "January 12, 2023, 12:53:14 AMLast edit: January 16, 2023, 05:12:40 AM by Hispo",
  "content": "Desde hace ya un tiempo he pensado en hacer arte para nuestra comunidad del foro, por fín he conseguido algo de tiempo para hacer algo relativamente rápido que mostrar. Nada mejor para comenzar el año.Me disculpo de antemano por la calidad, la verdad es que tenido que desviar mi tiempo en hacer obras con las cuales ya me he comprometido.  La inspiración de esta humilde obra salió de una de las participaciones de satoshi aquí en el foro, estoy seguro que muchos de ustedes ya conocen el contexto.Decidí darle un toque de la película matrix (irónicamente nunca la he visto, pero conozco los memes)  También quisiera saber si estaría bien dejar este hilo aquí o moverlo a algún otro lado, para futuras entradas, no solo de mi parte, sino también de ustedes.Comentarios y críticas constructivas son bienvenidas.  https://bitcointalk.org/index.php?topic=532.msg6306#msg6306",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434387",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "January 12, 2023, 08:35:13 AMLast edit: January 12, 2023, 09:34:11 AM by DdmrDdmr",
      "body": "Habrá que congratular la existencia todavía de arte que no sea generada por alguna IA (ni un meme) …Es curioso lo que se puede hacer con unos trazos sencillos, plasmando una idea por asociación de varias ideas subyacentes. A mí me parece entretenido y supongo que ya lo llevas bastante por la mano con experiencia previa. A mí me costó lo suyo crear mi avatar, fruto de mi poca arte para el trazo y de ser novato en el uso de las herramientas de uso.Aspectos laterales:Quizás querrías hacer algo más grande el código QR con la dirección BTC, dado que éste figura demasiado pequeño para poder leerlo, al menos esa es mi experiencia al intentarlo.En disputa con lo anterior, una duda que me surge, y siendo un asunto lateral al hilo, es si los códigos QR y direcciones BTC se pueden poner así en el foro. A mí me parece natural que las creaciones puedan llevarlo, y de hecho, es lo que hemos visto en imágenes de obras creadas a nivel de calle y subidas al foro. La duda radica en si alguien la consideraría contraria a la regla que no permite solicitar BTC en el foro. Que conste que yo no considero que lo sea, y desde luego tengo clarísimo que no es tu intención. Lo digo pensando en lo que otros podrían llegar a considerar, sobre todo por el Norte.Edit:Quote from: Hispo on January 12, 2023, 09:13:45 AM<…>Quizás estaría preguntárselo a @Welsh. A mí me parece correcto que se pudiesen dejar en obras de arte, y quitarlo es ponerse la venda antes de la herida.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 12, 2023, 09:13:45 AM",
      "body": "Quote from: DdmrDdmr on January 12, 2023, 08:35:13 AMHabrá que congratular la existencia todavía de arte que no sea generada por alguna IA (ni un meme) …Es curioso lo que se puede hacer con unos trazos sencillos, plasmando una idea por asociación de varias ideas subyacentes. A mí me parece entretenido y supongo que ya lo llevas bastante por la mano con experiencia previa. A mí me costó lo suyo crear mi avatar, fruto de mi poca arte para el trazo y de ser novato en el uso de las herramientas de uso.Aspectos laterales:Quizás querrías hacer algo más grande el código QR con la dirección BTC, dado que éste figura demasiado pequeño para poder leerlo, al menos esa es mi experiencia al intentarlo.En disputa con lo anterior, una duda que me surge, y siendo un asunto lateral al hilo, es si los códigos QR y direcciones BTC se pueden poner así en el foro. A mí me parece natural que las creaciones puedan llevarlo, y de hecho, es lo que hemos visto en imágenes de obras creadas a nivel de calle y subidas al foro. La duda radica en si alguien la consideraría contraria a la regla que no permite solicitar BTC en el foro. Que conste que yo no considero que lo sea, y desde luego tengo clarísimo que no es tu intención. Lo digo pensando en lo que otros podrían llegar a considerar, sobre todo por el Norte.Si, la verdad es que ya tengo un tiempo, pero eso no quita que aún sienta que tengo mucho que aprender. De todas formas, creo que la belleza de la creación de una imagen desde la consciencia de un ser humano puede transcender el nivel artístico de esta. Claro que eso no impide el que yo intente mejorar aún más, para satisfacción propia.En cuanto al QR, la verdad es que se me hizo adecuado el firmar de forma criptográfica del lado BTC y de forma tradicional en el lado FIAT del dibujo.Igual, tiene sentido lo que dices, así que he removido la dirección y dejado intacta la firma. Supongo que eso es más que suficiente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 12, 2023, 08:59:33 PM",
      "body": "Me gustó la obra de arte colega, con gusto la tendría colgada en mi muro. Pero algo que noté es que la frase está en ingles, sería bueno tener una versión en español de la frase. Personalmente esa es una de mis frases favoritas de satoshi, hay mucha verdad en su ficción.¿Tienes alguna galería virtual, o planes de hacer NFTs con tus obras?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 13, 2023, 12:32:44 AM",
      "body": "Quote from: seoincorporation on January 12, 2023, 08:59:33 PM-snip-Gracias por tus comentarios.  Estuve debatiéndome si utilizar el texto original o la traducción en inglés, al final me decanté por la versión original. Aunque entiendo la gracia de que esta es la sección Española del foro. Así que cuando pueda editaré el OP con una versión traducida. No tengo planes de tokenizar mis obras y tengo espacios en otros lugares de internet en donde pongo mis trabajos, pero son off-topic con el tema de Bitcoin.Pensaba en convertir este hilo en algo así como el lugar en donde colgar mi contribuciones específicamente sobre esta temática.Ya estoy pensando cual será mi siguiente contribución. Quien sabe, si las cosas salen bien podría hacer uno mensual, entre todo el alboroto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franckuestein",
      "created_time": "January 13, 2023, 10:34:56 PM",
      "body": "Mola!No he podido pasar por alto la curiosidad de hacer zoom en la parte inferior izquierda. Primero he pensado que era una dirección de Bitcoin pero luego al verlo más largo parece un hash de algún tipo.¿La ilustración contiene algún misterio o me estoy flipando?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 14, 2023, 12:42:50 AM",
      "body": "Quote from: franckuestein on January 13, 2023, 10:34:56 PMMola!No he podido pasar por alto la curiosidad de hacer zoom en la parte inferior izquierda. Primero he pensado que era una dirección de Bitcoin pero luego al verlo más largo parece un hash de algún tipo.¿La ilustración contiene algún misterio o me estoy flipando?No hay misterio alguno, solo se trata de una firma criptografíca utilizando una de mis direcciones de Bitcoin Stakeadas. Cómo he mencionado antes, me pareció lógico el utilizar una firma de ese tipo en la mitad crypto de la imagen y una firma común en la mitad FIAT del dibujo. Así que no mires más allá de la superficie. Me alegro que te guste mi trabajo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franckuestein",
      "created_time": "January 14, 2023, 02:38:45 AM",
      "body": "Quote from: Hispo on January 14, 2023, 12:42:50 AM-snip-Así que no mires más allá de la superficie. Me alegro que te guste mi trabajo.Supongo que será el complejo de Crypto Puzzle   Hilos míticos dónde los haya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "January 16, 2023, 04:43:21 PM",
      "body": "Pues me parece una síntesis de este:https://www.youtube.com/watch?v=nOh-7SzI6gMEn realidad no importa mucho si no vistes Matrix, pero el chiste es la capsula roja o azul (no verde). La roja te dará entender la (meta) realidad mientras la azul te mantendrá en el sueño que pensaste siempre fue toda tu vida...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ganandoonline",
      "created_time": "January 22, 2023, 09:47:18 PM",
      "body": "Quote from: Artemis3 on January 16, 2023, 04:43:21 PMPues me parece una síntesis de este:https://i.ytimg.com/vi/nOh-7SzI6gM/hqdefault.jpghttps://www.youtube.com/watch?v=nOh-7SzI6gMEn realidad no importa mucho si no vistes Matrix, pero el chiste es la capsula roja o azul (no verde). La roja te dará entender la (meta) realidad mientras la azul te mantendrá en el sueño que pensaste siempre fue toda tu vida...  Uno de los mejores videos sobre BTC que haya visto, no entiendo cómo solo tiene 1200 likes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "January 29, 2023, 03:35:28 PM",
      "body": "Quote from: ganandoonline on January 22, 2023, 09:47:18 PMQuote from: Artemis3 on January 16, 2023, 04:43:21 PM<...>  Uno de los mejores videos sobre BTC que haya visto, no entiendo cómo solo tiene 1200 likes.Hay varios parecidos y este me suena haberlo visto unos años atrás, pero sí que es cierto que es bastante bueno. De hecho, la película de Matrix, aunque hablara de todo el tema de las máquinas, es al sistema a lo que se refería de trasfondo. Lo único que han hecho es \"traducir\" el clip a la vida real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}