{
  "id": "topic_5406276",
  "title": "PawGo",
  "author": "PawGo",
  "created_time": "July 14, 2022, 02:31:24 PM",
  "content": "New Jersey-based Celsius froze withdrawals last month, citing 'extreme' market conditions, cutting off access to savings for individual investors and sending tremors through the crypto market.In a court filing at the U.S. Bankruptcy Court for Southern District of New York, Celsius estimated its assets and liabilities as between $1 billion to $10 billion, with more than 100,000 creditors. The company has $167 million in cash on hand.\"This is the right decision for our community and company\" said Celsius co-founder and Chief Executive Alex Mashinsky.Another U.S. crypto lender, Voyager Digital Ltd, filed for bankruptcy this month after suspending withdrawals and deposits. Singapore's Vauld, a smaller lender, also froze withdrawals this month.more",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406276",
  "comments": [
    {
      "author": "jackg",
      "created_time": "July 14, 2022, 02:45:48 PM",
      "body": "I'm still trying to work out if this was timed to get out of the market, badly managed or poorly diversified (it could be all 3).I don't think anyone would suspect bitcoin and the cryptospace not to crash - luna was an unfortunate investment but if that was a lot of their portfolio they should probably take the people that leant it to court over fraud (it wasn't much that caused the price crash).Also does the article mean:$1bn in assets$10bn in liabilities$167m in cashI think I've understood it that way but not too sure as the article isn't very specific (if it means they only have $200million in assets then I think that's a much bigger problem for them and they must've been leveraging with that or something to manage to do that badly).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 14, 2022, 04:23:45 PM",
      "body": "They filed bankruptcy for Chapter 11.Celcius since their crisis beginning then collapse and bankruptcy did not provide transparent and public information for their investors. It affects investor soul and get rid of chance to be supported by other crypto whales or big companies.The bankruptcy is unavoidable but it does not end the crisis. Lot of things to compensate for users and how to execute it.I believe that with lot of uncertainty in politics, economy around the world, there will be more bad months for crypto market. We might see more crypto projects, venture capitals be bankrupted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 14, 2022, 04:39:41 PM",
      "body": "To be honest, this was incoming. They were just wasting time and trying to launder whatever money they had through tornado etc.I mean they are still in profit just like how LUNA owners already smuggled millions before the crash of the shitcoin.So, they are never at loss. They are just at a loss for a brand name. They are just pieces of shit people who will run with a different brand in the next bull run, nothing else.Never stake your BTC. Satoshi never invented Staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 14, 2022, 04:52:25 PMLast edit: July 14, 2022, 05:03:03 PM by franky1",
      "body": "Quote from: jackg on July 14, 2022, 02:45:48 PMAlso does the article mean:$1bn in assets$10bn in liabilities$167m in cashI think I've understood it that way but not too sure as the article isn't very specific (if it means they only have $200million in assets then I think that's a much bigger problem for them and they must've been leveraging with that or something to manage to do that badly). what companies do is they \"paper loan\" (no actual money switches hands) to a dying company EG say $2billion (on paper not real cash transfer)and they physically pay X% instead as a 'consultation fee' to the dying company executives. where by the dying company executives hand over a few billion of assets to the loan company in a different 'gift' /partnership handover.this is done so that the loan company is not seen as making profit from the hand over. is not actually losing real large cash in any real debt. but gets to play a loss for tax purposes and has the debt wrote off in the bankruptcy. celcius had more then $1bill in assets and $167m in cash. but the liabilities on paper appears as $10b but in actual fact are lower in real cash debt terms.... but thats how business is done. everyone gets rich during a liquidation. apart from the customers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "July 14, 2022, 06:13:44 PM",
      "body": "Another bear market & another chain of seemingly well run crypto companies gets liquidated. That's the problem with these centralised shitcoin casinos, they can’t be trusted. Starting all the way back with Gox & it’s still happening now. Get your money off these type of platforms of you will get rugged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 14, 2022, 07:37:51 PM",
      "body": "Quote from: DeathAngel on July 14, 2022, 06:13:44 PMAnother bear market & another chain of seemingly well run crypto companies gets liquidated. That's the problem with these centralised shitcoin casinos, they can’t be trusted. Starting all the way back with Gox & it’s still happening now. Get your money off these type of platforms of you will get rugged.well run is highly subjective here. I mean, there's questionable ethics on how they managed their business, and quite frankly the business model they had, basically guaranteed success. As long as they were driving users to their platform, they were making money. Honestly, I just want to see these sort of business practices be done with. I hate how you can just plainly get away with moving around funds, and then declaring bankruptcy. There needs to be more investigations, and more of holding the people responsible for their actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 14, 2022, 07:51:33 PM",
      "body": "How many more examples do we need to understand the problem of centralisation, custodial services, etc? It's hard to me to understand how people keep falling for these schemes over and over again, after so many examples we've been seing. And it's not only in crypto. Banking system is thhe same crap. We keep being bombarded wit corruption and bankrupcy examples.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "July 14, 2022, 08:47:30 PM",
      "body": "Quote from: DeathAngel on July 14, 2022, 06:13:44 PMAnother bear market & another chain of seemingly well run crypto companies gets liquidated. That's the problem with these centralised shitcoin casinos, they can’t be trusted. Starting all the way back with Gox & it’s still happening now. Get your money off these type of platforms of you will get rugged.Well run is a kinda overstatement.  If the company is well run, it could have managed the risk and is not filing bankruptcy now.Quote from: franky1 on July 14, 2022, 04:52:25 PMwhat companies do is they \"paper loan\" (no actual money switches hands) to a dying company EG say $2billion (on paper not real cash transfer)and they physically pay X% instead as a 'consultation fee' to the dying company executives. where by the dying company executives hand over a few billion of assets to the loan company in a different 'gift' /partnership handover.this is done so that the loan company is not seen as making profit from the hand over. is not actually losing real large cash in any real debt. but gets to play a loss for tax purposes and has the debt wrote off in the bankruptcy. celcius had more then $1bill in assets and $167m in cash. but the liabilities on paper appears as $10b but in actual fact are lower in real cash debt terms.... but thats how business is done. everyone gets rich during a liquidation. apart from the customersClients can file a lawsuit against the company if this is the case.  If this is what really happens then the company is scamming the unwary investors and if justified as true then the people behind Celcius should be put behind bars due to fraudulent activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "July 14, 2022, 10:00:38 PM",
      "body": "Quote from: PawGo on July 14, 2022, 02:31:24 PMAnother U.S. crypto lender, Voyager Digital Ltd, filed for bankruptcy this month after suspending withdrawals and deposits. Singapore's Vauld, a smaller lender, also froze withdrawals this month.All these sort of development sends panic to people who do not know how to stay calm and make a good decision. Panicking can cost a lot, including making rash decisions that we most likely regret in the future.Quote from: hd49728 on July 14, 2022, 04:23:45 PMCelcius since their crisis beginning then collapse and bankruptcy did not provide transparent and public information for their investors. It affects investor soul and get rid of chance to be supported by other crypto whales or big companies.Lack of transparency especially to investors will not make them stay, if this is true, it means they caused their own issues with lack of transparency, people seldom do business with persons they cannot trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "July 14, 2022, 10:35:27 PM",
      "body": "Quote from: Queentoshi on July 14, 2022, 10:00:38 PMQuote from: PawGo on July 14, 2022, 02:31:24 PMAnother U.S. crypto lender, Voyager Digital Ltd, filed for bankruptcy this month after suspending withdrawals and deposits. Singapore's Vauld, a smaller lender, also froze withdrawals this month.All these sort of development sends panic to people who do not know how to stay calm and make a good decision. Panicking can cost a lot, including making rash decisions that we most likely regret in the future.Quote from: hd49728 on July 14, 2022, 04:23:45 PMCelcius since their crisis beginning then collapse and bankruptcy did not provide transparent and public information for their investors. It affects investor soul and get rid of chance to be supported by other crypto whales or big companies.Lack of transparency especially to investors will not make them stay, if this is true, it means they caused their own issues with lack of transparency, people seldom do business with persons they cannot trust. During this crisis, I believe most of these crypto companies won't disclose the real deal with their business.They may give a glimpse on what's happening but high likely that they won't give all the details.Because for sure, this will cause panic to their stakeholders and they will start withdrawing their funds.This is why most of the time, holders are already too late to withdraw because the company will just disclose the situation once their frozen their accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 14, 2022, 11:11:18 PM",
      "body": "Quote from: darkv0rt3x on July 14, 2022, 07:51:33 PMHow many more examples do we need to understand the problem of centralisation, custodial services, etc? It's hard to me to understand how people keep falling for these schemes over and over again, after so many examples we've been seing. And it's not only in crypto. Banking system is thhe same crap. We keep being bombarded wit corruption and bankrupcy examples. Maybe the hype of getting some decent percentage from their assets got them pretty good that's why they quickly jump whenever something like this is offered to them without realizing how much will cost them if something goes wrong as we've seen right now. As they said, this scenario is just merely drama and the truth behind this is yet to uncover, who knows maybe they already managed to keep some pretty amount of cash and secured it before they filed bankruptcy. we cannot truly understand how this works until they give us straightforward and transparent about their reasons for bankruptcy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 15, 2022, 12:13:36 AMLast edit: July 15, 2022, 02:24:46 AM by Zlantann",
      "body": "Another grand display of financial imprudence and recklessness. Celsius attracted many customers through mouth watery interest rates and easy access to most times un-collaterized loans. Sometimes the operations of most of these crypto lending companies is similar to ponzi operations. They seems not to put into consideration the risk and volatility of the crypto space while offering there services. They feel that because of the recent favorable bullish trend of the crypto market, they are free to be careless. But without a strong risk management systems and sound financial management practices we might see more lending companies file for bankruptcy. Filling for bankruptcy is not the end of the road for Celsius, they can still put their house in order and bounce back gallantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "July 15, 2022, 07:30:41 AM",
      "body": "Quote from: Zlantann on July 15, 2022, 12:13:36 AMAnother grand display of financial imprudence and recklessness. Celsius attracted many customers through mouth watery interest rates and easy access to most times un-collaterized loans. Sometimes the operations of most of these crypto lending companies is similar to ponzi operations. They seems not to put into consideration the risk and volatility of the crypto space while offering there services. They feel that because of the recent favorable bullish trend of the crypto market, they are free to be careless. But without a strong risk management systems and sound financial management practices we might see more lending companies file for bankruptcy. Filling for bankruptcy is not the end of the road for Celsius, they can still put their house in order and bounce back gallantly.      Of course we may blame Celsius for their business model, but it would not work if people would not be attracted and \"blinded\" by twitter/youtube influencers, who create big hype, FOMO and \"you cannot lose with crypto, look at my car\" environment.I only wonder if people who decide to use all that financial instruments provided by that \"innovative startup\" companies/exchanges, if they really understand what they do. And if they would decide to do the same on \"real\" market, on nasdaq etc., with \"real\" shares etc.I completely do not understand that financial market, I have no idea which kung-fu is used there - but I see that all the time the same happens - one more shitcoin created by \"innovative company\" which promises revolution and global change, then all collapse. But before it collapse, it must get all the $ from \"regular people\", who will use companies like Celsius to have even bigger gains - purely on the paper and only until all collapse.Yes, it looked a little like a Ponzi, now the main question is if they have enough money to hire good lawyers, they need it if they want to start another \"innovative decentralized blockchain\" company in the next 2 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 16, 2022, 03:02:18 AM",
      "body": "Quote from: PawGo on July 15, 2022, 07:30:41 AMQuote from: Zlantann on July 15, 2022, 12:13:36 AMAnother grand display of financial imprudence and recklessness. Celsius attracted many customers through mouth watery interest rates and easy access to most times un-collaterized loans. Sometimes the operations of most of these crypto lending companies is similar to ponzi operations. They seems not to put into consideration the risk and volatility of the crypto space while offering there services. They feel that because of the recent favorable bullish trend of the crypto market, they are free to be careless. But without a strong risk management systems and sound financial management practices we might see more lending companies file for bankruptcy. Filling for bankruptcy is not the end of the road for Celsius, they can still put their house in order and bounce back gallantly.      Of course we may blame Celsius for their business model, but it would not work if people would not be attracted and \"blinded\" by twitter/youtube influencers, who create big hype, FOMO and \"you cannot lose with crypto, look at my car\" environment.I only wonder if people who decide to use all that financial instruments provided by that \"innovative startup\" companies/exchanges, if they really understand what they do. And if they would decide to do the same on \"real\" market, on nasdaq etc., with \"real\" shares etc.I completely do not understand that financial market, I have no idea which kung-fu is used there - but I see that all the time the same happens - one more shitcoin created by \"innovative company\" which promises revolution and global change, then all collapse. But before it collapse, it must get all the $ from \"regular people\", who will use companies like Celsius to have even bigger gains - purely on the paper and only until all collapse.Yes, it looked a little like a Ponzi, now the main question is if they have enough money to hire good lawyers, they need it if they want to start another \"innovative decentralized blockchain\" company in the next 2 years.And this is exactly where I really want tighter crypto regulations. I really don't like that crypto remains to be the wild wild west. Many are demanding that the crypto market be kept completely free. I don't think it is worth it. Because this setup simply means a few schemers and scammers will prey on a larger body of credulous and uninformed individuals. While there is indeed a need to educate people and raise their awareness, this is no reason to let these innovative companies freely roam around looking for victims. And then they will do a scam exit, a rug pull, declare bankruptcy, and so on only to build another one right after.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 16, 2022, 03:11:51 AM",
      "body": "Quote from: ImThour on July 14, 2022, 04:39:41 PMTo be honest, this was incoming. They were just wasting time and trying to launder whatever money they had through tornado etc.I mean they are still in profit just like how LUNA owners already smuggled millions before the crash of the shitcoin.So, they are never at loss. They are just at a loss for a brand name. They are just pieces of shit people who will run with a different brand in the next bull run, nothing else.Never stake your BTC. Satoshi never invented Staking. Sounds like Do Kwon is smarter than the other teams ad he even have something to continue like the LUNC. Geeez. Quote from: Darker45 on July 16, 2022, 03:02:18 AMQuote from: PawGo on July 15, 2022, 07:30:41 AMQuote from: Zlantann on July 15, 2022, 12:13:36 AMAnother grand display of financial imprudence and recklessness. Celsius attracted many customers through mouth watery interest rates and easy access to most times un-collaterized loans. Sometimes the operations of most of these crypto lending companies is similar to ponzi operations. They seems not to put into consideration the risk and volatility of the crypto space while offering there services. They feel that because of the recent favorable bullish trend of the crypto market, they are free to be careless. But without a strong risk management systems and sound financial management practices we might see more lending companies file for bankruptcy. Filling for bankruptcy is not the end of the road for Celsius, they can still put their house in order and bounce back gallantly.      Of course we may blame Celsius for their business model, but it would not work if people would not be attracted and \"blinded\" by twitter/youtube influencers, who create big hype, FOMO and \"you cannot lose with crypto, look at my car\" environment.I only wonder if people who decide to use all that financial instruments provided by that \"innovative startup\" companies/exchanges, if they really understand what they do. And if they would decide to do the same on \"real\" market, on nasdaq etc., with \"real\" shares etc.I completely do not understand that financial market, I have no idea which kung-fu is used there - but I see that all the time the same happens - one more shitcoin created by \"innovative company\" which promises revolution and global change, then all collapse. But before it collapse, it must get all the $ from \"regular people\", who will use companies like Celsius to have even bigger gains - purely on the paper and only until all collapse.Yes, it looked a little like a Ponzi, now the main question is if they have enough money to hire good lawyers, they need it if they want to start another \"innovative decentralized blockchain\" company in the next 2 years.And this is exactly where I really want tighter crypto regulations. I really don't like that crypto remains to be the wild wild west. Many are demanding that the crypto market be kept completely free. I don't think it is worth it. Because this setup simply means a few schemers and scammers will prey on a larger body of credulous and uninformed individuals. While there is indeed a need to educate people and raise their awareness, this is no reason to let these innovative companies freely roam around looking for victims. And then they will do a scam exit, a rug pull, declare bankruptcy, and so on only to build another one right after.  If ts going to be regulated, it will really be tight that opensource wallet may require KYC and miners may even be regulated which government will give licences to qualified miners. So I would rather want the crypto to be what it is right now than having a regulation actually.Those scams and companies with bad protocols like Celcius, Voyager and etc come and go like the rest of the ICO projects before. Something will come up soon and all the investors I think has to do is take advantage of the opportunity and get out before the bears dominate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 17, 2022, 02:55:16 AM",
      "body": "Quote from: bittraffic on July 16, 2022, 03:11:51 AMQuote from: Darker45 on July 16, 2022, 03:02:18 AMQuote from: PawGo on July 15, 2022, 07:30:41 AMQuote from: Zlantann on July 15, 2022, 12:13:36 AM~snip~   ~snip~And this is exactly where I really want tighter crypto regulations. I really don't like that crypto remains to be the wild wild west. Many are demanding that the crypto market be kept completely free. I don't think it is worth it. Because this setup simply means a few schemers and scammers will prey on a larger body of credulous and uninformed individuals. While there is indeed a need to educate people and raise their awareness, this is no reason to let these innovative companies freely roam around looking for victims. And then they will do a scam exit, a rug pull, declare bankruptcy, and so on only to build another one right after.  If ts going to be regulated, it will really be tight that opensource wallet may require KYC and miners may even be regulated which government will give licences to qualified miners. So I would rather want the crypto to be what it is right now than having a regulation actually.Those scams and companies with bad protocols like Celcius, Voyager and etc come and go like the rest of the ICO projects before. Something will come up soon and all the investors I think has to do is take advantage of the opportunity and get out before the bears dominate. Regulations shouldn't be immediately equated with bad or unfair regulations. Bad or unfair regulations are the ones that should be called out for amendment or outright removal. But there have to be good regulations as well, those that are founded on proper research and understanding of the technology and what it tries to achieve.   Surely, the indiscriminate proliferation of crypto projects out of which majority are fraud or scam must need a certain amount of regulation. DeFi projects which are anything but decentralized must need some regulations. Staking or lending platforms which are offering ridiculous and unsustainable APYs must need some regulations. Poor tokenomics is rampant among altcoin projects and yet they're sprouting everywhere. One dies, another comes out. A coin is minted out of nothing, hyped, money is made out of thin air and cashed out by founder, coin crashed, version 2.0 is issued, money is again made, and so on. Surely, there must be something wrong with this and regulations are needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "July 17, 2022, 09:14:15 AM",
      "body": "Quote from: Zlantann on July 15, 2022, 12:13:36 AMAnother grand display of financial imprudence and recklessness. Celsius attracted many customers through mouth watery interest rates and easy access to most times un-collaterized loans. Sometimes the operations of most of these crypto lending companies is similar to ponzi operations. They seems not to put into consideration the risk and volatility of the crypto space while offering there services. They feel that because of the recent favorable bullish trend of the crypto market, they are free to be careless. But without a strong risk management systems and sound financial management practices we might see more lending companies file for bankruptcy. Filling for bankruptcy is not the end of the road for Celsius, they can still put their house in order and bounce back gallantly. Ah so it was their fault on why they got bankrupt and not really the bear market but why do you think they are like a ponzi? It is because they can lend more money the more people joined their company? But, I think that was normal for every lending business. It only shows that they are growing.Before they start a business like this, I think they also figured out that cryptocurrencies are kinda unstable but they still insist to continue. That only shows that they are willing to take risk and can accept whatever outcome they might get. For those who are wise enough, they will use a stable coin instead of volatile cryptos to prevent losing huge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 17, 2022, 09:51:03 PM",
      "body": "Quote from: franky1 on July 14, 2022, 04:52:25 PMwhat companies do is they \"paper loan\" (no actual money switches hands) to a dying company EG say $2billion (on paper not real cash transfer)<>If a company were to do this immediately before filing for bankruptcy, they would be forced to reverse this transaction by the bankruptcy court. Quote from: Zlantann on July 15, 2022, 12:13:36 AMAnother grand display of financial imprudence and recklessness. Celsius attracted many customers through mouth watery interest rates and easy access to most times un-collaterized loans. Sometimes the operations of most of these crypto lending companies is similar to ponzi operations. They seems not to put into consideration the risk and volatility of the crypto space while offering there services. They feel that because of the recent favorable bullish trend of the crypto market, they are free to be careless. But without a strong risk management systems and sound financial management practices we might see more lending companies file for bankruptcy. Filling for bankruptcy is not the end of the road for Celsius, they can still put their house in order and bounce back gallantly.      While I do agree that Celsius acted recklessly in making loans, I don't think they were a ponzi scheme. Celsius was essentially a bank, however, it does not appear they were very good at managing credit risk. Celsius would take deposits from their customers, and pay a lower interest rate than they expected to receive from loans made to borrowers using the money deposited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}