{
  "id": "topic_5410845",
  "title": "Gerceklerisoyleyen",
  "author": "Gerceklerisoyleyen",
  "created_time": "August 22, 2022, 07:06:38 PM",
  "content": "Arkadaşlar kafam karısık yatırım için hisse seneti alacaktım kendini kanıtlamıs firmalardan örnek türk hava yolları şişecam sasa vs gibi lakin şöyle birşey okudum.Enflasyon yükselince Borsa ne olur?Aynı şekilde enflasyondaki artış tüketim harcamala- rını arttıracak, dolayısıyla tasarruflarda ve yatırımlar- da bir düşüşe yol açacaktır. Bu durum hisse senedi ve diğer finansal varlıklara olan talebi azaltarak hisse fiyatlarında düşüşe neden olacaktır.Kimileride tam tersi enflasyon olan yerde hisse senedi alınır diyorlar hangisi doğru sizce ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410845",
  "comments": [
    {
      "author": "Red Pie",
      "created_time": "August 22, 2022, 08:36:49 PM",
      "body": "Eğer sizin hedefiniz bakmadan 10-15 yıl yatırım yapmaksa hisse senedi alınır. ama kısa vadede bir kazanç beklentisi içerisindeyseniz borsaya bulaşmayın derim. alacağınız hisse senedinin TL karşılığı dolar fiyatını baz alın, kâr/zarar ilişkisini böyle tayin edin. mesela x hissesi aldınız şu an 18 lira yani yaklaşık 1 dolar. dolar 25 lira olduğunda bu hisse 20 liraya çıksa bile siz kâr etmiyorsunuz, zarar ediyorsunuz. ama uzun vadede temettüler, bedelli bedelsiz bölünmeler ile daha kârlı çıkarsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "August 22, 2022, 09:57:43 PM",
      "body": "Quote from: Red Pie on August 22, 2022, 08:36:49 PMEğer sizin hedefiniz bakmadan 10-15 yıl yatırım yapmaksa hisse senedi alınır. ama kısa vadede bir kazanç beklentisi içerisindeyseniz borsaya bulaşmayın derim. alacağınız hisse senedinin TL karşılığı dolar fiyatını baz alın, kâr/zarar ilişkisini böyle tayin edin. mesela x hissesi aldınız şu an 18 lira yani yaklaşık 1 dolar. dolar 25 lira olduğunda bu hisse 20 liraya çıksa bile siz kâr etmiyorsunuz, zarar ediyorsunuz. ama uzun vadede temettüler, bedelli bedelsiz bölünmeler ile daha kârlı çıkarsınız. Teşekkürler mesajın için ben uzun vadeciyim lakin 1-2 yıl elimde tutmayı düşünüyordum 15 yıl benim için çok uzun bir süre belki ucan araba üretirler o zamana kadar. Youtubeden sabah arastıracagım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "August 23, 2022, 12:27:17 AM",
      "body": "Düşen uçakta zıplayarak hayatta kalamazsınız. Enflasyonu körükleyen bir kaç sebep var. Aşırı para basılması, paranın karşılığı olan varlıkların ülkeyi terk etmesi yada yok edilmesi, bağımsızlığını yitirerek siyasi partilerin oyuncağı olmuş merkez bankaları. Elbette başka sebepler de var ama başlıca sebepler bunlar. Kötüye gidişin sebepleri değişmediği yada değişme eğilimi göstermediği sürece Türkiye sınırları içerisindeki hiç bir şeye yatırım yapmayı düşünmüyorum. Aynı sebepler yüzünden Türkiye yabancı yatırımcı da gelmiyor. Para güven ortamını sever. Kripto varlıklara uyarlamak gerekirse %1000 getiri oranı vaat eden bir sürü platform var. Çoğu insan güvensiz bulduğu için para yatırmayı tercih etmez. Sadece istisnai olarak hammadde ihtiyacını Türk Lirası ile elde edip ihracat yapan şirketler (döviz bazlı kazanım) tercih edilebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "August 23, 2022, 06:15:01 AM",
      "body": "Enflasyon olan yerde Türk Lirası ile hisse senedi alırsanız enflasyondan daha az bir artış gerçekleşmesi durumunda yine zarar etmiş olacaksınız. Günlük haftalık al-sat dışında kısa ve orta vadeli hisse işine girmem. Sürekli artan döviz kuru karşında Türk Lirası günden güne eriyor. Geçen sene x hissesini 8 liradan almış olsaydınız ve bu gün o hisse 18 lira olmuş olsa bile zararda olacaktınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 23, 2022, 06:40:33 PM",
      "body": "Bir çok arkadaş güzel ve oldukça bilgilendirici bir şekilde yazmış ama bende yazayım. Paranızı yatıracağınız hisse senedi dolar kurundan veya TÜİK'in verdiği değil gerçek enflasyonun altında kar ederse zarar etmiş olacaksınız. O yüzden seçtiğiniz hisse senedinin döviz artışı kadar veya enflasyon artışı kadar artması lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "August 23, 2022, 07:32:49 PM",
      "body": "Quote from: Gencecikmen on August 23, 2022, 06:40:33 PMBir çok arkadaş güzel ve oldukça bilgilendirici bir şekilde yazmış ama bende yazayım. Paranızı yatıracağınız hisse senedi dolar kurundan veya TÜİK'in verdiği değil gerçek enflasyonun altında kar ederse zarar etmiş olacaksınız. O yüzden seçtiğiniz hisse senedinin döviz artışı kadar veya enflasyon artışı kadar artması lazım. Peki arkadaşlar nereye yatırım yapacagız. Hissedilen enslafyon son 1 yılda %200 leri aştı deniliyor peki paramız dolarda bile kalsa suan 18 tl diyelim %200 artısı 36 tl olması lazım eger 2023 de dolar 30 tl olmus olsa o zaman paramız dolarda durdugu için bile kaybetmiş olacaz ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "August 23, 2022, 07:37:32 PM",
      "body": "Quote from: Gerceklerisoyleyen on August 23, 2022, 07:32:49 PMQuote from: Gencecikmen on August 23, 2022, 06:40:33 PMBir çok arkadaş güzel ve oldukça bilgilendirici bir şekilde yazmış ama bende yazayım. Paranızı yatıracağınız hisse senedi dolar kurundan veya TÜİK'in verdiği değil gerçek enflasyonun altında kar ederse zarar etmiş olacaksınız. O yüzden seçtiğiniz hisse senedinin döviz artışı kadar veya enflasyon artışı kadar artması lazım. Peki arkadaşlar nereye yatırım yapacagız. Hissedilen enslafyon son 1 yılda %200 leri aştı deniliyor peki paramız dolarda bile kalsa suan 18 tl diyelim %200 artısı 36 tl olması lazım eger 2023 de dolar 30 tl olmus olsa o zaman paramız dolarda durdugu için bile kaybetmiş olacaz ? İşte sorun aslında orada işlemler “hissedilen” enflasyona göre değil, TÜİK’in açıkladığı verilere göre işliyor oda en son yüzde 76 falandı herhalde. Türkiye’de paranın korunmasının en basit yolu tlde durma. döviz al, dolar al, altın al ama paranı çevir mutlaka. enflasyona göre artan bir şey bulamazsın sen ancak yatırımını bu şekilde yapmak zorundasın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "August 23, 2022, 08:00:26 PM",
      "body": "Bence enflasyon olan yerde o ülkenin hisse senetleri alınmaz. büyük risktir mesela almak bu riski alırım diyorsanız siz bilirsiniz tabi. çünkü aldığınız hisse lotun değeri yükselirken enflasyonda yükselirse bir anlamı kalmıyor, kar ettim diyemiyorsunuz,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "August 23, 2022, 08:27:08 PM",
      "body": "Uzun vaadeli düşünüyorsan alınabilir diye düşünüyorum ama kısa vade için almanın mantıklı olmadığını düşünüyorum. Birincisi aldığın seneti tl bazlı alacağından dolar bazında paran erimiş olacak. Şuanki durum bunu gösteriyor. İkincisi ülkenin durumu ortada tam bir güvensizlik söz konusu, ekonomi berbat bunlarada dikkat etmek lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "August 23, 2022, 10:39:26 PM",
      "body": "Türk şirketlerinin son yıllardaki değerleri dolar bazında inanılmaz derecede düştüğü için bazı senetler değerlendirilebilir diye düşünüyorum ama aynı zamanda bu düşüşün devam edeceğini bundan dolayı dolar bazında bu şirketlerin daha da değer kaybedeceğini düşününce vazgeçiyorum.Kısacası ekonomi yönetimi bir sorun olduğunu kabul edip buna göre bir takım önlemler almaya başlarsa evet hisse senetleri almak mantıklı olabilir ama şuan bizim ülkemizde saydığım bu kriterlerin hiçbiri geçerli değil maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 24, 2022, 01:49:56 PM",
      "body": "Quote from: Gerceklerisoyleyen on August 23, 2022, 07:32:49 PMQuote from: Gencecikmen on August 23, 2022, 06:40:33 PMBir çok arkadaş güzel ve oldukça bilgilendirici bir şekilde yazmış ama bende yazayım. Paranızı yatıracağınız hisse senedi dolar kurundan veya TÜİK'in verdiği değil gerçek enflasyonun altında kar ederse zarar etmiş olacaksınız. O yüzden seçtiğiniz hisse senedinin döviz artışı kadar veya enflasyon artışı kadar artması lazım. Peki arkadaşlar nereye yatırım yapacagız. Hissedilen enslafyon son 1 yılda %200 leri aştı deniliyor peki paramız dolarda bile kalsa suan 18 tl diyelim %200 artısı 36 tl olması lazım eger 2023 de dolar 30 tl olmus olsa o zaman paramız dolarda durdugu için bile kaybetmiş olacaz ? Sorduğunuz soruya doğru cevap verecek kişi, zaten bu yatırımı çoktan yapmış şimdi Miami'de zevk u sefa yapıyordur. Ama yine de bir yatırım tavsiyesi olmamakla beraber, alacağınız hisse senedini Amerikan borsasından veya Avrupa borsasından almanız olur. Hisse senedi sabit kalsa bile yatırımınız döviz olduğundan, TL'nin değer kaybetmesi sizi etkilememiş olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "August 24, 2022, 03:46:53 PM",
      "body": "Quote from: Gencecikmen on August 24, 2022, 01:49:56 PMQuote from: Gerceklerisoyleyen on August 23, 2022, 07:32:49 PMQuote from: Gencecikmen on August 23, 2022, 06:40:33 PMBir çok arkadaş güzel ve oldukça bilgilendirici bir şekilde yazmış ama bende yazayım. Paranızı yatıracağınız hisse senedi dolar kurundan veya TÜİK'in verdiği değil gerçek enflasyonun altında kar ederse zarar etmiş olacaksınız. O yüzden seçtiğiniz hisse senedinin döviz artışı kadar veya enflasyon artışı kadar artması lazım. Peki arkadaşlar nereye yatırım yapacagız. Hissedilen enslafyon son 1 yılda %200 leri aştı deniliyor peki paramız dolarda bile kalsa suan 18 tl diyelim %200 artısı 36 tl olması lazım eger 2023 de dolar 30 tl olmus olsa o zaman paramız dolarda durdugu için bile kaybetmiş olacaz ? Sorduğunuz soruya doğru cevap verecek kişi, zaten bu yatırımı çoktan yapmış şimdi Miami'de zevk u sefa yapıyordur. Ama yine de bir yatırım tavsiyesi olmamakla beraber, alacağınız hisse senedini Amerikan borsasından veya Avrupa borsasından almanız olur. Hisse senedi sabit kalsa bile yatırımınız döviz olduğundan, TL'nin değer kaybetmesi sizi etkilememiş olur.Türkiye içinde yabancı hisse alabiliyormuyuz ? sanırım alamıyoruz o ülkenin vatandası olmak lazım ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "August 24, 2022, 08:43:06 PM",
      "body": "Quote from: Gerceklerisoyleyen on August 24, 2022, 03:46:53 PMQuote from: Gencecikmen on August 24, 2022, 01:49:56 PMQuote from: Gerceklerisoyleyen on August 23, 2022, 07:32:49 PMQuote from: Gencecikmen on August 23, 2022, 06:40:33 PMBir çok arkadaş güzel ve oldukça bilgilendirici bir şekilde yazmış ama bende yazayım. Paranızı yatıracağınız hisse senedi dolar kurundan veya TÜİK'in verdiği değil gerçek enflasyonun altında kar ederse zarar etmiş olacaksınız. O yüzden seçtiğiniz hisse senedinin döviz artışı kadar veya enflasyon artışı kadar artması lazım. Peki arkadaşlar nereye yatırım yapacagız. Hissedilen enslafyon son 1 yılda %200 leri aştı deniliyor peki paramız dolarda bile kalsa suan 18 tl diyelim %200 artısı 36 tl olması lazım eger 2023 de dolar 30 tl olmus olsa o zaman paramız dolarda durdugu için bile kaybetmiş olacaz ? Sorduğunuz soruya doğru cevap verecek kişi, zaten bu yatırımı çoktan yapmış şimdi Miami'de zevk u sefa yapıyordur. Ama yine de bir yatırım tavsiyesi olmamakla beraber, alacağınız hisse senedini Amerikan borsasından veya Avrupa borsasından almanız olur. Hisse senedi sabit kalsa bile yatırımınız döviz olduğundan, TL'nin değer kaybetmesi sizi etkilememiş olur.Türkiye içinde yabancı hisse alabiliyormuyuz ? sanırım alamıyoruz o ülkenin vatandası olmak lazım ?Bazı ortak fonlar var. Yabancı şirketlere sizin adınıza yatırım yapan şirketler. Bu şirketler aracılığıyla istediğiniz yabancı yatırım senedi temin edebilirsiniz. Yada bir ara kriptoda da büyük firmaların hisse senetlerine stabil kripto cinsinden tokenler yaratılmıştı diye hatırlıyorum. O sistem devam ediyorsa ona bakabilirsiniz hocam. Rahat alır rahat satarsınız özel bir şartı yoksa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "August 25, 2022, 05:29:57 AM",
      "body": "Enflasyon hisse senetlerini normalde kötü etkiler ama bizim ülkemizde asimetrik bir durum mevcut, şirketlerin enflasyona göre çok düşük faizli kredilere erişmeleri mümkün bu da karlılıklarını oldukça yukarı çekiyor. Ayrıca dolar/lira çifti sürekli dolar lehine yukarı yönlü hareket ediyor. Bu açıdan en azından seçime kadar ihracat yapan firmalara yatırım yapmakta fayda olabilir. Seçim sonrası belirsiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "August 28, 2022, 10:06:27 AM",
      "body": "Hisse senetlerinin dolar cinsinden değerleri ucuz. Bu mantıkla yatırım yapılabilir ancak yaptığınız yatırımın uzun vadeli olacağını unutmamalısınız. Kısa vadede enflasyonun yüksek olduğu bir ortamda hissenin değerinin enflasyon değerinin üzerinde artmış olması gerekir ki yaptığınız yatırım bir işe yarasın. Ama neredeyse %80 enflasyon bir ortamda hissenin değeri 2x yapacak ki sizin yatırımınız kazanç sağlasın. Bunun da pek mümkün olmadığını düşünüyorum. Çünkü o şirketlerin varlıkları da TL üzerinden, yaptıkları ticarette TL üzerinden gerçekleşiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 28, 2022, 10:32:12 AM",
      "body": "Dolar karşılığında hisseler ucuz olmuş olsa da ekonominin ve Türk lirasının geleceği ön görüsünde çok fazla düşünmeye gerek yok nereye gideceği belli o gideceği yerden döndüğü günlerde olacak yani olmalı. Hisseleri çok uzun vade de değerlendirmek gerekiyor. Şuan çok ucuz desek bile bir kaç ay sonra belki çok daha derin düşüşler olabilir yada ufak sıçramalar olabilir bu sayede yeni yatırımcılar da giriş yapmış olacaktır her zaman ki gibi. Yatırım yapmak istediğim hisseler var fakat şuan da benim için sırası değil daha fazla bekleyeceğim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "August 28, 2022, 02:11:04 PM",
      "body": "Quote from: Pierre 2 on August 25, 2022, 05:29:57 AMEnflasyon hisse senetlerini normalde kötü etkiler ama bizim ülkemizde asimetrik bir durum mevcut, şirketlerin enflasyona göre çok düşük faizli kredilere erişmeleri mümkün bu da karlılıklarını oldukça yukarı çekiyor. Ayrıca dolar/lira çifti sürekli dolar lehine yukarı yönlü hareket ediyor. Bu açıdan en azından seçime kadar ihracat yapan firmalara yatırım yapmakta fayda olabilir. Seçim sonrası belirsiz.Size katlıyorum İhracat yapan firmalar seçilmeli kesinlikle, çoğu ihracat firması son 2-3 yıldır çok büyük gelirler ettiler, ucuz işçilik ve kaliteli ürünler için ülkemize döndü firmalar.Bu sebeple ihracat firmalarını seçmelisiniz hisse senedi alırken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}