{
  "id": "topic_5405628",
  "title": "sabine80",
  "author": "sabine80",
  "created_time": "July 08, 2022, 03:49:54 PM",
  "content": "do you know any good projects where i don't have to invest any money and can earn crypto by playing (p2e)? im looking for such crypto projects. thanks in advance for good suggestions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405628",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "July 08, 2022, 03:59:23 PM",
      "body": "What famous game now is the nino Kuni but I dont played that game but youll earn some tokens from the game which can be traded and sell for money. Im not sure how much is the profit but it seems its really free to play this game. Im suggeating this cause their developer and this game is known and famous. So likely youll dont end up posting rants on a scam free p2e. It even trending now on playstore. Just checked them out, for details. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 08, 2022, 04:12:14 PM",
      "body": "If you want to explore aside from the game given by the first reply, you can check this site : https://playtoearn.net/blockchaingames?sort=f2p&direction=ascThe list of games can be sorted according to the tabulated info.  The site also states the status of the listed games.  Why not check and explore the site, there are lots of free to play - pay to earn games listed there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "July 08, 2022, 04:15:59 PM",
      "body": "Axie infinity is the leading p2e project and opens the first trend to the p2e market but they also just announced a partial closure of the game because of the unsustainable drop in revenue. P2e is a potential field, but with recent projects that have not really brought a good experience to players, instead of focusing on building entertainment games, they focused on making money, so they quickly recession. I think this is not the time to get involved in p2e projects that just waste your time, you should learn some other ways to make money while waiting for p2e to come back stronger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 08, 2022, 04:21:37 PM",
      "body": "Goodluck playing P2E with \"free-to-play\" features. You can start at zero capital but you'll find out soon enough that most of them aren't really profitable. The game characters or NFTs you minted for free are too weak to compete against players who spent money to level up.The price of their native tokens are down so you may consider buying them now and build before they start gaining traction again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabine80",
      "created_time": "July 08, 2022, 05:50:40 PM",
      "body": "Quote from: cryptoaddictchie on July 08, 2022, 03:59:23 PM...i try the game out. thanks.Quote from: serjent05 on July 08, 2022, 04:12:14 PM...thanks! i didnt know the site. i'll deal with it and take a closer look.Quote from: fuguebtc on July 08, 2022, 04:15:59 PM...thought its a good time to start earning some coins with p2e. well, lets see. i dont want to waste my time.Quote from: Yogee on July 08, 2022, 04:21:37 PM...oh, that doesn't sound so good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "July 08, 2022, 06:11:30 PM",
      "body": "Quote from: sabine80 on July 08, 2022, 03:49:54 PMdo you know any good projects where i don't have to invest any money and can earn crypto by playing (p2e)? im looking for such crypto projects. thanks in advance for good suggestions.I don't follow the development of play2earn games that closely at the moment as the whole crypto market is down and because play2earn games where a pretty new trend within the crypto space they were dropping even more in price than other projects. I don't think that there are play2earn games out there that are really hot at the moment. I also don't think that you can earn real money with them if you are not willing to invest even a little amount of money upfront. If that would be the case then those projects would already be dead because the token would not have any value at all. I know that it would be a dream for a lot of people to make an income just by playing without having to pay anything, but that is just not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 08, 2022, 07:00:16 PM",
      "body": "A little bit late to the trend mate!P2E with NFTs item already dead, look now the current project example like \"AXIE\". The value token is growing to the earth, no chance anymore to back up again + based on google history search.NFTs search peak already slowing down, since a lot people not getting a lose on NFTs. The worst part, really hard to sell their NFTs since not enough liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SafuBTC",
      "created_time": "July 08, 2022, 07:08:25 PM",
      "body": "Axie is the best but if you are looking for a new gaming engine I believe gala games have a upper hand because it's still new and affordable, if things goes as planned Gala worth more than 5$ some day, right now price is still a steal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 08, 2022, 08:21:38 PM",
      "body": "I think the P2E era has already died out, especially those with NFTs. People just realized that this is not a sustainable model for generating value on the cryptocurrency that it is tied to, and it can easily become oversaturated with people wanting to get the rewards but not wanting to add anything to the pot. You can still try Axie Infinity for casual gaming, but that in itself is no longer worth it. For hardcore games, you can go ahead and play Mir 4 or Ni No Kuni: Crossworlds, but it takes a lot of time before you can convert your characters into NFts, and even the price of that is not worth it in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 08, 2022, 09:08:25 PM",
      "body": "Quote from: sabine80 on July 08, 2022, 03:49:54 PMdo you know any good projects where i don't have to invest any money and can earn crypto by playing (p2e)? im looking for such crypto projects. thanks in advance for good suggestions.MIR4That's the only P2E that I know that you don't have to invest in and yet, you can earn. But you know what. P2E projects are like passage that you need to pay for to have a shortcut way of earning.It's like the more favorable path if you get to play and pay at the beginning because it's like the ticket before you can enter it. I don't play that game but I've seen people that have paid inside the game for the upgrades and not just all about earning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CuriousGeorge",
      "created_time": "July 08, 2022, 10:44:17 PM",
      "body": "I think there are many NFT games which offers reward though honestly very few of them worth trying. currently majority of NFTs in axie infinity are having huge correction, I guess you could try axie infinity out since it doesn't requires as much money as it was before just to get in their NFT games.majority of the axies are already down 80% of their initial value back then so I guess considering that axie infinity has existed for long it could be a great try, though it seems their economic model isn't sustaining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 09, 2022, 04:37:58 AM",
      "body": "Quote from: SafuBTC on July 08, 2022, 07:08:25 PMAxie is the best but if you are looking for a new gaming engine I believe gala games have a upper hand because it's still new and affordable, if things goes as planned Gala worth more than 5$ some day, right now price is still a steal.Not anymore today because the market has gone through the bear market and you can barely earn there. So being someone without any investment, you only need to look for a manager that will provide your scholarship.That's actually the ideal for OP.But today? Nope. The price of it SLP token has gone down and if you're going to calculate how much you'll earn there per day, that's even less than a penny. I don't know if this origins will lift the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "July 09, 2022, 04:55:11 AM",
      "body": "Quote from: sabine80 on July 08, 2022, 03:49:54 PMdo you know any good projects where i don't have to invest any money and can earn crypto by playing (p2e)? im looking for such crypto projects. thanks in advance for good suggestions.Thetan Arena(THG) is the only P2E that I know and play so far but I don't really recommend to fully rely on it if your goal is to earn while investing your time playing because it's obvious that the earnings are just small or even on other P2E games because you are just free to play. It's a waste of time to play and think about earning but rather you should only play just to enjoy the game.P2E nowadays is not profitable at all even if you invest money in it  because the NFT value is very fast to depreciate due to saturated market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "July 09, 2022, 05:31:12 AM",
      "body": "Quote from: sabine80 on July 08, 2022, 03:49:54 PMdo you know any good projects where i don't have to invest any money and can earn crypto by playing (p2e)? im looking for such crypto projects. thanks in advance for good suggestions.If you want some games that doesn't need to invest in order to play and earn at the same time, I can suggest the following:1. Taroverse (PC, Android and iOs) - earn TARO tokens every month for playing their mini-games2. Crazy Defense Heroes (Android and iOs) - earn TOWER tokens daily for playing3. Blankos Block Party (PC) - earn NFTs for completing challenges and sell them in the Mythical marketplace4. Splinterlands (PC, Android and iOs) - earn DEC tokens by playing card game battles and be one of the top in the leaderboard every season as well as getting lucky to opening chests for additional perksHope this helps you a bit but don't make P2E as your full-time career. That hype is already over. However, this is way better than traditional games due to owning these NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 09, 2022, 05:35:50 AM",
      "body": "Almost forgot mate. If you knew Guild of Guardians nft then they will release their game on 2023. They said they are giving free natural heroes to play and thats for free. Ive tried the alpha demo and the game is good and you can earn decent gog tokens even for free. Of course the only difference is the paid nft by investors are higher or faster to grind or proceed to higher level faster than free to earn players. Just watch out for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 09, 2022, 07:40:09 AM",
      "body": "I'm most familiar with Ni No Kuni, MIR4, and Axie Infinity. Ni No Kuni and MIR4 allow you to play for free but you honestly wouldn't get anything out of it unless you pay since the default you get wouldn't really be enough to compete, so the rewards are abysmal as well (and afaik, Ni no kuni was a flop at its release). Axie infinity was brought down BIG time by hype (which was also the one that brought it up tbf), but it's still a solid game. Entry-level is pretty cheap now that the hype is gone, about $25-$30 can get you in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 09, 2022, 08:00:29 AM",
      "body": "Quote from: serjent05 on July 08, 2022, 04:12:14 PMIf you want to explore aside from the game given by the first reply, you can check this site : https://playtoearn.net/blockchaingames?sort=f2p&direction=ascThe list of games can be sorted according to the tabulated info.  The site also states the status of the listed games.  Why not check and explore the site, there are lots of free to play - pay to earn games listed there.Interesting collection, and thanks for sharing this sorted site. I did not know there are so many games based out of NFT alone and other with their own coins. I am not sure how successful you guys have been earning enough and not throwing away lot of time on these games, but since its just to play to earn surely it has got time involved as earning factor?Any good experience or game suggestion from the list that you have mentioned here? Many times we exhaust ourselves playing non sense games so better to start with the one that's already has good average earnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 09, 2022, 08:06:24 AM",
      "body": "Quote from: cryptoaddictchie on July 08, 2022, 03:59:23 PMWhat famous game now is the nino Kuni but I dont played that game but youll earn some tokens from the game which can be traded and sell for money. Im not sure how much is the profit but it seems its really free to play this game. Im suggeating this cause their developer and this game is known and famous. So likely youll dont end up posting rants on a scam free p2e. It even trending now on playstore. Just checked them out, for details. . I wasn't aware about this game. Thank you very much for the suggetion. I'm going to try this out. It has come in a very good moment since I was beating my brains out in an attempt to discover play to earn opportunities at crypto market right now. The concept somehow reminds me MIR4 (mmorpg, to mine ore in game feature to make real money and even the currency's quotation format).Unfortunatelly these games don't last long for common players, because there are many cheater players using bots and other shady strategies to raise their profits. So it's necessary to enjoy the beginning of the game, while those cheaters and abusers aren't too strong and influent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 09, 2022, 09:06:22 AM",
      "body": "Quote from: uneng on July 09, 2022, 08:06:24 AMUnfortunatelly these games don't last long for common players, because there are many cheater players using bots and other shady strategies to raise their profits. So it's necessary to enjoy the beginning of the game, while those cheaters and abusers aren't too strong and influent.Actually there is always like this. In every game there are abusers and cheaters since not all games are perfect and these guys are trying to beat the game and earning unfair compared to other players. But of course depend on how developer will handle the game right?Try gog too its what Ive trusted so much but its not yet launch yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}