{
  "id": "topic_5415729",
  "title": "fennic",
  "author": "fennic",
  "created_time": "October 03, 2022, 01:05:06 AM",
  "content": "Bitcoin is cryptocurrency that is a future and that will save us from many things like inflation and other such things and so that many people will use this as payment method not as an investment that is currently running. And also I was thinking that what will be the bottom of Bitcoin till 2025 as many big investors and also other such big furms will buy at this Dio and so that it might just continue it's positions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415729",
  "comments": [
    {
      "author": "Baofeng",
      "created_time": "October 03, 2022, 01:52:43 AM",
      "body": "Bottom in 2025? If he look a the historical log, we could be in the bull run, 2024-2025. So I was quite surprised to that you are asking for the bottom instead of a new all time high.So I'm not sure if there is somewhat that can give you the bottom price till 2025.But as far as prediction as to what could be the new all time high, perhaps we could see 6 digits for the first time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fennic",
      "created_time": "October 03, 2022, 02:10:27 AM",
      "body": "Quote from: Baofeng on October 03, 2022, 01:52:43 AMBottom in 2025? If he look a the historical log, we could be in the bull run, 2024-2025. So I was quite surprised to that you are asking for the bottom instead of a new all time high.So I'm not sure if there is somewhat that can give you the bottom price till 2025.But as far as prediction as to what could be the new all time high, perhaps we could see 6 digits for the first time.I think that you did not understand, I was saying that at historical points Bitcoin will be very top. I was saying that now in Bear market at what levels Bitcoin will go down till 2025 not in 2025. Still I think you might not understand this. My mean a bug dump could be in 2022 or 2023 or even 2024 intitial months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 03, 2022, 02:24:18 AM",
      "body": "Quote from: Baofeng on October 03, 2022, 01:52:43 AMBottom in 2025? If he look a the historical log, we could But as far as prediction as to what could be the new all time high, perhaps we could see 6 digits for the first time.Isnt this exxagerated or over estimation? Thats a few years ahead and not that far but if ever weve hit or intercept that figure then its really an amazing investment.OP- In my opinion, bitcoin has been used for services but the majority are pobably viewing it as investment and another means to reach a rich status when they bought now and sold later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "target",
      "created_time": "October 03, 2022, 02:38:39 AM",
      "body": "Quote from: fennic on October 03, 2022, 02:10:27 AMQuote from: Baofeng on October 03, 2022, 01:52:43 AMBottom in 2025? If he look a the historical log, we could be in the bull run, 2024-2025. So I was quite surprised to that you are asking for the bottom instead of a new all time high.So I'm not sure if there is somewhat that can give you the bottom price till 2025.But as far as prediction as to what could be the new all time high, perhaps we could see 6 digits for the first time.I think that you did not understand, I was saying that at historical points Bitcoin will be very top. I was saying that now in Bear market at what levels Bitcoin will go down till 2025 not in 2025. Still I think you might not understand this. My mean a bug dump could be in 2022 or 2023 or even 2024 intitial months. You mean after the bullrun in 2024 which is after the halving there will be bear market again in 2025. That's hard to predict. The bear market this 2022 is not over, it's predicted that it could drop to $12k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "October 03, 2022, 02:50:40 AM",
      "body": "10k to 14k is my target bottom on the current bear market base on the monthly time frame previous resistance and supports. Going below than 10K will destory the bullish cycle of Bitcoin in general and start from the scratch without any known pattern for the rest of the year.It's hard to read the general pulse in crypto so everything is possible to occur and assuming the worst case scenario is the best thing to do as safety precautions on trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "October 03, 2022, 04:48:37 AM",
      "body": "Quote from: fennic on October 03, 2022, 01:05:06 AMBitcoin is cryptocurrency that is a future and that will save us from many things like inflation and other such things and so that many people will use this as payment method not as an investment that is currently running. And also I was thinking that what will be the bottom of Bitcoin till 2025 as many big investors and also other such big furms will buy at this Dio and so that it might just continue it's positions.the lowest we have till now is 17k level in which i think it can go  down to at least 14-15k before spiking up and till 2025 to come as I know we will be seeing more movement in the coming days.but what we can look at is that even if there is a dump to go in the next months or years yet we will cover the increase from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "October 03, 2022, 05:56:00 AMLast edit: October 03, 2022, 06:09:13 AM by STT",
      "body": "My worst case estimate at about the start of the year was BTC could see low teens and I didnt understand why that would happen especially just that it could stretch that far determined by the extent we had risen on a chart it can reverse of course.   Regular highs seen prior to the current rise into the range we are in the bottom of now was about the low teens, thats the most likely reliable area for price to turn around should it be pushed that far.  I dont ask what moves it that far, often we cant imagine exactly but also I know prices are frequently inaccurate at they most extreme points in a range just before they reverse direction.   I think 2022 or close to this time period is about the most negative we develop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 03, 2022, 06:17:28 AM",
      "body": "Until the year 2025, unexpected events may occur that lead to breaking the bottoms that are formed even if they are strong (currently the strongest bottom is 17,708.62), but we can see levels at 13K or less, we can ask about the possibility of these unexpected events.Other than that, it seems that 17,708.62 levels seem to be a strong bottom, and the longer the time without breaking it, the stronger it will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "October 03, 2022, 08:06:02 AM",
      "body": "Quote from: fennic on October 03, 2022, 01:05:06 AMBitcoin is cryptocurrency that is a future and that will save us from many things like inflation and other such things and so that many people will use this as payment method not as an investment that is currently running. And also I was thinking that what will be the bottom of Bitcoin till 2025 as many big investors and also other such big furms will buy at this Dio and so that it might just continue it's positions.Bitcoin touched $17.6k in June and is considered the lowest so far, will it continue to make new lows and what will the new lows be? No one will give you an exact answer. If you are trying to identify a bottom to buy I don't think it is necessary as it is very difficult to determine and at the current price it looks like we are nearing the bottom in this bear season so buying now is also a good time. Start buying and don't buy once, if the price continues to drop, keep buying, that's what we can do.The future of bitcoin used as a means of payment, I am not sure. Until now bitcoin is still considered an investment and very few people see it as a means of payment because of its high volatility it is more suitable for profitable investment than for use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 03, 2022, 08:26:41 AM",
      "body": "who cares? Historically, the price will have broken the current price peak, and then the bottom will be at 5, 10 or 17.6K, all of which are considered cheap prices when bitcoin break 100k or higher.Attention to the bottom is for those looking for short-term investment, not long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "October 03, 2022, 08:31:33 AM",
      "body": "Quote from: fennic on October 03, 2022, 01:05:06 AMBitcoin is cryptocurrency that is a future and that will save us from many things like inflation and other such things and so that many people will use this as payment method not as an investment that is currently running. You've said about inflation that relates to saving and as an asset and you cannot stop people if we're using it as an investment. There's no need to stress it out because anyone can use it freely depending on what they like, be it as a payment or an investment.Quote from: fennic on October 03, 2022, 01:05:06 AMAnd also I was thinking that what will be the bottom of Bitcoin till 2025 as many big investors and also other such big furms will buy at this Dio and so that it might just continue it's positions.No one knows what's the future price of it just as you're asking for an specific price. 2024 will have the halving and most speculations is like 2025 is the start of the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "October 03, 2022, 10:02:20 AM",
      "body": "17k is still holding pretty strong, we haven't really seen any indication of the market falling through it imo, and we're basically a year away from the expected bull run due to halving most are waiting. I mean if you look at it right now the market is still holding pretty strong at 19k, 20k levels for almost 3 months now. If nothing big happens I think it's safe to assume that it wouldn't go past below 17k anymore, but if something big happens then going to $13k levels wouldn't be that odd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BobK71",
      "created_time": "October 03, 2022, 10:28:08 AM",
      "body": "Quote from: Husires on October 03, 2022, 08:26:41 AMwho cares? Historically, the price will have broken the current price peak, and then the bottom will be at 5, 10 or 17.6K, all of which are considered cheap prices when bitcoin break 100k or higher.Attention to the bottom is for those looking for short-term investment, not long.when bearish markets are prolonged various obstacles are found by the investors. At that moment some investors price prediction bring it to the bottom. And when it is bullish, such confusions are no more. But no matter what happens, without determination nothing good can be expected. Bitcoin price going up or down is not a problem for long term investors. But it is a great concern who are short term investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 03, 2022, 03:45:48 PM",
      "body": "No one can predict the bottom on this year, now you're asking a question that how much the bottom until 2025 lol.Taking from the history, on 2017 Bitcoin ATH around at $19K. Now the Bitcoin price which is the bottom until now around at $19K too, so on 2025 the bottom might around $69K since it's the ATH on the last year. Bear season occur after bullish season on this 2 times of Bitcoin super cycle.Rather than asking how much the bottom, you'd rather ask how much is the highest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "October 03, 2022, 04:28:37 PM",
      "body": "The bottom by that date is still unknown, but I believe we shall see it by next year. From the middle or end of 2023 things will start improving again in cryptocurrency. The more we reach close to 2024 and 2025, the more it's likely a new bull run begins, because it's bitcoin halving time and historically it has always been a very positive momentum for btc and its loyal investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "October 03, 2022, 04:31:10 PM",
      "body": "won't go below $17k until next year, so everyone can do their speculations here and it's true no one can predict what the high price will be in 2025, I've directly discussed this in the thread about the 4 year cycle and I assume cyclical confidence it is predictable and will no longer be used as a benchmark bitcoin will be bullish, whenever bitcoin will be bullish and the next $100k is the main target of the previously failed ATH price in 2021, so buying under $20k is a good move for long term investment, because when the market is bullish they will move quickly to leave you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 03, 2022, 08:23:51 PM",
      "body": "I feel like we already reached the bottom until that date. I mean we reached 17.6k as bottom during this period, and that should probably stay until the next time. I am not saying that it is impossible for us to get any lower, of course it is possible but I feel like it is unlikely at the same time.We are probably going to see it go up from here on out, and that is why the price is very important when we are talking about the future and how it should not reach another bottom. I understand we are very close, just a 3-4k drop and we are going to be under that price and those type of falls easily happen, but the support line there is looking strong enough to keep us above that level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "October 03, 2022, 08:36:56 PM",
      "body": "Quote from: Baofeng on October 03, 2022, 01:52:43 AMBottom in 2025? If he look a the historical log, we could be in the bull run, 2024-2025. So I was quite surprised to that you are asking for the bottom instead of a new all time high.Actually what's happening now in cryptocurrency is showing that we going to experience a bullrun in 2024 and 2025 so i dont believe that the bottom of Bitcoin will come up in 2025, i believe that bitcoin circle will elapsed as four years we do emphasis on 2025. But one thing is that nobody knows the exact time bitcoin will accelerate, so that is one thing is strongly behind the secret of bitcoin. So it can c",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 03, 2022, 08:59:18 PM",
      "body": "Quote from: Baofeng on October 03, 2022, 01:52:43 AMBottom in 2025? If he look a the historical log, we could be in the bull run, 2024-2025. So I was quite surprised to that you are asking for the bottom instead of a new all time high.So I'm not sure if there is somewhat that can give you the bottom price till 2025.But as far as prediction as to what could be the new all time high, perhaps we could see 6 digits for the first time. By 2025, bitcoin analysts predicted that bitcoin will reach $100k above since a new all time high is expected after its bitcoin halving. The reason why a lot of bitcoin enthusiasts patiently wait for it to happen because they can finally reap and make a huge harvest from their long term bitcoin hodling. And since bitcoin is expected to become very bullish this time, for sure the altcoins in the market will be greatly influenced too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}