{
  "id": "topic_5456344",
  "title": "naim027",
  "author": "naim027",
  "created_time": "June 14, 2023, 02:44:31 PM",
  "content": "Hey!Mahdirakib! well played.Stop playing your dirty game with my friends and clients. You are the one whom I trusted most and shared everything. How ethical are you? I did not scam anyone, yet I have many tags because I did unethical things. Still, I did not decide to scam or promote scam (1xcrap). You were my best friend in the virtual world, and you started doing shit when I did not follow your instruction, and you were not able to get any benefit from me. Quote from: lovesmayfamilis on June 12, 2023, 09:58:20 AMmaybe you have better reasons for spying on him.Yes. He has a dirty reason for exposing confidential data. But that doesn't mean he will harass my friends and clients he may know. I have been in the forum since 2017. I know him from Duckdice.io. I was using this forum just to participate in the Duckdice game. But, one day, I noticed I got 1 merit from someone. So, I contacted Mahdirakib and wanted to ask more what is the merit thing and how I can get more. Slowly he explained many things about this forum. He also said you can earn money from a signature campaign if you rank up. I started being active, and I was getting merits from merit sources, and he seemed jealous about it. Yet, we had an excellent relationship. I don't remember how often I gave him loans (It must be more than 20 times). He plays on Betcoin.ag and Playbetr and often want a loan from me to participate in the contest. Loan Attachment:                               #Issue 1 Things started changing when I invited him to Paradice.in and try out the platform. He deposited some money and won. After making a withdrawal request, his withdrawal was pending, and he raged on Live support and chat room. I don't remember if I banned him from chatting, but he made some replies on the Paradice ANN thread where I criticized him for being rude on support and chat room. After that, he complained to our manager that he would not use Paradice anymore and was not satisfied with the support. Well, he stopped asking for loans. I apologized to him in public, and everything went normal again. I started giving him loans again. In the meantime, if I am not wrong, I ranked up to Sr. member while he was still a Full member. Or maybe we both were Sr. member. A few weeks later, I got banned, and I was frustrated. Even though we know each other from a Casino and forum, I still had a good relationship with him, and I was lending him. He knew all my secrets that I had Alt accounts. I often asked them to write something in my ban appeal thread, but he did nothing. Meanwhile, I continued lending him. Maybe he did not write anything because he knew I might earn more than him if my main account got unbanned. One thing should be noted that I never asked for a charge or commission for the amount I lent to him. Sometimes he donated, and I was running some charity program back then. I donated the fees to poor people and gave him pictures of the products I gave them. Donation Attachment:      #Issue 2 A few days later, He proposed a plan to open a gambling review site like BTCgosu. I told him that I might be able to help him. But I don't want to involve in it because of religious matters. He said ok then, the plan is canceled then. After a few days, I joined Casinocritique in their content writing team and entered game data. Once Casinocritique launched their ANN and team member name, Mahdirakib quickly sent me a dm and asked how I joined Casinocritique. I asked you to work with me, but you refused because of religious matters. Now you are working on a similar project. I told him that I was not getting paid from there and I didn't have a plan to continue working with them. FYI, I resigned from their team after a few days because of religion. Casinocritique takes a long time to remove me from the team member list. I don't know if they removed me yet or not.Want to Create a review website attachments:  #Issue 3 I started working on my home development, and my house was under construction. Mahdirakib wanted $200 USDT which he promised to return to me after three weeks. But I was short of money because my house was under construction. So, I had no choice, but I had to refuse him. After 10 more days, I got unbanned from the forum, and he congratulated me and said don't violate the rules anymore.After I wrote my welcome post, He started posting what he knew already, and he knows I made some mistakes. As long as he benefited from me, there were no problems. As soon as his benefit ended, He decided to play a dirty game.If you look at this from your perspective, He did the right thing by exposing me. When you see from your perspective that one of your friends knew you did something terrible, and he decided to reveal it because he was not getting benefits from you, How does it look? How ethical was it?Note: I have all the screenshots of what I have said. If anyone wants to verify, I can show you by giving the screenshots or via Video Call. While I was a newbie and Learning about BitcoinTalk from Mahdirakib    He knew I had Alts; Talking about my ban; Wanted to vouch for my ban appeal; Congratulated after I got unbanned and Mix Attachments     19 Minutes screen recording of more than two years of conversation;https://youtu.be/fBprJ7xIYr4Now comes this thread; Of course, Mahdirakib knows that John is an ex-staff of the Paradice support team. Mahdirakib is a player of Paradice and has contact with Paradice manager Seva (Tomal). So, Why don't you talk with Seva and let everyone know what they say? Because you want to tie John with me because we do business? Well, You got a loan from me more than 20 times. Does it make you my alt account? Stop Playing your Dirty games. Or do I have to expose you as well? @John Abraham; I am sorry, dude. I made some enemies during my forum journey, and I am sorry you were the victim of their shit.Conclusion: Don't trust Mahdirakib with confidential data. He can do anything to ruin your business if he doesn't get benefitted from you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456344",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "June 14, 2023, 03:04:11 PM",
      "body": "So, what? Do you think you have any credibility at all? Do you think people will stop looking for evidence to tag your alts? The pity is that the forum has a certain arbitrariness with these matters because this account from which you write should be banned, according to the rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "naim027",
      "created_time": "June 14, 2023, 03:15:38 PM",
      "body": "Quote from: Poker Player on June 14, 2023, 03:04:11 PMSo, what? Do you think you have any credibility at all? Do you think people will stop looking for evidence to tag your alts? The pity is that the forum has a certain arbitrariness with these matters because this account from which you write should be banned, according to the rules. Stop talking nonsense, PP. I have been buying, selling, and lending for a long time. I gave loans to Mahdirakib a couple of times. My Address is connected to his address as well. He was dealing with me even after I got banned. That doesn't mean he is my alt account. You guys showed tremendous anger because Royse kept their identity secret. Mahdirakib did the same. He knew I had alts but did not say to anyone because he was getting benefits from my lending service, and it was almost free for him. He decided to expose something that he already knew. Ask him to reply if he has balls. The Point is; Mahdirakib has contact with Paradice management. Why doesn't he talk to them? John has nothing to do with me. Why don't you guys verify yourself instead of asking for someone's private data? You guys lost your mind. You guys are waiting for someone to post their evidence while the evidence is in front of you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 14, 2023, 03:24:12 PM",
      "body": "It seems to me that you are going to have to explain yourself better, because as the credibility you have is 0, this is how I see your posts:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 14, 2023, 04:49:09 PM",
      "body": "Quote from: naim027 on June 14, 2023, 03:15:38 PMI gave loans to Mahdirakib a couple of times. My Address is connected to his address as well. He was dealing with me even after I got banned. That doesn't mean he is my alt account.You were banned for plagiarism only at the moment. I had no idea before 12th October that you have a few many alt accounts in the forum. I took loan from you several times, and you have already posted our conversation screenshot above. Which gives the clarity that I'm not your alt.Quote from: naim027 on June 14, 2023, 03:15:38 PMMahdirakib did the same. He knew I had alts but did not say to anyone because he was getting benefits from my lending service, and it was almost free for him.This is nothing else than a lie. Like most other forum members, I was aware of your Dic3L0v3r account only as you had created ban appeal request from it. But I did some research about you after watching this post. Initially, I couldn't find out much connection, but I did a little more research on you after this post and found the connections with other accounts.Quote from: naim027 on June 14, 2023, 03:15:38 PMJohn has nothing to do with me. Why don't you guys verify yourself instead of asking for someone's private data? Your conversation with 'John Abraham' is 'private data', and you cleared those conversations for privacy. But you have posted our full conversation publicly here. Where is your privacy now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "June 14, 2023, 04:53:49 PM",
      "body": "Just as others have said in John's accusation thread \"strange things are happening in this forum, and stranger things are yet to come\". What a week it has been in bitcointalk drama upon dramas.I  have gone through your thread and could only make sense of the text you wrote but as for the images you attached I could never understood what it was about since it's not entirely in plain english.Now my main concern is not related to if @Mahdirakib knew you or not. My main concern now is this:Quote from: John Abraham on June 13, 2023, 07:04:14 AMYou are right, indeed. He always clears the telegram chat after the successful trade. According to him, Bitcoin and crypto trading is banned there, and he doesn't want to keep any evidence. John boldly claimed that you normaly clear each chat section after every trade since it's related to crypto which is not allowed in your country but I am still suprised to see that you were able to provide all these screenshots right from when you were still a newbie but still yet you are unable to do the same for your John Abraham's case.From what I have seen in this thread I think he was only lying and does not have any prove as there was never any trade discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "naim027",
      "created_time": "June 14, 2023, 05:07:13 PM",
      "body": "Quote from: Mahdirakib on June 14, 2023, 04:49:09 PMThis is nothing else than a lie. Like most other forum members, I was aware of your Dic3L0v3r account only as you had created ban appeal request from it. But I did some research about you after watching this post. Initially, I couldn't find out much connection, but I did a little more research on you after this post and found the connections with other accounts. Oh really, mother fucker? You always knew what I was doing. I trusted you most and shared everything, including my ETH mining things, even though it's top secret in our country. What are you afraid of? Will people tag you? No worries. They won't. Quote from: Mahdirakib on June 14, 2023, 04:49:09 PMYour conversation with 'John Abraham' is 'private data', and you cleared those conversations for privacy. But you have posted our full conversation publicly here. Where is your privacy now?Quote from: Cantsay on June 14, 2023, 04:53:49 PMJohn boldly claimed that you normaly clear each chat section after every trade since it's related to crypto which is not allowed in your country but I am still suprised to see that you were able to provide all these screenshots right from when you were still a newbie but still yet you are unable to do the same for your John Abraham's case.It depends on whom I am trading with. I have a good relationship with John doesn't mean I trust him with everything. I never sent USD first. Even when he took a loan from me, I never exceeded the $100 limit. He never asked more than that. When it comes to Mahdirakib, I have known him since 2017-2018. I never felt insecure with him because of the relationship we had. If you translate the conversation, you will understand how deep the relationship is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "June 14, 2023, 07:04:52 PM",
      "body": "This part is interesting:Quote from: naim027 on June 14, 2023, 02:44:31 PM#Issue 2 A few days later, He proposed a plan to open a gambling review site like BTCgosu. I told him that I might be able to help him. But I don't want to involve in it because of religious matters. He said ok then, the plan is canceled then. After a few days, I joined Casinocritique in their content writing team and entered game data. Once Casinocritique launched their ANN and team member name, Mahdirakib quickly sent me a dm and asked how I joined Casinocritique. I asked you to work with me, but you refused because of religious matters. Now you are working on a similar project. I told him that I was not getting paid from there and I didn't have a plan to continue working with them. FYI, I resigned from their team after a few days because of religion. Casinocritique takes a long time to remove me from the team member list. I don't know if they removed me yet or not.Therefore it seems as though the allegation is Mahdirakib approached naim027 to start a casino related website but naim027 refused because he said it was against his religious beliefs. Furthermore it seems the allegation is that naim027 was working for CasinoCritique when he asked Mahdirakib to work with him but Mahdirakib refused because he said it was against his religious beliefs. Does anybody else agree the quote is effectively full of hypocrisy whether it is even true or not?If this is understood correctly, naim027 has stated he was discussing opening a casino review website but did not proceed because his religious beliefs did not permit it. After that he went to work on the now failed and never launched Casino Critique website (the name says it all) and while he was working there he offered employment to the same person that he initially refused to open a casino review website in partnership with citing his religious beliefs and then he also refused to work with you citing his religious beliefs yet those religious beliefs were not important when the initial casino review website idea was being presented to naim027 by a man with religious beliefs that would not want to work in casino-related projects.Oh and let us not forget naim027 also (allegedly) worked for casinos too.This really is something baffling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "June 14, 2023, 09:03:52 PM",
      "body": "It's remarkable how people can suddenly find their religious convictions when it suits their personal interests. Who knew religion could be so flexible?  It's worth mentioning that Naim had a well-established history with casinos and gambling long before all this \"religious stuff\" nonsense came into play. I can't help but wonder what his religion has to say about fundamental values like honesty, integrity, and fairness.Quote from: naim027 on June 14, 2023, 05:07:13 PMOh really, mother fucker? Well, this doesn't quite align with the image of a devoutly religious individual, now does it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 14, 2023, 09:52:10 PM",
      "body": "Quote from: JollyGood on June 14, 2023, 07:04:52 PMFurthermore it seems the allegation is that naim027 was working for CasinoCritique when he asked Mahdirakib to work with him but Mahdirakib refused because he said it was against his religious beliefs.You have misunderstood the second part of the above quote. I think everyone will be confused here as the way he described it. I didn't receive the offer from anyone to work with the Casino Critique team. I had only showed curiosity that why he is working with the Casino Critique team (casino review site) while he refused similar proposal from me. I didn't mention anything about the religion there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "naim027",
      "created_time": "June 15, 2023, 04:19:46 AM",
      "body": "Quote from: JollyGood on June 14, 2023, 07:04:52 PMDoes anybody else agree the quote is effectively full of hypocrisy whether it is even true or not? Your Father Mahdirakib already confirmed that it's true. It is full of hypocrisy. He offered me to open a casino review website and I refused his offer. Quote from: FatFork on June 14, 2023, 09:03:52 PMIt's worth mentioning that Naim had a well-established history with casinos and gambling long before all this \"religious stuff\" nonsense came into play.  Owning a platform and working for a platform is not the same thing.If you are working for some platform. You are not getting any commission from gamblers. There is nothing called profit or loss in a Job.But, when it comes to running your own platform, You directly getting commission from gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 15, 2023, 07:59:29 AM",
      "body": "I know naim027 is a mother fucker;A cheat;A liar;Very controversial;Although, I love the way he makes his presentions, his written English skills is high. He is smart and can maneuver  his way, yet I have fallen out of love with anything that relates to the name naim027 because of his high level of deceit and lies. However, amidst my induced dislike for naim027, I am bold to say that if Mahdirakib had known naim027 since 2017, collected upto 20 times loan from him, worked with him in different casinos and even offered a proposal to him. Just because he can no longer benefit from naim027, he decided to screw him up. Honestly, Mahdirakib you are the bigger fucker here. Bow out in shame both you and the fucking naim027.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 15, 2023, 09:04:17 AM",
      "body": "Quote from: KingsDen on June 15, 2023, 07:59:29 AMI am bold to say that if Mahdirakib had known naim027 since 2017, collected upto 20 times loan from him, worked with him in different casinos and even offered a proposal to him.To be frank, I had no idea about 'naim027' before 20th October of 2021. I haven't worked with him on any casino. I had only offered him to create a casino review site, but he had declined my offer (on 4th July 2022). I have conversation with 'naim027' from 20th October 2021 to 12th October 2022 on telegram, that's all. He sent me a PM on the 20th October in the forum, then sent me his telegram username on PM. Although I don't have the intention to post the screenshot of the forum PM here, but I have to do it to prove my words.I'm a regular gambler. I have played at a lot of casinos and talked with hundreds of gamblers in different casinos chat. But I don't know any of them in my real life.Quote from: KingsDen on June 15, 2023, 07:59:29 AMJust because he can no longer benefit from naim027, he decided to screw him up. I wasn't getting benefits from him by taking the loans. I had made the repayment always on time. He wasn't giving free money to me. Therefore, talking about the benefit is an useless excuse here. He is trying to insult me here, and you are taking those seriously.Quote from: KingsDen on June 15, 2023, 07:59:29 AMHonestly, Mahdirakib you are the bigger fucker here.I didn't expect to hear anything like that from you. My ignore list is small, but you will fit into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 15, 2023, 09:28:06 AM",
      "body": "Quote from: naim027 on June 14, 2023, 02:44:31 PMConclusion: Don't trust Mahdirakib with confidential data. He can do anything to ruin your business if he doesn't get benefitted from you.It looks like you don't mind sharing private communication yourself Quote from: naim027 on June 14, 2023, 02:44:31 PM@John Abraham; I am sorry, dude. I made some enemies during my forum journey, and I am sorry you were the victim of their shit.Is this why you put so much effort in a character attack against the creator of 'John Abraham ≈ naim027' Coincidence or Connection? instead of the accusation itself?Quote from: naim027 on June 14, 2023, 05:07:13 PMOh really, mother fucker?I tend to take posts less serious once they resort to name calling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 15, 2023, 10:00:39 AM",
      "body": "Quote from: Mahdirakib on June 14, 2023, 09:52:10 PMQuote from: JollyGood on June 14, 2023, 07:04:52 PMFurthermore it seems the allegation is that naim027 was working for CasinoCritique when he asked Mahdirakib to work with him but Mahdirakib refused because he said it was against his religious beliefs.You have misunderstood the second part of the above quote. I think everyone will be confused here as the way he described it. I didn't receive the offer from anyone to work with the Casino Critique team. I had only showed curiosity that why he is working with the Casino Critique team (casino review site) while he refused similar proposal from me. I didn't mention anything about the religion there.Casino Critique by Royse777 is an abandoned project. Let it go.Anyway, it seems at this point it is less of an issue of alt accounts and more of a personal issue between the two members Mahdirakib and naim027 similar to Vod vs. OgNasty years ago. Let's hope they just resolve their differences amicably.Besides alt accounts, is there some kind of financial dispute that I'm missing from the big picture?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 15, 2023, 10:45:08 AM",
      "body": "Quote from: JollyGood on June 14, 2023, 07:04:52 PMAfter that he went to work on the now failed and never launched Casino Critique website (the name says it all)Seriously? It seems like Mbappe to Madrid saga we had in the last transfer window. The journalist acted like they knew better information than Mbappe, Real Madrid, and PSG  Thank you JollyGood for the promotion you did among the gamblers. I have to ask the Casino Critique admin why he is paying people secretly to mention it while we are on a tight budget.Neither Casino Critique is a failed project nor it's abandoned. It's abandoned from the way it started but as a Casino review website, the work is still ongoing. I'm not active as a team member due to my real-life activities but the team is still there and working on the project.Quote from: NotATether on June 15, 2023, 10:00:39 AMAnyway, it seems at this point it is less of an issue of alt accounts and more of a personal issue between the two members Mahdirakib and naim027 similar to Vod vs. OgNasty years ago. Let's hope they just resolve their differences amicably.Seems true despite the fact that Naim027 had few alts. Hopefully, they will resolve it.QuoteBesides alt accounts, is there some kind of financial dispute that I'm missing from the big picture?No, no one owes anything to any one of them other than some gratitude and respect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 15, 2023, 10:59:58 AM",
      "body": "Quote from: Little Mouse on June 15, 2023, 10:45:08 AMNeither Casino Critique is a failed project nor it's abandoned. It's abandoned from the way it started but as a Casino review website, the work is still ongoing. I'm not active as a team member due to my real-life activities but the team is still there and working on the project.Oh ok. So what exactly is it going to become now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 15, 2023, 11:13:12 AM",
      "body": "I don't know about you all, but if some thread was opened in the Reputation board about me being an alt account of someone who was caught trying to deceive all around here and even committed ban evasion; I would personally would not feel very calm or would see very advantageous for my own reputation if that same person appeared and opened a new thread trying to make people doubt on the intentions of the person who has accused me.This situation makes this looks like as if John is indeed another alt of Naim, granted: Naim027 could have opened this thread under the request of John, but that is even the case John should have been more intelligent and realize that Naim's defense won't do much favor to clear his name.I would rather to have more reputable and honest people defending me. Better than nothing, some could say...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 15, 2023, 11:24:36 AMLast edit: June 15, 2023, 11:40:05 AM by Mahdirakib",
      "body": "Quote from: NotATether on June 15, 2023, 10:00:39 AMAnyway, it seems at this point it is less of an issue of alt accounts and more of a personal issue between the two members ~There is no personal issue with 'naim027' from my side. Actually, he took it personally as I helped to expose his alt accounts. He thought I did the expose as he declined my last loan request, which isn't true at all.Quote from: NotATether on June 15, 2023, 10:00:39 AMBesides alt accounts, is there some kind of financial dispute that I'm missing from the big picture?No, there is no financial dispute. I had taken loan form him 13th to 15th times maybe, and repaid the loan always on time. I also gave him a little extra amount during most of the repayment.Quote from: NotATether on June 15, 2023, 10:59:58 AMOh ok. So what exactly is it going to become now?'naim027' is making a personal attack on me without any valid reason. Some forum members are taking it seriously and engaging in the discussion. It will be a long discussion if everyone takes the thoughts of 'naim027' seriously by ignoring his feedbacks (professional liar).(Edit: You may ignore this 3rd quote reply as I just noticed that your reply is related to Casino Critique. Where I made the reply by thinking that you have asked about this thread. Sorry for the confusions)@Little Mouse, you have the ability to understand our whole discussion as you know the language. If you have time to read it, then kindly check it out and tell the forum whether I did anything wrong or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "June 15, 2023, 11:31:26 AM",
      "body": "Quote from: FatFork on June 14, 2023, 09:03:52 PMIt's remarkable how people can suddenly find their religious convictions when it suits their personal interests. Who knew religion could be so flexible?  It's worth mentioning that Naim had a well-established history with casinos and gambling long before all this \"religious stuff\" nonsense came into play. I can't help but wonder what his religion has to say about fundamental values like honesty, integrity, and fairness. Yes he seems to change his religious convictions but we all know naim027 is a compulsive liar, we simply do not know when he is telling the truth or partial truth. Quote from: FatFork on June 14, 2023, 09:03:52 PMQuote from: naim027 on June 14, 2023, 05:07:13 PMOh really, mother fucker? Well, this doesn't quite align with the image of a devoutly religious individual, now does it? He cannot get his story straight because of being a compulsive liar. Using profanities and insults is not productive. If you have to present a view or argument it should be done without resorting to that level but naim027 is a compulsive liar therefore we do not know what nonsense he will spout next.Quote from: Mahdirakib on June 14, 2023, 09:52:10 PMYou have misunderstood the second part of the above quote. I think everyone will be confused here as the way he described it. I didn't receive the offer from anyone to work with the Casino Critique team. I had only showed curiosity that why he is working with the Casino Critique team (casino review site) while he refused similar proposal from me. I didn't mention anything about the religion there.It was naim027 that made that comment and I personally do not believe with conviction anything he says. He has lied too much in the forum.Quote from: NotATether on June 15, 2023, 10:59:58 AMQuote from: Little Mouse on June 15, 2023, 10:45:08 AMNeither Casino Critique is a failed project nor it's abandoned. It's abandoned from the way it started but as a Casino review website, the work is still ongoing. I'm not active as a team member due to my real-life activities but the team is still there and working on the project.Oh ok. So what exactly is it going to become now?It will be interesting to read the reply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}