{
  "id": "topic_5415392",
  "title": "Christofferg",
  "author": "Christofferg",
  "created_time": "September 29, 2022, 06:17:56 PM",
  "content": "HelloAnyone tried out auto crypto ex?I have, i first bought a trading package worth 500$Then i suddenly won some kind of lottery/bonus worth 10.000$I withdrawal them and they can't pay out before i have 2 downlines. I registered another account on my name, and one on wife. Activevated them with 500$ on each. Then they say i need to pay government taxes and insurance on 610$. So i actually did, now they say i need too pay sending fee on 500 something dollars. Feel this is scam, anyone know that? Really need that 11200$ that's on pending now.Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415392",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "September 29, 2022, 06:34:04 PMLast edit: September 29, 2022, 09:13:09 PM by hosseinimr93",
      "body": "I don't know what service you are talking about, but given the information you provided about it, it's surely a scam.Any service asking you to make a deposit to be able to make a withdrawal is a scam. Don't waste more money on that website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "September 29, 2022, 06:54:52 PM",
      "body": "i believe the website you are talking about is completely a scam because that trick already happen in 2018 and still happens. you can check this thread https://bitcointalk.org/index.php?topic=5081286.0 because that thread has many websites that scam just like you said",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 29, 2022, 08:20:30 PM",
      "body": "Is this the site? autocryptoex.com. if yes, then the site is a complete scam if one adds your story. They will keep asking for money from you until you realize that it's scamJust the way the website is poorly built alone is enough to raise some eyebrowsI read this review from trustpilot, it was last updated on 9th september 2022Quote from: https://www.trustpilot.com/review/www.autocryptotrade.comI don't know if autocrypto trade is the same as autocryptoex.But I advise anyone who wants to earn real money trading Forex marketAvoid Autocryptoex at all costs.$100 pack trades for one day you get $15 USDThen it stops tradingI call this the donkey and the carrot it's to coercise you into buying $500 packOnce you buy into 500 packIt trades up to 30 days before you reset it you want to draw and they ask for $710 for insurance on your pack before you can draw money.Smells like a scamThen they may add you your account thousands in bonus payment you supposedly win.Then for the privilege of winningYou have to find two down linesNote if your earnings are good and you wanted to finance a downline from your pack they won't let you.So they want you to put in fresh money or the other personKnown as the dowline to finance the pack.At this point you have spent 500 USD and they say you can be your own downline meaning you double your pack to $1000So if you spent $1000And financed a freinds pack your up to 15000Then they want the $710 bogus insurance feeAnd your already at 2210 USD and all you wanted was a $500Trading pack.Your Freind can not pay you back out of their trading account because they are dealing with similar issues with Autocryptoex.So you either decide to pull the pin or keep pushing hoping it will work telling yourself it's not a scam.Also they have a lady who may not even be who she says she is and she's probably told you about the pack in the first placeWhen you ask her about things she's usually siding with the company.Note I have not paid bogus insurance and I have not upgraded my pack to $1000I have told them I want to close the account they are trying to explain to me to do so I need to recruit the second down line please don't waste your time with this company nothing but headaches and they will find many reasonsWhy you can't draw your earnings.No matter how much it says you have in the pack it's not worth anything unless you can actually draw on it think about it.You can find far better trading packs with diffent companiesEven if you do your homework it's hard to know who your dealing withOnly way to know sadly is to try but some groups actually test run packs long before you try they weed out the scum ones.DO NOT INVEST WITH AUTOCRYPTOEX EVER.If they refuse to refund me I will be reporting them of suspected of trading insolvent and alsoFar more it will become goverment and federal police matter.August 03 update the message I got from autocryptoe,.If you want to draw funds this is how they behave asking for $710 USD they will say it's insurance or a fee to shift funds from one spot to another, and here it is.You should know that we didn't run away with your money, and if you choose to comply with us it's your business at this point. We have found out that you are very stubborn, and that you are a troublesome person. Let us know when you eventually decide to pay the money for the reversal of your funds that was initially sent to our s19 mining machine, it's not our fault you don't have a good phone, so it's up to you.We won't reply to any more mails from you that is not a proof of payment or a mail stating when you would start the payment so you get your money.You should also know that we are hoping you pay this, so we will be done with you as soon as possible.Have a nice day.......September 9 2022 update So there you have it🙄also I called the S19 pro so called block chain mining number in last few weeks and someone sounding distinctly African answered it would not surprise me if they are based in Nigeria or similar locationSo I'm going to call them autocryptoex Africa from now onStill seen no money from them and it's September 9 2022And no response to any emails or messages I have sent them recentlyPlease invest your money elsewhere save yourself the drama and headaches.Date of experience: July 08, 2022",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "September 29, 2022, 11:28:12 PM",
      "body": "Quote from: Christofferg on September 29, 2022, 06:17:56 PMHelloAnyone tried out auto crypto ex?I have, i first bought a trading package worth 500$Then i suddenly won some kind of lottery/bonus worth 10.000$I withdrawal them and they can't pay out before i have 2 downlines. I registered another account on my name, and one on wife. Activevated them with 500$ on each. Then they say i need to pay government taxes and insurance on 610$. So i actually did, now they say i need too pay sending fee on 500 something dollars. Feel this is scam, anyone know that? Really need that 11200$ that's on pending now.Thanks It is a fact that the site is a scam. but next time please be careful, all signs that it was a scam were clear:1 - Trading is difficult, even anyone who says he is an expert cannot have a high and fixed return every day, trading does not generate guaranteed profit every day, there are days when the stop - loss is triggered and the person exits of the operation with a loss, there are days when the market is down and you can't make an operation, with that you can already conclude that it would be impossible to pay 500$ and receive some guaranteed profit from trading2 - keep it well, it is not possible that ask you to pay some amount for tax on a site where it is not the government's, when you withdraw to the bank it will be time when they will deduct the tax part or even the government of the your country will look for you to pay tax, so don't fall for these meaningless tricks anymore that you have to send tax amount on an anonymous website and then get paidI hope you don't fall for these scams anymore",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 30, 2022, 08:00:24 AM",
      "body": "I am sorry Christofferg but you got scammed big time. What was that \"trading package\" supposed to do that you felt it was worth $500? Make money automatically by initiating trades or are we talking about trading manuals and advice? You should have been suspicious of the site as soon as you won that lottery you never registered or paid for. Ask yourself, why would you need to pay money to activate your accounts, pay taxes, and other fees when you just won $10.000? They can simply deduct whatever is needed from your winnings. The reason why they ask for downlines is so they can scam more people with the same type of scheme. I hope you have learnt a lesson here and in the future you will be more careful trusting scammers with your money.Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 01, 2022, 04:35:43 PM",
      "body": "Other users already covered the important parts, but I'd like to point out another fake website that might be their sister site: Glencoretrade.com [archived] (apart from having similar content, both of them use the same registrar and the creation date is one day apart from each other)Quote from: https://www.namecheap.com/domains/whois/result?domain=autocryptoex.comDomain name: autocryptoex.comRegistrar WHOIS Server: whois.namecheap.comRegistrar URL: http://www.namecheap.comCreation Date: 2022-03-06T07:36:14.00ZQuote from: https://www.namecheap.com/domains/whois/result?domain=glencoretrade.comDomain name: glencoretrade.comRegistrar WHOIS Server: whois.namecheap.comRegistrar URL: http://www.namecheap.comCreation Date: 2022-03-07T10:52:33.00Zother websites that are somewhat similar:Guaranteed-trade.com [archived]operationdigitaltrade.com [archived]greenhillvest.com [archived]x9-cryptomining.ltd [archived]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}