{
  "id": "topic_5450890",
  "title": "Amr85",
  "author": "Amr85",
  "created_time": "May 01, 2023, 08:37:13 PM",
  "content": "Hello everyone!with regards to my previous topic https://bitcointalk.org/index.php?topic=5450277.0i have turned it into a website!  you can visit my website here https://btcusa.com/What do you think of it from 1 - 10 ?   ( 1 is bad - 10 is excellent)Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450890",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "May 01, 2023, 11:28:46 PM",
      "body": "I'm really impressed, the design is fantastic. I like the idea of the crypto real time update, it really is impressive. You really have put in a lot of hardwork and dedication into this project and it definitely paid off. From your previous post, I saw that you didn't have any idea on what to do with the website but you actually listened to some advice given to your by forum members and then turn it into something amazing. I will give you from 1-10, a '9' I added your website to my bookmark it will definitely become handy.nice work mate, keep it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "May 01, 2023, 11:37:39 PM",
      "body": "That was fast. Great job! Maybe in future you can strike a deal with some original authors to write articles for you. Some unique features like ATM radar or ads designed just for your site would also be great. A chatbox could also work, maybe links to interesting videos, instructions how to self-custody, where to buy and how to set up your first hardware wallet.I hope you won't abandon this project and keep adding to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "May 01, 2023, 11:38:36 PM",
      "body": "Nothing special, just a common blog website. But i still commend you having a good domain name, but it sounds like an exchange than a blog. But anyway, try to make it have a higher rank in google search so at least you get ROI more sooner and create great quality contents because you have higher spam score after i checked your DA/PA rankings as the effect of having an old registered domain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "May 02, 2023, 12:00:54 AM",
      "body": "Quote from: PX-Z on May 01, 2023, 11:38:36 PMNothing special, just a common blog website. But i still commend you having a good domain name, but it sounds like an exchange than a blog. But anyway, try to make it have a higher rank in google search so at least you get ROI more sooner and create great quality contents because you have higher spam score after i checked your DA/PA rankings as the effect of having an old registered domain.I guess you should visit the previous topic in other to understand why the OP decided to create this one. Although, like you said there may be nothing really special about it, but in due time the OP can work on it and transform it to something really mind blowing that would generate some good amount of money or he/she can cash in on the domain sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 02, 2023, 12:18:55 AM",
      "body": "You have done a great job my friend. Your domain name is a nice one and can easily attract users if you work properly on it. I recommend you to write some good articles about Bitcoin on your website and do some SEO to increase its ranking on search engines. You should work on it for at least and month and get some viewers through SEO, and you should add some good features that make it unique.Your best bet is on content the more you can produce on your site the higher the chances of it getting ranked on search engines. Once you reach a proper level on search engines then you can sell your website and earn some good profits with the effort that you put on it or you can continue posting on the website and earn via ads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "May 02, 2023, 03:48:30 AM",
      "body": "I've read your previous thread and it only took 5 days to create the site shows that you are indeed an experienced site builder. I'm impressed.The color selection for the site is good. But somehow, I feel that there are too many articles on the main page and it looks quite \"crowded.\" But it's okay. Oh yes, maybe you don't need to add the Real Time Update below, just the one on the right side. Also, there is a price list in the footer, so it's more than enough.But that's just a suggestion; you don't need to take it seriously. Now you need to focus on working on the SEO because that will get the site a good position on search engines. I give my rate at 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "May 02, 2023, 04:08:09 AM",
      "body": "I'm giving it a 7 as well mate, design is good. But if I have one suggestion though, maybe you can put the ticker price just above and not on the right side? I don't know maybe I'm used to seeing price updates above.And nice domain name you got here, perhaps it cost you something to get that.Best of luck though and hopefully you will constantly update your project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "May 02, 2023, 04:24:54 AMLast edit: May 02, 2023, 04:36:22 AM by Despairo",
      "body": "My rate is 6 for your site, 9 for the interface, but 3 for the content.Quote from: https://btcusa.com/indian-investor-committed-suicide-after-losing-money-on-bitcoin-report/The boy was caught in a crypto scam that promised high returns. Nonetheless, he did not receive any yield, while the scheme’s representatives he was in touch with ceased communication with him. The victim felt depressed and took his life shortly after realizing the fraud. I look into one of your article, it's good you're not forget to give a credit for the original source which I appreciate it, but you're just blatantly copy paste the whole article without read or re-write a false article. If someone read on the title, the investor was lost huge amount of money due to investing Bitcoin, but the content discuss the investor was lost huge amount of money due to investing in a ponzi scheme project! both are different case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 02, 2023, 04:35:01 AM",
      "body": "The site looks pretty good, actually. There are always things that can be improved, but for a newly created site I give you a 7. With this domain, if you don't stop making improvements, with time you will be able to attract a lot of traffic. The only thing is that you better be careful with what Despairo says in the previous post, you will have to improve the content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 02, 2023, 05:00:25 AM",
      "body": "the website looks good especially if it only took you 5 days to create(as michellee mentioned), but I am curious, I saw that you have a ToS and rules for people who register and post blogs on the website but I can't see a way to register, do I personally email someone for it? just to be clear, I am not really interested in registering, I am just curious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "May 02, 2023, 06:16:12 AM",
      "body": "Quote from: Amr85 on May 01, 2023, 08:37:13 PMHello everyone!with regards to my previous topic https://bitcointalk.org/index.php?topic=5450277.0i have turned it into a website!  you can visit my website here https://btcusa.com/What do you think of it from 1 - 10 ?   ( 1 is bad - 10 is excellent)Thanks!The design is ok, I'd say 6 or 7. Domain name is 10, really nice one and probably costed you a fortune. Most headlines are from May 1st have you just launched it recently? Do you have a team or it's a one man show? Contents/news 7 out of 10. Do you use a bot/AI scraping news websites or you do it manually? Would be nice to introduce Opinions section and hire some reputable/popular Bitcoin bloggers to write for you. Just my 2c.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "May 02, 2023, 06:29:19 AM",
      "body": "Quote from: Amr85 on May 01, 2023, 08:37:13 PMHello everyone!with regards to my previous topic https://bitcointalk.org/index.php?topic=5450277.0i have turned it into a website!  you can visit my website here https://btcusa.com/What do you think of it from 1 - 10 ?   ( 1 is bad - 10 is excellent)Thanks!Generally good page, and looking at your story you created that in the blink of an eye - well done.Only critique I have: There are hundrets of market-cap ratings, crypto-news sites and mining / trading blogs.Why not go with something really unique instead? Just saying... ofc depends on your business idea.Great domain name - nice HODL if it's indeed 1996.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 02, 2023, 07:06:50 AM",
      "body": "I'm pretty sure that all of those news pieces are aggregated from other websites as there is no way even the largest site operations can churn out that many articles in a single day. Nothing bad about that, just pointing it out.You should consider doing some SEO for your homepage, but it'll probably be extremely difficult since you'd have to rank for terms like \"bitcoin news\", \"crypto news\" and that kind of stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "May 02, 2023, 07:19:54 AM",
      "body": "Quote from: serveria.com on May 02, 2023, 06:16:12 AMThe design is ok, I'd say 6 or 7. Quote from: serveria.com on May 02, 2023, 06:16:12 AMDomain name is 10, really nice one and probably costed you a fortune. In the previous topic mentioned, Quote from: Amr85 on May 01, 2023, 08:37:13 PMwith regards to my previous topic https://bitcointalk.org/index.php?topic=5450277.0he states that he was in a bidding war up to about 600 USD. So Amr85 got the domain extremely cheap. Quote from: Amr85 on April 26, 2023, 04:48:25 PMThe auction went from $20 to about $600 where i was bidding against few people, i was willing to get it even if it got to 4 digit mark.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "May 02, 2023, 08:30:18 AM",
      "body": "Quote from: Amr85 on May 01, 2023, 08:37:13 PMHello everyone!with regards to my previous topic https://bitcointalk.org/index.php?topic=5450277.0i have turned it into a website!  you can visit my website here https://btcusa.com/What do you think of it from 1 - 10 ?   ( 1 is bad - 10 is excellent)Thanks!It actually looked really professional comparable to something a Cointelegraph I mean your website might actually be one of the crypto news websites, you've done a really great job on your website congratulation mate! I think that domain will cost a significant figure but you could easily hold that since it might actually go for a higher price because of cryptocurrency adaptation all over the world, so in the future it might even cost higher and could be an excellent investment for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "May 02, 2023, 09:12:01 AM",
      "body": "That's a brand-able name that can be pitched to top cryptocurrency firms in the USA, they'll get interested in buying the domain name. I'd say that the site, despite its age lacks some backlinks, now that its a blog, you can work on that to add more value to the name and also help in convincing buyers to bid for the name. Hence, such name won't be difficult to rank if the right contents and SEO is implemented on it. To stand out, that's if you wish to run the site for longer period, the theme on the site is not unique, though fine as other crypto news site. I'd recommend you use a simple responsive theme or template that'll fit on mobile version. Because such themes like the one you have won't keep people to read for longer time before they leave your site; it could cause Pogo sticking, and it's bad for the growth of your site. Look around themeforest, they've got nice templates that'll make you stand out in this niche.However, how is the domain business moving? I've been off the business since 2016 when scammers started creeping into Flippa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "May 02, 2023, 09:14:33 AM",
      "body": "You may wanna tone down the ads. Every time I scroll down in an article using my phone, I see ads... I was able reduce it with ublock origin but not everyone uses that. Ads are OK but too many could annoy some readers off.I noticed the articles are copy-pasted from other news publishers as well - with sources mentioned. I can't speak for others but, I would prefer a news outlet with original content. If you like scraping information, perhaps a news aggregator would be a better fit for you e.g. cryptopanic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "May 02, 2023, 09:31:49 AM",
      "body": "I saw two spaces for Real time update and I think that you can eliminate one, keep only one is enough.Then you can use that space for re-organize your website better. The current design is not good enough for different categories of news like Bitcoin news, Ethereum news, Mining news, Trading etc.I would prefer to see you re-organize it better than the current version which looks to mix some categories and I can not clearly see them on your website. You can reorganize it horizontally category by category rather than the current design in columns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amr85",
      "created_time": "May 02, 2023, 08:21:54 PM",
      "body": "Thanks for all the feedback & for the kind words! I am happy that most people rate it at '7'!  I will work on few things from the suggestions, mainly:1) improve SEO & ranking.2) invite famous authors to write articles 'exclusively' for the site! and maybe reward them in someway, maybe i will leave this to another thread.few were asking how much i got the domain for, it was an expired auction on namesilo got it for ~$600 with the renewal, i am using namecheap hosting which is a great value for the money. i know the name 'BTCUSA.com sounds more like an exchange, but as i have stated earlier starting an exchange is by far bigger than me   hence why i tuned it into a crypto news website.if anyone got a private suggestion/request/enquire please email me at: hello@btcusa.comThanks again for the kind words,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}