{
  "id": "topic_5462201",
  "title": "pumppattern",
  "author": "pumppattern",
  "created_time": "August 05, 2023, 06:43:21 PM",
  "content": "Hi all, I'm new here.I have created something original that I would like to share. It's called the bitcoin cycle calculator.How it works:a) First, input a cycle length from peak-to-peak (use charts.coinmetrics.io, log format)b) The calculator determines the next cycle length based on a spiral key indexed to the number Pi. c) Finally, compare Calculator to Actual to measure validity. See code below.Calculator:https://docs.google.com/spreadsheets/d/1-1kzvj8PKT_y2hGaJE0YMMBlwbmKKekb/edit?usp=sharing&ouid=109498811292848585307&rtpof=true&sd=trueCharts:https://drive.google.com/file/d/1FX_DA0MJMZ6YeJUxwntiZdqitpmASAHQ/view?usp=sharingCode:115/1*1/2*3   670/4*2/3*1   115/1*3/2*4   670/4*4/3*1   238/1*5/4*1   238/1*5/4*3   238/1*5/4*1   1470/5*6/5*4   1470/5*6/5*1   1470/5*6/5*4        Lime        Orange          Blue         Brown           Red        Purple        Yellow    Turquoise       Pink           Green         172.5d        111.7d        690.0d        223.3d        297.5d        892.5d        297.5d      1411.2d     352.8d         1411.2d            Actual        Actual        Actual        Actual        Actual        Actual        Actual         Actual        Actual          Actual              209d    115d          670d          238d      304d      879d   287d         1422d       365d        tbd        Lime     Brown          Yellow       Green7/18/2010 -> 2/12/2011. 209 days.   4/10/2013 -> 12/4/2013. 238 days.     3/4/2017 -> 12/16/2017. 287 days.     11/10/2022 -> 9/21/2026.     Orange         Red                   Turquoise2/13/2011 -> 6/8/2011. 115 days.    12/5/2013 -> 10/5/2014. 304 days.  12/17/2017 -> 11/8/2021. 1422 days.           Blue         Purple          Pink6/9/2011 -> 4/9/2013. 670 days.     10/6/2014 -> 3/3/2017. 879 days.     11/9/2021 -> 11/9/2022. 365 days. Here are the cycles, color-coded with their respective formula.Chart1https://cdn.nostr.build/i/1e32f5462df91c59637da7773fdc48d42337e88d81dc1779c56c72babdcf4095.jpgChart2https://cdn.nostr.build/i/1c926cb6ad37f6767e65c1b7a9c5e4f557eaeec002bf0276905036b0c1979a42.jpgUse the outward spiral key, which is a representation of the number Pi. Divide the spiral into 10 sections, each 36°.  a) align the start of the lime green section at r=1, end at r=2.b) align the start of the orange section at r=2, end at r=3.c) align the start of the blue section at r=3, end at r=4. Continue for the brown cycle.d) the formula changes slightly starting at the red cycle. The spiral now has a bottom boundary that has a thickness.e) the thickness shrinks when encountering a previous pump from a past cycle. f) shrinking in thickness marks mid-cycle boundaries that are tops or lows.Once understood, the pattern becomes obvious. Feel free to leave a comment if you found this valuable. Thanks for reading!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462201",
  "comments": [
    {
      "author": "dimonstration",
      "created_time": "August 05, 2023, 07:21:46 PM",
      "body": "The thing is Bitcoin cycle is independent to the previous cycle because the event and circumstances makes every cycle unique and unpredictable using calculations. Your calculations is based on the chart of previous data and just projectting the future cycle based on how previous cycle form while fundamentals play an important role that affects the price behavior of Bitcoin. Your idea is good and I might give it a shot just to have a base for the current cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 05, 2023, 07:59:34 PM",
      "body": "Hmm, the cyclical analysis doesn't guarantee any type of exact information related to the market price or rally, it just presents how the rally can go all the way long in the longer time frame. So it doesn't matter whether you calculate or not the market will always stay dependent on the timeline of market developments for now the market is fully dependent on the news of ETF approval from the SEC and some other factors as well.In short, as you cant predict anything related to the market movement you can just have an idea of the long-run behavior on the basis of fundamental analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "August 06, 2023, 03:16:13 AM",
      "body": "Pi Cycle Top indicator and the Fear and Greed index charts are very useful. If you search on Trading view, you will find Pi Cycle Bottom indicator too.Compare bull markets and Cycle repeat are other useful charts.After years in this volatile and unpredictable market, I focus more on fundamental charts with historic cycles and market psychological cycle. I don't use too many technical indicators and charts and avoid to make predictions which are all inaccurate and useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 06, 2023, 08:09:44 AM",
      "body": "Quote from: dimonstration on August 05, 2023, 07:21:46 PMThe thing is Bitcoin cycle is independent to the previous cycle because the event and circumstances makes every cycle unique and unpredictable using calculations. Quote from: Hamza2424 on August 05, 2023, 07:59:34 PMHmm, the cyclical analysis doesn't guarantee any type of exact information related to the market price or rally, it just presents how the rally can go all the way long in the longer time frame. I agree. I would not want to disappoint the OP too much but I am not confident that the tool will help us too much, predictively speaking. Quote from: tbct_mt2 on August 06, 2023, 03:16:13 AMAfter years in this volatile and unpredictable market, I focus more on fundamental charts with historic cycles and market psychological cycle. I don't use too many technical indicators and charts and avoid to make predictions which are all inaccurate and useless.Same here. I couldn't have said it better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "August 06, 2023, 08:14:34 AM",
      "body": "If I understood it correctly, upon checking the Google Sheet, you're basing it on pi, right? And you are saying that 3.03% complete means on the numbers of pi or the possible time where Bitcoin is mined at the end? I'm curious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "August 06, 2023, 09:17:41 AM",
      "body": "Quote from: dimonstration on August 05, 2023, 07:21:46 PMThe thing is Bitcoin cycle is independent to the previous cycle because the event and circumstances makes every cycle unique and unpredictable using calculations. Your calculations is based on the chart of previous data and just projectting the future cycle based on how previous cycle form while fundamentals play an important role that affects the price behavior of Bitcoin. Your idea is good and I might give it a shot just to have a base for the current cycle.Not sure about the calculator mentioned in OP but I think BTC price chart shows us some patterns which are repeated.If we observe carefully then we can surely find a pattern. After every BTC halving the price of bitcoin has increased.This shows that the cycle of accumulation and then a pump is repeated near every BTC halving and we can use this to gain decent profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "August 06, 2023, 11:34:59 AM",
      "body": "Quote from: pawanjain on August 06, 2023, 09:17:41 AMThis shows that the cycle of accumulation and then a pump is repeated near every BTC halving and we can use this to gain decent profits.If so, prove it by trading specifically on signals generated from this charting. Use the formula OP provided, suggest an entry price and exit point (time plus value). I know you won't, don't worry lol Just saying it's easy to say, less easy to validate with actual trade in real time.I like the idea, but I don't like the expected outcome. Still long term game of dca is the only thing I like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}