{
  "id": "topic_5456429",
  "title": "darkangel11",
  "author": "darkangel11",
  "created_time": "June 15, 2023, 11:03:00 AM",
  "content": "As the name of the topic says, everybody wanted decoupling from stocks a few years back, because the general trend was that Wall Street is manipulating the price. Here's what we're working with now. S&PNASDAQBTCThat said, I'm sure the price of bitcoin is being manipulated right now and there's something big going on behind the scenes with the SEC attacking exchanges in the US, while at the same time China inviting Coinbase to Hong Kong. The SEC setting up its stooge in the form of Prometheum that is the only company that was allowed a \"special purpose broker\" status by the SEC, despite the company having 20% Chinese capital and not offering any bitcoin or ETH trading. It looks like the SEC is trying to force already existing exchanges to delist altcoins and then all those will be listed by their special broker that has close ties with China. A lot of hands seem to be reaching for your coins at the moment. I can already feel the pre-halving pressure building up",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456429",
  "comments": [
    {
      "author": "dragonvslinux",
      "created_time": "June 15, 2023, 04:21:44 PM",
      "body": "Quote from: darkangel11 on June 15, 2023, 11:03:00 AMThat said, I'm sure the price of bitcoin is being manipulated right now and there's something big going on behind the scenes with the SEC attacking exchanges in the US, while at the same time China inviting Coinbase to Hong Kong.I'm not convinced price is being manipulated. Unlike the S&P/Nasdaq that has risen 20-40% from it's lows, Bitcoin went up 100%, so it seems reasonable for price to cool off after that with speculators taking profits. If anything there is an argument for stock markets being manipulated, but to me it just seems like a strong recovery after the lack of recession or a general depression, like is usually seen in these markets.But I do like to see the correlation breaking, even if it's not in the direction people would like to see. Mainly because at some point these stocks will also need to cool off, and potentially this will increase liquidity into Bitcoin if it remains cheap. I also don't see much high-volume selling in Bitcoin market right now, just casual profit taking / re-balancing of bullish allocations. Slow and steady wins the race.In summary a -20% correction over the past 2 months after a 100% increase within around 4 months, sounds totally reasonable to me, even if -25% seems more likely to me. If anything there is more of an argument for bullish manipulation that is propping up the price for so long without a more significant/volatile correction that we normally see in Bitcoin, but instead I think this is just due to DCA style investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 16, 2023, 04:29:43 AM",
      "body": "One thing to keep in mind is this. Even though the index are rising doesn’t mean all stocks are rising. It’s mostly stocks like Nvidia, Apple, MSFT, ORCL, etc. Most are tech stocks. And most reasons are due to AI.Bitcoin can’t really do anything AI related and hence why it’s not appreciating like the others. Plus there is also this mess with the SEC which is not helping. Also along with all the hacks that have happened this month. Hence why many are bearish on crypto at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 16, 2023, 02:48:39 PM",
      "body": "I think this isn't all that interesting considering it has happened before as well if I am not wrong. I cannot remember when it was exactly but it could be sometime during 2017 or something if I am not wrong.The problem is not that bitcoin went down while markets were up, that's still fine, it's the idea that it shouldn't be moving together, I am fine with it being bad for bitcoin as long as it can also be good for bitcoin in the future, if we see markets go down while bitcoin goes up, I would be fine accepting this as well. We have been running parallels for so long that it never made sense to me, and this version is a lot better, it's not about being reverse of each other instead of parallels, it's about not having any connection together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 16, 2023, 06:37:47 PM",
      "body": "I didn't want decoupling, not yet anyway. Still waiting for the super crash of everything to happen -- you know, global recession, the new era of troubles, and all that.It's not that I wish the world to collapse, the system of finance and banking and debt already are in all honesty, I was waiting for the banks and governments to break (to inevitably get on the path of recovery). Because it's really hard on regular people all over the world already. A reset I thought was pending, and Bitcoin would surely have followed in their wake, only if temporarily.That would have provided one hell of a buying opportunity...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 16, 2023, 07:49:55 PM",
      "body": "Bitcoin will recover, it already has somewhat as I type this. The price has recovered from Binance & Coinbase FUD to $26,370. We are still just ranging between $25,000 & $29,000. Resistances & support levels still present. Talking about decoupling, I will guarantee that bitcoin outperforms stocks over the next 2.5 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "June 16, 2023, 08:54:22 PM",
      "body": "Or maybe this is just instance that we have seen the decoupling, but yet the data is still fairly young to say that yeah, finally here is it. I think the manipulation happened with the price suddenly went above $27,000 after the Binance news.But after that we have seen a lot of profit talking, following the spike, the prices suddenly went down below $25,000 at some point.Now we are back above the support level and I think should be the right price, the effect on the SEC vs Binance drama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "June 16, 2023, 10:26:39 PM",
      "body": "Quote from: darkangel11 on June 15, 2023, 11:03:00 AMAs the name of the topic says, everybody wanted decoupling from stocks a few years backYeeeah, but not like this  This is not the direction everyone was hoping for. But who knows, maybe it could work too. If investors worldwide stop perceiving BTC as being correlated with stock markets, maybe it'll be easier to break away the other way around in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 17, 2023, 08:42:24 AM",
      "body": "The attempt to find a link between the stock market and Bitcoin started several months ago, and I still see that some believe in this theory. The fundamental difference between these markets makes things that affect Bitcoin may not affect S & P / Nasdaq stocks, and vice versa, as after BlackRock signed with Coinbase is bound to move this platform to Hong Kong.we have several months of rises, and a correction must occur, especially since we are in the middle of the year, where people tend to withdraw their investments and avoid high-risk investments. you always find the performance of the second quarter in Bitcoin slow compared to the rest of the quarters.That we're still over $25,000 is good news in itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 17, 2023, 09:11:07 AM",
      "body": "I think what we saw was more of a news event with the SEC taking action against Bitcoin exchanges. I wouldn’t say that’s enough to call this a decoupling. The real decoupling we want to see will be when the stock market heads south from the recession and the Bitcoin price shoots up after the halving. Still a ways out though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 17, 2023, 10:18:06 AM",
      "body": "Quote from: OgNasty on June 17, 2023, 09:11:07 AMI think what we saw was more of a news event with the SEC taking action against Bitcoin exchanges. I wouldn’t say that’s enough to call this a decoupling. The real decoupling we want to see will be when the stock market heads south from the recession and the Bitcoin price shoots up after the halving. Still a ways out though. You're right, it just one of those single occurrence that we have seen so far. And so it's obvious that they will have a deviation path as the attack by SEC is on Binance, hence it went down, while S&P/Nasdaq grow. And maybe one reason is that those investors who sold their crypto might have been going on other assets. But it's just for temporary change if I'm not mistaken. Sooner or later they will go back to bitcoin and other crypto because they know that there is a good chance to have a better profits than stocks in the next coming years specially after the halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "June 17, 2023, 10:19:39 AM",
      "body": "There is no decoupling, the same way there is no coupling. You can only say that in short periods of time. If you look at the big picture, there is none.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "June 17, 2023, 12:31:02 PM",
      "body": "Quote from: Cuenta Alternativa on June 17, 2023, 10:19:39 AMThere is no decoupling, the same way there is no coupling. You can only say that in short periods of time. If you look at the big picture, there is none.Depends on how you want to look at things (i.e. take into account crypto volatility or not) and choosing a period to analyze is judgmental. The main reason people considered BTC to be coupled with stock markets is that in recent years (say from around 2017 onwards), the price of both reacted in similar ways to changes in the market's conditions. And the initial expectation for Bitcoin was to be a hedge against inflation, so the negative correlation was expected, which was not really the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "June 17, 2023, 01:19:28 PM",
      "body": "Quote from: darkangel11 on June 15, 2023, 11:03:00 AMThat said, I'm sure the price of bitcoin is being manipulated right now and there's something big going on behind the scenes with the SEC attacking exchanges in the US, while at the same time China inviting Coinbase to Hong Kong. The SEC setting up its stooge in the form of Prometheum that is the only company that was allowed a \"special purpose broker\" status by the SEC, despite the company having 20% Chinese capital and not offering any bitcoin or ETH trading. It looks like the SEC is trying to force already existing exchanges to delist altcoins and then all those will be listed by their special broker that has close ties with China. A lot of hands seem to be reaching for your coins at the moment. I can already feel the pre-halving pressure building up They don't hesitate to do so. They are constantly trying to manipulate the market. But many people like you and me, we don't eat these tricks. We will continue to hold. Of course, we still have to be careful, but these events do not seem like a coincidence to me when we are so close to the halving.Quote from: DeathAngel on June 16, 2023, 07:49:55 PMBitcoin will recover, it already has somewhat as I type this. The price has recovered from Binance & Coinbase FUD to $26,370. We are still just ranging between $25,000 & $29,000. Resistances & support levels still present. Talking about decoupling, I will guarantee that bitcoin outperforms stocks over the next 2.5 years.There is nothing bad as mentioned on social media. As you said, support and resistance are still at a good level. They love to write bad scenarios when Bitcoin drops 1k-2k.It may take a little longer than 2.5 years. I hope I'm wrong, but I think so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "June 17, 2023, 01:50:21 PM",
      "body": "Quote from: darkangel11 on June 15, 2023, 11:03:00 AMThat said, I'm sure the price of bitcoin is being manipulated right now and there's something big going on behind the scenes with the SEC attacking exchanges in the US, while at the same time China inviting Coinbase to Hong Kong....With a market that is not regulated, not controlled by anyone, and a very small cap. For a long time, I have never believed that cryptocurrencies or bitcoin operate according to supply and demand, the market is always manipulated. I always wonder, if the market is not manipulated, why is there no crash during the bull season, and all the news is positive? But when the bear season comes, there will be black swans and negative news to pull the price down as low as possible. It's clear that there is blatant manipulation going on, not just a coincidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "June 17, 2023, 06:42:11 PM",
      "body": "Quote from: pawel7777 on June 17, 2023, 12:31:02 PMDepends on how you want to look at things (i.e. take into account crypto volatility or not) and choosing a period to analyze is judgmental. The main reason people considered BTC to be coupled with stock markets is that in recent years (say from around 2017 onwards), the price of both reacted in similar ways to changes in the market's conditions. Well, taking time periods to compare two series of events can lead to arbitrary correlations:Nick Cage Movies Vs. Drownings, and More Strange (but Spurious) CorrelationsQuote from: pawel7777 on June 17, 2023, 12:31:02 PMAnd the initial expectation for Bitcoin was to be a hedge against inflation, so the negative correlation was expected, which was not really the case.Bitcoin is the best hedge against inflation - has any major asset given a better return since 2009? It not only protects against inflation but outperforms it with a much higher return in terms of the strongest fiat currencies, let alone compared to currencies of countries such as Venezuela or Argentina. Of course, there will always be those who bought at the peak of the bull market and sold because they shit their trousers when the market started to fall, but every inflation hedge has ups and downs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "June 18, 2023, 10:31:49 PMLast edit: June 19, 2023, 09:12:16 PM by pawel7777",
      "body": "Quote from: Cuenta Alternativa on June 17, 2023, 06:42:11 PMWell, taking time periods to compare two series of events can lead to arbitrary correlations:Nick Cage Movies Vs. Drownings, and More Strange (but Spurious) CorrelationsThe article is hidden behind paywall, but I get your point. The fact that there are some accidental correlations is not a reason to dismiss all of them though.Quote from: Cuenta Alternativa on June 17, 2023, 06:42:11 PMBitcoin is the best hedge against inflation - has any major asset given a better return since 2009? It not only protects against inflation but outperforms it with a much higher return in terms of the strongest fiat currencies, let alone compared to currencies of countries such as Venezuela or Argentina. Of course, there will always be those who bought at the peak of the bull market and sold because they shit their trousers when the market started to fall, but every inflation hedge has ups and downs. I can't agree with this. Sure it performed great when you take the entry price of zero (or sub 1 USD) in 2009, But someone who bought in say 2 years ago and is witnessing BTC trading at a much lower nominal price (not to mention the real value, i.e adjusted for inflation), would probably disagree, even if they haven't \"shat their trousers\" and are still holding (\"you only lose if you sell\" is a joke).To say something is a great hedge against inflation, you'd expect there to be a positive correlation: the higher the inflation rate - the higher the price. Is this the case for Bitcoin?And why do you want to compare it only to \"major assets\", was BTC a major asset in 2009?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "June 19, 2023, 03:42:58 AM",
      "body": "I can also feel that there's this pre-halving pressure amidst this seemingly bearish market. This is the reason why I'm not at all bothered by the sudden turbulences of the price. I notice that the price tends to quickly fall but it is almost as quickly followed by a rise. At this point in time, there is really no big reason to worry. Despite of the SEC's filing of lawsuit, which aren't really a threat to Bitcoin itself, the effect of the upcoming halving can't be underestimated. There are two points. One, whether we like it or not whatever the SEC is doing can't stop Bitcoin. Second, whether we like it or not the scheduled halving will take place. So to somebody who is thinking, accumulating Bitcoin is the best thing to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 19, 2023, 05:33:49 AM",
      "body": "Meh — it has always been the case that bitcoin and the SPY couples and decouples from time to time. But it doesn't change the fact that both assets move in the same direction a lot of times. Wouldn't be surprised that sooner or later bitcoin is decoupled but in the upside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 19, 2023, 06:07:21 AM",
      "body": "Quote from: darkangel11 on June 15, 2023, 11:03:00 AMAs the name of the topic says, everybody wanted decoupling from stocks a few years back,There was no coupling to be decoupled! This is also not the first time bitcoin charts look nothing like the stock market charts. The most recent one is the 110% bitcoin price rise from January to April while something like S&P only went up about 3% and something like NASDAQ got dumped -13%.The oldest one was also a few years back, the same time people were talking about \"correlation\" was when bitcoin started shooting to the moon from $3k bottom while the stock market continued dumping during the COVID19 Pandemic.Quotebecause the general trend was that Wall Street is manipulating the price. The actual trend was bitcoin market manipulators were manipulating the price by convincing weak hands that whenever US stock market dumps they should also panic sell their bitcoins. Which they succeeded in a lot of occasions to cause panic sell each time US stock market dumped over the past couple of years!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}