{
  "id": "topic_5407651",
  "title": "MrDave",
  "author": "MrDave",
  "created_time": "July 26, 2022, 09:07:08 AM",
  "content": "So, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETH",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407651",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "July 26, 2022, 09:51:25 AM",
      "body": "Bitcoin is always my first choice, it’s the most reputable & highly adopted coin. Eth is a good coin too but I’m a little nervous about the merge. If you asked me one coin to have my whole net worth in though it’d definitely be bitcoin, all day every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrDave",
      "created_time": "July 26, 2022, 10:05:03 AM",
      "body": "Quote from: DeathAngel on July 26, 2022, 09:51:25 AMBitcoin is always my first choice, it’s the most reputable & highly adopted coin. Eth is a good coin too but I’m a little nervous about the merge. If you asked me one coin to have my whole net worth in though it’d definitely be bitcoin, all day every day.Don't you think so that the whole net worth to a specific coin is way riskier?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "July 26, 2022, 10:22:55 AM",
      "body": "Quote from: DeathAngel on July 26, 2022, 09:51:25 AMBitcoin is always my first choice, it’s the most reputable & highly adopted coin. Eth is a good coin too but I’m a little nervous about the merge. If you asked me one coin to have my whole net worth in though it’d definitely be bitcoin, all day every day.If OP is a beginner in investing then i don't see any better option than bitcoin. I'm also starting to worry about the merge, a lot of optimism for this eth upgrade, as it will solve problems like gas fees or transaction speed of the ethereum network but it makes eth lose its decentralization. The worst thing about the POS algorithmic mechanism is that most of it will be held by sharks and exchanges. This is pretty common with altcoins these days, only eth is not. This is also one of the things that makes eth more special than the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 26, 2022, 10:25:29 AM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHBTC obviously.It is the first crypto which has the most adoption. You simply can't find an exchange or a casino which don't accept bitcoin. If you have a crypto based business, then one way or another, you accept bitcoin.ETH would take the second spot for the same reasons mostly.The rest are just noise. BCH, AXS, EOS these are shitcoins that are going to die maybe not tomorrow but later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "July 26, 2022, 10:34:25 AM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHUltimate choice - Bitcoin. But if I'll be choosing the coins I'd like to hold from that list, they'll be:BTCETHAXSThat three would suffice that portfolio of mine if I'll be building a new one. However for the newbies, it's always the best idea and strategy to stay with bitcoin with your hard earned money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "July 26, 2022, 11:07:00 AM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHI will go for the BTC and ETH.The reason is very simple. The marketcap of the coins are very large, so definitely the price will grow if I buy when the prices are down.Also these coins are limited in supply, so as the time passes the demand of the coins will increase, and as these are limited amount of supply, then definitely the price will rise.Yes I need to just wait and hold for a little bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 26, 2022, 11:10:43 AM",
      "body": "Bitcoin. It hasn't really failed most people, only weak hands which pretty much jumped the hype and didn't really wait failed. The profit gains wouldn't be as much as it was in the past, but compared to others, it's a much safer option without the contribution of any centralized group. As for another option, I'd go for ETH but only as an alternative, but you might want to wait for the upgrade to see if it goes all as planned or not. You can risk it though if you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "July 26, 2022, 11:33:43 AM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AM BCH, AXS, EOS, BTC, ETHWithout a doubt and not having a few things to worry about, I think everyone knows Bitcoin is the only one that you don't need to do research on, even a beginner can progress quickly in terms of Bitcoin ownership. Whereas ETH is only to accumulate portfolio value in order to add more Bitcoin. In conclusion, I have no suggestions on other coins to guarantee huge profits in today's volatile market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "July 26, 2022, 11:43:35 AM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHI prefer ETH (etherum), because in my opinion, etherum is a smart contract from a variety of altcoins and that could be one of the factors supporting the price of etherum. in addition, etherum updates more often too and that allows for a better future of etherum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 26, 2022, 12:16:12 PM",
      "body": "You are posting on the Bitcointalk forum, so most of us are Bitcoin fans here so far. Definitely, I choose and prefer Bitcoin for holding, if need altcoin then we may go with ETH or BNB. There are many reasons behind that, first is decentralization. Bitcoin is truly decentralized and doesn't have security issues if you are holding your wallet (not an exchange wallet). An altcoin is highly risky because it would come to zero. We have seen the LUNA scam and how they make us fool actually. So believe in Bitcoin only, may trade with few good alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "July 26, 2022, 12:23:49 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHi would prefer BTC and ETH. the reason i chose these two coins is that bitcoin has been known since 2009 and i firmly believe that the world already knows that digital money can be stored and generate profits in the future. on the other hand, bitcoin's track record has been recognized by several countries as a good digital investment asset.and the reason i chose ethereum is because i firmly believe that ethereum in the future will have the same position as bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 26, 2022, 12:35:11 PM",
      "body": "Of course Bitcoin will by my ultimate choice, the 2nd coin would be Ethereum, this duo will always be the majority of my portfolio. I used to keep some EOS too, but since the bear market earlier this year, I have sold all of them. BCH and AXS was never on my list, I think you should add BNB to the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "July 26, 2022, 12:36:59 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHEasy, BTC, and ETH obviously. I mean those are prime movers right? While AXS? hmm, we've seen it's kinda hype during the bull run, same with EOS. For BCH? we all know that any fork coin by BTC is not going to succeed and we have told this since 2017. So I guess I'm old and traditional crypto investor that's why I like those 2 cryptos. Although the price is really high, but I would rather invest on them specially for long term rather than those projects that seems to be just hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "laurenB7742",
      "created_time": "July 26, 2022, 12:54:37 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHYou are on a bitcoin forum, so the answer is definitely bitcoin, the best coin in the crypto market. The king of the cryptocurrency industry, the most widely used and accepted coin today. Besides bitcoin, the second choice would be none other than Ether, the king of altcoins. It is recommended to only focus on the top two coins, no need to hold too many coins, just right and enough will make you rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rufsilf",
      "created_time": "July 26, 2022, 01:26:07 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHI guess you already and besides, this was been asked countless times and the result is BTC as the ultimate choice of the majority and then ETH is next. And why? Profit - people who invest seem to look for a reliable and profitable project and Bitcoin is known for it. And you know what? People had come and invested in crypto because of Bitcoin. If this is not created, I think crypto market has been died already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "July 26, 2022, 02:27:20 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHBTC and ETH is my ultimate choices for a long term investment. If I have the other coins besides of BTC and ETH, that just mean I want to make additional profit from those coins but I do not have big expectation to see those coins will give me a big profit. It is very difficult to analyze the altcoin, especially altcoin that does not have much development. So you do not have to risk yourself to have the altcoin that you do not know and only stick to BTC and ETH that will be enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ayers",
      "created_time": "July 26, 2022, 03:06:16 PM",
      "body": "after investing in many altcoins, i find that bitcoin is still the most perfect choice, a coin that can guarantee your safety as well as profitbitcoin is not like altcoins, it will not give you quick profit but it ensures the safety of your assets and you will also get huge profit as long as you hold it for a long time a long time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 26, 2022, 03:33:29 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHI immediately exclude BCH from this list, because I consider it a shitcoin, an unsuccessful clone of BTC, trying to mimic it.I don't know anything about AXS and have never been interested in it. EOS seems to me a dubious coin that gained popularity during the hype, but ceased to be interesting for many a long time ago. I expect the slow death of this project more, instead of raising the price by EOS. ETH is a good choice and probably the best among altcoins. A large user base, fame, mass character, development and a fairly high price make this crypto the most popular and in demand, which will certainly affect the price increase. BTC is number 1 and the best choice. The only decentralized cryptocurrency, the most expensive and the most famous. If currencies ever cease to exist, then BTC will be the latest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ararbermas",
      "created_time": "July 26, 2022, 03:36:13 PM",
      "body": "Quote from: MrDave on July 26, 2022, 09:07:08 AMSo, guys what will be your choice from these coins and why? Any specific reason? - BCH, AXS, EOS, BTC, ETHit still very skeptical to choose alts over bitcoin especially on this kind of situation wherein mostly didn't succeed especially if bitcoin is suffering from some factors after making progress because obviously they always failed afterwards. So i would say my ultimate choice is still bitcoin, just to good to be true..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}