{
  "id": "topic_5436702",
  "title": "Phyna4",
  "author": "Phyna4",
  "created_time": "January 25, 2023, 09:48:23 AM",
  "content": "While I was in school,  I always find excuse to avoid doing school work, I  discovered that I procrastinate a lot which caused me to perform poorly in assignments and examsI had to help myself to overcome procrastination. I learned  the importance of setting specific and attainable goals for myself,I began to use planner to schedule my time and make sure I hold myself accountable.With these strategies I was able to do my school work like reading and completing assignments at the right time. My grades improved greatly.If you are planning to invest, do it now and in the future, you will be glad you did them.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436702",
  "comments": [
    {
      "author": "Dariona",
      "created_time": "January 25, 2023, 11:17:19 AM",
      "body": "I manage to fight procrastination with the help of sports. This is the best option in my opinion. Try it too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 25, 2023, 04:43:32 PM",
      "body": "Yes, procrastination is really a dream killer, and it has killed many dreams and will still kill more if not  stopped. When you procrastinate doing something that will be beneficial to it means you haven't made up your mind to follow up that dream.Procrastination can make you remain stagnant in life and see other people climb above you, in all procrastination is an elder brother to laziness and when you refuse to do what you are meant to do at a particular point that thing remains undone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 25, 2023, 05:09:50 PM",
      "body": "Sometimes (maybe a lot) not having time to do something, simply looks like procrastination. I have found that both, procrastination and not having time, have often proven to be better. I found that I really didn't need to do lot of things that I put off for whatever reason. And the results were often a lot better than if I had done them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phyna4",
      "created_time": "January 26, 2023, 09:36:56 AM",
      "body": "Quote from: BADecker on January 25, 2023, 05:09:50 PMSometimes (maybe a lot) not having time to do something, simply looks like procrastination. I have found that both, procrastination and not having time, have often proven to be better. I found that I really didn't need to do lot of things that I put off for whatever reason. And the results were often a lot better than if I had done them. you have a valid point here however, not having time to do something is another different thing all together. Procastination is delaying or totally putting off something intentionally. That definitely won't yield a good result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "misterrtwisterr",
      "created_time": "January 26, 2023, 10:38:02 AM",
      "body": "Procrastination can sometimes help you come up with a better and faster solution for things, but most of the time it hurts your long term plans. I think it helps to have goals you're really focused on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "January 30, 2023, 06:48:34 AM",
      "body": "Procrastination is a very bad habit to have. It is beyond being lazy. From firsthand experiences procrastination does not make it any easier to get a project completed. Which does have a negative impact on the type of employee that you are. This leads to bad evaluations and can affect your salary. With knowing that it is negative there are steps that you can take to overpower this negative quality. You can start out with having a list of tasks that needs to be accomplished and making sure that those tasks are manageable, leaving yourself room for any errors. This way you can become a better employee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "geeyow",
      "created_time": "January 30, 2023, 08:24:42 AM",
      "body": "One way to beat procrastination is doing the 5-minute rule.If you are too lazy to do any task, think of doing it for just 5 minutes, commit on doing it within just 5 minutes, then, when you feel like it, extend it consecutively. By the end of the day, you will be surprised to know that you have actually done a lot of tasks by doing multiple extended 5 minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 30, 2023, 09:40:15 PM",
      "body": "If you seriously have plans and goals you want to achieve follow it up and avoid procrastination, procrastination is a destiny killer because it won't make you do what you are supposed to do at the time you are supposed to do it.Procrastination will only set you way far from your goals, so once you have a plan set a daily, weekly or monthly routine to it and keep up the energy' by so doing you will see the results coming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BariMade",
      "created_time": "January 31, 2023, 08:18:29 AM",
      "body": "We always put things off until tomorrow, which is actually an excuse. Procrastination is the most debilitating thing, and it will slowly drag down your entire life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LEbimb",
      "created_time": "January 31, 2023, 08:21:34 AM",
      "body": "Procrastination is not as simple as delaying things and not doing them. It is to express our fear of these things, which is actually our own laziness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PouJonah31",
      "created_time": "January 31, 2023, 08:24:16 AM",
      "body": "Procrastination is stealing our most precious thing, which is time. Time cannot be reversed. It is also something that many people regret but it does not help. Once some things are missed, they are really missed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarteeBernard29",
      "created_time": "February 01, 2023, 07:23:28 AM",
      "body": "Procrastination is actually related to self-discipline. When you are self-disciplined enough and have the will to complete what you should do, this will bring you one step closer to success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "February 01, 2023, 01:28:26 PM",
      "body": "I’ve done well in life but I didn’t listen much at school. I knew that most of the things taught aren’t relevant in the real world. Once you get past about 14 year old math & English, it’s pointless trash that you get taught. My advice would be to pick a subject or a trade & put everything you have into that. You don’t need to be working hard in French class or music if you have no interest or desire to pursue a career in those fields.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KateReed25",
      "created_time": "February 01, 2023, 03:49:28 PM",
      "body": "These are the right words! I see how the world is changing and how I stand still. Thank God I have a desire to do something and grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ashuran",
      "created_time": "February 01, 2023, 06:10:22 PM",
      "body": "procrastination is caused by lifestyle, you need to change it then it will pass, not otherwise",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 06, 2023, 02:20:47 PM",
      "body": "Procrastination means that you were too tired, or too scared, to do it in the first place. Or maybe that you didn't really want to do it, but got strapped into it somehow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raizok21",
      "created_time": "February 14, 2023, 10:45:26 AM",
      "body": "For some people that I know, it helps them a little in way of accomplishing tasks before the due makes them to think much faster. But, of course, it depends on the person. If you're studying for an exam, which needs a lot of focus and understanding, procrastination is a bad habit since needs to understand what you're studying instead of just memorizing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "misterrtwisterr",
      "created_time": "March 03, 2023, 09:19:52 AM",
      "body": "Procrastination is a great way to sabotage your long term goals. You might get by with your short term goals, but long term ones will suffer for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apraun Seupot",
      "created_time": "March 30, 2023, 05:59:50 AM",
      "body": "I think it's great that you were able to identify the issue and take steps to address it, like setting goals and using a planner. For me, must be intentional about how we use our time if we want to achieve success.So, it's never too early to start planning for the future and making smart financial decisions. If you're just starting out in your career or have been working for a while, investing can be a great way to build wealth and secure your future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}