{
  "id": "topic_5441409",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "February 27, 2023, 12:37:05 PM",
  "content": "I was crosschecking my messages on telegram just like I used to do every day and I came across a private message that consists of a screenshot with a different set of recovery seeds, for exodus wallet, Flux wallet, and Metamask, strange, isn't it? This sender sent me this picture only and no Hi or hello like usual, just this picture.How many of you are getting this messages? I bring this on this forum because it's nothing new to me, the motive behind this is to confuse new crypto investors that they mistakenly send you this picture. Now, if you are very greedy like how many people are, you will want to import one of these seed into a wallet, hoping you will find one or two coins in the wallets. And guess what? Such wallets always have coins in them, if they are empty how will you even think of sending ETH as gas fee into these wallets to move out the coins that's never yours? The fact here is the wallets are wired to move out any deposited amount automatically once you send ETH into the wallets.Moral lesson of the day - Why are you even trying to claim what's not yours? You never hustle or work for this and you want to steal from someone else hustle, this is a very bad habit, it means if someone mistakenly send you a BTC or two you won't ever think of sending them back, there are good examples of people that return BTC mistakenly sent to them to the rightful owners, be a good example. - Do not consider yourself lucky because People don't go online displaying their seeds, even new unpopular crypto wallets will warn you the first time you try to create a new wallet, to never share your seed with anyone, so if you come across any seeds online, it is intentional, to lure Greedy people.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441409",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "February 27, 2023, 01:04:34 PM",
      "body": "Quote from: Outhue on February 27, 2023, 12:37:05 PMThe fact here is the wallets are wired to move out any deposited amount automatically once you send ETH into the wallets.To be precise, the one I noticed is for USDT on Tron blockchain, but people must be very sensitive to avoid this type of scam because there can be other ways too, maybe like using automated bot to send the coin to another (but an attack's) address. As for the USDT on Tron blockchain, we have discussed this on this forum before very well when the scam was very new and common, we later found out that it is possible to use USDT on Tron blockchain in a way that the Tron wallet is having two seed phrase (or private keys)The first seed phrase can be used for the recovery of the walletThe second seed phrase can be used as a watch-only wallet and can not be used for spending the coin, but can be used to see the wallet balance and addresses. Because of this, the attackers only send the watch-only wallet seed phrase to the victim and keep the seed phrase that he can use to spend the coins to himself. If the victim sees it, he can import the seed phrase or check on blockchain explorer to find out that there is huge amount of money on the wallet and he can import it. He needs tron for the fee to move to USDT from the wallet, but the wallet will have no Tron. Because of that, the victim will send Tron to the wallet inorder to spend the USDT but not able to. The Tron sent can be spent by the attacker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "February 27, 2023, 01:33:12 PM",
      "body": "OHH dammn what a crazy way to scam new users haha, I am shocked this is what happens when you are new on the field (Leg Pushing). Op thanks for sharing this information I found it really new to me because I am not using telegram regularly as I use to ignore the DMs. But I was thinking how is it possible when you see the wallet has some value in them in terms of coins why they don't even check if the token is legit or not there are very simple ways to check if the contract of the token is normal or suspicious. Maximum time the valued token on such wallets are trade locked, as their demand high fees for token unlock and never unlock them because this is the way they scam new users to be careful with the tokens on Hot Wallets.I would like to suggest new users must check the contract before they buy or sell any such kind of token in their wallet a simple way is to check the contract address on the Token Sniffer. Normally you can check the contract details from the chain explorer as well, just goto chain explorer and verify the contract. https://tokensniffer.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "February 27, 2023, 02:17:38 PM",
      "body": "This is a known scam. Most times the person sending the private key will ask you to assist them in moving their coins claiming that they don't have any idea on how to do it themselves and afterwards provide you with the private key to the wallet. The reason why they do this is to try to trap those with greedy mindsets, those that are looking for how to steal money they didn't work hard to get. When you finally import the wallet you'll be asked for add some gas fee and as soon as you add Tron to the wallet it will be moved automatically to another wallet. I believe that Tron can allow multisig so even if youre possession of one of the account that's need to sign the transaction you still won't be able to send anything away from that wallet. Most times when I receive messages like this I immediately report them to telegram so that their account can be suspended or restricted from sending messages to non mutual contact that way it will help slow down their activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "February 27, 2023, 03:22:22 PM",
      "body": "Quote from: Charles-Tim on February 27, 2023, 01:04:34 PMQuote from: Outhue on February 27, 2023, 12:37:05 PMThe fact here is the wallets are wired to move out any deposited amount automatically once you send ETH into the wallets.To be precise, the one I noticed is for USDT on Tron blockchain, but people must be very sensitive to avoid this type of scam because there can be other ways too, maybe like using automated bot to send the coin to another (but an attack's) address. As for the USDT on Tron blockchain, we have discussed this on this forum before very well when the scam was very new and common, we later found out that it is possible to use USDT on Tron blockchain in a way that the Tron wallet is having two seed phrase (or private keys)The first seed phrase can be used for the recovery of the walletThe second seed phrase can be used as a watch-only wallet and can not be used for spending the coin, but can be used to see the wallet balance and addresses. Didn't know that at all. I always thought scammers create a fake token with the same name to trick the newbies who even don't know there's something called a contract address when we are using a token. I was a target of the scammer but never bothered to look at their image once I see something little like this. But I have heard this that scammer create fake token and set automated tools which move all the tron(for USDT), ETH or other coin into their own address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "February 27, 2023, 03:29:21 PM",
      "body": "There's a way you can avoid yourself from getting such from people like that, watch the groups you join on social media, avoid leaving your contact details open online, don't read or take action on any mail or chat response received from unknown persons, dont even download their image or click the link they sent if you're not expecting anything of such, always ensure that you block and report them whenever they send you such phishing attempts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "February 27, 2023, 03:54:20 PM",
      "body": "There is nothing new in these tricks with the supposedly randomly sent seed-phrase. This is a classic deception on the manipulation of the most ordinary human greed. Greed breeds poverty, and generosity breeds wealth. It sounds absurd, but that's how it works.Vasya made the precise observation that you cannot claim what does not belong to you. Even if someone accidentally sends a real seed-phrase, then what moral right do you have to appropriate someone else's property? In general, it is naive to wait for such gifts of fate - this doesn't happen and the likelihood that this will happen is almost impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "February 27, 2023, 04:40:59 PM",
      "body": "This is an old scam, and I've listed it on my top most annoyingly dangerous crypto scam ever existed I think newbies still get jebaited from this method, as it's not a stupid scam like sending money to get 2x in return or impersonation from Vitalik's Twitter. It is seemingly technical with a private key and has some tokens in it, so the victim thinks they are smart to steal the money. This isn't for Timmy who can't even swipe a wallet and transfer tokens.Anyway, for all kinds of scams, this quote will help you: \"If it sounds too good to be true, it probably shit.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "February 27, 2023, 05:12:19 PM",
      "body": "Quote from: Outhue on February 27, 2023, 12:37:05 PMThis sender sent me this picture only and no Hi or hello like usual, just this picture.Report the pm to the moderators if someone posts it via the forum. But if you get it on telegram then ignore that user and block him forever.Remember, telegram is a scammer's paradise and you should just avoid dealing with strangers. Its main mode is to get money from you, but that method has been around for quite a while. Old practices were repeated, and they would only catch careless people.Quote from: Outhue on February 27, 2023, 12:37:05 PMMoral lesson of the day - Why are you even trying to claim what's not yours? You never hustle or work for this and you want to steal from someone else hustle, this is a very bad habit, it means if someone mistakenly send you a BTC or two you won't ever think of sending them back, there are good examples of people that return BTC mistakenly sent to them to the rightful owners, be a good example.Such is the trap. Money is what everyone wants, and getting it is not as easy as they think. But they just don't realize that is a trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "February 27, 2023, 05:29:03 PM",
      "body": "These messages are very popular on telegram, Twitter, Reddit and any other platform, where crypto related discussions are had.The important point to avoid falling for such scams is ignoring unsolicited messages, regardless of the content.If your telegram account, email or any other form of contact is not available publicly (for people to reach you), then avoid any message you get from unknown contacts, particularly if it requires some form of action from you.Don't get greedy, and in it looks to good to be true, it probably isn't true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "February 27, 2023, 05:56:00 PM",
      "body": "It's worth mentioning that a wallet containing tokens with fake (inflated) value is not the only possibility. There could also be real USDT tokens present in the wallet, but they hold no actual value. This is because Tether, being a centralized organization, has the power to freeze assets in a specific wallet via smart contract. Therefore, certain tokens may be locked, and there could be blacklisted addresses due to several reasons, such as requests from law enforcement in response to illicit activities or hacks.Such addresses are then often used for such scam attempts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "February 27, 2023, 07:07:20 PM",
      "body": "This method is old and known to most of the experienced users. Personally, I came across this type of wallet address on two occasions, one on the Ethereum network and the second on the Tron network, and by searching a little, I concluded that an address can be programmed with a smart contract that allows setting contract settings in different ways. It's different on the Tron network since the second private key can be used which only allows a watch-only wallet.Quote from: Hamza2424 on February 27, 2023, 01:33:12 PMI would like to suggest new users must check the contract before they buy or sell any such kind of token in their wallet a simple way is to check the contract address on the Token Sniffer. Normally you can check the contract details from the chain explorer as well, just go to chain explorer and verify the contract. https://tokensniffer.com/Thanks for this great suggestion. I hope everyone will be familiar with it and use it easily. But of course, unfortunately, not everyone can use this service, given that not all users are aware of the nature of smart contracts and the possibility of analyzing them. It might have been nice to have an official announcement of the site on Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "February 27, 2023, 07:47:09 PM",
      "body": "This scheme or method if that's what you prefer is very old. They let you know about the seed phrase or private key and once you access the wallet, you will see that there is a balance with it's value in dollars but once you try to deposit which it is the reason which is to sell the funds in that wallet. Once you deposited a crypto but when you try to sell the funds, you cannot sell it. If the person who did that is checking the wallet most of the time then after you deposit any amount then you will see that it is being transferred to another wallet. The best solution for that is to never deposit and ignore the message.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "February 27, 2023, 09:12:21 PM",
      "body": "I thought that this thread would remind that whoever is in profit right now, don't think that you're just lucky but an actual risk taker, believer that have went against odds and doubts of many before.But I do agree with your reminder that if it's not yours, why even take it? Greediness is at its finest with that knowing that you're aware someone doesn't owe you anything. And if a random stranger approaches you with screenshots of private keys and things, think that someone is giving away money then which is hard to believe these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "February 27, 2023, 10:10:25 PM",
      "body": "The idea of the scammer here is that the victim is going to be greedy, and once overwhelmed by avarice such victim would think they are just being lucky and are about to profit from another's mistake, but little would the victim know they are the one that's gonna be scammed.The scam is quite popular and i think anyone who has been in the crypto space for a few years must have heard of it or experienced it, thus i think the perpetrators would be hoping that their scam finds a newbie who is most likely to fall victim. Having said that, if you aren't expecting any PM, treat anyone received as a possible scam except proven otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "February 27, 2023, 10:43:09 PM",
      "body": "Hahahahaha......When someone actually got newly introduced to the technical part of Bitcoin and they came across these..... they'll be like, damnnnn, I've got someone in here that's so dumb and odd, that all they could do to expose Thier ignorance is to post images of Thier recovery phrase for whatever wallets they'd prefer?? Lol...I believe that post like this would help to prune 'em rookies NEVER to fall a victim of losing some fees to these fraudsters, all in the name of claiming what isn't rightfully theirs.These are all prepared tricked to make some funds on the net, BEWARE!Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "February 28, 2023, 02:40:15 AM",
      "body": "Quote from: Hamza2424 on February 27, 2023, 01:33:12 PMI would like to suggest new users must check the contract before they buy or sell any such kind of token in their wallet a simple way is to check the contract address on the Token Sniffer. Normally you can check the contract details from the chain explorer as well, just goto chain explorer and verify the contract. https://tokensniffer.com/They can be shit tokens with very low price on market. If those tokens are on market, at least you can trade them by trading on centralized exchanges or swap on decentralized exchanges.The worse scam is tokens that have yet been verified by coinmarketcap, coingecko and blockchain explorers. The recognized identity of those new and scam tokens are they don't have token logo.Their logo is a default logo of ERC-20 chain or Binance Smart Chain (BSC BEP-20 chain).Very most likely a few weeks or months later, you check those tokens again you will see their tokens marked as scam by Ethereum.io or Bscscan.com explorers. They will be marked as scam after community members report those scam tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "February 28, 2023, 08:19:46 AM",
      "body": "You said this isn't new to you ?Did you try inputting the seed phrase the first time you got such message? Please don't take my questions personal because I was only asking out of curiosity and I do wish to know and it really shows that this scammers and criminals are really working tirelessly to scam people of their hard earned money.I help redeem gift cards but I wasn't bothered how those cards where gotten and my attention was drawn to the fact most of those cards were gotten off scam and now I have to ask for source of card before helping to redeem them.Greed is one factor that has rather destroyed so mayo rather than build and people should learn how not to earn from where they didn't labour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "February 28, 2023, 09:11:02 AM",
      "body": "Quote from: Outhue on February 27, 2023, 12:37:05 PM...The fact here is the wallets are wired to move out any deposited amount automatically once you send ETH into the wallets.Moral lesson of the day - Why are you even trying to claim what's not yours? You never hustle or work for this and you want to steal from someone else hustle, this is a very bad habit, it means if someone mistakenly send you a BTC or two you won't ever think of sending them back, there are good examples of people that return BTC mistakenly sent to them to the rightful owners, be a good example. in the last month, I got several telegram messages from scammers a lot, and messages as OP mentioned, also came to my messages. as much as possible ignore and just delete their message because it's not profitable for you at all. there are many cases out there, where when you connect your wallet or you top up the wallet, immediately your assets in your wallet will disappear and be withdrawn by them.Quote from: Outhue on February 27, 2023, 12:37:05 PM- Do not consider yourself lucky because People don't go online displaying their seeds, even new unpopular crypto wallets will warn you the first time you try to create a new wallet, to never share your seed with anyone, so if you come across any seeds online, it is intentional, to lure Greedy people.true, they do that on purpose, they just throw the bait and the fish (victims) who are too greedy will fall into the trap. don't be too innocent in the world of the internet, even your own siblings can cheat, let alone other people we never know at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "February 28, 2023, 09:22:25 AM",
      "body": "In the past, fraud of this kind was common. In the past, I kept receiving and seeing messages and images of addresses with balance. I thought it had already subsided. Anyhow, the growth of crypto currencies continues. Since more businesses and individuals are interested, it should come as no surprise that these fraudsters will keep trying to entice newcomers to these types of schemes. Newcomers with morals will question why they are receiving coins they do not own and the answer is the address is up for grabs to the fastest to send fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}