{
  "id": "topic_5475789",
  "title": "imlosthehe",
  "author": "imlosthehe",
  "created_time": "November 28, 2023, 02:19:06 PMLast edit: November 30, 2023, 08:27:54 PM by imlosthehe",
  "content": "I´ve bought some sats from a seller I'm used to. This time, the transactions appears as \"local\" and looks like it's not done. I've tried to broadcast it but it just won't confirm. What can I do to finish it ? https://i.ibb.co/Fwqxg5V/image.pnghttps://i.ibb.co/Db9wK16/image.pngThank you ___________________SOLVED, thank you !!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475789",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "November 28, 2023, 02:24:59 PM",
      "body": "Local means that the transaction is in your wallet file, but the node you are connected to doesn't have it in its mempool.Quote from: imlosthehe on November 28, 2023, 02:19:06 PMI've tried to broadcast it but it just won't confirm. What happened when you broadcasted the transaction? Did you get any error?Unless the transaction is invalid now, it should be broadcasted to the network and its status should change to \"unconfirmed\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 28, 2023, 03:02:08 PM",
      "body": "Quote from: imlosthehe on November 28, 2023, 02:19:06 PMI´ve bought some sats from a seller I'm used to. This time, the transactions appears as \"local\" and looks like it's not done. I've tried to broadcast it but it just won't confirm. What can I do to finish it ? Contact the seller about it immediately if you're getting \"bad-txns-inputs-missingorspent\".There are wallets that will instantaneously remove a transaction that's dropped from its mempool which could lead him to spend its input to another transaction unintentionally.There also other scenarios that could lead to the same result like its parent transaction that got replaced via rbf.Since you're the receiver, better maintain your communication with the sender who's in control of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abdussamad",
      "created_time": "November 28, 2023, 03:55:19 PM",
      "body": "You can try increasing the fee to make it confirm. Right click on it and choose \"child pays for parent\". Then specify a higher fee and click on ok. In the window that pops up click on sign and then click on broadcast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 28, 2023, 04:36:40 PM",
      "body": "Quote from: Abdussamad on November 28, 2023, 03:55:19 PMRight click on it and choose \"child pays for parent\". Then specify a higher fee and click on ok. In the window that pops up click on sign and then click on broadcast. The transaction OP is talking about is \"Local\" and the \"Child pays for parent\" option wouldn't be available in the right-click menu.Assuming the transaction in question is still valid, first OP should broadcast the transaction or connect to a server that still has it in their mempool. After that, he/she would be able to do CPFP.If the transaction is no longer valid, there's nothing that can be done except contact the sender and ask him/her to make a new transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imlosthehe",
      "created_time": "November 28, 2023, 06:39:47 PM",
      "body": "Yes, I've tried to broadcast, but I get this: https://i.ibb.co/NF6jmVx/image.pngI'll contact the seller, I'll check it with him too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 28, 2023, 06:48:39 PM",
      "body": "Quote from: imlosthehe on November 28, 2023, 06:39:47 PMYes, I've tried to broadcast, but I get this: This is exactly the error mentioned by nc50lc and means that the transaction is trying to spend the coins that don't exist in UTXO set. Now, the only solution is that the sender makes a new transaction. Take note that unless you completely trust the sender, you should never accept an unconfirmed transaction. There is no guarantee that an unconfirmed transaction will be finally confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imlosthehe",
      "created_time": "November 28, 2023, 07:11:19 PM",
      "body": "Quote from: hosseinimr93 on November 28, 2023, 06:48:39 PMQuote from: imlosthehe on November 28, 2023, 06:39:47 PMYes, I've tried to broadcast, but I get this: https://i.ibb.co/NF6jmVx/image.pngThis is exactly the error mentioned by nc50lc and means that the transaction is trying to spend the coins that don't exist in UTXO set. Now, the only solution is that the sender makes a new transaction. Take note that unless you completely trust the sender, you should never accept an unconfirmed transaction. There is no guarantee that an unconfirmed transaction will be finally confirmed. Yess, exactly. I saw it, but the 360 sec limit wouldn't let me respond it. I'll send all in the same post now.hosseinimr93 and nc50lc - happened what they said. child pays for parent, indeed I don't have this option, but I thank Abdussamad anyway, thank you very much for your time and attention. hosseinimr93, It's a person that I buy regularly from him, I guess and hope we'll fix it, I'm already talking to him.  I always send the money before he sets the transactions, Our relation makes it easier to me trusting him, than expecting him do trust me. Anyway, I'll let you know later, thanks all for the help P.S. - any way to thumbs up the replies?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}