{
  "id": "topic_5450140",
  "title": "flyingcarpet",
  "author": "flyingcarpet",
  "created_time": "April 25, 2023, 04:03:00 PM",
  "content": "Hepimizin bildiği ve şikayet ettiği bir konu var. Araç bayilerinin araçları satmayıp otoparklarda beklettiği ya da ek olarak hikayeden bir çok ürün ekleyerek normal piyasanın üzerinde satmaya çalıştığını biliyoruz. Birçok vidyo var bu konuyla ilgili. Boş arazilerde ya da otoparklarda binlerce sıfır araç.Mercedes-Benz Türkiye'nin artık satışlarını online olarak yapacağı haberleri çıktı. Beliyorsunuz ki yakın zamanda Tesla Türkiye pazarına açılmış ve bu yöntemi izlemişti. Bu yöntem sizce araba piyasasını nasıl etkiler ve bayiler açısından oluşan durum hakkındaki görüşleriniz neler?Haberin ve fotoğrafın kaynağı: https://www.arabam.com/blog/danisman/mercedes-benz-online-satisa-gececek-mi/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450140",
  "comments": [
    {
      "author": "Mustang Shelby",
      "created_time": "April 25, 2023, 05:37:54 PM",
      "body": "Mantıklı olmuş bu. Türkiye’de Online satışlara geçilse de merak ettiğim şey acaba her talebe karşılık verebilecekler mi? Eğer belirli satışa izin verip, diğerlerine vermeseler galericiler alır götürür yine stoklar. Sarı siteden yine yüksek fiyata verirler ama atıyorum 1000 kişi alım istedi 1000 arabayı da gönderebilecekler mi? Asıl soru bu. Mercedes gibi köklü bir firma ile öncü olarak başlayan bu satış politikası inşallah diğer firmalara da yayılır ve bayiler adam akıllı işler yapmaya çalışır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "April 25, 2023, 05:38:49 PM",
      "body": "tesla ile bunun arasında kararsız kaldım iyisi mi bi ondan bi bundan alayım dursun kenarda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "April 25, 2023, 06:04:29 PM",
      "body": "Gayet mantıklı bir hareket, ülkede ki şark kurnazı tiplerin artık hafiften bu işlerden uzaklaştırılması gerekiyordu zaten. Araba aldığım zaman her seferinde sonuncuya denk geliyorsun nedense, ve sürekli bir şekilde tam istenen gibide olmuyor, hep bir yamuğu oluyor, en son elde kalan tırt hali falan kalıyor. 1.5 istiyosun 1.2 hali çıkıyor, siyah diyosun mavisi çıkıyor, neden? Çünkü o elinde kalmış onu kitleyecek sana. Bence bu online olayı on numara hareket, zaten hafiften teknolojiye göre bu yöne geçmemiz gerekiyordu, yapacak bir şey yok, o galericiler artık ikinci el piyasasına yönelsinler, zaten severler öyle işleri, oradan para kazansınlar kazanabiliyorlarsa. Ülkede ikinci el fiyatını sıfırın üstüne çıkardılar bir ara, nasıl? Sıfır fiyatı daha düşükte, piyasada yok, satmıyorlar, ikinci el fiyatı daha yüksek ama bulunabiliyor en azından diye bir müddet şaka maka ikinci elleri sıfırdan pahalıya okuttular bunlar, aldıkları parada şaka gibi fark, satmaay değmez, git sahibindene kendin koy, hiç satılmasa fiyatı zamanla artar değer kazanır kafaya takmaya değmez bunlara kazıklanacağına. Darısı diğer bütün firmaların başına.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "April 25, 2023, 07:57:58 PM",
      "body": "Online satışın araç piyasasını etkileyeceğini düşünmüyorum. Al sat yapan veya galericiler bayi yerine online alıma yönelecek sadece bayiden aldığı gibi rahat araç alır mı orasını bilmiyorum. Online satışı kim yönetecek mesela. Bayiler online satışta etkili olacaksa aynı hamam aynı tas devam ederiz. En iyi kısım bayinin geçirdiği ekstra aksesuarlar cam filmi, seramik kaplama vs.. şeylerin online da olmayacağı. Bunun için 50.000 tl isteyen bayi biliyorum ve insanlar bu paraları yine de veriyor mecburiyetten. Umarım ülkece araç tedarik konusunda sorun yaşamayız ve fiyatlar artık rayına oturur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "April 25, 2023, 08:41:39 PM",
      "body": "Çok çok önceden yapılması gereken bir hareket idi. Çok ama çok geç kalındığını öncelikle söyleyebilirim. Bayilere gittiğiniz zaman araba bulunmadığını ve her gittiğim seferde 2 ay sonra geleceğini belirtirken her gittiğimde yine bir sonraki 2 ay sonraya atmaları işin gülünç tarafı. Malesef ki herkes ÖTV ödememek için rapor çıkarmış ve bu yüzden bayiler arabaları direk galerilere satmayı tercih ediyorlar. Bu da doğal olarak raporlu araç alımını azalttığı gibi araba bulunmaz bir veli nimete dönüşüyor. Ee onlar da haklı çünkü galericiler araba başı 15-20K fazladan verip temiz bir şekilde çekiyor arabaları. El altından çok güzel tanıdık vasıtasıyla yardım ediyorlar. Bu sebeple bayilerin aldığı para ortadan kalkmış olacak ve araba fiyatları yavaş yavaş düşmeye başlayacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "April 25, 2023, 08:57:31 PM",
      "body": "Paranız var. Ama araba bulamıyorsunuz. Çünkü serbest piyasa denilen şey sizi kıskaca almış. Galerilerde saklanan arabalar, otoparklarda brandalarla saklanan arabalar haberlerini gördük yakın zamanda. Yeni arabaları sakladıklarında eski arabaları daha yüksek fiyattan sattılar. Tesla, Mercedes ekibini kutluyorum biraz geç kalmış olsalar da. Hiç yoksa bir daha fırsatçıların eline düşmem bu gelişmelerden sonra. Diğer araç firmaları da aynı yolu izler umarım. Gerçi izlemezlerse ürettikleri arabalar Mercedes fiyatına satılacak bazı galeriler tarafından. Markalarını korumak istiyorlarsa aynı yolu izlemeleri gerekiyor onların da.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "April 26, 2023, 06:41:54 AM",
      "body": "Quote from: flyingcarpet on April 25, 2023, 04:03:00 PMBu yöntem sizce araba piyasasını nasıl etkiler ve bayiler açısından oluşan durum hakkındaki görüşleriniz neler?Bayiler her dönem en karlı işi yaptı ve kazanacakları kadar parayı kazandılar. Bir sürü müşterileri var diye her şeyi yaptılar bugüne kadar. El altından istedikleriyle kazandıkları bile onlar için yeter ve artar. Daha fazlasını kazanmasalar onlar için bir kayıp olmaz. Mercedes Benz'in kendi satış noktalarını oluşturması iyi bir gelişme bence.Bu tür iddialar dolaşımdayken bayiliklerini sonlandırmayan firmalara da değinmek gerekiyor. Tesla'nın uygulamasından sonra bu akıma katılmaları bence çok geç kalınmış bir reaksiyon. Daha öncesinde böyle yapabilirlerdi. Şimdiye kadar neden beklediklerini anlamıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1kodumtek7",
      "created_time": "April 26, 2023, 10:43:23 AM",
      "body": "Tüm araba üreticilerinin bu yönteme geçmesi gerekiyor. Bayilerde sıfır araç kalmamış. Hepimiz galericilerle anlaşma yaptıklarını ve galeri tarafından piyasanın çok üzerine satıldıklarını biliyoruz. Online satışta hem bayi karı olmadığı için fiyat azalacak hem de marka tarafından yapıldığı için bayilerin ve galerilerin yaptığı yolsuzluklar yapılmayacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "April 26, 2023, 10:49:29 AM",
      "body": "Bu sistem bizim ülkemizde ne kadar sağlıklı ilerleyecek merak ediyorum. Piyasada sıfır araç yok, bakıyordunuz el altından galerilere aynı araçtan 100 tane gönderiliyor depoda bekletiliyor. Böyle berbat bir durum varken gidip de galeriden ya da bayiden araç alınmayacağı kesin, bu yüzden bu satış sistemi bana çok mantıklı geliyor. Ama halkımız buna alışı mı o ayrı bir konu. İnternetten ayakkabı almaya bile bu kadar geç alışmış insanların olduğu yerde böyle yenilikçi fikirlerin benimsenmesi çok zaman alacaktır",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabsav",
      "created_time": "April 26, 2023, 01:39:55 PM",
      "body": "adım gibi eminim bayiler kendileri satın alıp kendi bayılerınde 0 2. el satıcak",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "April 26, 2023, 06:41:49 PM",
      "body": "Teoride süper bir haber, pratikte bakalım ne kadar başarılı olabilecek bir haber olacak. Mercedes ile başlayan bu akıma diğer firmalar ne kadar dahil olacaklar? Benim gözümde tüm firmaların böyle bir satış yöntemi seçmesi gerekiyor. Hem aradan bayileri kaldırıp komisyonları da cebinde bırakırlar hem de Türkiye’de insanlar arabalara daha kolay ulaşır. Tabi burada da zengin galericiler bir olup Mercedes alıp, stoklayıp yarın fahiş fiyatlara insanlara ikinci el olarak satmazlarsa iyidir. Türkiye’de araç satıcılarına oldum olası güvenemedim, bir de emlakçılara. Her türlü fırıldak var bu grupta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "April 27, 2023, 08:03:30 AM",
      "body": "Şu çip sıkıntısı bir bitmedi de durumlar düzelemedi. Genel olarak otomotiv piyasası rezalet halde. Talep çok olunca bayiler işin bokunu çıkarmıştı. Yasal olarak markalar da bir şey yapamıyormuş. Kontratlarında marka genel müdürlüklerinin bayilere ceza yazması bile çok çok zormuş ve hatta imkansız olduğu durumlar varmış. Bayiler de istedikleri gibi kötü davranıyor. Araç satarken cam filmi, motor koruma vs diye normalde atıyorum 5k olan bir şeyi 50k'ya satan bile varmış. Bu ortamda otomobilin internetten satılması ve faturanın Mercedes tarafından kesilecek olması çok iyi. Acil şekilde diğer markaların da yapması gerekiyor. Yoksa biz Volkswagen bayisine gittik, satış görevlisi kadın zaten tok satıcı modunda ilgilenmek bile istemedi. Yoksa cidden alacağız yani gerçekten %100 alacaktık. 10 sene önce hatırlıyorum bayiye girdiğinizde krallar kraliçeler gibi karşılanıyordunuz. Satış yapmak için ne yıkama yağlamalar ne satış kampanyaları. Şimdi kampanyayı bırakın dediğim gibi üstüne yüklü miktarda para istiyorlar. Hatta rüşvetsiz vs satın alamıyorsunuz. Son 3 ay içinde tüm düzgün markaları yakınımızdaki 4-5 ilde denedim ama yok, adamlar tok satıcı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "April 27, 2023, 12:34:39 PM",
      "body": "Mantıklı güzel olmuş. Tesla hamlesinden sonra Mercede-Benzin Türkiye online satışına geçmesi güzel bir hamle oldu. Satış sınırlaması olursa iyi olur stokçular online satışları anında yok ederler yoksa stoklar hemen biter. Kontrollü satış yapabilirlerse bir nebze daha araç piyasası için iyi olur. Diğer araç üreticileri de ülkemizde böyle satış yapmaya geçebilir Mercedesin yaptığı hamleden sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}