{
  "id": "topic_5460366",
  "title": "Aa489313",
  "author": "Aa489313",
  "created_time": "July 19, 2023, 06:59:02 PM",
  "content": "sorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460366",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "July 19, 2023, 07:03:49 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMIs it too late to buy btc now?thank youSorry for your worries but the Answer is NO you can’t buy bitcoin. I guessed you are looking for a way to increase your 3,000USD to the 75,000USD, but bitcoin doesn’t do this. It is not a get rich quick scheme where you put in money and get an instant increase of 25x. Although bitcoin actually grows into profit but certainly that it will take years to achieve this your goal. Moreover bitcoin investment is advised to be with money you can afford to lose because its volatility also cause the market low which will could also cause you lose. Furthermore there is nothing that can give you such rise except gambling and I am sure you know how risky it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 19, 2023, 07:12:12 PM",
      "body": "Firstly i wish your brother i quick recovery soon, you have to understand how to make effective use of scale of preference in making choices on what to do base on their order of importance and a matter of urgency, if you can help your brother with the little you have with you, it could go a long way from the total sum needed for his health treatment, investing in bitcoin now is not what you can have a quick result as soon as possible, you make investment and hodl while waiting for price pump opportunity to sell out, you can always have this opportunity to invest in bitcoin at any time as long as you're ready and best reserved for such, while your brother's life is more important now to save it with your little additional money, this is a matter of life and death.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "July 19, 2023, 07:15:35 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youSorry but realistically there is no way 3000usd can give you an ROI of 75,000usd, the time frame is unrealistic and anyone promising you such returns is a scammer. This is a life and death situation and is not the right time to make a bitcoin investment. Bitcoin is a risky investment and you cannot afford to lose any money in this situation you’re in. You will have to find another means to source for the money to pay for the bills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "July 19, 2023, 07:28:07 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youThere is no guaranteed way that will assure  you 2× return in short term and obviously it's not advisible to anyone that he should invest all of his assets in Bitcoin. You may invest a particular amount of your total assets which should be hold for long term and obviously in a non custodial wallet.Basically it's too much volatile and can't be predicted surely what will happen next. It may go more down and you will lose your Principal assets. That will be more harmful to you. So practically in crypto it's impossible. You may see some ponzi scheme sites are promoting 2× return in a short term which will surely scam you. Even if you invest in any altcoins it will be more risky as it can be manipulated much easily. Never fall into a trap who offer you unbelievable returns.I wish your brother will recover soon. You may arrange funds in other ways like from your relatives or anyone else. It's totally up to you. But never be scammed when money is much more essential to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "July 19, 2023, 07:30:13 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank you Remember that you cannot invest in bitcoin an amount that you cannot afford to lose, and to think that it’s a long term investment so you cannot expect quick returns from it. So there’s no way that you’ll be investing for bitcoin with that money. Instead, if you can find additional job that will suit your skills, then go for it because it will give you additional income to earn. For now, I guess that would be my advice as investing in bitcoin cannot give you the quick profits you need for your brother’s operation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "July 19, 2023, 07:36:01 PM",
      "body": "Bitcoin does not help to raise money urgently, that will be a loan or gambling or ponzi schemes (which I will not advise you do). Bitcoin is a long term investment where you invest all at once or gradually at different times and wait patiently for it to reach a particular price.Running a GoFundMe will be a much better way to raise some money for your brother's condition or looking to take a loan.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 19, 2023, 07:40:26 PM",
      "body": "You need $75000. You have $3000If you invest in bitcoin at $30000, $3000 will turn to $75000 after bitcoin increased 25 times. $30000 multiply by 25 equals $750000. Even after the next halving, I do not think bitcoin can increase up to $200000, but your target would be $750000.Sorry. You need to look for other ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "July 19, 2023, 07:41:41 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youFirst of all, I am sorry about your brother's condition, I hope he will be given a speedy recovery. I want to say that you can't with your strategy of buying bitcoins now with $3,000 and expecting it to turn out to be what you want $75,000. Indeed, bitcoin investment has the potential to make as much profit as you say, but not in a short time. While you need the money shortly for your sibling's treatment, try to think realistically now, don't let it be because you want to save your brother but you don't think logically anymore.Indeed, your current situation is difficult, but try to think clearly, don't let your decision make the situation even more difficult in the future because your sibling's life is more important than anything else. you should use the $ 3,000 for treatment and the drawback is that you can look elsewhere, maybe this is a wise choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "July 19, 2023, 07:45:10 PM",
      "body": "Quote from: SatoPrincess on July 19, 2023, 07:15:35 PMQuote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youSorry but realistically there is no way 3000usd can give you an ROI of 75,000usd, the time frame is unrealistic and anyone promising you such returns is a scammer. This is a life and death situation and is not the right time to make a bitcoin investment. Bitcoin is a risky investment and you cannot afford to lose any money in this situation you’re in. You will have to find another means to source for the money to pay for the bills. I have to agree with this mate. Your brother needs immediate treatment for his health condition so you need more money to gain, and not to risk it in a volatile investment like bitcoin. Yes, bitcoin is a good and profitable investment but you can never rely on it on a situation like this. You have to create another means to support you on this matter, maybe you can ask some charity foundations or go find an additional job that will pay you good compensation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "July 19, 2023, 07:46:22 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youDon't dare try it, don't even give it a second thought even if the treatment is not now, health comes first before investment, you will most likely make nothing significant now with the current state of the market. I don't know any investment that you will find invest $3000 into that will make you something in a short while, anyone that promise you any profit are lying to you and may scam you, even in tbe long run, there is no a guarantee that bitcoin will give you $70,000 that you need for surgery, better find alternative way out.I also hope you have a better way to start over Bitcoin because the last time I check, Bitcoin is ban in China Dr everyone, putting your money is like jeopardizing your brother health and the authorities as well because they may one day in tbe future ask for the source of the money, I hope you find a solution to your brother and quick recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 19, 2023, 07:53:14 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youBitcoin is not a get rich quick scheme. For you to make 75k USD out of your 3k USD you would need the Bitcoin price to go to 25x higher than it is now. Thats 750000 USD/BTC. The chance of that happening within the next 5 years is very low. Perhaps withing 10-15 years, sure. But since your brother's condition is so dire, it seems like he cannot wait that long.Your best chance at getting 75k USD in a short time is either a loan or a go-fund-me.  In other words, crowdsourcing the money. But you will need to provide proof that you have a brother and that he truly has leukemia and that you do not have the money to pay for his treatment. Without that proof, nobody will send you any money.As I said, try gofundme.com and provide proofs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 19, 2023, 08:10:49 PM",
      "body": "Bitcoin is not a charity. If your brother's life depends on the price of bitcoin, then you are doing him a big harm. He may even die because of this. You should look for the other ways to gather money. Maybe you should accept donations to your bitcoin address and maybe bitcoin can help you that way but investing bitcoin to turn your $3k to $75k is a big no no in this situation. Don't do that.There is no safe way to turn $3k into $75 on earth anyway. The chances are you will lose that $3k while trying it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "July 19, 2023, 08:21:23 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youFeel sorry for the situation but just like on what others been saying on here is that it cant really be that possible for you to buy bitcoin and having the hopes that you could be able to get that 75k usd for it to be used for treatment. I know the feeling on having that kind of desperation just to save up your loved ones but its better not to risks up that 3k on something which cant really be able to solve out the problem. Have you able toreach out from your relatives or other close friends on taking up some loan or borrowing money? Basing on what you have said that you already owe 30k which its really that hard for it pile up even morebut we dont really that care. Is there some organization or government charities out there for you to seek out help? Dont tend to rely on something on crypto because everything cant really give out that kind of fast pace on earning money or having that multiple folds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "July 19, 2023, 08:21:45 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 07:59:54 PMThank you, gofundme does not support China.But China doesn't support cryptocurrencies as well. I wondered after reading your post that if there is a possibility to invest, how will you be able to do that (buy bitcoin) while you are in China?If go-fund-me can provide help then i think $3k you actually have can help you move to a near country that is supported by go-fund-me.In addition to this, as far as I know, China is a very advanced country in the social field and health care. Are there no assistance programs for those with complex medical conditions?Sorry to hear about your brother. i wish him a fast recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "July 19, 2023, 08:25:27 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank you Sorry to hear about your current problem and we only wish we could do something for you right now buddy. But as it stands today there's no way bitcoin could help you with that. Money is quick in this industry but not that quick kind sir. Plus the risks that come with investing in cryptocurrencies especially during times like this may even leave you with less money than you came up with. I would highly suggest you check if there were opportunities for your brother to avail of his insurance if he has any, or if you guys could be covered by government assistance which I believe is something that all countries have anyway. I hope for the best for you and your brother and just know that if you're telling us the truth (which I believe you do), the whole forum is with you and your brother's recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 19, 2023, 08:33:43 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youSo sorry about your brother. I hope he does get well. As other community members have said, you can't get the multiplier you need to make the target of $75,000. It would have been possible in the past if you got Bitcoin in the early days. I also wouldn't suggest any get rich scheme as you might end up losing all the money you have rather than gain anything. I wish you and your brother well. Quote from: Aa489313 on July 19, 2023, 07:59:54 PMThank you, gofundme does not support China.Gofundme was just an idea. You can look for alternatives that are available for China residents. I'm sure there are charity organizations that can cater for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 19, 2023, 08:39:45 PM",
      "body": "I'd look at fundraising sites, charities, a loan from a bank or a family member. Try everything you can, OP, because bitcoin will not help you here and don't fall for scams and shitcoins, they will only make matters worse for you. What looks like an easy way out is really a way into a dark, deep hole. Investing in bitcoin to save someone means you'll have a deadline to meet, like a month, a year, whatever. This is the easiest way to go bankrupt because bitcoin doesn't meet deadlines. It can be at new ATH post halving, or it can be at 50% of the last ATH, like it was in 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 19, 2023, 08:43:55 PM",
      "body": "investing in BTC would not magically make you earn a profit, in fact, there is even a chance that if you invested in BTC the money you invested could lose value because of the volatility of the bitcoin price. I am not sure how government officials are in China but you'd be better off asking them for help or other charity institution than investing your total asset on BTC. sorry about your brother, I hope he gets the help that he needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 19, 2023, 08:48:29 PM",
      "body": "Quote from: Aa489313 on July 19, 2023, 06:59:02 PMsorry，I come from China，The following is translated by machine ，My brother has leukemia. I have already owed  30,000 US dollars. But my brother still hasn't improved. I finally got the bone marrow last week. The doctor said it would cost about 75,000 US dollars. My total assets are about 3,000 US dollars now. If I want to treat my brother. Is it too late to buy btc now?thank youIt is not late to invest in Bitcoin because it's always the best time to buy now before the bull run comes for every cycle. But talking about saving your brother, it's not going to be enough as investing in BTC takes time and it wouldn't grow overnight just as what you are probably thinking.If you've got that total assets worth $3k and then your brother's surgery needs around $75k, you see the big difference and what you need to have. The only odds that you need to have is to see Bitcoin go around up to $750k to make that $3k of yours to become $75k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}