{
  "id": "topic_5412523",
  "title": "Bitcoin_Arena",
  "author": "Bitcoin_Arena",
  "created_time": "September 05, 2022, 10:39:17 PM",
  "content": "In what looks to be an indirect push to force traders to use their stablecoin, BUSD. Trading of assets or pairs that involve USDP, USDC and TUSD will no-longer be supported in Binance starting 26th September 2022.All those having account balances of the mentioned stablecoins will have them auto converted top BUSDQuoteFellow Binancians,In order to enhance liquidity and capital-efficiency for users, Binance is introducing BUSD Auto-Conversion for users' existing balances and new deposits of USDC, USDP and TUSD stablecoins at a 1:1 ratio. With effect from 2022-09-29 03:00 (UTC), users will trade with a consolidated BUSD balance on the Binance Platform that reflects their balances of these four stablecoins (BUSD, USDC, USDP and TUSD) post conversion.QuotePlease note that in view of this announcement, the following changes will be made.Spot:- Binance will remove and cease trading on the following spot trading pairs at 2022-09-26 03:00 (UTC): USDC/BUSD, USDC/USDT, USDP/BUSD, USDP/USDT, TUSD/BUSD, TUSD/USDT.- Binance will remove and cease trading on the following spot trading pairs at 2022-09-29 03:00 (UTC):ADA/USDC, ATOM/USDC, AUD/USDC, BCH/USDC, BNB/USDC, BTC/USDC, BTTC/USDC, EOS/USDC, ETH/USDC, LINK/USDC, LTC/USDC, SOL/USDC, TRX/USDC, WIN/USDC, XRP/USDC, ZEC/USDC, BNB/USDP, BTC/USDP, ETH/USDP, ADA/TUSD, BNB/TUSD, BTC/TUSD, ETH/TUSD, TRX/TUSD, XRP/TUSD.- Users will be able to view their USDC, USDP and TUSD balances under the BUSD denominated account balance when the conversion is complete.- All pending trade orders will be automatically removed after trading ceases in each respective trading pair. Users can then trade the assets in the respective BUSD trading pairs.Source: https://www.binance.com/en/support/announcement/e62f703604a94538a1f1bc803b2d579fDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412523",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2022, 11:13:33 PM",
      "body": "Similar thread is already existing: Binance to remove USDC as a tradable asset.But rhis can be if different discussion because of the question you asked. Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?Very possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 05, 2022, 11:23:43 PM",
      "body": "Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?I highly doubt they would do that. USDT is a major pillar of the ecossystem and most of the volume is still in USDT in most exchanges. Unless it shrinks A LOT, they won't ever remove it or that could cause some panic or put fire into the conspiracies that they are insolvent or a scam.Most traders use USDT and the remaining (specially those who don't fully trust USDT) are spread between the other stablecoins (USDC and BUSD), so it's actually smart that they did that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2022, 11:58:12 PMLast edit: September 09, 2022, 09:48:33 AM by Charles-Tim",
      "body": "Quote from: TryNinja on September 05, 2022, 11:23:43 PMI highly doubt they would do that. USDT is a major pillar of the ecossystem and most of the volume is still in USDT in most exchanges. Unless it shrinks A LOT, they won't ever remove it or that could cause some panic or put fire into the conspiracies that they are insolvent or a scam.Most traders use USDT and the remaining (specially those who don't fully trust USDT) are spread between the other stablecoins (USDC and BUSD), so it's actually smart that they did that.According to Coinmarketcap: https://coinmarketcap.com/USDT marketcap is $67.55 billionUSDC marketcap is $51.86 billion BUSD marketcap is $19.92 billionHow about USCD? It is also traded on many exchanges. If Binance can do that for USDC, it may not just want to do it at once, it can also do it for USDT. But maybe not yet because USDT is the main trading pair on Binance, but Binance is already working against that.Most traders uses USDT, but if BUSD has $44.45 billion market, mainly traded on Binance, you know what that means. Binance is not more after liquidity in my opinion, Binance is after something else which is obviously clear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 06, 2022, 12:26:27 AM",
      "body": "Quote from: Charles-Tim on September 05, 2022, 11:58:12 PMMost traders uses USDT, but if BUSD has $44.45 billion market, mainly traded on Binance, you know what that means. Binance is not more after liquidity in my opinion, Binance is after something else which is obviously clear.USDC rise is quite recent, USDT has also shrink quite a bit the last few months ($83b -> $67b). But even with an rate of 1:1.3 in their supply, USDT still has 3x the volume of BUSD on Binance (BTC pairs): https://coinranking.com/market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "September 06, 2022, 04:47:59 AM",
      "body": "Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?No unless Tether and USDT was ordered by the government to be shutdown. Binance is only trying to use a similar strategy as FTX, I reckon. In FTX all of your deposited USDC, TUSD, BUSD and USDP are called just USD in the platform, however, the exchange uses USDC is their main dollar derivative for liquidity. However, if you withdraw you can still withdraw through USDC, TUSD, BUSD and USDP. USDT in FTX is separate and still called USDT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 06, 2022, 05:25:46 AM",
      "body": "Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?That would be wishful thinking.Maybe somebody has the numbers about how much USDT is transferred in and out of Binance on a daily basis, but I have a feeling the numbers may be bigger than for fiat. And then delisting USDT would be an awfully bad business.Quote from: Charles-Tim on September 05, 2022, 11:58:12 PMAccording to Coinmarketcap: https://coinmarketcap.com/USDT marketcap is $67.55 billionUSDT marketcap is $51.86 billion BUSD marketcap is $44.45 billionThe second one is USDC, not USDT  But wasn't market cap an useless parameter to measure?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 06, 2022, 06:16:43 AM",
      "body": "According to the news, we still could deposit USDC or TUSD but it will automatically be converted to BUSD in the platform. Its like they are forcing BUSD on all traders in Binance. But then anyway, I don't see the difference if they want traders to use BUSD. How does it affects traders when they're only using BUSD or Is it for Binance market manipulation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "September 06, 2022, 06:31:56 AM",
      "body": "@bittraffic. There would be no difference. The trading pairs representing as USD will be listed as BUSD. It is similar to FTX as I mentioned already. The only difference is FTX uses USDC as their main stablecoin and listed it as USD. Howevever, you can still deposit BUSD, TUSD and USDP and it will be autoconverted to USDC.@NeuroticFish. The cryptospace was hyperdollarized by USDT. Before 2017, much of the exchanges listed their much of their altcoin trading pairs against bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 06, 2022, 07:08:25 AM",
      "body": "Quote from: bbc.reporter on September 06, 2022, 06:31:56 AM@NeuroticFish. The cryptospace was hyperdollarized by USDT. Before 2017, much of the exchanges listed their much of their altcoin trading pairs against bitcoin.You're right. This also helped to keep very low value altcoins on trade, where bitcoin 8 digits after decimal point wouldn't have suffice.Also I've checked now how many trade pairs USDT has on Binance and I was surprised - they're more than BUSD or BNB, probably more than BTC too - then it struck me: binance.com has no USD and the replacement was (and is!) USDT.So yes, we have now a much better answer to OP question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 06, 2022, 07:16:06 AMLast edit: May 14, 2023, 05:03:25 PM by Charles-Tim",
      "body": "Quote from: NeuroticFish on September 06, 2022, 05:25:46 AMThe second one is USDC, not USDT  But wasn't market cap an useless parameter to measure?It was a typo, I have changed it to USDC. Thanks. Quote from: bbc.reporter on September 06, 2022, 04:47:59 AMQuote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?No unless Tether and USDT was ordered by the government to be shutdown. Binance is only trying to use a similar strategy as FTX, I reckon. In FTX all of your deposited USDC, TUSD, BUSD and USDP are called just USD in the platform, however, the exchange uses USDC is their main dollar derivative for liquidity. However, if you withdraw you can still withdraw through USDC, TUSD, BUSD and USDP. USDT in FTX is separate and still called USDT. Check _act_ post on the second thread, We know that already, but the question is if Binance would do the same for USDT, automatically making people to depend on their stable coin, BUSD for trading on their exchange.Quote from: TryNinja on September 06, 2022, 12:26:27 AMUSDC rise is quite recent, USDT has also shrink quite a bit the last few months ($83b -> $67b). But even with an rate of 1:1.3 in their supply, USDT still has 3x the volume of BUSD on Binance (BTC pairs): https://coinranking.com/marketThis is what I found out today, not quite long. Not about the stable coins trading volume, but about the total Binance holding of the stable coins, also included how some USDC has been converted to BUSD by Binance last month. You can check it out on Cointelegraph, in the below link:https://cointelegraph.com/news/binance-no-plans-to-auto-convert-tether-though-that-may-changeQuote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?Never mind that I quote you again, but this is worth to be read:QuoteIn a statement to Cointelegraph, a Binance spokesperson confirmed there were no immediate plans to do the same to USDT, but noted that this could change, stating: “We do not have plans to auto-convert USDT to BUSD as of now, but may change.”The spokesperson also confirmed that the auto-conversion and move to cease most trading services for USDC is “not a temporary measure,” and that it “will continue.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 06, 2022, 11:11:08 AM",
      "body": "Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?If they do that, then all hell will break loose. Lots of users and programs with Binance API integration depend on USDT, and these will all break if USDT is delisted, especially when not all exchanges support BUSD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 06, 2022, 03:16:39 PM",
      "body": "Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?This was stinking shady move from binance and it could happen in future they will remove USDT or move it only to their network, but the way they are going they could even remove BTC on mainnet one day.They are obviously trying to push everything on their shit centralized bnb chain, because CZ and his friends can control, freeze and reverse any transactions there.I would not trust binance exchange for anything this days, especially when we know they are faking most of their trading volume.Quote from: NotATether on September 06, 2022, 11:11:08 AMIf they do that, then all hell will break loose. Lots of users and programs with Binance API integration depend on USDT, and these will all break if USDT is delisted, especially when not all exchanges support BUSD.This is why they are trying to force everyone else to use busd crap.It's sAfU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 06, 2022, 08:07:13 PM",
      "body": "Quote from: TryNinja on September 06, 2022, 12:26:27 AMUSDC rise is quite recent, USDT has also shrink quite a bit the last few months ($83b -> $67b). But even with an rate of 1:1.3 in their supply, USDT still has 3x the volume of BUSD on Binance (BTC pairs): https://coinranking.com/marketyes this maybe the current stat but it will change when they delist all other stablecoin pairs and have only either USDT or BUSD tading pairs for stablecoins. They are already \"censoring\" USDT trading pairs in the top gains or top losers list even when you check right now which is pretty annoying.it's quite clearly they are pushing hard for their shitcoins (BUSD and BNB)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "September 07, 2022, 12:42:32 AM",
      "body": "I just remembered this article where it said that the CEO of Circle has denied the rumors that Circle was going to collapse because it had exposure to Genesis, Blockfi, Celsius, 3 Arrows Capital and Galaxy Holdings. This is head shaking if it is true because what if Binance is converting everything to BUSD not for efficiency. What if they are doing this to avoid a bank run? Allaire’s Twitter thread came in response to a running rumor by a Twitter user, Geralt Davidson, claiming that Circle has lost billions of dollars over the years as it injected high incentives for crypto-oriented banks such as Signature and Silvergate to convert their cash deposits into USDC.In addition, USDC lendings, being exposed to troubled companies like Genesis, BlockFi, Celsius, Galaxy, and 3AC, have caused Circle at risk of a bank run as billions of USDC won’t be returned in time, Davidson added.Source https://cryptopotato.com/circle-ceo-refutes-rumor-of-usdc-collapse-due-to-exposure-to-troubled-firms/Also, this is something I have mentioned on July about USDC. https://bitcointalk.org/index.php?topic=5404884.msg60497154#msg60497154",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 07, 2022, 04:01:48 AM",
      "body": "Quote from: Bitcoin_Arena on September 05, 2022, 10:39:17 PMDo you think there will come a time when Binance will stop supporting USDT so as to continue forcing people to use BUSD on their platform?Yes, actually a big YES to that. Binance tends to monopolize. Binance is greedy. So it's just a matter of time before Binance would also kick out USDT in favor of their BUSD. But there will be conditions, of course. Binance means business and money more than anything else. So for as long as USDT is as huge as it is right now, they couldn't remove it. At this point, Binance is slowly but surely killing other competitors. It cannot do that with USDT, at least for now. It has billions in daily volume with BTC/USDT pair alone, another more than a billion with ETH/USDT, and so on. Binance needs USDT for now for the sake of revenue. The moment it weakens, Binance would definitely remove it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 08, 2022, 07:20:50 PM",
      "body": "Starting with mandatory ok KYC, trying to bump BNB, trying to be a decentralized platform, buying CMC, launching its own blockchain, and now trying to eliminate the closest competitors (USDC.)Honestly, all Binance is trying to do is monopolistic behavior, which is bad for a platform in a decentralized society.I wouldn't be surprised if they are willing to do anything to maximize their profits including start closing accounts without any obvious reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "September 10, 2022, 07:12:47 AM",
      "body": "Sounds like forced compliance or else face the wrath of big brother.  Appears Binance wants favor from the government, guess they have seen what happened to XRP, AMP, etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "September 10, 2022, 07:16:55 PM",
      "body": "Ridiculous, seems all stable coins pair will be removed expect BUSD & USDT. Since they are going to remove all stable coins, so I believe they will remove USDT as well near future to force Binance users to use BUSD. It's direct manipulation, to be honest. Of course, they are considering BUSD to make more strong as a stable coin. Holding stable coins become pretty hard nowadays after Terra's allegations. Not a good decision for users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 12, 2022, 10:41:11 PM",
      "body": "Quote from: 2stout on September 10, 2022, 07:12:47 AMSounds like forced compliance or else face the wrath of big brother.  Appears Binance wants favor from the government, guess they have seen what happened to XRP, AMP, etcIt has nothing to do with compliance lol. it's more of a way to try and remove direct competition from their exchange in favor of their stablecoinQuote from: The Cryptovator on September 10, 2022, 07:16:55 PMRidiculous, seems all stable coins pair will be removed expect BUSD & USDT. Since they are going to remove all stable coins, so I believe they will remove USDT as well near future to force Binance users to use BUSD. It's direct manipulation, to be honest. That's what I was thinking too. in the near future, they will come up with an excuse to delist USDT. Already their are signs when you use their platform. the spot and Futures trading pairs for USDT are hidden while those for BUSD are readily available. You have to look hard to get the USDT  trading pairs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}