{
  "id": "topic_5411061",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "August 24, 2022, 02:58:41 PM",
  "content": "Almanya Ekonomik Araştırma Enstitüsü (DIW) Başkanı Marcel Fratzscher Ukrayna'daki savaşın Almanya ekonomisi üzerindeki etkisinin daha yıllarca süreceğini söyledi. Ve Marcel Fratzscher: \"Bu, şirketlerin daha az yatırım yapmasına ve hepsinden önemlisi tüketicilerin daha az tüketmesine yol açıyor. Özel tüketici harcamalarında şimdiden büyük bir zayıflık görüyoruz. Bu durgunluğun maliyetleri normalden çok daha fazla omuza yayılacak. Sorun şu ki, düşük gelirli insanlara alışılmadık derecede sert vuruyor. Yüksek gelirli insanlara kıyasla enflasyonun üç ila dört katı.\" Kaynak: https://www.cnnturk.com/ekonomi/almanya-ekonomik-arastirma-enstitusu-savasin-olumsuz-etkisi-uzun-yillar-surecek",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411061",
  "comments": [
    {
      "author": "judas",
      "created_time": "August 24, 2022, 07:27:05 PM",
      "body": "Pandeminin üstüne gelen savaş ve bunun üzerine hala yaşamakta olduğumuz iklim krizi... Dünya gerçekten çok zorlu bir dönemin içerisine girmiş bulunuyor Avrupa ülkeleri bile ekonomik anlamda güçlük çekmeye başladı.Onların çektikleri güçlükler tabii bizim içerisinde bulunduğumuz durumla kıyaslanamaz ama dünya böyle bir durumdayken bizim de daha aklı selim adımlar atmamız gerektiğini düşünüyorum.Haberde de ipuçlarını bulabileceğimiz gibi bu tarz ekonomik açıdan sıkıntılı dönemlerde orta kesim tamamen yok olma tehlikesiyle karşı karşıya kalırken zengin kesim yine kendini bir şekilde olduğu yerde konumlandırabilirken fakir kesim gerçekten büyük bir buhran yaşayabiliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "August 24, 2022, 08:38:50 PM",
      "body": "Almanya, çok iyi yönetti aslında bence bu süreci. Enflasyon oranları da öyle ahım şahım değil. Buna bile çeşitli önlemler almak için hazırlanıyorlar ve bunun analizi yapılıyor. Özellikle en düşük alım gücü olan vatandaşlarını kendilerine örnek alıyorlar ki gelişmiş ülkelerin tam olarak anladığı şey bu. En düşük maaş ile geçinebilen kişilerin hayatını düzgün yaşaması gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "August 25, 2022, 10:30:20 AM",
      "body": "Almanya için beklenendi bence, Rusya ambargolara karşı doğal gaz ı kullanınca biraz sersemledi avrupa.Çok uzun yıllar süreceğini sanmam çünkü avrupa ülkeleri yeşil enerjiye geçiş yapıyolardı, bu gaz olayı işleri daha da hızlandıracak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 25, 2022, 01:30:28 PM",
      "body": "Quote from: judas on August 24, 2022, 07:27:05 PMPandeminin üstüne gelen savaş ve bunun üzerine hala yaşamakta olduğumuz iklim krizi... Dünya gerçekten çok zorlu bir dönemin içerisine girmiş bulunuyor Avrupa ülkeleri bile ekonomik anlamda güçlük çekmeye başladı.Onların çektikleri güçlükler tabii bizim içerisinde bulunduğumuz durumla kıyaslanamaz ama dünya böyle bir durumdayken bizim de daha aklı selim adımlar atmamız gerektiğini düşünüyorum.Haberde de ipuçlarını bulabileceğimiz gibi bu tarz ekonomik açıdan sıkıntılı dönemlerde orta kesim tamamen yok olma tehlikesiyle karşı karşıya kalırken zengin kesim yine kendini bir şekilde olduğu yerde konumlandırabilirken fakir kesim gerçekten büyük bir buhran yaşayabiliyor.Kesinlikle krizler hep alt ve orta sınıfı vuruyor. Zengin kesim bu tarz krizlerden ya etkilenmiyor yada az etkileniyor. Almanya gibi Avrupa'da bu krizi en hafif şekilde yaşayan bir ülke bile bu durumun araştırmasını yapıp alt ve orta kesimin daha az zarar yaşaması için çareler üretirken bizde ise tam tersinin olması aslında en üzücü durum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "August 25, 2022, 01:38:15 PM",
      "body": "Quote from: Gencecikmen on August 25, 2022, 01:30:28 PMQuote from: judas on August 24, 2022, 07:27:05 PMPandeminin üstüne gelen savaş ve bunun üzerine hala yaşamakta olduğumuz iklim krizi... Dünya gerçekten çok zorlu bir dönemin içerisine girmiş bulunuyor Avrupa ülkeleri bile ekonomik anlamda güçlük çekmeye başladı.Onların çektikleri güçlükler tabii bizim içerisinde bulunduğumuz durumla kıyaslanamaz ama dünya böyle bir durumdayken bizim de daha aklı selim adımlar atmamız gerektiğini düşünüyorum.Haberde de ipuçlarını bulabileceğimiz gibi bu tarz ekonomik açıdan sıkıntılı dönemlerde orta kesim tamamen yok olma tehlikesiyle karşı karşıya kalırken zengin kesim yine kendini bir şekilde olduğu yerde konumlandırabilirken fakir kesim gerçekten büyük bir buhran yaşayabiliyor.Kesinlikle krizler hep alt ve orta sınıfı vuruyor. Zengin kesim bu tarz krizlerden ya etkilenmiyor yada az etkileniyor. Almanya gibi Avrupa'da bu krizi en hafif şekilde yaşayan bir ülke bile bu durumun araştırmasını yapıp alt ve orta kesimin daha az zarar yaşaması için çareler üretirken bizde ise tam tersinin olması aslında en üzücü durum. Zaten olması gereken Almanya ve Avrupa ülkeleri gibi yapıp en alt kademede olan insanların alım gücünün araştırılması olmalıdır, zarar olur, enflasyon olur, bunlardan zengin minimum etkilenir ama bir yerlerde tek amacı yemek yemek olan, yaşamak olan en alt kademe var, bunların gücünün durumu diğerlerinin hepsinin önünde olmalı,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kartalgiunti",
      "created_time": "August 25, 2022, 10:33:55 PM",
      "body": "Kısa vadede Avrupa’yı en çok zorlayacak olay sanırım enerji krizi olacak. Rusya ilerleyen günlerde yine 3 günlük kesinti yapılacağını söylemişti ve bu sürenin uzamasından endişe ediliyor şu anda. Haberlerde tasarrufla ilgili çok absürt olarak düşüneceğimiz önlemler alınıyor. Avrupa şu an kendisini en kötü senaryo için hazırlıyor bakalım olası yaşanacak zorluklarda halkların tepkileri nasıl olacak",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "August 26, 2022, 10:26:55 AM",
      "body": "Savaş Ukrayna ile Rusya arasında çıkmış olabilir ama bu süreç neredeyse tüm dünya ülkelerini etkilemiş oldu. Kısıtlamalar ve ambargolar nedeniyle azalan arz kaynaklı fiyatlar iyiden iyiye arttı. Ukrayna tarafında tarım üretimi azaldı Rusya tarafında ise kısıtlamalar dolayısıyla ihracat ürünlerinde kısıtlamaya gidilmesi fiyatların daha çok artmasına neden oldu başta petrol ürünleri ve doğal gaz olmak üzere ciddi fiyat artışları oldu savaşın olumsuz etkileri savaş bitmiş olsa bile daha uzun yıllar bu etkinin gölgesinde kalır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 28, 2022, 10:27:50 AM",
      "body": "Sizin için öyle tabi Rusya ile zıtlaşırsanız enerjinizi keserler sonra banyo yapmayın ıslak mendille kendinizi silin diye halka uyarıda bulunursunuz. Kendi çıkarları adına adaletsiz davranmayı görev bilenler savaşın etkisini uzun yıllar hissetmeye devam edecek. Burada durum tam tersi insanlar paranın değeri kalmadı diye eline geçen her şeyi anında harcıyor o şekilde ekonomi dönüyor inanılmaz bir tüketim çılgınlığı var. Siz enflasyon görmemişsiniz %10 ile ne hale geldiniz bir de buraya bakın %300 enflasyonla millet etrafa para saçıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 29, 2022, 06:13:01 PM",
      "body": "Quote from: kriminall on August 25, 2022, 01:38:15 PMQuote from: Gencecikmen on August 25, 2022, 01:30:28 PMQuote from: judas on August 24, 2022, 07:27:05 PMPandeminin üstüne gelen savaş ve bunun üzerine hala yaşamakta olduğumuz iklim krizi... Dünya gerçekten çok zorlu bir dönemin içerisine girmiş bulunuyor Avrupa ülkeleri bile ekonomik anlamda güçlük çekmeye başladı.Onların çektikleri güçlükler tabii bizim içerisinde bulunduğumuz durumla kıyaslanamaz ama dünya böyle bir durumdayken bizim de daha aklı selim adımlar atmamız gerektiğini düşünüyorum.Haberde de ipuçlarını bulabileceğimiz gibi bu tarz ekonomik açıdan sıkıntılı dönemlerde orta kesim tamamen yok olma tehlikesiyle karşı karşıya kalırken zengin kesim yine kendini bir şekilde olduğu yerde konumlandırabilirken fakir kesim gerçekten büyük bir buhran yaşayabiliyor.Kesinlikle krizler hep alt ve orta sınıfı vuruyor. Zengin kesim bu tarz krizlerden ya etkilenmiyor yada az etkileniyor. Almanya gibi Avrupa'da bu krizi en hafif şekilde yaşayan bir ülke bile bu durumun araştırmasını yapıp alt ve orta kesimin daha az zarar yaşaması için çareler üretirken bizde ise tam tersinin olması aslında en üzücü durum. Zaten olması gereken Almanya ve Avrupa ülkeleri gibi yapıp en alt kademede olan insanların alım gücünün araştırılması olmalıdır, zarar olur, enflasyon olur, bunlardan zengin minimum etkilenir ama bir yerlerde tek amacı yemek yemek olan, yaşamak olan en alt kademe var, bunların gücünün durumu diğerlerinin hepsinin önünde olmalı, Kesinlikle hocam aynı şeyleri düşünüyoruz. Hani bir söz var ya: \"en zayıf halkan kadar güçlüsün\" diye. O hesap toplumda öyle. En dar gelirli kişinin durumu ne kadar iyiyse o toplum o kadar iyidir. Bu sebeple alt kesimin refahı çok önemli. Ve zengin kesim için enflasyon sadece lüksleri için sorun yaratırken dar gelirli için enflasyon yemek yemek, temiz su bulmak veya barınmak gibi temel şeyler için zorluk demek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "August 29, 2022, 07:35:58 PM",
      "body": "Savaşa hayır derler tabi ama kendi çukurları için. bunun dünya genelini etkilediğini, savaşın etkilerine enine boyuna düşündüklerini ve ekonominin içinden çıkılmaz, kokuşmuş bir hale geldiğini gördüler. rusya doğalgaz vermeyince avrupada doğalgazı alternatif bulmaya yöneldi ve alacakları doğalgaz daha pahalı hale geldi aynısı petrol için de böyle. bu yüzden savaşın getirdiği siyasi ilişkilerin gerginliği uzun süre aynı kalır, etkileri daha uzun sürer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "August 29, 2022, 08:07:34 PM",
      "body": "Bunu savaş çıkmadan önce düşünecektiniz. Verdiniz gazı verdiniz gazı enerjiniz tehdit altına girince ağlamaya başladınız. Bu avrupa iki yüzlülüğünden tiksiniyorum. Olaylar başlamadan önce ve sonrasında yaptırımların arkası kesilmedi. Kimse barıştan yana bir tavır sergilemedi ve körü körüne bir ülkeyi savaşın içine attılar. Ne zaman ucu kendilerine dokundu ılımlı açıklamalar yapmaya başladılar. Özellikle Almanya bu konuda başı çekiyor. Zaten pandemiden çıkan dünyanın genel enflasyon oranında artış vardı bir de bu savaş çığırtkanlığı üstüne tuz biber oldu. Bir an önce barış masasını kurup en azından küresel enerji ve gıda fiyatlarındaki artışta durulma meydana getirilebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "August 29, 2022, 08:16:40 PM",
      "body": "Quote from: karabiber on August 29, 2022, 08:07:34 PMBunu savaş çıkmadan önce düşünecektiniz. Verdiniz gazı verdiniz gazı enerjiniz tehdit altına girince ağlamaya başladınız. Bu avrupa iki yüzlülüğünden tiksiniyorum. Olaylar başlamadan önce ve sonrasında yaptırımların arkası kesilmedi. Kimse barıştan yana bir tavır sergilemedi ve körü körüne bir ülkeyi savaşın içine attılar. Ne zaman ucu kendilerine dokundu ılımlı açıklamalar yapmaya başladılar. Özellikle Almanya bu konuda başı çekiyor. Zaten pandemiden çıkan dünyanın genel enflasyon oranında artış vardı bir de bu savaş çığırtkanlığı üstüne tuz biber oldu. Bir an önce barış masasını kurup en azından küresel enerji ve gıda fiyatlarındaki artışta durulma meydana getirilebilir.Avrupa’da genellikle yapılan hareketler bunlar zaten hocam. Önce bir ülkeyi veya grubu pohpohlarlar bunlar, ondan sonra o grupla bir bağı veya avantajı kalmayınca kaçar gibi uzaklaşırlar. Yumurta dayanınca ılımlı açıklamalar yapıyorlar. Ondan önce Ukrayna için gazlayıcı açıklamalar yaptılar. Zelenski bile kaç kere söyledi Avrupa bize sözünü tutmadı diye. Artık özelden nasıl söz verdiler bilmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "August 30, 2022, 08:03:43 AM",
      "body": "Hem pandemi hem savaş üst üste geldi. Hayır savaşın olduğu Ukrayna ülkesi de gıda konusunda fazlasıyla önemli bir ülke yani. Bu yüzden çok büyük sıkıntılar yaşıyoruz. Enflasyon Türkiye dışında dahi rekor üstüne rekor kırıyor. Türkiye gibi ortalama ülkeler ise daha da vahim şekilde etkileniyor. Umarım Rusya Ukrayna yı bütünüyle işgal edemeyeceğini anlar ve savaşı durdurur. Ekonomiye doğrudan etkisi olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "September 01, 2022, 12:05:35 PM",
      "body": "Savaşın olumsuz yönlerinden bahsedilmiş. Ekonomi bölümü makalesi olduğu için yalnızca ekonomik yönlerine değinilmiş. Ama her şey maddiyat mı? İnsan hayatının hiç önemi yok mu? Zorlanıyorum bu yazıları okuduğumda. Boğazım düğüm düğüm oluyor dostlar.Savaş ölüm demektir. Küresel fakirliktir. Bombaların, kimyasalların doğaya zarar vermesidir. Savaş silahlarının kimyasal etkisinin geçmesi için 5 bin yıl gerekiyormuş. Savaş yapıların yıkılması, çevrenin zarar görmesidir. Göçlerin artması ailelerin kopmasıdır. Annesini, babasını kaybetmiş Ukraynalı küçük çocuklar gözümüzün önünde. Parçalanan hayatlarla dolu dramlar izledik hepimiz. O çocuklar yalnız fiziksel tahribat almadılar. Ruhları da zarar gördü. Psikolojileri bir daha asla düzelmeyecek bir çoğunun.Doğrudan ekonomik zararlarını hesap etmek kolay. Dolaylı hasarları onarmaya çalışsak bütün dünyanın parası yetmez. Toprağı 8 milyar insan tane tane elimizle temizlemeye çalışsak zamanımız yetmez. Savaş mağduru çocukları her gün eğlendirsek yine rehabilite edemeyiz. Savaşın kötü bir şey olduğu rakamlarla ortada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}