{
  "id": "topic_5400589",
  "title": "Bitox888",
  "author": "Bitox888",
  "created_time": "May 29, 2022, 09:52:52 AM",
  "content": "If I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400589",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 29, 2022, 09:57:52 AM",
      "body": "Not much. If it just so happens that a certain platform you sent your funds to asks you about where the funds came from, just say you bought it P2P. Though this rarely happens as far as I know. As long as buying P2P is not illegal where you're from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "May 29, 2022, 10:00:17 AM",
      "body": "IIRC there's a news that lead you a problem when you bought a coins from criminal, but I didn't remember where's the sources. I guess it depends how much you bought, let's say you bought from a hacker that stole 2 BTC and you bought 1 BTC from him, the another 1 BTC he send to other wallet. If chainalysis can track the source and linked with your identity, then it's possible you will have a trouble since they suspect you're the criminal.To avoid it depends on how good you hide your trace and your privacy concern, of course Bitcoin mixers will help in this case.Use decentralized exchange e.g. Bisq don't use the centralized one that ask your KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "May 29, 2022, 10:00:27 AM",
      "body": "I'd like to say no, but you probably should be concerned if you live in the US and intend to use those BTC later on with a regulated service. That's because more and more people and services are being sanctioned, watched, blocked, blacklisted, and if you're linked, who knows if they'll only deny you service, might even not give your coins back.If you're buying direct p2p, then you'd be better off doing it at a place where you can look up a little of their history and reputation (so a place like Bisq works great). Or something like LBC since you'd be getting it off the site's wallet anyway.Even better, after you buy, use ChipMixer to lose any association you might have had with the seller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 29, 2022, 10:23:13 AM",
      "body": "Quote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ? I do not see a reason for concern unless you are at fault. Because while buying from a p2p platform, it is impossible for the buyer to know the origin of the bitcoin or whether it is a criminal proceed. You should have the purchase record in the p2p platform so nothing to worry there. But while buying from a reputed p2p platform like localbitcoins, always check the ratings and feedbacks of a particular seller. You will quite easily find a seller with great ratings and feedback. Also check if the seller is a regular one by checking the most recent feedbacks. Sometimes, you will find a seller suddenly woke up after a long time which needs to be avoided. But if you are buying from a regular seller, you should not face any issue. It's extremely rare!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "May 29, 2022, 10:44:11 AM",
      "body": "History of the previous transactions weren't required when you're involved with P2P transaction. There is very minimal chance of such issues. If you're an unlucky person to face such a problem you've got the perfect data in your hands. Show the transaction involved, so that it'll redirect to the person from whom you've made the purchase. If you're that feared, then find a mixing service once after buying.If the transaction is connected with any of the exchange hacked fund, then there is chances for freezing of funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "May 29, 2022, 10:51:36 AM",
      "body": "Quote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ? Smart criminals (e.g. hackers or other illegal activities) may clean their bitcoin history before selling it on the P2P exchange. They will probably use a mixer to remove traces and if that has been done then you will be safe to buy bitcoin. Indeed you will be advised to check the reputation of the seller first before making a transaction, this will make it safer for you to own bitcoin. But it would be great if you put this advice into practice.Quote from: buwaytress on May 29, 2022, 10:00:27 AMEven better, after you buy, use ChipMixer to lose any association you might have had with the seller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "May 29, 2022, 11:09:04 AM",
      "body": "Quote from: avikz on May 29, 2022, 10:23:13 AMQuote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ? I do not see a reason for concern unless you are at fault. Because while buying from a p2p platform, it is impossible for the buyer to know the origin of the bitcoin or whether it is a criminal proceed. You should have the purchase record in the p2p platform so nothing to worry there. But while buying from a reputed p2p platform like localbitcoins, always check the ratings and feedbacks of a particular seller. You will quite easily find a seller with great ratings and feedback. Also check if the seller is a regular one by checking the most recent feedbacks. Sometimes, you will find a seller suddenly woke up after a long time which needs to be avoided. But if you are buying from a regular seller, you should not face any issue. It's extremely rare! This is the action I always use, Whether you are trading on any of the exchanges, just check trader ratings and feedback and always only trade on accounts with 98% or 99% high ratings. Limit trading on accounts that get lots of negative feedback and low success rates, you will avoid unfortunate problems. I trade on Binance regularly and I feel safe with it even though this is a centralized exchange and requires KYC to trade, but this helps us avoid frauds and scams, criminal assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 29, 2022, 11:31:17 AM",
      "body": "Quote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ?As long as you avoid centralized exchanges, which treat bitcoin as non-fungible and demand blackmail you to give them your personal info to proceed, it's extremely unlikely you will ever get yourself into trouble. No peer looks for your bitcoin's history. Quote from: Bitox888 on May 29, 2022, 09:52:52 AMIf yes then how do I avoid such situation ?If you don't feel confident with having your peer's history, mix them. And I recommend you to do this more regularly, such as for the money you'll send to your peer; to make yourself untraceable. Mix, for the sake of your privacy. Here's a list of reputable mixers: 2022 List Bitcoin Mixers Bitcoin Tumblers Websites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 29, 2022, 12:14:36 PM",
      "body": "It is possible that you can get what they call as tainted or dirty Bitcoin. How to avoid it? You might not want to hear the answer, but I guess the best way is to use platforms which are compliant with the latest policies and government regulations on cryptocurrency. With this, even if you are using P2P, you are less likely to get a dirty Bitcoin. The EU's 5AMLD, for example, covers P2P platforms. The law even extends to the UK.Supposing you failed to avoid it, you can always resort to using coin mixers. However, and this is my personal stand on the matter, Bitcoin is designed to be fungible. Any single Bitcoin is the same with the rest. They're all identical. All 21 million Bitcoin are the same and equal. That is why I think there should be a form of resistance on our part, and continue not to label coins as if they aren't equal. While it is admittedly hard, non-custodial, decentralized, and anonymous platforms should be strongly preferred. Otherwise, this revolutionary alternative currency of ours will eventually bow down to the old system and lose its spirit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "May 29, 2022, 12:22:04 PM",
      "body": "Quote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ? Not really, no. From a moral perspective, there is also nothing to worry about because that principle could be aplied to FIAT as well. How could we possible know the background of the money that gies through our hands. I would argue that it's more likely that it has a criminal past than BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "May 29, 2022, 12:41:08 PM",
      "body": "Quote from: Marvell1 on May 29, 2022, 11:09:04 AMQuote from: avikz on May 29, 2022, 10:23:13 AMQuote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ? I do not see a reason for concern unless you are at fault. Because while buying from a p2p platform, it is impossible for the buyer to know the origin of the bitcoin or whether it is a criminal proceed. You should have the purchase record in the p2p platform so nothing to worry there. But while buying from a reputed p2p platform like localbitcoins, always check the ratings and feedbacks of a particular seller. You will quite easily find a seller with great ratings and feedback. Also check if the seller is a regular one by checking the most recent feedbacks. Sometimes, you will find a seller suddenly woke up after a long time which needs to be avoided. But if you are buying from a regular seller, you should not face any issue. It's extremely rare! This is the action I always use, Whether you are trading on any of the exchanges, just check trader ratings and feedback and always only trade on accounts with 98% or 99% high ratings. Limit trading on accounts that get lots of negative feedback and low success rates, you will avoid unfortunate problems. I trade on Binance regularly and I feel safe with it even though this is a centralized exchange and requires KYC to trade, but this helps us avoid frauds and scams, criminal assets.Yes I focus on those traders where they have higher ratings between 98 to 99% when doing P2P with Binance. In the Philippines, the Filipinos are still prone to being in a rush rather than checking the ratings of the one they wanted to do P2P. In the end, they got scammed easily because of choosing a trader with lower ratings.Recently, I have seen someone got victimized lately by a trader with only 50% rating because well, you know, in a rush rather than checking the ratings, especially believing the fake SMS confirmation text.Only choose sellers who are regularly doing P2P with high ratings. I’ve never been scammed because of that, but of course, these scammers are leveling up their scamming skills so we need to be always extra careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitox888",
      "created_time": "May 29, 2022, 12:44:02 PM",
      "body": "Quote from: Solosanz on May 29, 2022, 10:00:17 AMUse decentralized exchange e.g. Bisq don't use the centralized one that ask your KYC.I am going to buy it from a guy I dont know. So I wont use exchange but I dont know the guy and I have no idea where he got his bitcoins from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trapatalce",
      "created_time": "May 29, 2022, 12:52:30 PM",
      "body": "How would anyone know if those specific coins were used in any illegal activity?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitox888",
      "created_time": "May 29, 2022, 12:56:11 PMLast edit: May 30, 2022, 12:16:13 PM by Mr. Big",
      "body": "Here's a list of reputable mixers: 2022 List Bitcoin Mixers Bitcoin Tumblers Websites.[/quote]cant I just use Samourai's mixing functions ? Quote from: trapatalce on May 29, 2022, 12:52:30 PMHow would anyone know if those specific coins were used in any illegal activity?bitcoin is an open book, there is just a question of identities of ppl owning them, but I am no criminal, it will be easy to find out my identiy if needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 29, 2022, 01:25:13 PM",
      "body": "Quote from: Bitox888 on May 29, 2022, 12:56:11 PMcant I just use Samourai's mixing functions ?Samourai doesn't have a good reputation when it comes to privacy. I wouldn't choose it; if you want to give it a try, do it with a Dojo installed. Otherwise, you'll have to hand out your master public key, which nullifies your mixing. Definitely don't go with Wasabi, as they're now censoring certain UTXOs.To avoid installing wallet software etc., just use a mixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "May 29, 2022, 01:34:23 PM",
      "body": "I don't think the history will affect your purchase. It's actually been happening for lots of times but since you aren't involved in such criminal activity, you shouldn't be bothered about the it but if you seek assurance, then you could check it and buy from a different trader if that will give you peace of mind. You just have to make sure that you're purchasing from an exchange and not from an unknown person from other platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 29, 2022, 02:00:39 PM",
      "body": "Quote from: trapatalce on May 29, 2022, 12:52:30 PMHow would anyone know if those specific coins were used in any illegal activity?Cause the blockchain is completely transparent.If a hacker breaches a centralizes exchange and transfers Bitcoin from the coldwallet of the exchange into an address the had created, this particular transaction can be tracked as well as the wallet the inputs were sent to, from then on, any other transactions those inputs were used in can also be monitored.You can do this yourself by visiting a blockchain explorer like blockchair.comQuote from: Bitox888 on May 29, 2022, 09:52:52 AMIf I purchase bitcoins via p2p, can I get some problems if the bitcoins I get were involved in some criminal activity ? If yes then how do I avoid such situation ? • Theoretically, you should not get into any trouble as long as you can prove that you had nothing to do with it, with proof of transaction and communication with the other party.• How to avoid such situation would be by keeping records if your transactions should they be needed.Also, do not trade directly (physically) with someone except you explicitly trust this person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "May 29, 2022, 02:23:26 PM",
      "body": "Why don't you just use a mixer if you are not very sure? There is a popular one here in the forum Chipmixer that renders this service, enquire about the process to mix your coins and get it done with. If you are in a country where you feel this can have a negative impact later then a mixer is your best option. But you should first try and buy from a reputable p2p platform, that way the probability of buying a stolen coin is less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 29, 2022, 02:40:11 PM",
      "body": "Quote from: Bitox888 on May 29, 2022, 12:56:11 PMQuoteHere's a list of reputable mixers: 2022 List Bitcoin Mixers Bitcoin Tumblers Websites.cant I just use Samourai's mixing functions ? This wallet doesn't have the same function on Bitcoin mixers, this is just a wallet that isn't a perfect way of taking care of your privacy.Reputable Bitcoin mixers are still good to go for any pseudonymous transactions but when it comes to completely be anonymous, that's impossible to happen.This is very common in crypto and the fact is, we can't hide it in every transaction, everything is traceable and even you think Bitcoin mixers are enough to clean dirty Bitcoin, to protect your privacy but isn't.  As many people say, (when there's smoke there's a fire), what is the purpose of using Bitcoin mixers and using P2P exchange if there has nothing to hide.  So that's was expected if you keep using these, you can get dirty Bitcoin, like darknet or even black market. But I think this isn't something to worry about, we have many dirty transactions that have been considered as clean.  If you heard Silkroad raided and seized a huge amount of Bitcoin, the government put it on auction, and those who have to buy Bitcoin consider it clean.If you have doubt, you can call these agencies that studied Bitcoin blockchain transactions to confirm Bitcoin transaction is clean.ChainalysisScoreChainCipherTraceElliptic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}