{
  "id": "topic_5457045",
  "title": "Asuspawer09",
  "author": "Asuspawer09",
  "created_time": "June 21, 2023, 03:37:31 AMLast edit: September 01, 2024, 03:14:47 PM by Asuspawer09",
  "content": "Akda ni: GazetaBitcoinOrihinal na paksa: Bitcoin: The dream of Cypherpunks, libertarians and crypto-anarchists Larawan na nagpapakita ng mga Romano na nagbabayad ng buwis || Pinagmulan ng larawan: historyhit.com Ang mga pinuno ay nagpapahirap sa mga tao sa loob ng mga siglo. Isa sa mga unang anyo ng pagsasamantala na ito ay nabuo noong Roman Empire, 2000 taon na ang nakalilipas. Lumipas ang oras, ngunit nanatili ang kasanayang ito. Ang mga paraan ay iba't iba, kabilang ang direktang buwis, indirektang buwis, inflasyon, pagsensor sa access sa impormasyon, pagsasakdal, pagbabawal, pagkaalipin, di-makatarungang paglilitis, pagsasaliksik ng personal na impormasyon at paggamit nito laban sa mga taong marangal. Gayunpaman, ang lahat ng ito ay humahantong sa parehong pinakamataas na layunin: ang kapangyarihan ay kailangang manatili sa mga kamay ng mga pinunong mayayaman, habang ang mahihirap ay kailangang magtrabaho para sa kapakinabangan ng mga pinunong mayayaman. Lumaban ang mga tao, ngunit kadalasan ay walang armas. Ang epikong labanan na ito na tumagal mula noong sinaunang panahon ay pinakamahusay na inilarawan ni Murray Rothbard bilang \"ang malaking tunggalian na walang hanggang ipinaglalaban sa pagitan ng Kalayaan at Kapangyarihan\". Ang isang paraan para makakuha ng pagmamalabis at kalayaan ay sa pamamagitan ng pribadong pera, ngunit ang mga namamahala ay hindi sumasang-ayon sa naturang kompetisyon. At ang mga pinuno ay may monopolyo rin sa pagmiminta ng mga barya mula pa noong Roman Empire. Gayunpaman, mula sa mga siglo na ang nakalilipas, nagkaroon na ng pagnanais ng mga tao para sa pribadong pera at ang kasaysayan ay nagpapakita sa atin na sa maraming pagkakataon, nagkaroon ng pribadong pera sa iba't ibang anyo. Ang tanyag na ekonomista at pilosopo na si Friedrich August von Hayek, nagwagi ng Nobel sa Economic Sciences noong 1974, ay naglabas ng isang napaka-lehitimong debate sa kanyang obra maestra obra maestra na Denationalization of Money: The Argument Refined: \"[...] ay hindi maiwasang magtaka kung bakit dapat magtayo ang mga tao sa napakatagal na panahon na ang mga pamahalaan ay gumagamit ng eksklusibong kapangyarihan sa loob ng dalawang libong taon na regular na ginagamit upang pagsamantalahan at dayain sila\". Isa pang tanyag na personalidad na ipinagtanggol ang pangangailangan ng pribadong pera ay si Murray Rothbard. Sa pagitan ng 1700 at 1900, iba't ibang pribadong barya ang umiikot sa Estados Unidos. Ang unang pribadong barya mula sa kasaysayan ng US ay ang Higley Copper coin, na ginawa noong 1737 ng pamilya Higley. Marahil ang pinakasikat ay ang Bechtler na mga gintong barya (unang inilabas noong 1831), na kilala sa pagkakaroon ng higit na kadalisayan kaysa sa mga barya na inilabas ng estado. Ang kumpanyang Moffat&Co sa San Francisco ay sumulat din ng isang pahina ng kasaysayan noong panahon ng gold rush, sa pamamagitan ng mga inilabas na barya nito. Isa sa pinakahinahangad na barya ay ang Brasher Doubloon, na pinakalangkapan ni Ephraim Brasher noong 1787. Iba pang mga kapansin-pansin na pribadong barya na dapat banggitin: Morgan Dollars, Saint-Gaudens Double Eagles, Barber Quarter. Siyempre, hindi sumasang-ayon ang pamahalaan sa mga pribadong pampalitang mga balangkas ngunit tiyak na nagkaroon ng mga ito sa iba't ibang mga punto ng panahon. Ginamit ang mga baryang ito sa malawakang antas, kahit na may mga pagsisikap ang estado na ipasara ang mga ito.  Libertarianismo at anarkismo  Murray Rothbard || Pinagmulan ng larawan: fee.org \"Itinukoy ko ang anarkistang lipunan bilang isang lipunan kung saan walang legal na posibilidad ng pwersahang pag-atake laban sa tao o ari-arian ng sinumang indibidwal\" - Murray Rothbard  Lumipas ang mga taon at patuloy na ipinagbabawal ng estado ang pribadong pera sa pamamagitan ng anumang posible nilang paraan. Lalo pang lumakas ang pang-aapi. Ngunit mas tumindi rin ang pagnanais ng mga tao para sa kalayaan. Noong nakaraan, kanilang ipinahayag ang mga ideyang ito sa pamamagitan ng liberalism, na sa kalaunan ay nag-iba at naging libertarianismo. Ang mga unang anyo ng libertarianismo ay lumitaw sa pagitan ng ika-18 at ika-19 na siglo. Ang modernong libertarianismo, na nagsimula noong 1950, ay pinag-usapan ng mga mahuhusay na isip tulad nina Murray Rothbard, Milton Friedman, o Hayek. Ayon kay Rothbard, \"Ang paniniwalang libertarian ay nakasalalay sa isang pangunahing aksioma: na walang tao o grupo ng mga tao ang maaaring mag-agresyon laban sa katauhan o ari-arian ng sinumang iba. Ito ay maaaring tawaging \"aksiyomang hindi-agresyon.\" Ang agresyon ay samakatuwid ay katumbas ng pagsalakay.\" Sa pangkalahatan, maaari nating sabihin na ang libertarianismo ay nakatuon sa mga karapatan ng indibidwal, paglimita ng pamahalaan, pagpapalakas ng malayang merkado, at kapayapaan. Isang partikular na bahagi ng libertarianismo ay ang anarkismo. Bagamat mas radikal ang kilusang ito, ito ay patuloy na nakatuon sa mga indibidwal. Sa pangkalahatan, ang anarkismo ay nagtatangkang magpatupad ng lipunang walang pamahalaan, malaya ang mga indibidwal na hindi pinamamahalaan ng batas kundi ng malayang kasunduan. Ang terminong \"anarkiya\" mismo ay nangangahulugang \"kawalan ng pamahalaan\". Gayunpaman, hindi dapat ituring na nagpapahiwatig ng karahasan ang anarkismo: hindi ito kailanman nagmula sa karahasan at hindi kailanman magiging tungkol dito. Isang mahusay na paliwanag sa isyung ito ay ibinigay ng Canadian na teoretikong si L. Susan Brown: \"Bagaman ang popular na pagkaunawa sa anarkismo ay isang marahas at anti-Estado na kilusan, ang anarkismo ay isang mas malalim at mas pinausling tradisyon kaysa sa simpleng pagtutol sa kapangyarihan ng pamahalaan. Tinututulan ng mga anarkista ang ideyang ang kapangyarihan at dominasyon ay kinakailangan para sa lipunan, at sa halip ay nagsusulong ng mas kooperatibong mga anyo ng panlipunang, pampulitikal, at pang-ekonomiyang organisasyon na kontra-hiyerarkiya\".  Crypto wars  Munition t-shirts, ayon sa batas ng US, orihinal na nilikha ni Adam Back || Pinagmulan ng larawan: Twitter \"Kung ang privacy ay ipinagbabawal, tanging mga kriminal lamang ang magkakaroon ng privacy.\" -- Phil Zimmermann Iniwan natin ang mga taon ng 1950 at pumasok sa panahon ng teknolohiya: Ang ARPANET, ang ninuno ng Internet, ay ipinanganak noong 1967; ang mga microprocessor ay nagpapalit-saklaw batay sa batas ni Moore; ang mga personal na kompyuter (PCs) ay inilunsad noong 1975; ang World Wide Web ay inilunsad noong 1989. Ang kriptograpiya ay umiiral sa pamamagitan ng magaling na isip ni Friedman. Ngunit ang lahat ng mga teknolohikal na pag-unlad na ito ay hindi para sa publiko (pa): natuklasan lamang ng estado ang isang bagong paraan ng pang-aapi, marahil ang pinaka-mapanganib - ang pagsubaybay. Na isang tuluy-tuloy na proseso para sa panghihimasok sa privacy ng mga tao. Kung ang isang indibidwal ay nagmamataas sa kanyang kapitbahay sa pamamagitan ng bintana, maaaring humarap ito sa Korte; ngunit kung ang pamahalaan ay nagsasaliksik sa buong bansa, walang problema. Kung ang isang normal na tao ay sumusubok na alamin ang mga transaksyon sa pinansyal ng iba, maaaring kasuhan siya; ngunit kung ang estado ang nais na malaman ang lahat ng transaksyon sa pinansyal ng bawat indibidwal, walang problema. Ang teknolohiya ay nag-aalok ng isang malaking sandata sa pamahalaan at sinimulan nitong gamitin ito nang buong kapasidad upang magkaroon ng ganap na kontrol, lalo na sa pamamagitan ng mga ahensya tulad ng NSA. Ang permanenteng pagkagutom ng mga namamahala sa impormasyon tungkol sa mamamayan ay naging gutom para sa malaking data: ang bawat indibidwal ay kinokondisyon ng mga dokumentong ibinigay ng pamahalaan. Hindi ka maaaring manganak nang walang govern-issued ID, hindi ka maaaring magpakasal nang walang govern-issued ID, hindi ka maaaring mamatay nang walang govern-issued ID, hindi mo mapapatunayan ang iyong pagkakakilanlan nang walang govern-issued ID, hindi ka maaaring mag-access sa mga ospital ng walang ID na ibinigay ng pamahalaan, atbp. At ang lahat ng impormasyong ito ay naitala sa mga database na kontrolado ng iba't ibang sangay ng estado; sa huli, kontrolado ito ng pamahalaan. Sa mga malupit na panahong ito, noong 1975, inimbento ni Whitfield Diffie ang public-key cryptography, na nagdadala ng napakahusay na tool sa publiko. Nag-react ang pamahalaan at nag-aalok ng tulong nito upang \"panatilihing ligtas\" ang mga pribadong susi ng mga tao. Ngunit hindi nangyari ito at mula sa mga sandaling iyon, nagsimula ang digmaang kripto. Noong 1977, naimbento nina Ron Rivest, Adi Shamir, at Leonard Adleman ang algoritmo ng RSA encryption na gumagamit ng public-key cryptography. Ang susunod na hakbang ng NSA ay ipagbawal ang pampublikong pag-access sa imbentong kay Diffie at ang pag-export ng mga algoritmo ng encryption palabas ng Estados Unidos. Nag-alala si Bobby Inman, ang direktor ng NSA, dahil maaaring mag-access ang mga tao sa teknolohiyang pang-encryption na, hanggang sa puntong iyon sa kasaysayan, ginagamit lamang ng mga ahensya. Sa isang artikulo ng Wired noong 1993, nabunyag ang isang liham na ipinadala ni Inman noong 1979, na nagbabala na ang \"non-governmental cryptologic activity and publication [...] ay nagdudulot ng malinaw na panganib sa pambansang seguridad\". Itinuturing na classified information ang mga algoritmo ng encryption at protektado ng mga Federal Regulations, tulad ng ITAR (International Traffic in Arms Regulations, 22 CFR 121-128). Ang pag-export nito ay maaaring humantong sa sampung taon na pagkakakulong. Bilang tugon, ang publiko ay nag-print ng ilang linya ng kodigo ng RSA sa mga t-shirt at binalaan ng ahensya na ang pagsusuot ng ganitong uri ng mga t-shirt habang naglalakbay palabas ng Estados Unidos o nag-e-export ay magdudulot ng pagkakakulong para sa \"mga lumalabag\", dahil itinuturing na \"mga sandata\" ang mga ganitong uri ng t-shirt. Ang mga mayroong tattoo na may RSA algorithm ay itinuturing din na mga lumalabag. Marahil iyon ang unang pagkakataon na natatakot ang pamahalaan na mawawala nito ang kontrol. Makikita ang takot na ito sa pangalan ng liham na inilabas ni Inman: \"Sky is falling\". Si John Gilmore, isang matapang na binate, tumayo nang matatag sa harap ng ahensya. Ayon sa parehong artikulo ng Wired, binigyang diin niya: \"Ipakita ninyo sa amin. Ipakita sa publiko kung paano ang kakayahan ninyong labagin ang privacy ng sinuman ay nakapigil ng isang malaking kalamidad. Sila ay nagbibigay-kapansanan sa kalayaan at privacy ng lahat ng mamamayan—upang ipagtanggol tayo laban sa isang haka-haka na hindi nila ipinaliwanag. Ang desisyon na talagang ipagpalit ang ating privacy ay isang desisyon na dapat gawin ng buong lipunan, hindi unilaterally ginawa ng isang military spy agency.\"  Cypherpunks at crypto-anarchy: \"Mga rebeldeng may layunin\"  Unang pahina ng magasin na Wired (\"Rebels With a Cause\"), Mayo/Hunyo 1993 || Pinagmulan ng imahe: Wired.com \"Ako ay nabighani sa crypto-anarchy ni Tim May. Hindi tulad ng mga komunidad na tradisyonal na nauugnay sa salitang \"anarchy\", sa isang crypto-anarchy ang gobyerno ay hindi pansamantalang nawasak ngunit permanenteng ipinagbabawal at permanenteng hindi kailangan. Ito ay isang pamayanan kung saan ang banta ng karahasan ay walang bisa dahil ang karahasan ay hindi magagawa, at hindi magagawa ang karahasan dahil hindi maaring maugnay ang mga kalahok sa kanilang tunay na pangalan o pisikal na lokasyon.\" -- Wei Dai Sa taong 1992. Isang grupo ng tatlong tagahanga ng code at mga cryptographer na binubuo nina Timothy C. May, John Gilmore, at Erich Hughes ang natuklasan na pareho silang mayroong katulad na pananaw tungkol sa pangangalaga at pagbabantay ng pamahalaan. Lahat sila ay may malalim na kaalaman sa Computer Science. Si May ay dating chief scientist sa Intel, si Gilmore ay nagtrabaho ng ilang taon sa Sun Microsystems bago itatag ang sarili niyang kumpanya, samantalang si Hughes ay isang programmer at matematiko. Nagsimula silang magkita sa opisina ni Gilmore, sa lugar ng San Francisco Bay, sinusubukang humanap ng mga paraan para protektahan ang privacy ng mga tao sa pamamagitan ng cryptography. Di-nagtagal, isa pang mahilig ang sumali sa kanila: ang hacker na si Jude Milhon, na kilala rin bilang St. Jude. Nakahanap din siya ng pangalan para sa grupo: sa pamamagitan ng pagsasama-sama ng mga salitang \"cipher\" (na may kaugnayan sa cryptography) at \"cyberpunk\" (na bahagi ng genre ng science fiction batay sa dystopian reality at anarchy) naimbento niya ang pangalang \"Cypherpunks\". Nag-evolve ang grupo at marami pang iba ang sumali. Para sa patuloy na pakikipag-ugnayan naglunsad sila ng isang mailing list; ang archive ng mail ay matatagpuan sa Metzdowd.com at Cypherpunks.venona.com. Sa tuktok, mayroon itong humigit-kumulang 2000 mga subscriber. Ang ideolohiya ng Cypherpunks ay nagdala ng libertarianismo at anarkismo sa isang bagong antas: ang crypto-anarchy. \"Isang multo ang naglalakbay sa modernong mundo, ang multong crypto anarchy\", pahayag ni Tim May noong 1988, sa kung saan naging kilala ito bilang isang obra maestra sa literatura ng Cypherpunks: \"The Crypto Anarchist Manifesto\".\"Ang mga Cypherpunks ay sumusulat ng code\", binigyang-diin ni Eric Hughes sa \"A Cypherpunk's Manifesto\", isa pang kilalang pagsusulat na kumakatawan sa isang piraso ng kasaysayan. At sa pamamagitan ng code, nais nilang magbigay ng privacy sa mga tao. Nais nilang magkaroon ang publiko ng malayang access sa kriptograpiya. Ang iba pang mga punto ng interes ay online anonimity, teorya ng laro, secure na pagbabahagi ng file, mga sistema ng reputasyon, libreng merkado at pagsuway sa sibil. Si Steven Levy, ang may-akda ng nabanggit na Wired na artikulo sa itaas, ay tinawag sila ng isang terminong imposibleng isalin sa isang wikang banyaga: \"techie-cum-civil libertarians\". Ang isa pang malaking pagnanais ng Cypherpunks ay lumikha ng electronic cash. Isang uri ng hindi masusubaybayang pera na maaaring huminto sa pagbabantay ng pamahalaan sa buhay pinansyal ng mga indibidwal. Sa paglipas ng panahon, maraming tagahanga na nagbabahagi ng ideolohiyang ito ang sumapi sa grupo. Sa mga pinakatanyag na mga ito, maaari nating banggitin si Philip Zimmermann, tagapagtatag ng PGP, Julian Assange, ang tagapagtatag ng WikiLeaks, si Hal Finney, ang developer ng Tor, at si Hal Finney, ang developer ng PGP 2.0 at Reusable Proof-of-Work. Makikita ang iba pang mga tanyag na Cypherpunks dito.DigiCashIlan sa mga kriptograpo na ito ay nagsimulang magtrabaho sa pangarap na kanilang hinahangad: ang elektronikong salapi. At mayroon silang isang huwaran: ang DigiCash ni Dr. David Chaum. Ang trabaho ni David Chaum ay nagdulot ng inspirasyon sa grupo ng Cypherpunks at siya ay maaaring tawagin bilang ang lolo ng Cypherpunks. Ang kanyang mga pagsusulat (tulad ng \"Untraceable Electronic Mail, Return Addresses, and Digital Pseudonyms\", \"Blind Signatures for Untraceable Payments\" o \"Security without Identification Card Computers to make Big Brother Obsolete\") ay nagpapatunay na siya ay nag-iisip nang malayo sa kanyang panahon. Noong 1989 nagawa na niyang ilunsad ang kumpanya ng electronic money na DigiCash Inc. Inialok ng kumpanya sa publiko ang sistema ng pagbabayad ng eCash at ang CyberBucks coins, na batay sa mga blind signature. Ang panukala ay aktwal na inilapat sa mga tunay na pagbabayad sa mundo, na pinagtibay ng ilang mga bangko, tulad ng Mark Twain Bank mula sa St. Louis, Deutsche Bank, Credit Suisse, Norske Bank at Bank Austria. Ang iba pang malalaking manlalaro ay naging interesado sa paglikha ni Chaum: Visa, Netscape, ABN Amro Bank, CitiBank at ING Bank. Kahit si Bill Gates ay sinubukang i-embed ang DigiCash sa Windows '95. Sa kasamaang palad, ang huling nabanggit na mga manlalaro ay hindi kailanman pumirma ng mga kontrata kay Chaum. Sa huli, noong 1998, nabangkarote ang DigiCash Inc. Hindi naakit ang mga tao na gamitin ang sistema. Ang panukala ni Chaum ay mas mataas din sa panahon nito.Ang mga Cypherpunks ay naniniwala rin na ang pagkabigo ng DigiCash Inc. ay dulot ng katotohanang ito ay batay sa isang sentral na awtoridad. Ang susi sa tagumpay ay isang lubusang desentralisadong anyo ng pera.e-GoldIsang katulad na negosyo ang binuo mula 1996-2009 ng kumpanyang Gold & Silver Reserve, Inc. Itinatag ng kumpanyang ito ang isang subsidiary na pinangalanang e-gold Ltd. upang mamahala ng elektronikong ginto. Ang mga gumagamit ay maaaring malayuang maglipat ng ginto sa pagitan nila, sa gramo o troy ounces unit. Ang negosyo ay umunlad, na may pinakamataas na halos 5M user. Maraming mga palitan ang nagpatibay ng electronic gold na ito at maaari din itong ilipat ng mga user sa pamamagitan ng kanilang mga telepono. Gayunpaman, noong 2007 ang mga may-ari ay inakusahan ng US govern para sa pagpapatakbo ng pera nang walang lisensya. Ang mga may-ari ay umamin ng pagkakasala at sila ay napatunayang nagkasala (noong 2008); ang mga palitan ay sarado. Para sa pag-amin na nilabag nila ang batas at para sa pagtanggap na kailangan nila ng lisensya sa pagpapatakbo ng pera, nakatanggap sila ng mas madaling pagsingil. Gayunpaman, ayon sa batas ng US, dahil napatunayang nagkasala sila, hindi sila pinayagang makakuha ng naturang lisensya at hindi na umiral ang e-Gold.HashCashPinagmulan ng imahe: Mailing list ng mga CypherpunksNoong 1997, naglunsad ng isang panukala sa mailing list si Dr. Adam Back na tinatawag na HashCash. Sa panahong iyon, ang mga spam sa Internet (lalo na ang mga spam sa email) ay nagsimulang maging isang malaking problema. Napansin ito ng mga malalaking kumpanya, kaya isang unang hakbang ang ginawa noong 1992 ng IBM, sa pamamagitan ng isang panukalang tinatawag na Pricing via Processing or Combating Junk Mail. Ang panukala ng mga mananaliksik ng IBM ay itatakda sa hinaharap bilang Proof-of-Work.Ang imbensyon ni Adam Back ay hindi batay sa panukala ng IBM; gayunpaman, marami itong pagkakatulad. Ipinapalagay ng konsepto ng HashCash ang isang Proof-of-Work na pamamaraan para sa paglilimita sa email spam at mga pag-atake ng DDos, batay sa halaga ng bawat email na, sa huli, ay gagawing masyadong magastos ang spam para magamit. ang HashCash ay magiging bahagi ng istruktura ng Bitcoin at nabanggit din sa Bitcoin Whitepaper.Bukod pa rito, nananatiling kilala si Adam Back sa pagiging isa na nagtuturo kay Satoshi Nakamoto kay Wei Dai, matapos makakita ng pagkakatulad sa pagitan ng kanilang mga panukalang electronic money. Mayroon lamang dalawang indibidwal na personal na nakipag-ugnayan sa Satoshi tungkol sa Bitcoin: ang una ay Adam Back; ang pangalawa ay si Wei Dai.b-money Bihirang larawan ni Wei Dai, na maaaring (o hindi) siya ang litrato; ayon sa kanyang pahayag mula sa WeiDai.com, \"Paalala na sa kasalukuyang pagsusulat nito, anumang mga larawang ko sa internet ay ibang mga taong may pangalang Wei Dai\" || Pinagmulan ng imahe: steemit.comNoong 1998, isa pang kahanga-hangang Cypherpunk ang dumating na may dalang electronic money proposal: Ipinakilala ni Wei Dai ang b-money. Ang draft ay batay din sa Proof-of-Work at ipinakita ito sa dalawang bersyon. Sa kasamaang-palad, ang b-money ay madaling maapektuhan ng mga Sybil attack at hindi natapos ni Wei Dai ang kanyang trabaho. Ang panukala ay hindi kailanman naipatupad.At hindi na niya natapos ang kanyang imbensyon dahil hindi na niya pinagkakatiwalaan ang utility sa b-money o ang crypto-anarchy ideology. Sa isang huling talakayan sa LessWrong forum, inamin niya: \"Hindi ako gumawa ng anumang mga hakbang upang mag-code up ng b-money. Bahagi nito ay dahil ang b-money ay hindi pa isang kumpletong praktikal na disenyo, ngunit hindi ko itinuloy ang magtrabaho sa disenyo dahil medyo nadismaya ako sa cryptoanarchy nang matapos akong magsulat ng b-money, at hindi ko inakala na ang isang sistemang tulad nito, kapag naipatupad, ay maaaring makaakit ng napakaraming atensyon at paggamit nang higit sa isang maliit na grupo. ng hardcore cypherpunks\". Ang paratang na ito ay nadoble sa isang talakayan na ipinadala niya kay Adam Back at sa iba pang Cypherpunks, na nagpapatunay na hindi siya naniniwala sa isang praktikal na aplikasyon ng b-money: \"Sa palagay ko ang b-money ay higit sa lahat ay isang angkop na currency/pagpapatupad ng kontrata mekanismo, na naglilingkod sa mga ayaw o hindi maaaring gumamit ng mga itinataguyod ng gobyerno\".Gayunpaman, bagama't hindi masyadong nagtiwala si Wei Dai sa kanyang imbensyon, may ibang nagtiwala. Makalipas ang isang dekada, kasunod ng payo ni Adam Back, nakipag-ugnayan sa kanya si Satoshi Nakamoto para tingnan ang kanyang panukala ng electronic cash na pinangalanang Bitcoin. Nagpalitan sila ng tatlong emails. Sa una, mula Agosto 22nd, 2008, isinulat ni Satoshi:\"Labis akong interesado na basahin ang iyong pahina tungkol sa b-money.  Ako ay nakahanda na ilabas ang isang papel na nagpapalawig sa iyong mga ideya tungo sa isang kumpletong gumagana na sistema.  Si Adam Back (hashcash.org) ang napansin ang mga pagkakatulad at ipinakita sa akin ang iyong site.Kailangan kong alamin ang taon ng pagkakalathala ng iyong b-money page para sa citation sa aking papel.  Magmumukha itong:[1] W. Dai, \"b-money,\" http://www.weidai.com/bmoney.txt, (2006?).Maaari kang mag-download ng pre-release na draft sa http://www.upload.ae/file/6157/ecash-pdf.html. Huwag mag-atubiling ipasa ito sa sinumang sa tingin mo ay interesado.\"Tumugon si Wei Dai sa email na ito. Sumulat siya:\"Kumusta Satoshi. Ang b-money ay inihayag sa mailing list ng cypherpunks noong 1998. Narito ang naka-archive na post: http://cypherpunks.venona.com/date/1998/11/msg00941.htmlMayroong ilang mga talakayan tungkol dito sa http://cypherpunks.venona.com/date/1998/12/msg00194.html.Salamat sa pagpapaalam sa akin tungkol sa iyong papel. Titingnan ko ito at ipaalam sa iyo kung mayroon akong anumang mga komento o tanong.\"Ngunit hindi sinuri ni Wei Dai ang draft ni Satoshi at hindi rin siya bumalik na may tugon kay Satoshi. Nakatanggap siya noong ika-10 ng Enero, 2009 ng isa pang email mula kay Satoshi, na nagpapaalam sa kanya na ang Bitcoin ay ganap na gumagana:\"Nais kong ipaalam sa iyo, inilabas ko lang ang buong pagpapatupad ng papel na ipinadala ko sa iyo ilang buwan na ang nakakaraan, ang Bitcoin v0.1.  Ang mga detalye, pag-download at mga screenshot ay nasa www.bitcoin.orgSa tingin ko, nakakamit nito ang halos lahat ng mga layunin na itinakda mong lutasin sa iyong papel na b-money.Ang sistema ay ganap na desentralisado, nang walang anumang server o pinagkakatiwalaang partido.  Ang imprastraktura ng network ay maaaring suportahan ang isang buong hanay ng mga escrow na transaksyon at kontrata, ngunit sa ngayon ang focus ay sa mga pangunahing kaalaman ng pera at mga transaksyon.\"Hindi itinago ni Wei Dai ang koneksyon kay Satoshi sa kadahilanang siya lang ang nakakaalam. Marahil ay hindi siya nagtiwala sa potensyal ng Bitcoin o marahil ay hindi siya sumang-ayon sa isang pera na walang matatag na halaga. Ang tiyak ay pagkatapos ng mga taon ay pinagsisihan niya ang kanyang ginawa:\"Ituturing kong nabigo ang Bitcoin patungkol sa patakaran sa pananalapi nito (dahil ang patakaran ay nagdudulot ng mataas na pagkasumpungin ng presyo na nagpapataw ng mabigat na gastos sa mga gumagamit nito, na kailangang kumuha ng hindi kanais-nais na mga panganib o makisali sa mahal na hedging upang magamit ang pera) . (Maaaring ito ay bahagyang kasalanan ko dahil nang sumulat si Satoshi sa akin na humihingi ng mga komento sa kanyang draft na papel, hindi ko na siya binalikan. Kung hindi, marahil ay nai-dissuade ko siya (o sila) mula sa ideyang \"fixed supply of money\".)\"Kahit na hindi niya ito nalaman noong panahong iyon, si Wei Dai ay nananatiling parte ng kasaysayan bilang isa sa dalawang mga taong personal na kinontak ni Satoshi Nakamoto bago ilunsad ang Bitcoin.Bit GoldIsang kilalang Cypherpunk na sumubok ng solusyon para sa isang pribadong anyo ng electronic money ay si Nick Szabo. Nakilala niya ang ideya dahil dati siyang nagtrabaho kasama si Dr. Chaum sa DigiCash. Noong 2005, ipinahayag niya ang isang proposal na tinatawag na Bit Gold. Ngunit lumikha na siya ng proposal noong 1998. Ayon sa white paper, ang kanyang imbentong ito ay dapat na \"gumamit ng benchmark functions, pati na rin ng mga pamamaraan ng cryptography at replication, upang lumikha ng isang bago at salitang sistema ng pananalapi, ang bit gold, na naglilingkod hindi lamang bilang isang scheme ng pagbabayad, kundi pati na rin bilang isang pangmatagalang imbakan ng halaga na hindi nakasalalay sa anumang pinagkakatiwalaang awtoridad\". Makakahanap ng mas maraming detalye tungkol sa proposal na ito sa blog ni Szabo.Gumagamit ang Bit Gold ng Reusable Proof-of-Work ngunit mahina rin ito sa mga pag-atake ng Sybil, katulad ng b-money. Ang konsepto ay hindi kailanman inilunsad bilang isang tunay na aplikasyon sa buhay at nanatili sa kasaysayan bilang isang post sa blog, dahil nahaharap ito sa napakaraming teknikal na paghihirap para sa pagtatrabaho sa isang tunay na kapaligiran. Gayunpaman, ang mga pangunahing ideya sa likod ng Bit Gold ay higit na nagbigay inspirasyon kay Satoshi para sa kanyang masterpice - Bitcoin.Satoshi, ang huling (?) CypherpunkAng The Times, Enero 3, 2009, isyung London, umagang edisyon || Pinagmulan ng imahe: TheTimes03Jan2009.com\"Ang pangunahing problema sa tradisyunal na pera ay ang lahat ng tiwala na kinakailangan upang ito ay gumana.  Ang sentral na bangko ay dapat na pinagkakatiwalaan na hindi ibababa ang pera, ngunit ang kasaysayan ng fiat currency ay puno ng mga paglabag sa tiwala na iyon. ng mga bangko ay dapat pagkatiwalaan na pangalagaan ang aming pera at i-transfer ito sa paraang elektroniko, ngunit nagpapautang sila ng mga malalaking halaga na lumilikha ng mga credit bubble na halos walang reserba.  Kailangan nating pagkatiwalaan sila ng ating privacy, magtiwala sa kanila na huwag hayaang maubos ng mga magnanakaw ng pagkakakilanlan ang ating mga account.\"Larawan ni Satoshi Nakamoto noong umaga ng Enero 3rd, 2009. Kakabili lang niya ng pahayagan na The Times mula sa kiosk sa ibaba. Pagbalik sa kanyang tahanan, umiinom siya ng mainit na kape at nagbabasa ng pangunahing pamagat: \"Ang Pangulo ng Piskalya Malapit nang Magpatupad ng Ikalawang Bailout para sa mga Bangko\". Naghihintay pa rin para matagpuan ang genesis block. Ano kayang iniisip niya? Siguro ibinulong niya sa sarili niya \"Ngayon ay labis na! Ang pamahalaan ay sumusobra na sa kalabisan! Ngunit narito na ang Bitcoin ngayon...\".Walang nakakaalam kung ano ang maiisip niya sa araw na iyon. Ngunit ang tiyak ay noong ika-3rd ng Enero, 2009, ang bloke ng genesis ng Bitcoin ay mina. At naselyohang may pamagat ng pangunahing artikulo mula sa The Times.Nagsimula ang trabaho sa Bitcoin halos dalawang taon bago iyon, noong 2007. Si Satoshi, na sumali rin sa Cypherpunks mailing list, marahil ay nasaksihan ang nangyari sa e-Gold at sa mga may-ari nito. Malinaw ang layunin ng estado sa mga pribadong anyo ng pera. Ang konteksto sa ekonomiya at pulitika ay masama, sapagkat ang mundo ay nahaharap sa malaking krisis. Baka ang Bitcoin ay isang personal na pangarap ni Satoshi. O baka ang konteksto ng mundo ang nag-udyok sa kanya na magtrabaho sa kanyang imbento. Anuman ang katotohanan, ang mahalaga ay sinusundan niya ang pangarap na ito ng mga Cypherpunks, isang pangarap na ibinahagi rin ng mga ninuno sa libertarianismo.Batay sa isang libertarian at crypto-anarchic na ideolohiya, kasunod ng mga konsepto ng kanyang mga naunang, nagawa ni Satoshi Nakamoto na lumikha ng \"isang bagong electronic cash system na ganap na peer-to-peer, na walang pinagkakatiwalaang third party\". Ang system \"ay magbibigay-daan sa mga online na pagbabayad na direktang ipadala mula sa isang partido patungo sa isa pa nang walang mga pasanin na dumaan sa isang institusyong pampinansyal.  Ang mga digital na lagda ay nagbibigay ng bahagi ng solusyon, ngunit ang mga pangunahing benepisyo ay mawawala kung ang isang pinagkakatiwalaang partido ay kinakailangan pa rin upang maiwasan ang doble-spending.\"Sa ibang salita, ang Bitcoin ay ang unang anyo ng pribadong elektronikong pera, na nagpawalang-bisa sa mga tao mula sa panggugulo ng pamahalaan, sapagkat ang mga pondo ay maaaring ipasa nang direkta sa pagitan ng mga indibidwal, nang walang pakikialam ng anumang ikatlong partido - tulad ng mga bangko, na nagiging mga malalawak na kamay ng pamahalaan.Bitcoin genesis block || Pinagmulan ng imahe: RedditAng libertarianismo ni Satoshi ay naka-patunay sa maraming kaniyang mga salita.\"Ang tradisyunal na modelo ng pagba-bangko ay nakakamit ng antas ng privacy sa pamamagitan ng pag-limita ng access sa impormasyon sa mga partido na sangkot at sa pinagkakatiwalaang third party.  Ang pangangailangan na ipahayag nang pampubliko ang lahat ng transaksyon ay umaalis sa paraang ito, ngunit ang privacy ay maaari pa ring mapanatili sa pamamagitan ng pagputol ng daloy ng impormasyon sa ibang lugar: sa pamamagitan ng pananatiling anonymous ng mga public key.  Makikita ng publiko na mayroong nagpapadala ng halaga sa ibang tao, ngunit walang impormasyon na nag-uugnay ng transaksyon sa sinuman.  Ito ay katulad ng antas ng impormasyon na inilalabas ng mga stock exchange, kung saan ang oras at laki ng indibidwal na mga trade, ang 'tape', ay ginagawang pampubliko, ngunit hindi nagpapahayag kung sino ang mga partido.\"Ang isa pang magandang halimbawa sa bagay na ito ay ibinigay sa isang artikulo noong 2015 mula sa The Verge, na naglalarawan ng kanyang unang talakayan kay Martti Malmi, na sa kalaunan ay magiging administrator ng BitcoinTalk. Si Martti ay isa ring indibidwal na may mga anarchic na pananaw, dahil miyembro siya ng defunct forum na anti-state.org. Sinasabi sa artikulo:\"Sa kanyang unang email kay Satoshi Nakamoto, noong Mayo 2009, inaalok ni Martti ang kanyang mga serbisyo: \"Gusto kong tumulong sa Bitcoin, kung may magagawa ako,\" isinulat niya.Bago makipag-ugnayan kay Satoshi, sumulat si Martti tungkol sa Bitcoin sa anti-state.org, isang forum na nakatuon sa posibilidad ng isang anarkistang lipunan na inorganisa lamang ng merkado. Gamit ang screen name na Trickster, nagbigay si Martti ng maikling paglalarawan ng ideya ng Bitcoin at humingi ng mga saloobin: \"Ano sa palagay mo ito? Talagang nasasabik ako tungkol sa pag-iisip ng isang bagay na praktikal na maaaring tunay na maglalapit sa atin sa kalayaan sa ating buhay :-)\"Kasama sa kaniyang unang email kay Satoshi ang isang link sa post na ito, at mabilis na binasa ni Satoshi ito at nag-reply.\"Ang iyong pagkaunawa sa Bitcoin ay tumpak,\" sinulat ni Satoshi bilang tugon.\"Ang mga susunod na bahagi ng nagpapakita ng palatandaan ng pag-unlad ng Bitcoin (n.b. -- salamat, cygan para sa bahaging ito!) -- 5 email na ipinadalan nina Satoshi at Adam Back. Kung ang limang emails na ito ay dapat paniwalaan (at walang madaling paraan upang gawin ito) mayroon nang komunikasyon sina Satoshi Nakamoto at Adam Back mula pa noong Agosto ng 2008, Sa pamamagitin ng limang importanteng 'mga dokumento' maaari nating maipamalas ang isang partikular na bahagi ng panahon at maunawaan na nakipagugnayan si Satoshi sa ilang mga Cypherpunks.    Ang sagot ni Satoshi ay malinaw sa kanyang paningin. At ang kanyang aral ay hindi dapat kalimutan.Ang parehong ay totoo tungkol sa kanya kapag pinag-uusapan natin ang pagbabahagi ng mga punto ng interes ng Cypherpunks - binigyan niya ang mga tao ng libreng access sa Bitcoin, sa privacy na inaalok ng Bitcoin. Libreng pag-access at kadalian ng paggamit ng mga cryptographic key na ginagamit ng kanyang protocol. Ang Bitcoin ay dapat (at nagtagumpay na) ganap na baguhin ang libreng merkado. Sa huli, ito ay isang anyo ng pagsuway sa sibil. Isang paraan upang makakuha ng posisyon sa harap ng pera ng pamahalaan - ang traceable na pera, ang napalaki na pera, ang pera na araw-araw ay nawawalan ng halaga, dahil ang mga printer ng gobyerno ay patuloy na naglalabas ng bagong pera.Nais niyang tulungan ang mga tao na maging malaya muli. At ito ay posible sa pamamagitan ng Bitcoin. Wala nang bangko at pamahalaan ang maaaring \"pitasin\" ang salapi ng mga tao sa pamamagitan ng mas o menos sopistikadong mekanismo, tulad ng buwis sa paglilipat ng kanilang mga pondo, buwis sa pagbebenta ng kanilang mga produkto, buwis sa pagbebenta ng kanilang lakas ng trabaho. Ang Bitcoin ay libre para sa sinuman at ang kalayaan ay nasa loob nito; kung gusto mong magkaroon ng kontrol sa iyong privacy at mga pinansya, ang kailangan mo lang gawin ay yakapin ito.Ang Bitcoin ay nakita ng maraming taon, sa maraming pagkakataon, ni Tim May. Halimbawa, sa kanyang 1994 na sanaysay na Crypto Anarchy and Virtual Communities sinabi niya \"Ang teknolohiya ay nagpalaya sa genie mula sa bote. Ang Crypto anarchy ay nagpapalaya sa mga indibidwal mula sa pamimilit ng kanilang pisikal na mga kapitbahay-na hindi alam kung sino sila sa Net-at mula sa mga pamahalaan . Para sa mga libertarian, ang malakas na crypto ay nagbibigay ng paraan kung saan maiiwasan ang pamahalaan\".Ang Bitcoin ay tunay at narito para magpatuloy. Ang kalangitan ay nagsimulang bumagsak mula noong 1979 at patuloy na bumabagsak mula noon. Ang namamahala ay natalo sa digmaan. Ang kalayaan ay nasa ating mga kamay.Ito ang aking ika-1000 na post.At ito ay isang resulta ng aking nakaraang pagsulat na may kaugnayan sa Cypherpunks, kasaysayan at crypto-anarchy. Ang espiritu ng Cypherpunks ay nabubuhay sa marami sa atin. Tungkulin nating panatilihin itong buhay. Tungkulin nating patuloy na lumaban para sa kalayaan at kalayaan!Mga sanggunian:- 12 taon na pero hindi pa rin alam ng tao ang pag gamit ng Bitcoin- Pag habol ng goberyno sa traders- Kripto vs Pera na nailimbag ng bansa- Ang anarkiya at pag manipesto ng krypto - Mahalagang dapat basahin- Pag limita ng gobyerno sa pang publikong impormasyon at pag-hayag- Phil Zimmermann's pananaw para sa PGP - Mainam na basahin- When the govern wants to hold your private keys- Ang tawag para kay Julian Assange || Ang Pagmanipesto ng WikiLeaks - Basahin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457045",
  "comments": [
    {
      "author": "Asuspawer09",
      "created_time": "June 21, 2023, 04:04:38 AMLast edit: June 21, 2023, 10:36:01 AM by Asuspawer09",
      "body": "Ayon sa Gazeta ito ay isa sa uri ng pagkukumpara sa pagitan ng Bitcoin at lahat ng mga ninuno nito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "June 21, 2023, 09:54:23 AM",
      "body": "Dear Asuspawer09, I am more than happy to see my 1000th post on the forum translated in your language! I wanted to make a memorable essay with this 1000th post, so I decided to write this topic about Bitcoin and its ancestors. It took me a long time to properly document it and, as you already noticed, it was also a great amount of work also for translating it So I am really glad to see that my analysis of Bitcoin and its predecessors is also available in your local board. I hope that all Filipino users will enjoy reading this piece of history that shows how Wei Dai, Adam Back, Nick Szabo and David Chaum paved the way for Satoshi, decades ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}