{
  "id": "topic_5415879",
  "title": "casinotester0001",
  "author": "casinotester0001",
  "created_time": "October 04, 2022, 09:32:21 AM",
  "content": "US Senator Says 'I Love That Bitcoin Can't Be Stopped'source: https://news.bitcoin.com/us-senator-says-i-love-that-bitcoin-cant-be-stopped-citing-concerns-about-national-debt-and-inflation/U.S. Senator Cynthia Lummis says she loves that bitcoin cannot be stopped and that governments cannot just confiscate the cryptocurrency. “It’s actually comforting to know that bitcoin is there,” she said ...... she said the truth",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415879",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "October 04, 2022, 09:54:56 AM",
      "body": "Lummis is brilliant & a real advocate for bitcoin. I really like her but we need a lot more people in power to have her attitude towards bitcoin to really gain mainstream adoption.It’ll take a while but we’ll get there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 04, 2022, 01:44:10 PM",
      "body": "Quote from: DeathAngel on October 04, 2022, 09:54:56 AMIt’ll take a while but we’ll get there.Exactly. We're still early.However, as they're saying \"gradually, then suddenly\", now most countries are only \"checking the waters\". But I would not be surprised if in 10 years (or less?) the remaining countries may get into a FOMO situation and rush to make sure they do have Bitcoin as legal tender (at least!). Am I overly optimistic? Maybe, but the currently starting recession may be an eye opener.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "October 04, 2022, 01:54:10 PM",
      "body": "Quote from: NeuroticFish on October 04, 2022, 01:44:10 PM--snip--Exactly. We're still early.However, as they're saying \"gradually, then suddenly\", now most countries are only \"checking the waters\". But I would not be surprised if in 10 years (or less?) the remaining countries may get into a FOMO situation and rush to make sure they do have Bitcoin as legal tender (at least!). Am I overly optimistic? Maybe, but the currently starting recession may be an eye opener.Yup, not only the recession, but also the stories of countries (or banks) stopping people from accessing their own money we have seen in the news the last couple of weeks/months (the situation in Lebanon and China). Personally, i'd think such stories are even better \"selling points\" for crypto... No matter which country you live in, or which bank you use, as long as you have a non-custodial wallet, nobody will freeze your money... You'll always have funds at hand to pay for food/medicine/energy as long as there are people willing to accept your crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 04, 2022, 03:01:27 PM",
      "body": "It's good and reassuring to know that some politicians are actually able to understand the power of bitcoin and the power of a decentralised network. Because majority of this lot thinks that making laws will allow them to stop bitcoin which is obviously not true!I hope she will remain vocal about bitcoin and eventually help the users to get a favorable legislation as a whole which is still missing in US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "steve5946",
      "created_time": "October 04, 2022, 03:44:54 PM",
      "body": "Everyone has a different opinion about Bitcoin. While some people have understood its value, others are yet to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 04, 2022, 04:08:15 PM",
      "body": "Quote from: casinotester0001 on October 04, 2022, 09:32:21 AMUS Senator Says 'I Love That Bitcoin Can't Be Stopped'...Regardless of the general government opinion always made known about how they are against bitcoins, there are some individuals in the government that hold unique opinions and views about bitcoins and cryptocurrency different from the consensus who have refused to adopt the government's opinion simply because they are in the government. Regardless of your position in office, I always advice that people endeavour to do their own research and find out information about the credibility of something for themselves instead of taking people's word for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mynonce",
      "created_time": "October 04, 2022, 04:59:18 PM",
      "body": "Quote from: NeuroticFish on October 04, 2022, 01:44:10 PMExactly. We're still early.However, as they're saying \"gradually, then suddenly\", ...exactly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 04, 2022, 05:11:27 PM",
      "body": "Quote from: steve5946 on October 04, 2022, 03:44:54 PMEveryone has a different opinion about Bitcoin. While some people have understood its value, others are yet to do so.There is nothing in this world that everyone has the same opinion about, there must be difference in opinion, no matter how good that thing is, some people won't like it, either for personal reasons or because they have been misinformed about it. Bitcoin is no different, it is a new technology that the government and organizations like Greenpeace have spread so much propaganda about, so surely many people will be misinformed and would not try to understand it. But the longer people discover that 'Bitcoin can't be stopped', the harder it becomes to spread false information about it, and i feel we are getting there in some years time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 04, 2022, 05:17:28 PM",
      "body": "To have someone with power like Lummis supporting cryptocurrency in general, it’s one of the things that we shouldn’t take for granted. A lot of people should understand how you could take advantage of crypto in terms of  loss of value of your money. I hope a lot of people would follow her footsteps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "October 04, 2022, 05:28:33 PM",
      "body": "Hopefully it will be the support voiced by the government which will eventually make bitcoin more trusted by the world community. But most of the time we cannot predict the government's attitude towards bitcoin because they can change quickly when one or more people oppose them.I would definitely love it if bitcoin could be backed by the government, but the real mess is that the government doesn't want this decentralized system to lead the financial system that so many people adopt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "October 04, 2022, 06:25:10 PM",
      "body": "Quote from: DeathAngel on October 04, 2022, 09:54:56 AMLummis is brilliant & a real advocate for bitcoin. I really like her but we need a lot more people in power to have her attitude towards bitcoin to really gain mainstream adoption.This is the kind of news I always love to see and the fact that a high-profile Senator in the U.S said such things in an interview this means that a lot of people will see more light in the adoption of bitcoin. We need more powerful political leaders in the world to advocate for bitcoin more because with their backing bitcoin will not be hated as it is in some part of the world today and what Lummis have done is just information I believe more and more powerful world leaders will see the need for bitcoin adoption soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mynonce",
      "created_time": "October 04, 2022, 06:29:23 PM",
      "body": "Quote from: GiftedMAN on October 04, 2022, 06:25:10 PM~ I believe more and more powerful world leaders will see the need for bitcoin adoption soon.YES!Quote from: mynonce on October 04, 2022, 06:02:41 PMhttps://www.benzinga.com/markets/cryptocurrency/22/10/29138455/argentinas-energy-company-mines-bitcoin-using-residual-gasState-owned Argentina energy company YPF Mines Bitcoin Using Residual GasArgentina's power company comes up with a novel way to mine Bitcoin.An initiative to power Bitcoin mining using residual gas is being tested in Vaca Muerta oil field.Four months ago ME countries started Bitcoin mining:https://www.coindesk.com/business/2022/06/03/middle-east-oil-producers-move-into-bitcoin-mining-with-crusoe-energy-stakes/Crusoe Energy, the privately held U.S. company that pioneered bitcoin (BTC) mining by using wasted natural gas as a power source, is expanding in the Middle Eastern region with investments from Mubadala – the sovereign wealth fund (SWF) of Abu Dhabi – and the Oman Investment Authority (OIA).Did you know this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 04, 2022, 06:48:53 PM",
      "body": "It is so nice to see that some politician (you know politicians are known with their lies) can be honest about it. Bitcoin is really cool alternative financial instrument. It obviously also makes me feel safe that governments can't confiscate it. Its like legal grey area or island, where you can safely jump in or jump out. It gives great opportunity to people who wanna secure their wealth. I feel lucky to know Bitcoin in my life, relatively early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 04, 2022, 07:03:28 PM",
      "body": "Yes whether we like it or not, Bitcoin can't be stopped and it's true. No one controls it, not even the great Satoshi Nakamoto could even control it anymore. Once it's deployed, no one can control or stop you from initiating the transaction no matter how much the amount would that be. Even the banks and government can't do anything to stop it. Even the outright ban won't work, so they'll just have to regulate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "October 04, 2022, 09:59:44 PM",
      "body": "Quote from: cheezcarls on October 04, 2022, 07:03:28 PMYes whether we like it or not, Bitcoin can't be stopped and it's true. No one controls it, not even the great Satoshi Nakamoto could even control it anymore. Once it's deployed, no one can control or stop you from initiating the transaction no matter how much the amount would that be. Even the banks and government can't do anything to stop it. Even the outright ban won't work, so they'll just have to regulate it.and this is why some people are looking at bitcoin as one way to launder money because no one is controlling their transactions. but if we look at the positive side, we can enumerate a lot of good reasons why we need currency like btc today. just consider the fee when you send to other countries as compared to traditional remittance system like WU. with btc, it is borderless. you can receive your coin in just few minutes without the intervention of other party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "October 04, 2022, 10:33:31 PM",
      "body": "It is quite rare to see powerful people in the administration open-up their thoughts about bitcoin. She's clear about bitcoin and she loves it for the prime reason it can't be stopped. She even suggested bitcoin as a source that could help governments come out of the financial problems, particularly the inflation that have hit every nation. Even at the age of 68 Cynthia Lummis is good about the understanding and need of technology based financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "October 04, 2022, 10:45:58 PM",
      "body": "Honestly, this woman earns my respect because she's the first woman that's current in the US government office to make this statement and it only takes a genius mind to understand the benefit of Bitcoin not being controlled or confiscated by the government. Besides, 95% of government official considered the liberation potential of Bitcoin to be a threat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "October 05, 2022, 01:12:39 PM",
      "body": "Quote from: casinotester0001 on October 04, 2022, 09:32:21 AMUS Senator Says 'I Love That Bitcoin Can't Be Stopped'source: https://news.bitcoin.com/us-senator-says-i-love-that-bitcoin-cant-be-stopped-citing-concerns-about-national-debt-and-inflation/U.S. Senator Cynthia Lummis says she loves that bitcoin cannot be stopped and that governments cannot just confiscate the cryptocurrency. “It’s actually comforting to know that bitcoin is there,” she said ...... she said the truth  This is what the government is afraid of though. I mean as a senator they can think whatever they want, but if they cannot reach the bitcoins of anyone, and everyone goes into bitcoin, then it is not going to be that easy for them at all.This is what I believe would be a big deal for them, taxation is the key for any government to continue, and they do charge you tax when you profit from it, but if you hide it, and they cannot find it, that means they cannot tax something they do not know exists, and that’s their problem. Hence, senator or not, each of the government members, elected officials, need our taxes and bitcoin profits for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}