{
  "id": "topic_5457149",
  "title": "Saucyhead",
  "author": "Saucyhead",
  "created_time": "June 21, 2023, 11:38:35 PM",
  "content": "You have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? How can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ? I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retail",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457149",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "June 21, 2023, 11:44:04 PM",
      "body": "Forget about the opportunity that you have missed in the past. Like you said, you have no idea how Bitcoin could have reached where it is today, as do most of us out here. So the best you could possibly do now is to stop the regret and move past it. What matters is what you could do with the opportunities that you have at hand now that you know how important Bitcoin is. No time is too late to join the line; it's not about having millions first; if your mind is determined, you can start with any little one that you have, and little by little you will accumulate more. When the price pumps, everyone is going to realize profit according to their invested amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 21, 2023, 11:45:30 PM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMHow can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ? You mean that bitcoin has no utility? Are you in this world, or probably you do not know much about bitcoin. I do not expect anyone to come up with something false that bitcoin has no until. Quote from: Saucyhead on June 21, 2023, 11:38:35 PMI want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailThis is the reason you have not be buying bitcoin, you think it is made out of thin air and has no utility. You think like a bitcoin critic that is now seeing himself missing out of opportunity that increase in bitcoin price would have offered. Go and learn about bitcoin limited supply and increasing demand. Probably you will be able to know why bitcoin is an asset and why the price will still continue to increase than decrease.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 21, 2023, 11:52:32 PM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? You don't need millions to buy Bitcoins. The problem with some investors who rush to buy Bitcoin is to think they can get rich quick overnight. This is never going to happen. Even the HODlers we see today held the Bitcoins through the years. They could have sold bitcoin when it was just worth $500, but they didn't.QuoteHow can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ?I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retail The white paper is here, maybe it will help you understand Bitcoin's main purpose https://bitcoin.org/en/bitcoin-paper",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "June 21, 2023, 11:56:49 PM",
      "body": "You are not the only one who missed that opportunity in the early days of Bitcoin. I think it is best to forget about this because most of us in those days did not expect what Bitcoin is today.The opportunity is not limited to the first adopters only, but also to those who have mastered mining, and this did not cost them what it costs the same thing today.The problem with your position is that you are talking about Bitcoin as an investment opportunity only, and you do not notice how many steps Bitcoin has made in a short time that no one expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "June 21, 2023, 11:57:50 PM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMI want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailWhy would you invest right? You are not required to do so especially if that is how you view this technology. Those fanboys you are calling are simply ones who made profit from doing so. They are creating a hype and they are getting something from it; nothing's wrong with that. There are other investments you may choose from, you're not limited in this industry. But don't mind asking why there are many investors even if things are made of 'thin air'. If you're really that curious, just surf this section of forum and you'd know why. There are also other platforns such as social media sites you may also visit. People are doing and engaging to things because of a reason. And if I were you, you should also atleast have one, towards this industry before you actually start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 22, 2023, 12:42:55 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? Well you have to look long term, and that is the secret of early adopters. So I don't think there is a missed opportunities here, just buy as much as you can and then simply be a bitcoin holder. The longer you hold the better it might be for us, just like what the early adopters did.Quote from: Saucyhead on June 21, 2023, 11:38:35 PMHow can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ? Then experiment it yourself, try to buy items and pay bitcoin, simply as that. Quote from: Saucyhead on June 21, 2023, 11:38:35 PMI want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailDon't get me wrong, but I think the problem is your mindset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "June 22, 2023, 01:14:40 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PM(....)I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailWe can't avoid this and in some cases, this is true. So be careful because if you spend too much time on the internet, especially on social media, you will encounter a lot of people that doing already this, you are their exit.And for me, there's nothing wrong for this because they took a risk during early and I think it's worth it because at the first they don't know what will happen also in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 22, 2023, 01:15:18 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMI want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailFind a good discussion on its fundamental idea from a good book instead of Twitter/Reddit. Seeing how you don't see how companies make a profit from Bitcoin, I believe you're simply looking at the wrong place to understand Bitcoin. You can also browse around the Dev & Technical discussion on this forum. If after doing that you still don't understand or don't believe in it, then don't buy it. Nobody is forcing you to participate anyway, and if you're more comfortable with gold or other things then just buy that. Don't get trapped in FOMO.Quote from: Saucyhead on June 21, 2023, 11:38:35 PMSo now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? Nobody can give you an answer. Who knows, maybe someday you will ask the same thing but you'll replace $110 with $60k. At the end of the day, it is a high-risk high-reward investment. If you don't have the means to shoulder the risk, maybe you should look for alternatives. Obviously, you can just spend $100 and then forget it for 10 years or so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 22, 2023, 01:38:52 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? I'm glad you noticed that even a bit late, oh no you don't late, you still have time to buy even have a little money now. The Blackrock is just one euphoria of this era. I know that the company has secretly bought bitcoins since several years ago, but they don't tell us because they don't us to know they bought a lot of to avoid the price grow up significantly. Now, The Blackrock just bought a few, and seems to have finished it until the price back to ATH. The company has a strategy that can't have been predicted. But, we have the point key we should know is just buy the dip, DCA and hold, it then we can be won outperformed than the big company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "June 22, 2023, 02:40:25 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMHow can i understand Bitcoin more ?Bitcoin information and resourcesResources to teach Average Joe about BitcoinBitcoin WikiLearnmeabitcoin.comQuoteI mean it has no use for it yet, it is not producing profits for companies ? Since 2009, Bitcoin adoption has increased a lot and many use cases for bitcoin. No use for it, really? If no use for it, why are you here?QuoteI want to invest good capital but dont understand why I would do this on something made out of thin air.bitcoins are created by miners, from their Proof-of-Work mining works to find Bitcoin blocks. bitcoins are not created from thin air like altcoins with mint function.How is the 21 million Bitcoin cap defined and enforced?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 22, 2023, 03:20:03 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMI want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailJust like others said there is no time too late to invest into bitcoin. The coin wouldn’t stop circulating or halving after the next to suggest that it is an already missed opportunity but rather it mining would continue till 2140 before mining stops and that seems a very long time to come. And due how scarcity brings about demand, everyone that got the coin before then is still in good shape. Reading through your post I found that it is your skepticism that has and is keeping you away from been part of the early adopters. If at this time after you meet bitcoin at $110 and you still think it is just a thin air token then you would certainly miss more lows to buy on. There’s nothing bad having to cast your doubt before investing your money into something but if you actually have those doubts then there’s no reason to cast an eye on the people that are gaining after buying at such lows because they took the risk that most of us couldn’t, so it is best they enjoy the most of it now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "June 22, 2023, 03:28:33 AM",
      "body": "Quote from: Sarah Azhari on June 22, 2023, 01:38:52 AMQuote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? I'm glad you noticed that even a bit late, oh no you don't late, you still have time to buy even have a little money now. The Blackrock is just one euphoria of this era. I know that the company has secretly bought bitcoins since several years ago, but they don't tell us because they don't us to know they bought a lot of to avoid the price grow up significantly. Now, The Blackrock just bought a few, and seems to have finished it until the price back to ATH. The company has a strategy that can't have been predicted. But, we have the point key we should know is just buy the dip, DCA and hold, it then we can be won outperformed than the big company.There's no late comers when it comes to Bitcoin, you could always hop in to the market with proper knowledge and wise decisions for you to profit. As you guys mentioned like the Blackrock, there's always a new trend in years so there would be an opportunity for everyone to witness and experienced the bullish market where people could ride in. And I agree that you don't have to overthink about this company, just buy low, sell high to everyone and you could do better than those companies. But for sure there's no late comers but take your time to study the Bitcoin or else you would rush on these things which makes your life more complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "June 22, 2023, 03:39:33 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? How can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ? I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retaildon't try missing again mate , you have missed your chance before when you were young so now that you are mature enough and can deeply check what is given then why asking the community now .and if you are having confusion and second thoughts then leave this market and invest in other places where you can generate more than what you are thinking here.trust is the most important thing in each investing .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "June 22, 2023, 04:29:48 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? How can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ? I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailBitcoin is definitely not created out of thin air, every coin is basically created by doing work, aka Proof-of-work. You can't just simply generate a bitcoin out of thin air (which you can do with fiat by the way)You can understand more about Bitcoin by reading the whitepaper:https://bitcoin.org/bitcoin.pdfIt's a short read and explains the main concepts nicely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 22, 2023, 04:31:52 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PMYou have millions to buy ? I so missed out on this when it was $110 a coin but I was young and no money. So now that blackrock made some noise in the Bitcoin space and got everyone rallied up will this be the biggest money grab in history to then crash it on the recession? How can i understand Bitcoin more ? I mean it has no use for it yet, it is not producing profits for companies ? I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailnever look back and regret! I missed the chance too! But anytime is the best time to start investing in Bitcoin. because the price you see today, may not be available in the future. Don't let the Fear of missing out decide your next action. Start now and forget for another couple of years. This method works in almost all cases, be it in the stock market or the crypto market. Also, I am sure you don't know anything about Bitcoin mining. Otherwise, you wouldn't have said that it is made out of thin air. Be a little more respectful to the community and do research on how Bitcoins are created. Then come back here and then we will discuss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 22, 2023, 05:17:55 AM",
      "body": "Even if Bitcoin seems created out of nothing and intangible, it has a value given by the non-replicability.  In fact, Bitcoin can never be spent twice and therefore cannot be falsified, just like gold which cannot be reproduced artificially.  Also consider that the Fiat currency is constantly counterfeited but what is its true value other than being a trivial piece of paper?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 22, 2023, 05:27:12 AMLast edit: June 24, 2023, 01:19:29 PM by TheUltraElite",
      "body": "Bitcoin's job is not to provide profits for companies. It is a currency and a mode of transaction to change the economy. If you think everyone is a fanboy wishing for it to go up then be happy with that idea and not try to uncover yourself the reason behind it. Most of us here have watched the market for years enough to clear out the price cycles and how the market moves. While the long drawn bear market has it own effect on the traders psyche and the patience to hold through it.I suggest you learn how Bitcoin works and how it's demand and supply functions. We cannot prove to you that it will be a good investment for the future, so decide on that yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 22, 2023, 09:27:39 AM",
      "body": "Quote from: Saucyhead on June 21, 2023, 11:38:35 PM~snip~I want to invest good capital but dont understand why I would do this on something made out of thin air. Sometimes seems like its a lot of fanboys just wanting it to go up and up so they can then sell to retailIn this case, it may be better to keep your money or invest it in something else, because why would I or someone else assure you that Bitcoin is a good or bad choice for you? When you say \"something made out of thin air\" it is more than obvious you don't understand even the most basic.Maybe you should study mining and POW and read Bitcoin white paper, and if it doesn't help, I suggest you may buy a picture of the sunset and find the value by looking at the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 22, 2023, 09:47:36 AM",
      "body": "Based on your explanation you still think Bitcoin is useless and it's just like bubble going to burst, it's better if you not invest in Bitcoin because if the price suddenly drop 10% in a day or it's not like your expectation, you will say Bitcoin is scam.What is next for Bitcoin? nothing as it's keep decentralized and almost impossible to hack. But the next is adoption from the government about Bitcoin or the government will start ban Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}