{
  "id": "topic_5448171",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "April 09, 2023, 05:38:07 PM",
  "content": "Alik BakhshiPolitical conflicts and the fate of Azerbaijan        Moscow does not like to remember, let alone discuss the shameful pages of Russian history, which are not few and which were hidden from the population, for example, the so-called Molotov-Ribbentrop Pact (08/23/1939) on non-aggression between Nazi Germany and the USSR, after which Berlin and Moscow began implement their aggressive plans, the first victims of which were Poland, then Finland, which Russia attacked without declaring war. On that day, November 30, 1939, Russian bombers dropped 350 bombs on civilians in Helsinki, for which Russia was expelled from the League of Nations. However, this did not stop Moscow's aggressive intentions, and the subsequent victims of expansion were all European countries that had the misfortune of being neighbors of the Russian Empire. These are well-known facts, so to speak, but there are also little-known facts that were carefully hidden from the population. The fact is that Moscow at that time also planned to continue the aggressive policy of tsarist Russia towards Turkey and Iran. Thus, Russia sent an ultimatum to Turkey on granting her permission to deploy naval bases on the Bosphorus and the Dardanelles, to which Turkey responded with a decisive refusal. By the way, during Stalin's negotiations with Hitler on Russia's accession to the Tripartite Pact (Germany, Italy, Japan), Stalin raised the issue of the Black Sea Straits, but Hitler did not want to slaughter Turkey for Russia. Instead of Turkey, Hitler suggested that Russia direct its aspirations to the South-East towards Iran and India, controlled by Great Britain. The negotiations dragged on for a long time, this circumstance, in my opinion, aroused Hitler's suspicion of the reliability of Stalin as an ally, and in the end led to Hitler's decision to attack Russia. (1)     Regarding the policy towards Iran, Stalin seems to have been preparing for a long time to invade this country, so to speak, to continue the expansion of tsarist Russia, and then Hitler insisted, because oil was supplied from Iran to England. It is interesting that Stalin was not stopped by the German attack on the USSR and on August 25, 1941, despite the outbreak of war with Germany, the Red Army invaded Iran from the territory of Azerbaijan and Turkmenistan. The weak Iranian army was unable to stop the rushing wedge of 1000 tanks, which already on August 29 was 150 km away. from Tehran. On September 1, Shah Reza Pahlavi ordered an end to resistance and abdicated, giving way to his son Mohammed Reza Pahlavi. The occupation of Iran by the Soviet Union continued until April 1946 and was explained by the Kremlin to ensure security in the event of aggression from Turkey. Naturally, few believed in this absurdity. Stalin wanted to include the territory of South Azerbaijan into the USSR and bring a puppet communist party to power in Iran, as was done later in the countries of Eastern Europe that became members of the Warsaw Pact. For this purpose, a communist party was organized in the occupied part of Iran, the task of which was to establish a communist regime in the country. However, these plans of Stalin were opposed by Winston Churchill, who understood Russia much better than the naive Roosevelt, who completely trusted Stalin.          According to the decision of the Potsdam Conference, Soviet troops were to leave Iran by March 2, 1946, however, instead, the People's Republic of Azerbaijan was proclaimed on March 3, and on March 4, Soviet tanks moved towards Tehran.      The next day, March 5, when the crisis associated with Moscow's aggressive actions in Iran reaches its highest apogee, Winston Churchill delivers the famous Fulton speech, in which he opens the eyes of the Western public to what Russia is like. Here are his prophetic words:    “Today, a black shadow has fallen on the stage of post-war life, which until recently shone in the bright light of the Allied victory. No one can say what can be expected in the near future from Soviet Russia and the international communist community led by it, and what are the limits, if any, of their expansionist aspirations and persistent efforts to convert the whole world to their faith.”     Further, Churchill outlines the mechanism that Moscow uses in its aggressive policy and which can be characterized as international terrorism:     “In a number of countries around the world, although they are far from the Russian borders, communist fifth columns are being created, acting with amazing coherence and coordination, in full accordance with the guidelines emanating from the communist center. The Communist parties and their fifth columns in all these countries are a huge and, alas, a growing threat to Christian civilization.”     Although Churchill's Fulton speech refers to events in the distant past, it contains words that are very closely related to the actions of Putin's Russia in Ukraine and which indicate the great power mentality of the Russian people:       \"nothing they admire more than strength, and nothing they respect less than weakness, especially military weakness.\"       What to hide, it is thanks to the mentality of the Russian people that Putin manages to pursue an aggressive policy. (2.3)     Churchill's speech contains words directly related in time to Russia's aggressive actions against Iran and Turkey:      \"Turkey and Persia are seriously alarmed by the territorial claims presented to them by Moscow and the pressure exerted by it in connection with this.\"      The violation of the Potsdam Agreement by the Soviet Union provoked a sharp protest from the United States and Great Britain, who demanded the immediate fulfillment of the obligations signed by Moscow, setting a deadline by the anniversary of the end of the war, that is, by May 9, 1946, not a single Russian soldier should remain on the territory of Iran. Stalin had to obey, because he was given to understand that otherwise the United States would not fail to use the atomic bomb. At that time, the Soviet Union did not yet possess the secret of creating atomic weapons, received from the Rosenberg couple a little later.     After the withdrawal of the Red Army from Iran, the People's Republic of Azerbaijan, created in Iranian Azerbaijan, did not last even one day. Fleeing from the persecution of the Iranian government, the communists of South Azerbaijan, whom Shah Mohammed Reza Pahlavi considered the fifth column, hastily fled to Soviet Azerbaijan. In Baku they were called Iranian democrats. All of them remained citizens of Iran for a long time, until Moscow finally lost hope of returning to South Azerbaijan. And, who knows, if political circumstances had developed differently and Stalin had not made concessions, then today, after the collapse of the USSR, the Turkic people of Azerbaijan would live in one state. (4)            It should be noted that Stalin did not leave his maniacal idea with territorial claims against Turkey, which he tried to impose on the Potsdam Conference, arguing that the Montreux Convention on the Black Sea Straits was outdated and subject to revision. In addition, Stalin insisted on granting the USSR the right to have a naval base for joint control with Turkey over the straits in order to ensure their security, in addition, he demanded that the territory in the North-East of Turkey be transferred to the USSR to accommodate more than a million Armenians living abroad and dreaming of returning to Armenia. Moscow has already allocated a part of the territory of Azerbaijan for the Armenians, now it is necessary to provide the Armenians with a part of the Turkish territory. Having not achieved success at the Potsdam Conference, the USSR in 1946 turned to Turkey with a note of brazen demands to revise the status of the Black Sea straits, which Turkey resolutely rejected with the support of the United States and Great Britain. Only after Stalin's death in 1953 did Russia renounce territorial claims against Turkey in connection with Turkey's entry into NATO.      Using the example of the people of Azerbaijan, we see how the political intentions of strong countries influence the fate of peoples. In order not to be like a leaf in the wind, subject to someone's political aspirations, it is necessary to discard the rivalry between the Turks that is constantly pursuing each other and unite, creating an alliance similar to the European Union. (5,6)1. Stalin's fatal mistake that saved the world. https://alikbahshi.livejournal.com/20036.html2. The state-forming people and its Fuhrer or Ukraine and further down the list. https://alikbahshi.livejournal.com/21749.html3. Great Russian chauvinism, and Putin is his Fuhrer. https://alikbahshi.livejournal.com/21133.html4. Azerbaijan, Azerbaijan. https://alikbahshi.livejournal.com/13967.html5. One language - one Motherland. https://alikbahshi.livejournal.com/16879.html6. Turkic language and Azerbaijan. https://alikbahshi.livejournal.com/16879.html     04/07/2023  Original: https://alikbahshi.livejournal.com/95510.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448171",
  "comments": []
}