{
  "id": "topic_5470840",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "October 18, 2023, 08:28:04 PMLast edit: October 19, 2023, 04:28:31 AM by Hewlet",
  "content": "Sometimes I sit back and ask myself some questions like;What if I was born into a Muslim society, would I have been a Christian?How is it that of all the religions in this world, I was born in an environment where a particular one was popular and I had to belong to that one, and every other person outside of my religion became a sinner awaiting condemnation?And unfortunately, in the same way I was made to see the other folks outside my belief system as bad, they also look at me as bad because that's the image that has been painted in our minds by our religious leaders.But here is the hard reality. If you were born in a Muslim family/community there is a 90% certainty that you will be a Muslim. And this applies to almost all the things we believe in.Some of the practices we see others involved In and it irritate us to the born, if we grew up in such an environment where they are practiced, we would  do the sameI know we, Nigerians are very religious and will do anything it takes to protect our religious beliefs but then, lets know that we could have been at the other side of religious belief if we grew up there.Lets serve our God the way he ask us to and allow others to do there's to the best of there  ability caus las las, all of us de worship wetin our elders past give us.This thread is coming from a place of mutual acceptance and understanding of our differences in belief system which primarily is a function of our environment.That you are a Muslim doesn't make the Christian, Hindu, juju person or one that practices certain supposed God bad or foolish to be doing so. Remember you will most likely worship the same God or have the same belief system if you grew up in the same environment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470840",
  "comments": [
    {
      "author": "EluguHcman",
      "created_time": "October 18, 2023, 10:55:42 PM",
      "body": "Let's preach and teach more of humanitarian than whatever that is religionsly believed then one love would raise to make the world a better place for everyone.And then the earth of today can be beautified a heavy where we would all treat with conciousness not to get the life lost else the religious beliefs and practices would keep to take lead of divisionality and sentiments amongst both religious would keep to advance same way the world is getting to ab advance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "October 18, 2023, 11:40:56 PM",
      "body": "We have different scriptures, laws and guideline in all the different religions but there is something that is common which is the belief that God exist. When I see discrimination from people around me because of religion I feel hurt.  I can’t help but I feel it is completely pointless for religious sentiment. The most annoying part is that why would Christian have different doctrines when we are all Christians. Infact we the Christians, discriminate our own self because of doctrines and we see each other in a different perspective like we are worshiping a different God. Take a look at the Muslims one God which is Allah, one Bible which is the Quran and one doctrine. Honestly, when I observe how they come together and show affection to one another, even if I were raised in a Muslim household, I would still feel joy, and I would value it even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 19, 2023, 04:56:52 PM",
      "body": "To me religious inductrination is common in africa. expecially in Nigeria. And this has brought discrimination amongs us on daily basis. This has blindfolded many people to know that we all are serving the same God. Some times I dont blame the youth, but our parents. African parents always take it as a responsibility to guid you physically, emotionally, educationally and religiously. If you choose another paths, dey may decide to disown you or allow you to feed yourself. That is emotional torture. And there by being forced to do what dey do. Likewise the idol worshipers. Nigeria religion has always been a by forced religion. You can only be free when you are an adult or when you are now feeding yourself.There is nothing you and I can do about it. If you are born in Muslim you believe Muslim are serving the real God. Likewise to the Christian. When you are a full grown man or woman you have the chance to try other religion.The most inportant thing is let there be unity and love. Let us always love one another in respective of our religion,Culture and ethnicity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 22, 2023, 09:54:57 AM",
      "body": "Quote from: EluguHcman on October 18, 2023, 10:55:42 PMLet's preach and teach more of humanitarian than whatever that is religionsly believed then one love would raise to make the world a better place for everyone.And then the earth of today can be beautified a heavy where we would all treat with conciousness not to get the life lost else the religious beliefs and practices would keep to take lead of divisionality and sentiments amongst both religious would keep to advance same way the world is getting to ab advance.I agree with you because most of this religion preach what the dont practice so it is better for us as humans to think of ways by which we can help and assist one another to grow in the society rather than always believing in some scriptures that puts confusion and disintegration with one another",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "October 23, 2023, 06:24:20 PM",
      "body": "Religion which was supposed to bind us together is tearing us apart. Even the whites who brought most of these religions to us do not practice it the way we do. We have been so brain washed that we are ready to tear our families apart if they do not agree with or go contrary to our religious beliefs and what our priests told us. Religion will really be of help to humanity if everyone will abide by the teachings of love, where we will see everyone as one not minding the tribe, race, religion and background. If we practice love, some prayer points wouldn't be necessary.  Why pray against your father simply because he is a traditional worshipper? Truly, we have a long way to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "October 24, 2023, 04:54:37 AM",
      "body": "Every religion has a point at which it agrees with other religions, its the people that don't follow the teachings, thereby leading to religion bigotry and all forms of irresponsible behaviors all in the name of projecting religion. Let's take a look at the  five most popular religions in the world  Islam: “Not one of you truly believes until you wish for others what you wish for yourself.” – The Prophet Muhammad, Hadith.Hinduism: “This is the sum of duty; do not do to others what would cause pain if done to you.” – Mahabharata 5:1517.Buddhism: “Treat not others in ways that you yourself would find hurtful.” – Udana-Varga 5.18.Christianity: “In everything do to others as you would have them do to you; for this is the law of the prophets.” – Jesus, Matthew 7:12.Judaism – “What is hateful to you, do not do to your neighbour. This is the whole Torah, all the rest is commentary.” – Hillel, Talmud, Shabbat 31a.https://goodfaithmedia.org/faith-seeking-understanding-love-your-god-love-your-neighbors/#:~:text=Buddhism%3A%20%E2%80%9CTreat%20not%20others%20in,not%20do%20to%20your%20neighbour.You can see for yourself that they all preach about love to a very large extent. If we all could only practice love actively without reservation or sentiments, I believe the world will be a much better place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "October 24, 2023, 07:43:53 AM",
      "body": "It is what you are trained with, that you will be used to. If your parents are Christians, and live a moral life that is the character that they will impact on you, also with the Muslims and idol worshippers, this is why the other religious practice might irritate you, if you want it to.Let love lead and not religion, I could remember when we were still in college, where I grew up, we less care about religion because we see ourselves as one. We go to the same school, eat together and have fun together. The  only thing that we didn't do was to go to the same place of worship. If we see each other as one, the no matter the religion that you belong to, you wouldn't allow it to be a barrier to love.What I mean is that, it depends on the individual mindset how he sees other people that are not from the same religious practice with him, that they are not his enemies and not a problem so that they can live as one in love and unity to put hands together and raise the country to be a better place for our children, children.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}