{
  "id": "topic_5397939",
  "title": "kriptobaron",
  "author": "kriptobaron",
  "created_time": "May 09, 2022, 07:49:58 PM",
  "content": "https://coinmarketcap.jotform.com/221158472679970Şartları kabul edip mail ve binance ID girdikten sonra.Cevaplar.1 - All of the above2- The transfer fees go drectly to the Celer team.3- Over 204- Aggressive Conservative hodler.5- 2 & 36- Binance / Pancakeswap7- All of the above8- Acces to new and lnnovative9- All of the above10- All of the above11- All of the above12- NAME: Pear DAO, Symbol: PEX13- All of the above14- You can multiply your APYs15- All of the above16- By creating a space17- Avatar NFT18- 100.000 $LİVE19- Game with AR/VR20- TMT and GOAL21- Console game players22- All of the above23- Both are correcth24- A - yes, you can play for free25- Whitelisting26- Holders Supply & Volume27- Order bookEn son BNB cüzdan adresi isteyecek onu ekledikten sonra çıkan seçeneklerden  Yes, l wil complete it! diyoruz.BNB Chain Gravity Account: yazan yerin orda ki linke tıklıyoruz BNB Chaini takip ediyorsunuz bir gönderisine yorum begeni atmanızı istiyor.Bazen bu kısımda sitede hata veriyor olmazsa uğraşmayın.Yes l followed & left a comment! diyoruz bitiriyoruz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397939",
  "comments": [
    {
      "author": "Lebraam",
      "created_time": "May 09, 2022, 08:09:54 PM",
      "body": "teşekkürler paylaşım için",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jhonkar",
      "created_time": "May 10, 2022, 06:07:48 AM",
      "body": "teşekkürler hocam paylaşım için",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "May 10, 2022, 10:57:50 AM",
      "body": "Bilgi ve cevaplar için teşekkürler, doldurduk bakalım, multilerden sıra gelirse bize de bir şeyler düşer buradan iyi para dağıtıyorlar valla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "May 10, 2022, 07:28:57 PM",
      "body": "Hocam bu güzel haber için teşekkür ederim. bende bu özel etkinliği sizin sayenizde öğrendim. bu formu doldurup, bilgileri girip müsait bir zamanında airdrop için şansımı denemek istiyorum bakalım ne olacak bize çıkacak mı? bazı ülke vatandaşları bu airdropları sömürüyorlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "May 10, 2022, 07:46:12 PM",
      "body": "Bende teşekkür ederim ve bende AirDrop’a katılacağım. Az bir şey gelirse gelir, gelmezse gelmez şeklinde deneyeceğim. Artık bir miktar para ayırıp kenara bazı platformları kullanıp, platformların bazılarının yapacağı AirDrop’lardan şansımı deneyebilirim. Artık para yapan şeylerde bu önde geliyormuş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "May 10, 2022, 08:25:43 PM",
      "body": "Ödül bu sefer yüksek arkadaşlar doğal olarak şansımızda yüksek.CoinMarketCap elmas toplama sistemi var onu da kimse kaçırmasın günlük girip bir kaç tık ile elmasları toplayın ben 1000-5000 elmas ile alınan saçma sapan NFT'lerdense 1-2 yıl biriktirip yüklü elmas ile alınabilecek şeylerin peşinden koşacağım örnek ONE EPIC CoinMarketCap MOMO NFT var 50 bin elmasa 1 kişi alabiliyor ama bu biraz abartı olmuş 3 yıl refsiz elmas toplıcaksın nerdeyse ama şöylede bir durum var şuanda EPİC MOMO NFT'ler minimum 2400 dolar.Mantıken bu kadar yıl toplayıp peşinden koşturmak saçma gelebilir ama çok da bir şey yapmıyorsun 2-3 tık ile elmas topluyorsun buna para için bakmayacaksın ileride topladıklarına güzel bir şey denk gelirse o zaman bakarsın dalgana.Tabi 3000-5000 elmasa alınacak güzel NFT'ler düşerse onları da kaçırmamak lazım takip edip.Coingecko da var aynı şekilde o CMC'ye göre daha fazla veriyor elması.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "May 10, 2022, 10:29:23 PM",
      "body": "Quote from: kriptobaron on May 10, 2022, 08:25:43 PMÖdül bu sefer yüksek arkadaşlar doğal olarak şansımızda yüksek.CoinMarketCap elmas toplama sistemi var onu da kimse kaçırmasın günlük girip bir kaç tık ile elmasları toplayın ben 1000-5000 elmas ile alınan saçma sapan NFT'lerdense 1-2 yıl biriktirip yüklü elmas ile alınabilecek şeylerin peşinden koşacağım örnek ONE EPIC CoinMarketCap MOMO NFT var 50 bin elmasa 1 kişi alabiliyor ama bu biraz abartı olmuş 3 yıl refsiz elmas toplıcaksın nerdeyse ama şöylede bir durum var şuanda EPİC MOMO NFT'ler minimum 2400 dolar.Mantıken bu kadar yıl toplayıp peşinden koşturmak saçma gelebilir ama çok da bir şey yapmıyorsun 2-3 tık ile elmas topluyorsun buna para için bakmayacaksın ileride topladıklarına güzel bir şey denk gelirse o zaman bakarsın dalgana.Tabi 3000-5000 elmasa alınacak güzel NFT'ler düşerse onları da kaçırmamak lazım takip edip.Coingecko da var aynı şekilde o CMC'ye göre daha fazla veriyor elması.Coingecko tırt bir şey verdiği yok 30-40k nerdeyse şeker var elimde hiç bir şey alamıyorsun, çok nadir oluyor ondan etkinlik.CMC'nin arkasında binance olmasından dolayı para edebilecek şeyler daha fazla,  yeni başladım elmas toplamaya daha 1k yapamadım, seneye artık",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "May 10, 2022, 11:12:42 PM",
      "body": "Bu öğren kazan programlarını düşünüyorum, bir kaç cevap ile girdiğiniz airdroptan para kazanma olasılığı beni bunu denemeye itiyor, bilgileri verdiğiniz için, cevapları verdiğiniz için teşekkürler hocam, artık coinmarketcapin dağıttığı ödülden size pay gelmesini beklemek kalıyor,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "May 11, 2022, 05:43:09 PM",
      "body": "Coinmarketcap ile coingeckoya analiz ve protfolyo takibi için günlük giriyorum zaten. Girmişken elmasları alıp çıkıyorum. Önemsiz gibi görünen bu tip airdroplar gün gelir değerlenebilir. Geçmişte çok gördük benzer muslukları, dağıtımları, airdropları.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}