{
  "id": "topic_5445452",
  "title": "larry_vw_1955",
  "author": "larry_vw_1955",
  "created_time": "March 19, 2023, 01:17:28 AM",
  "content": "The stablecoin USDC has nearly regained parity with the U.S. dollar after rising just above $0.99 on March 12, 2023, at 7:20 p.m. Eastern Time. The stablecoin jumped back to the $0.99 range after the U.S. Federal Reserve revealed it would bail out depositors of California’s Silicon Valley Bank (SVB) and New York’s Signature Bank. Following the Fed announcement, Circle CEO Jeremy Allaire said on Twitter that the company would rely on BNY Mellon to settle the process of minting and redemption.quoted from:https://news.bitcoin.com/usdc-stablecoin-nears-parity-with-usd-after-feds-bailout-announcement/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445452",
  "comments": [
    {
      "author": "larry_vw_1955",
      "created_time": "March 19, 2023, 04:32:25 AM",
      "body": "you guys living in america realize that your tax dollars are at work here, right? paying that bill so that people that invested in USDC to make 10% return get taken care of... up next: using taxpayer dollars to refund people who got screwed in centralized platforms like blockfi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 19, 2023, 05:46:36 AM",
      "body": "From what I understand, they technically didn’t get “bailed out” because Circle requested a wire on Thursday which was before the cut off time which was Friday morning. They were going to get the full amount anyways even if the deposits weren’t covered 100%.Keep in mind they didn’t bail out the bank or shareholders. The bank is gone and if trading ever resumes it will trade close to $0 pretty much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "March 19, 2023, 10:55:37 PM",
      "body": "Quote from: adaseb on March 19, 2023, 05:46:36 AMFrom what I understand, they technically didn’t get “bailed out” because Circle requested a wire on Thursday which was before the cut off time which was Friday morning. They were going to get the full amount anyways even if the deposits weren’t covered 100%.they got bailed out:https://protos.com/how-the-us-govt-bailed-out-usdc-stablecoin/The government declared SVB and Signature as systemically important. To alleviate contagion to the US financial system, the FDIC guaranteed all deposits at both banks — including deposits above the FDIC’s standard, $250,000 per customer limit for federal deposit insurance.QuoteKeep in mind they didn’t bail out the bank or shareholders. The bank is gone and if trading ever resumes it will trade close to $0 pretty much.usdc is back at $1. thanks to the government bailout. trading in usdc has resumed...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}