{
  "id": "topic_5463893",
  "title": "j1792",
  "author": "j1792",
  "created_time": "August 20, 2023, 08:02:36 AM",
  "content": "Privacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463893",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 20, 2023, 08:15:48 AM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Bitcoin is the main coin while other coins are altcoins. People also know monero too. Monero is the 28th on the list if marketcap is used for comparison. It is having a marketcap of over $2.6 billion. Which means it is a good coin. But if you expectations about the coins is not up to what the marketcap is, it is good to know that most people that are into crypto do not care about privacy, they care about investing and making profit from the coin they invested in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 20, 2023, 08:48:02 AM",
      "body": "There are many centralized exchanges delisted Monero and privacy concern topic is a thing that the centralized entity e.g. government don't like it. If there are articles or influencers talk about privacy concern, they could be targeted since they're become the risk of centralized entity in order to control their citizen.Or maybe there are many people don't care about privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 20, 2023, 09:23:55 AM",
      "body": "Regulatory outlook. Many regulatory bodies are aware that a cryptocurrency that is built with privacy technologies enabled by default is not easily trackable. So there are many limitations set in place to prevent further adoption of such cryptocurrency, in this case, Monero. Besides, a specific purpose is built for different uses. People who love flexibility or more new things favour smart-contract-focused cryptocurrency. One thing is for sure there are people who maintain and protect their own privacy thoughtfully, and that suits them to utilise Monero. Each coin has its own purpose, and each user is free to choose what suits them. With that in mind, popularity is not a metric that might be worth considering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "August 20, 2023, 09:40:02 AM",
      "body": "Well I think when it was created in 2014 we thought it would be the only real coin for 'privacy'. But now there is so many other alt coins that have more privacy then moreno.I just think some new ones came along. It is a old coin like Dash and Zcoin that now are not so popular and with less marketcap then they had years back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 20, 2023, 09:49:51 AM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Most cryptocurrency users care about profit, not privacy. Few think about it and therefore, coins like monero are not so interesting for investors. Look at xrp, which has a huge amount of investor money poured into it, and ask yourself why this worthless shitcoin is preferred over xmr.Monero may not be as popular, but it certainly has its own user base. It is likely that over time, when there will be less financial freedom due to CBDC, coins that allow to remain confidential will rise again and become in demand, but for now, their fate is not enviable. In fact, the value of a coin is not a direct indicator of popularity. To understand this, it is necessary to check the number of daily transactions in the xmr network and compare with other altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 20, 2023, 09:52:39 AM",
      "body": "It is because monero is completely anti-government. It provides full privacy and the governments don't like it. Since the corps pay taxes to the government like us, it is impossible to establish a business without the consent of the government. Since the govs don't like anonymous coins like monero, exchanges delisted it and now monero is a dead man walking. This is what happens when you go against the government. They don't do the same thing to bitcoin because bitcoin is semi-anonymous and the gov is OK with it. Too bad for monero though. It really deserves to survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yudhisthir",
      "created_time": "August 20, 2023, 10:03:05 AM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Monero is hugely popular with illegal traders and criminals. That makes it a target for law enforcing agencies and buying and selling of it is made harder by the agencies and are not listed in most of popular centralized exchange. Even if it's harder to trade, it's still the most used privacy coin. Personally I, and most of other traders and investors don't require monero for their strategy as we have nothing to hide and want to avoid any unnecessary trouble with the agencies. Monero is a good coin for many but it's just a trouble for most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "August 20, 2023, 11:20:31 AM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Yes, privacy should be one of the main features of a coin. However, if you look at how crypto regulators look at Monero and other privacy coins, most of them have been delisted by exchange, because of the pressures from regulators.And if you look at this,QuoteIn a statement last month, the IRS created a pilot offering up to $625,000 for anyone who can provably trace Monero or other privacy coin transactions. According to the tax collector, privacy coins have become popular among \"illicit actors\" such as Sodinokibi (a former affiliate with the GrandCrab RaaS group) who stated that all future ransom payments will be in Monero (XMR) rather than Bitcoin (BTC) due to privacy concerns. The agency wanted to create some incentive to better understand the privacy coin sector since they say \"there are limited investigative resources for tracing transactions involving privacy cryptocurrency coins such as Monero.\"https://www.coinbureau.com/news/crack-monero-irs-six-figure-reward-trace-xmr/So how can you invest or put your money on Monero when government are trying to break them?And with that, it's going to be a cat and mouse game and so far Monero is losing it's ground.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 20, 2023, 12:58:27 PM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Monero is doing well now but it is also facing many battles from the government. First because it is a cryptocurrency and secondly because of its privacy status. The government don't want anything hidden. But then I do not totally blame them because the privacy of Monero is being abused and widely used in the dark net for all sorts of illegal transactions. While I am confident that Monero will one day make a major breakthrough. That will be when the need for privacy becomes a necessity for everyone. It might not happen soon, but it will surely happen and everyone will be privacy concerned despite what the government will say or do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "j1792",
      "created_time": "August 20, 2023, 01:14:13 PM",
      "body": "Quote from: _act_ on August 20, 2023, 08:15:48 AMQuote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Bitcoin is the main coin while other coins are altcoins. People also know monero too. Monero is the 28th on the list if marketcap is used for comparison. It is having a marketcap of over $2.6 billion. Which means it is a good coin. But if you expectations about the coins is not up to what the marketcap is, it is good to know that most people that are into crypto do not care about privacy, they care about investing and making profit from the coin they invested in.I don't know how they put up with full transparency on all their bills, the only explanation I can think of is that they don't even think about paying their bills in BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 20, 2023, 02:04:41 PM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?I dont think its not a main coin. Being in top 100 projects based on coingecko and coinmarketcap is one of the main coins or tokens. Its based their listing on marketcap and they have a huge one compared to other competitors. Not to the point that will head on like bitcoin since its really the number 1 coin. Privacy is important too but with the case of monero many exchanges wouldnt like their style thats why some got them delisted before on major cex.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 21, 2023, 06:38:11 AM",
      "body": "Quote from: cryptoaddictchie on August 20, 2023, 02:04:41 PMI dont think its not a main coin. Being in top 100 projects based on coingecko and coinmarketcap is one of the main coins or tokens. Its based their listing on marketcap and they have a huge one compared to other competitors. Not to the point that will head on like bitcoin since its really the number 1 coin. Privacy is important too but with the case of monero many exchanges wouldnt like their style thats why some got them delisted before on major cex. Monero is still listed on many exchanges, like Binance, Kucoin, Kraken, Bitfinix, Gate.io, OKX, MEXC, CoinEx and many other exchanges. Monero is listed on decentralized exchanges like Bisq and many others. If it is not listed on exchange like Coinbase, we all know how Coinbase is like this and how they restricted many countries. I am one of the people that do not like such an exchange like Coinbase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FahriZah",
      "created_time": "August 21, 2023, 06:42:11 AM",
      "body": "Absolutely main coin is bitcoin and monero is one of the good coin before time i see the movement huge facilities and for daily teading best coin monero but now monero very bad conditions and before time monero achieved huge population but now little down & unpopular hopefully monero agin come back with old performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big kid",
      "created_time": "August 21, 2023, 07:23:45 AM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Because most people care about profits and hype, privacy is for people who need it for some reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aseprebel",
      "created_time": "August 21, 2023, 07:48:42 AM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin? Monero is known for its strong emphasis on privacy and anonymity. While this is a valuable feature for users seeking enhanced privacy in their transactions, it also raised concerns about its potential use in illegal activities. This might have led to some hesitance among exchanges and mainstream platforms to adopt it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "August 21, 2023, 03:42:22 PM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?You want to know why Monero isn't as popular as other coins? Simple. It's because governments have been labeling privacy coins as something used by criminals (tax evaders, money launderers, etc). After all, they don't want people to obtain privacy and true financial freedom. A cryptocurrency they cannot track, trace, or even control, would be considered \"an enemy of the State\". The fact that many exchanges have de-listed Monero, tells us how powerful governments' influence can be over the crypto industry. I'm fine with Monero just the way it is, as long as stays private and decentralized. Maybe it will live alongside Bitcoin for generations? Just my opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "August 21, 2023, 04:23:08 PM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?People didn't really care with privacy these days. The reality is that hundreds of millions of people used a centralized exchange site that required verification and it can be hard to accept. Monero was very effective when it comes to the P2P transaction. It's actually a useless coin when you were trading it on centralized exchange site as your identity known by the exchange site. The privacy coin is not popular anymore. People prefer to get utility instead of privacy coin. Privacy is not necessary and it depends on yourself. Using an exchange site is easier to withdraw or deposit money to crypto than using p2p, even if you value privacy coin. So many privacy coins are dead now. Government is also the main reason people are willing to use centralized exchange site. They can be sued money laundering purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "August 21, 2023, 04:47:09 PM",
      "body": "The primary coin you are referring to is Monero going to outperform above bitcoin?Although currently Monero coins are still widely on centralized exchanges there are some exchanges that delist this coin for privacy reasons that regulators do not like, maybe what others have revealed is true monero is receiving a lot of challenges especially with the government.But this coin is still quite popular as the most private coin and that is what many people want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "August 21, 2023, 04:50:50 PM",
      "body": "Quote from: j1792 on August 20, 2023, 08:02:36 AMPrivacy is a necessary feature in my opinion, but why hasn't Monero become a main coin?Privacy concern was the main reason for which Monero got disconnected from peoples mind. Else earlier Munneru was one of the popular coin after Litecoin and Ethereum. Monero was not a main coin earlier. As it was one of the oldest coin, hence, it gained popularity along with bitcoins. Nowadays only few die hard traders have these coins in their wallets. And after bitcoins recent all-time high price, the popularity of Monero came down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}