{
  "id": "topic_5421329",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "November 16, 2022, 01:02:04 PM",
  "content": "I am a fan of Coinmarketcap/new, I use this link from time to time to look into new projects that find their way to the platform, i've heard that Coingecko is better for this but that's not why I am here..It's getting annoying to see new projects claiming they have good utility and when you go deep to do some research you ends up withSTAKINGBUYBACKBURNING MECHANISM Tell me how these are use cases? Are people still stupid enough to invest their hard earned money on such crypto projects? If you are new to crypto all these aren't real use cases.If these are all a project have to offer you better run, such projects have nothing to lose if they want to rug pull and believe me it's easier for them, they have nothing to offer in the first place.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421329",
  "comments": [
    {
      "author": "TheBeardedBaby",
      "created_time": "November 16, 2022, 01:24:00 PM",
      "body": "That topic is more for the Altcoin section.Basically 99.99% of the new projects are trash, just to follow the trend, create a meme coin or \"too good to be true\" kind of scammers. All of them are driven by greed, so they all end up in oblivion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "November 16, 2022, 01:59:14 PM",
      "body": "Projects that offer such utility are Defi projects. That's the type of mechanism they offer to their investors. Defi projects are the worst type of investment any investor can make. The only thing they are good at is increasing their tokens in number in your wallet but it is worth noting in the dollar price. Some of the Defi projects I know are on their way to zeros worth due to the bearish market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 16, 2022, 02:11:54 PM",
      "body": "Quote from: Outhue on November 16, 2022, 01:02:04 PMAre people still stupid enough to invest their hard earned money on such crypto projects? If you are new to crypto all these aren't real use cases.They aren't stupid but they let their actions bring out stupidity in them with their decision to made quick money through crypto project, this is common to newbies and anyone van as well fall a victim but rare inbthe case of experience bitcoiners who have the understanding of what they are looking for.Quote from: Outhue on November 16, 2022, 01:02:04 PMIf these are all a project have to offer you better run, such projects have nothing to lose if they want to rug pull and believe me it's easier for them, they have nothing to offer in the first place. It has been said repeatedly to always DYOR in whatsoever thing you wanted bto venture into in cryptocurrency and have an understanding of the risk involved in other to play safe and always not to invest any amount you can't afford to loose. That's why bitcoin is most preferred for investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "November 16, 2022, 03:41:57 PM",
      "body": "Quote from: Marykeller on November 16, 2022, 01:59:14 PMProjects that offer such utility are Defi projects. That's the type of mechanism they offer to their investors. Defi projects are the worst type of investment any investor can make. The only thing they are good at is increasing their tokens in number in your wallet but it is worth noting in the dollar price. Some of the Defi projects I know are on their way to zeros worth due to the bearish marketDefi has the same mechanism but I am talking about meme coins, they are popping up on coinmarketcap since the beginning of this bear market.Some Defi projects have good use cases apart from this mechanism we are talking about here but unlike meme coins, they produce nothing, they are community-based coins I guess that's what makes them useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "November 16, 2022, 03:44:07 PM",
      "body": "Quote from: Outhue on November 16, 2022, 01:02:04 PMAre people still stupid enough to invest their hard earned money on such crypto projects? If you are new to crypto all these aren't real use cases.Sadly many people are not using their brains at all, that is something I learned in last few years, they much more prefer to be treated as children so they need babysitters for everthing.I really don't see any need for using most shitcoins, like for example every damn centralized exchange created their own ponzi tokens, like FTT, BNB and other worthless crap.If I could find real use case for altcoins this would probably be only for privacy reasons and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 17, 2022, 10:15:11 AM",
      "body": "The reason for not learning comes from two things:They think profit is easy, especially with the stories of people who bought $100 and made $10,000 without effort.Fear of catching up with the train, especially if the price rises sharply, or fear of risk if the price drops sharply.It is these psychological factors that make the initial investment emotional, random, and involve a risk that we cannot control the results of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "November 17, 2022, 01:54:59 PM",
      "body": "Quote from: TheBeardedBaby on November 16, 2022, 01:24:00 PMBasically 99.99% of the new projects are trash, just to follow the trend, create a meme coin or \"too good to be true\" kind of scammers. All of them are driven by greed, so they all end up in oblivion. It's easy to create token out of thin air as ERC-20 token based on ETH standards without even looking for security bugs also merely for the purpose of making the founders rich out of your pockets.They don't have any utility to offer to the public and only attract you with some lucrative offers and people in the hoard of seeing some fake potential returns in future invest in them but later on it turned out to be scam coin.At this time there are around 18k cryptos listed on Coinbase and out of them 99% are shitcoins just setup for the purpose of scamming you people and they need to realise in what they are investing their funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kingkongs",
      "created_time": "November 17, 2022, 06:33:16 PM",
      "body": "Quote from: TheBeardedBaby on November 16, 2022, 01:24:00 PMThat topic is more for the Altcoin section.Basically 99.99% of the new projects are trash, just to follow the trend, create a meme coin or \"too good to be true\" kind of scammers. All of them are driven by greed, so they all end up in oblivion. I strongly disagree with you that 99.99 per cent of Altcoin are trash, but I have no doubt that they're all element of centralization, We have Alt Coin that are really doing well for themselves, and things has really been upward for them. My only concerning is creating a token without any plans for such project, I think the earlier we stop comparing BTC standard to every other will be far greater and better for us all. BTC open a new of possibilities, so it should always been respected for that. In conclusion some Alt Coin are superbly good, and some are useless, but not 99.99%. Also I will advice to stay away from project without real utility and use  case. Be warned",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 17, 2022, 07:27:20 PM",
      "body": "This are schemes many new projects use to get new investors i have personally seen some myself many claim they bring in, amazing utilities like NFT marketplace, play to earn gaming, partnership, giveaways, strong community or even professional team.You have to see the similarities with all this new project and understand that this might just be a trend you need to be careful about, I can't emphasize enough that it's best to good for good already established projects or have substantial review of a new one you are interested in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 17, 2022, 07:47:54 PM",
      "body": "Quote from: hugeblack on November 17, 2022, 10:15:11 AMThe reason for not learning comes from two things:They think profit is easy, especially with the stories of people who bought $100 and made $10,000 without effort.Fear of catching up with the train, especially if the price rises sharply, or fear of risk if the price drops sharply.It is these psychological factors that make the initial investment emotional, and random and involve a risk that we cannot control the results of.Those physiological factors are also the reasons why newbies need evaluation and revaluation of everything thrown at them from the market, trying to make 10x profits effortlessly is what has resulted into miss guided investment that has led many to lose their funds in projects that are designed just to steal from investors. And this gullible character is also what makes some invest in Ponzi scheme that brands themselves as cryptocurrency projects and this has been the major feature of the altcoin market like Bitcoin that can be easily held for a long term base without worries of totally losing all your money as we can see in altcoin were some coins can go from 100 to zero within a short time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 17, 2022, 07:59:58 PM",
      "body": "Quote from: TheBeardedBaby on November 16, 2022, 01:24:00 PMThat topic is more for the Altcoin section.Basically 99.99% of the new projects are trash, just to follow the trend, create a meme coin or \"too good to be true\" kind of scammers. All of them are driven by greed, so they all end up in oblivion. I believe that all new projects are rubbish and it's right to just follow the trend to get hype and make profit there for them whereas investors will suffer from losing a lot of money.Staking: usually they offer a bigger APY but in reality the price has dropped drastically.Buy back: this is crap I've been with for a long time but the team doesn't do that.Burning mechanism: Basically they only burn tokens from a few percent supply but still these tokens are useless.Don't look at what's on offer with the offer, I don't believe in it myself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 17, 2022, 08:08:27 PM",
      "body": "It's a PR move. Most of these projects have seen the necessity of token burning because they saw it effective for those who has tried it. Like for these two successful coins, BNB and ETH.As for BNB, cmiiw, there's a quarterly burning of it. And for Ethereum, every transaction we make, there's the portion that's being burned from the transaction fees.For the staking APY percentage rates, if they're too good to be true you better avoid them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 17, 2022, 09:18:55 PM",
      "body": "Quote from: Outhue on November 16, 2022, 01:02:04 PMIt's getting annoying to see new projects claiming they have good utility and when you go deep to do some research you ends up withThere's no need to look deeper, because they are all lying about utility. No one in real life uses things like smart contracts or DeFi for their applications. No matter how many new features you add to crypto coins and tokens, they will not be used in real economy, the world has seen and decided that crypto/blockchain is not a way to do things, that existing solutions are better. So the only use case of crypto is pumping it and dumping to bigger fools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "November 17, 2022, 09:38:03 PM",
      "body": "Quote from: Outhue on November 16, 2022, 01:02:04 PMAre people still stupid enough to invest their hard earned money on such crypto projects? If you are new to crypto all these aren't real use cases.If these are all a project have to offer you better run, such projects have nothing to lose if they want to rug pull and believe me it's easier for them, they have nothing to offer in the first place. Unfortunately, these platforms rely a lot on newcomers to the crypto field to spread offers delusional about quick profit and security. Newcomers will follow these offers out of ignorance of what they are and with confidence in those platforms that publish the offers.There are scam gambling platforms that post their ads on many well-known websites. I would like you to review the updates regarding both the 1xbit platform and the 1xbet platform. These two platforms have proven to be fraudulent platforms, but you can see advertisements for them even in world football stadiums.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 18, 2022, 04:37:01 AM",
      "body": "You could summarise real use case having projects to single digits out of thousands that exist. Points you mentioned indeed scream futile project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 18, 2022, 05:48:24 AM",
      "body": "Quote from: Outhue on November 16, 2022, 01:02:04 PMAre people still stupid enough to invest their hard earned money on such crypto projects? If you are new to crypto all these aren't real use cases.I'm convinced that a large percentage of altcoin investors already know this and they aren't buying shitcoins because they think they have use cases but instead they buy them because they think they can make money when they get pumped. In other words they are gamblers that are making bets on altcoins.It is like the gambler who is playing a dice game while they know there is nothing real in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 18, 2022, 07:05:24 AM",
      "body": "Quote from: Outhue on November 16, 2022, 01:02:04 PMIf these are all a project have to offer you better run, such projects have nothing to lose if they want to rug pull and believe me it's easier for them, they have nothing to offer in the first place. Actually you are right. These features are quite simple to be considered as use case. Most shitcoins are like that, so we can notice that its structure is only created for that. But if these features are related and connected to a bigger use case then we can change the belief on that projects. Example bnb, its a coin with multiple feature that all you mentioned. But also they have some products that you can use the tokens which it make it healthy. What I dont like about them is the centralized system which is quite a negative trait for such decentralized world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 18, 2022, 11:13:18 AM",
      "body": "Quote from: Wiwo on November 17, 2022, 07:47:54 PMThose physiological factors are also the reasons why newbies need evaluation and revaluation of everything thrown at them from the market, trying to make 10x profits effortlessly is what has resulted into miss guided investment that has led many to lose their funds in projects that are designed just to steal from investors. The problem is where do I get the information from and who do I trust? I remember over the past year, on many TV channels, there was an exaggerated promotion of NFTs on the grounds that it brings quick profits.After that, the user will search social media to find armies of robots that convince him that investment now is a golden opportunity. Some people search Google to find currency in the first result and some (paid) articles that talk about the economic feasibility of investment.All factors will make you believe that you got the golden opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "November 18, 2022, 11:37:38 AM",
      "body": "It is unfortunate that projects with actual use cases and unique ideas fall before they even get to try or remain stuck in a very low Market Cap ranking while projects like SHIB get to the top.  I wish all this hype did not exist but we all know Cryptocurrencies will continue to be a space full of hype.  ICO's and all other type of O's, 'Decentralized Exchanges', Burning Mechanisms, NFT's et cetera.  They all bring pretty much nothing but hype that ultimately dies after a pretty short while but makes some certain few people rich.I was hyped up years ago that one day the list of Cryptocurrencies will get drastically changed by shaking off all the crappy projects.  I am still waiting and hoping for that to happen because it seems like almost everything is just a bare copycat with a different name.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}