{
  "id": "topic_5444398",
  "title": "LDL",
  "author": "LDL",
  "created_time": "March 10, 2023, 11:27:05 PM",
  "content": "President Joe Biden's administration has imposed a 30% tax on bitcoin mining electricity use. Bitcoin mining was not very profitable even though this tax was not levied in the past. But what impact will the new electricity cost have on Bitcoin mining?Will this additional electricity tax attract new miners to Bitcoin mining?What will be the impact on hashpower for a 30% mining tax?Even before the imposition of this tax, some mining companies were in losses.What are the old mining companies thinking about this tax?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444398",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 10, 2023, 11:52:31 PM",
      "body": "Quote from: LDL on March 10, 2023, 11:27:05 PMPresident Joe Biden's administration has imposed a 30% tax on bitcoin mining electricity use. Bitcoin mining was not very profitable even though this tax was not levied in the past. But what impact will the new electricity cost have on Bitcoin mining?Bitcoin mining profitability is mostly seasonal with several factors determining the profitability such as Bitcoin Price, hash rate and the changes in Bitcoin transaction fees.QuoteWill this additional electricity tax attract new miners to Bitcoin mining?Will the 30% tax on Bitcoin mining work outside the US?  QuoteWhat will be the impact on hashpower for a 30% mining tax?Absolutely nothing, mining is not done only in the US. Also, not everyone in the US will stop mining because of the 30% mining taxQuoteWhat are the old mining companies thinking about this tax? If you were a miner, what would you think about the tax?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_oh_no_stop_this_",
      "created_time": "March 11, 2023, 01:01:34 AM",
      "body": "In my humble opinion, this will lead to the concentration of miners in the large entities (eventually exposed to the government) that can afford having their own power plants (talking about the U.S. of course).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "March 11, 2023, 02:01:32 AM",
      "body": "Quote from: LDL on March 10, 2023, 11:27:05 PMPresident Joe Biden's administration has imposed a 30% tax on bitcoin mining electricity use. Bitcoin mining was not very profitable even though this tax was not levied in the past. But what impact will the new electricity cost have on Bitcoin mining?Will this additional electricity tax attract new miners to Bitcoin mining?What will be the impact on hashpower for a 30% mining tax?Even before the imposition of this tax, some mining companies were in losses.What are the old mining companies thinking about this tax? Well Trump taxed  China imports at 30% I have paid thousand in import duties . It slowed my mines growth.I would need to read the tax bill proposed to under stand if it will hurt my mine as much or more than the import tax.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "March 12, 2023, 02:31:03 PM",
      "body": "Quote from: LDL on March 10, 2023, 11:27:05 PMPresident Joe Biden's administration has imposed a 30% tax on bitcoin mining electricity use. Bitcoin mining was not very profitable even though this tax was not levied in the past. But what impact will the new electricity cost have on Bitcoin mining?Will this additional electricity tax attract new miners to Bitcoin mining?What will be the impact on hashpower for a 30% mining tax?Even before the imposition of this tax, some mining companies were in losses.What are the old mining companies thinking about this tax? That's a very high tax rate. Companies will move to another country instead of paying the tax. BTC is decentralized, so such a law (if it's approved by Congress) won't affect PoW mining in any way. On the contrary, it will make BTC stronger and set the US back in crypto/Blockchain adoption. The country has already been taking an aggresive approach against crypto, so it should only be a matter of time before EU takes the reigns as the world's biggest crypto hub. I hope the 30% tax rate only applies to mining companies and NOT individuals. Because that would only make matters worse. Who knows what's next in store for Biden's \"Anti-Crypto Agenda\"? Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "March 13, 2023, 02:13:44 AM",
      "body": "Yeah its a huge jump and most of them might run away or just pay the tax till the new regulation says \"BAN ON CRYPTO MINING\".  or  they might declare non-mining operation and say it datacenter or so.Kazakhstan is crypto-mining friendly but I don't know until when it going to last. Since there is news that says \"An individual's income from the sale of digital asset issued by a foreign issuer will be subject to personal income tax at the rate of 10%. The taxable basis will be the positive difference between the sales price and the purchase price of the digital asset.\" - https://www.mondaq.com/tax-authorities/1290116/changes-in-the-digital-mining-taxation-in-kazakhstans Just the sale of digital asset Quote from: philipma1957 on March 11, 2023, 02:01:32 AMWell Trump taxed  China imports at 30% I have paid thousand in import duties . It slowed my mines growth.I would need to read the tax bill proposed to under stand if it will hurt my mine as much or more than the import tax.Is the regulation import still there, I mean if tax on mining is approved you need more time to even ROI right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maxre",
      "created_time": "March 13, 2023, 05:08:30 AM",
      "body": "Quote from: LDL on March 10, 2023, 11:27:05 PMPresident Joe Biden's administration has imposed a 30% tax on bitcoin mining electricity use. Bitcoin mining was not very profitable even though this tax was not levied in the past. But what impact will the new electricity cost have on Bitcoin mining?Will this additional electricity tax attract new miners to Bitcoin mining?What will be the impact on hashpower for a 30% mining tax?Even before the imposition of this tax, some mining companies were in losses.What are the old mining companies thinking about this tax? In my point of view that Bitcoin and also crypto might be in great danger because having 30% taxes on the Bitcoin could cause significant ending of mining powerhouse that run full on crypto and it could be a disaster for the Cryptocurrency community too. So by the way if these miners are agreeing to paying taxes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "March 13, 2023, 05:23:22 AM",
      "body": "Quote from: Abiky on March 12, 2023, 02:31:03 PMOn the contrary, it will make BTC stronger and set the US back in crypto/Blockchain adoption. well i'd say the usa is already hamstrung by the IRS backwards legislation about wanting to have a record of every single transaction you do even if it's just a cup of coffee you have to keep records on it and report it. so this won't really change anything who wants to use crypto in the usa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minemyhive",
      "created_time": "March 13, 2023, 07:03:06 AM",
      "body": "Simply put: wouldn't mining just move to non US domicile facilities? That is the most straightforward. And have a mix of JV entities in the end",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "March 13, 2023, 12:17:11 PM",
      "body": "I know a man in the U.S that use solar power to mine Bitcoin, I lost contact with him in 2022,  he told me how he makes money by selling power back to the Grid, I would have love to hear what he plans to do with this 30% tax on Bitcoin mining, because it is not possible to keep mining 24 hours per day using solar energy without the grid power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "March 13, 2023, 10:30:15 PM",
      "body": "Quote from: Maxre on March 13, 2023, 05:08:30 AMIn my point of view that Bitcoin and also crypto might be in great danger because having 30% taxes on the Bitcoin could cause significant ending of mining powerhouse that run full on crypto and it could be a disaster for the Cryptocurrency community too. 30% of what exactly? 30% of your total electricity bill?  Quote from: Z390 on March 13, 2023, 12:17:11 PMI know a man in the U.S that use solar power to mine Bitcoin, I lost contact with him in 2022,  he told me how he makes money by selling power back to the Grid, I would have love to hear what he plans to do with this 30% tax on Bitcoin mining, because it is not possible to keep mining 24 hours per day using solar energy without the grid power. i mean if he's mining with his own power then he doesn't have to pay anyone any tax for using that electricity. so he's good. if he has batteries then maybe he can be mining at night. but not sure how feasible that is",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "March 14, 2023, 12:37:03 AM",
      "body": "Quote from: Z390 on March 13, 2023, 12:17:11 PMI know a man in the U.S that use solar power to mine Bitcoin, I lost contact with him in 2022,  he told me how he makes money by selling power back to the Grid, I would have love to hear what he plans to do with this 30% tax on Bitcoin mining, because it is not possible to keep mining 24 hours per day using solar energy without the grid power. We have 3 arrays280 kwatts110 kwatts  45 kwatts435kwatts total which with grid sales means we burn 60kwatts 24/7/365 and net zeroso 60kwatts of free powerbut our mine burns 130kwatts so we buy 70 kwatts an hour on the cheapMy guess is if this happens we have to cut back to 60kwatts of free power and no cheap power with that 30% tax.No worries as that bill will bomb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xylber",
      "created_time": "March 14, 2023, 01:12:35 AM",
      "body": "They are crazy, they want to earn 30% taxes from the miners, but they run to protect traditional bankers when they go broke...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sledge0001",
      "created_time": "March 14, 2023, 01:17:03 AM",
      "body": "Correct me if I'm wrong but it seems that we in the US already pay taxes and fees on our electric bills. Seems like the exact definition of double taxation and is nothing more than a money grab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "March 14, 2023, 01:22:58 AM",
      "body": "Quote from: minemyhive on March 13, 2023, 07:03:06 AMSimply put: wouldn't mining just move to non US domicile facilities? That is the most straightforward. And have a mix of JV entities in the endIn theory yes, but there is no other place on the planet that can facilitate the amount of hashrate the U.S has, the U.S is where the money resides,  U.S large miners who now make up nearly 50% of the total hashrate wouldn't be able to collect half the money elsewhere, investors in the U.S have a ton of money to risk which is why large U.S mining companies grow at a very unrealistic rate despite having made worse decisions than any rookie miner (like buying those tens of thousands S19s for $15,000 right at the peak of the cycle)So not all of the hashrate will be able to move elsewhere if shit hits the fan, moreover, I think the proposed tax is just on the power bill, not the total income, so the companies that pay 5 cents per kWh will have to pay 6.5 cents, is it going to hurt? of course? is it going to be the end of the world for them? no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "March 14, 2023, 01:29:29 AM",
      "body": "That bill is not passing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "March 14, 2023, 02:25:52 AM",
      "body": "Quote from: philipma1957 on March 14, 2023, 12:37:03 AMMy guess is if this happens we have to cut back to 60kwatts of free power and no cheap power with that 30% tax.according to: https://cointelegraph.com/news/biden-budget-proposes-30-tax-on-crypto-mining-electricity-usageThe tax would be phased-in at 10% per year over three years and covers electricity generated from both on and off-grid sources. Crypto miners who acquire their electricity needs off-grid would still be subject to the tax and would be required to estimate the electricity costs generated by any “electricity generating plant.”so you would still have to pay the tax for the 60kwatts though. QuoteNo worries as that bill will bomb.so then you don't agree that excise taxes are an acceptable thing or you just don't agree that excise taxes for crypto mining are an acceptable thing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "March 14, 2023, 03:09:17 PM",
      "body": "Quote from: LDL on March 10, 2023, 11:27:05 PMPresident Joe Biden's administration has imposed a 30% tax on bitcoin mining electricity use. Bitcoin mining was not very profitable even though this tax was not levied in the past. But what impact will the new electricity cost have on Bitcoin mining?Will this additional electricity tax attract new miners to Bitcoin mining?What will be the impact on hashpower for a 30% mining tax?Even before the imposition of this tax, some mining companies were in losses.What are the old mining companies thinking about this tax?    If Biden actually implements that, the only number 1 that will be affected are those who live there in the US. So my question to you is, is the 30% tax you are talking about related to bitcoin and altcoin mining? maybe you are only talking about the traditional mining industry?Besides that, I don't think it has any effect if the US is no longer covered. Of course that will only be effective based on Biden's jurisdiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "March 14, 2023, 05:10:22 PM",
      "body": "Quote from: larry_vw_1955 on March 13, 2023, 05:23:22 AMwell i'd say the usa is already hamstrung by the IRS backwards legislation about wanting to have a record of every single transaction you do even if it's just a cup of coffee you have to keep records on it and report it. so this won't really change anything who wants to use crypto in the usa?  Too much taxation would greatly stifle the growth of the crypto industry within the country. Consider how things didn't end too well for India when it imposed huge taxes to crypto users. Taxes need to be moderate to help prevent big industry players from migrating to another country. I'd say a 30% mining tax is too high. Hopefully, it'll get rejected by Congress, else there will be a mass exodus of miners from the US to other countries that are much more flexible. Every transaction made on the US with crypto is already considered as \"taxable\", so I don't get why the government wants to add more taxes on top of existing ones. It's all a deliberate attempt to try to harm crypto/Blockchain tech for good. Who knows where this will lead the country in the future? Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "March 14, 2023, 07:25:27 PM",
      "body": "found full paperhttps://home.treasury.gov/system/files/131/General-Explanations-FY2024.pdfQuoteIMPOSE DIGITAL ASSET MINING ENERGY EXISE TAX Current LawCurrent law does not provide tax rules specifically addressing digital assets, with the exception of certain rules relating to broker reporting and reporting of cash transactions.Reasons for ChangeDigital asset mining is a process for validating transactions among holders of digital assets to record and transfer cryptographically secured assets on a distributed ledger by, for example, using high-powered computers to perform calculations to select the validator.The computational effort involved in mining can be substantial and can therefore require a correspondingly large amount of energy. The increase in energy consumption attributable to the growth of digital asset mining has negative environmental effects and can have environmental justice implications as well as increase energy prices for those that share an electricity grid with digital asset miners. Digital asset mining also creates uncertainty and risks to local utilities and communities, as mining activity is highly variable and highly mobile.An excise tax on electricity usage by digital asset miners could reduce mining activity along with its associated environmental impacts and other harms.ProposalAny firm using computing resources, whether owned by the firm or leased from others, to mine digital assets would be subject to an excise tax equal to 30 percent of the costs of electricity used in digital asset mining.Firms engaged in digital asset mining would be required to report the amount and type of electricity used as well as the value of that electricity, if purchased externally. Firms that lease computational capacity would be required to report the value of the electricity used by the lessor firm attributable to the leased capacity, which would serve as the tax base. Firms that produce or acquire power off-grid, for example by using the output of a particular electricity generating plant, would be subject to an excise tax equal to 30 percent of estimated electricity costs.Except as otherwise provided by the Secretary, the term “digital asset” means any digital representation of value which is recorded on a cryptographically secured distributed ledger or any similar technology as specified by the Secretary.The proposal would be effective for taxable years beginning after December 31, 2023. The excise tax would be phased in over three years at a rate of 10 percent in the first year, 20 percent in the second, and 30 percent thereafter.71General Explanations of the Administration’s Fiscal Year 2024 Revenue ProposalsandQuoteMODERNIZE RULES, INCLUDING THOSE FOR DIGITAL ASSETSAPPLY THE WASH SALE RULES TO DIGITAL ASSETS AND ADDRESS RELATED PARTY TRANSACTIONSCurrent LawSection 1091 of the Internal Revenue Code disallows a loss from a sale of stock or securities if the same or substantially identical stock or securities are purchased within 30 days before or after the sale (a “wash sale”) unless the taxpayer is a dealer in stock or securities and the loss is sustained in the ordinary course of its dealer business. If the stock or securities are purchased at a price that differs from the sale price of the stock or securities sold, appropriate adjustments are made to the basis of the purchased stock or securities. The holding period for the purchased stock or securities takes into account the holding period for the sold stock or securities. As a result, the effect of the wash sale rules ordinarily is to defer the recognition of a loss until the taxpayer finally disposes of the stock or securities. The wash sale rules also apply to sales of stock or securities where the taxpayer enters into a contract or option to buy the same or substantially identical stock or securities within the 30-day window, and to certain short sales of stock or securities. The wash sales are intended to ensure that taxpayers cannot recognize losses without exiting their position in a loss asset for a meaningful period of time.The Internal Revenue Service treats a loss from a sale of stock or securities by a taxpayer that causes its individual retirement account or Roth IRA to purchase substantially identical stock or securities within 30 days of the sale as subject to the wash sale rule.52Except as otherwise provided by the Secretary or her delegates (Secretary), brokers who report gross proceeds and basis from the sale of stock or securities determine a customer’s adjusted basis without regard to the wash sale rules, unless the transaction occurs in the same account with respect to identical securities.Reasons for ChangeTaxpayers with loss positions in digital assets are engaging in transactions that would be subject to the wash sale rules if the digital assets were subject to section 1091. For example, a taxpayer may sell a digital asset that is not considered a stock or security for wash sale purposes at a loss on one day and repurchase the same digital asset the next day. The same loss recognition rules should apply to digital assets held as investments or for trading as would apply for stocks and securities.The wash sale rules should also be updated to provide statutory rules addressing related party transactions, and to reflect new types of financial instruments that have developed since the last amendments made to those rules.52 Revenue Ruling 2008-5, 2008-1 C.B. 271.190    General Explanations of the Administration’s Fiscal Year 2024 Revenue ProposalsBroker reporting rules should be amended to reflect these changes to the wash sale rules.ProposalThe wash sales rules would be amended to add digital assets to the list of assets subject to the wash sale rules. Except as otherwise provided by the Secretary, the term “digital asset” means any digital representation of value which is recorded on a cryptographically secured distributed ledger or any similar technology as specified by the Secretary.53 Regulatory authority would be granted to the Secretary to treat any security as defined by section 475(c)(2), or any commodity as defined by section 475(e)(2), or other assets traded on an established market as subject to the wash sale rules as necessary to prevent abuse. The basis and holding period rules applicable to purchased assets would be revised to reflect the expanded scope of the wash sale rules. These expanded rules are not intended to apply to ordinary course business transactions. The Secretary would have authority to prescribe regulations defining the term ‘substantially identical” and to provide an exception to the application of the wash sale rules for ordinary course business transactions (not including trading) involving digital assets.The wash sale rules, as they apply to all assets and not only digital assets, would be modified with respect to transactions involving related persons, except as otherwise provided in regulations prescribed by the Secretary. In the case of any loss from a sale of assets subject to the wash sale rules and a purchase by a related party of the same or substantially identical assets within 30 days of the sale, the loss would be deferred until the related party sells or otherwise disposes of the asset or such other time as specified by the Secretary, provided that the taxpayer and a related party do not reacquire the asset within 30 days before or after that sale or disposition, or the parties cease to be related. A related party would include members of a taxpayer’s family and tax-favored accounts such as individual retirement accounts controlled by the taxpayer or the taxpayer’s spouse. Two entities would be related to each other if one controlled the other, directly or indirectly, or both were under the common control of either a third entity or the taxpayer and one or more family members. An individual would be related to an entity if the entity is controlled, directly or indirectly, by the individual and the individual’s family members. The Secretary would have authority to issue regulations expanding this definition as necessary to prevent abuse, to provide rules for transactions where a taxpayer sold assets at a loss and both the taxpayer and a related party acquired the same or substantially similar assets, and to coordinate the operation of the wash sale rules with other rules dealing with sales of loss property between related parties (sections 267 and 707).The wash sale rules also would be amended to address derivative financial instruments more comprehensively, including modifications to the basis rules to prevent abuse.The Secretary would have authority to require brokers to report such information as may be necessary or appropriate to implement the wash sale rules. Except as otherwise provided by the53 This definition is the same as that provided in section 6045(g)(3)(D). It is intended that the Secretary may exercise her authority to provide that the term “digital asset” has a meaning for wash sale purposes that is not identical to its meaning for purposes of regulations issued under section 6045.191  General Explanations of the Administration’s Fiscal Year 2024 Revenue ProposalsSecretary, brokers reporting a customer’s adjusted basis on a disposition of a digital asset or other asset subject to the wash sale rules would report the basis of the asset without regard to the wash sale rules unless the sale of the loss asset and the transaction causing the wash sale rules to apply occur in the same account with respect to identical assets.No inference is intended as to whether the losses claimed by taxpayers from wash sales of digital assets may be deducted under current law, or as to the proper treatment of transactions involving related parties under the wash sale rules under current law.The proposal would be effective for taxable years beginning after December 31, 2023.I think the wash rule is more likely to be adapted than the power rule.Also I read the power tax rule I think my 125 kwatt per hour  of which 60 kwatts is my solar nets to 65 kwatts as I  am net meter.Thus if I pay 10 cents for 1 kwatt first year I go to 11 centssecond year I go to 12 cents third year I go to 13 cents.13 x 65 = $8.45 an hour 202.80 a day by year three. 10 cents is not my price. I am closer to 5 cents so 101.80 a day by 2026 in power vs 78  a day for my company  in 2023 if I understand the net metering correctly.so 23 a day is 690 a month best caseworst case 1200-1300 a monthI can survive that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}