{
  "id": "topic_5467742",
  "title": "Stepstowealth",
  "author": "Stepstowealth",
  "created_time": "September 22, 2023, 06:42:14 PM",
  "content": "Maybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. Satoshi is someone that has insight and was able to make this system that has been able to survive and is doing well after a long time of creation, do you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467742",
  "comments": [
    {
      "author": "jrrsparkles",
      "created_time": "September 22, 2023, 06:50:15 PM",
      "body": "Satoshi said this in 2010.Quote from: satoshi on February 14, 2010, 03:52:23 PMI'm sure that in 20 years there will either be very large transaction volume or no volume. So he kind of predicted what would be the outcome of Bitcoin if people accepted it but he may not expected that more people would be accumulating Bitcoins for investment purposes rather than using to for making payments and cutting the centralized entity as the middlemen. But Bitcoin is becoming inevitable year by year so this is good and going in the way that he would have expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 07:03:15 PM",
      "body": "Satoshi said that:Quote from: satoshi on February 21, 2010, 05:44:24 AMThe price of any commodity tends to gravitate toward the production cost.  If the price is below cost, then production slows down.  If the price is above cost, profit can be made by generating and selling more.  At the same time, the increased production would increase the difficulty, pushing the cost of generating towards the price.He knows that the price will be volatile at the beggining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "September 22, 2023, 07:04:19 PM",
      "body": "As we know, Bitcoin was created to make a hassle-free p2p money transfer without third-party involvement worldwide. I assume Satoshi never thought at the beginning that Bitcoin would be volatile like now. Instead of focusing on Bitcoin use cases, we are more interested in making money from them. However, Bitcoin has now become the most popular cryptocurrency worldwide. Satoshi got more than he expected from Bitcoin; we are getting an advantage from his dream coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "September 22, 2023, 07:16:12 PM",
      "body": "Anything is \"volatile\" if there is no State intervention, and that's the way it should be. Even gold fluctuates, but after extraction diminished and market availability lowered it became less and a less fluctuating but it still is.If something never changes price you have a big problem, something is artificially withholding it creating a distortion which someday will burst. Re educate, things must have price that changes, that means freedom and healthy market, competition will naturally normalize things, and \"normal\" means price can change. You are the buyer and have the power to decide to buy it or not.Value is subjective, changes in location and time. There is no intrinsic or extrinsic value, the power is in the buyer not the worker (Goodbye Marxism). Vote with your wallet, what you buy creates information which directly affects the future. Market price is nothing more than the result of a permanent election, direct democracy = free market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 22, 2023, 07:18:45 PM",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. Satoshi is someone that has insight and was able to make this system that has been able to survive and is doing well after a long time of creation, do you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?Inventor usually has a vision but that doesn't mean that the vision will match the reality. There could be many things which Satoshi probably have never thought about. For example the block size. If he had envisioned that Bitcoin's transaction volume will be so huge, he would made it in a different way to accomodate more space. So it doesn't matter what Satoshi had envisioned. What matters is the free market which decides the next course of action. Not a government or cash rich corporation decides that for us!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 22, 2023, 07:21:05 PMLast edit: September 22, 2023, 07:32:51 PM by franky1",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. simple economicsif back in the olden days someone in the middle east can CPU mine for $0.004/kwh and someone in hawaii can mine for $0.40/kwh then there would be a economic speculation of cost window range of 100x across the planet. and with bitcoin being an international currency where different countries become aware and utilise bitcoin at different times. then yes obvious economics shows that volatility/speculation change is standard for a international currency based on an electric cost of production.then add in factors like the hash competition of more miners joining raising the cost. and then difficulty. and then eventually halving of rewards. then it all adds up to a volatile marketbitcoin was not meant to be a stable fiat replacement for one nation with no price change. it was meant to change and grow with utility and speculate above base costs of production",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 22, 2023, 07:36:50 PM",
      "body": "Before bitcoin gets to this level satoshi knew it from the very day one of creation so, even some companies that manufactured things knows how it would be and the durability of what they are producing the cost of it in time to come and so many more. So Satoshi knew what he was doing and i am not sure he created bitcoin for only peer to peer purposes only despite he mission was to make payment system easily as possible but he also knew that in time to come people could finds more valuable aspect of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "September 22, 2023, 07:53:40 PM",
      "body": "Quote from: The Cryptovator on September 22, 2023, 07:04:19 PMAs we know, Bitcoin was created to make a hassle-free p2p money transfer without third-party involvement worldwide. I assume Satoshi never thought at the beginning that Bitcoin would be volatile like now. Instead of focusing on Bitcoin use cases, we are more interested in making money from them. However, Bitcoin has now become the most popular cryptocurrency worldwide. Satoshi got more than he expected from Bitcoin; we are getting an advantage from his dream coin.That's the first thing I know of that solves the complexity with the involvement of third parties so with the existence of bitcoin created by satoshi with bitcoin is for someone who is happy with P2P everyone is free with it without other intermediaries.But who would have thought that this was more above satoshi's expectations maybe so, how this bitcoin growth rapidly for more than a decade, people began to invest even with several other large institutions that could generate considerable profits even though the price still fluctuated, We are happy and we have also benefited more in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "September 22, 2023, 08:02:38 PM",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. Satoshi is someone that has insight and was able to make this system that has been able to survive and is doing well after a long time of creation, do you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?It is difficult to imagine he did not imagined the current scenario, after all both gold and fiat currencies are traded in specialized markets, so it makes sense that bitcoin is also traded and used as an investment, now some may argue he may not have imagined that this particular use will surpass its use as money, but that makes no sense either, as even if gold was used for thousands of years as money right now is mostly used as an investment and as a way to preserve our wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 23, 2023, 05:43:33 AM",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PM do you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?The real question is: what difference would that have made if he knew that? Could he have designed bitcoin in a different way to prevent volatility? The answer is no, it would not have made any difference and the design would have been the same. So knowing or not knowing it is not important.Besides, I personally believe that this volatile price is just a phase. It may last another 5 to 10 years to reach mass adoption and stability but stable value (not price) is going to be the final result after mass adoption. After all Bitcoin is still pretty young and in its initial phase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 23, 2023, 06:14:15 AM",
      "body": "I'm pretty sure Satoshi himself or anyone with decent markets knowledge would immediately know that such an asset as bitcoin will guaranteed to be this volatile. Even by just knowing how controversial and debatable bitcoin is and will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "September 23, 2023, 06:31:50 AM",
      "body": "Quote from: albert0bsd on September 22, 2023, 07:03:15 PMSatoshi said that:Quote from: satoshi on February 21, 2010, 05:44:24 AMThe price of any commodity tends to gravitate toward the production cost.  If the price is below cost, then production slows down.  If the price is above cost, profit can be made by generating and selling more.  At the same time, the increased production would increase the difficulty, pushing the cost of generating towards the price.He knows that the price will be volatile at the beggining.This fine detail from Satoshi hits different, knowing too well that is what's actual happening atm!!Btw at the moment markets aren't as active because many bought at a premium price and forced to hodl as price is in red on their books not until price climbs back up for them to break even or go for the profits..and this will only happen with new players to buy the cheap coins.Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. With supply and demand at the center of everything, he definitely knew bitcoin would be volatile based on selling and buying that will always tilt the swing here and there and not forgetting bitcoin isn't pegged to anything will always have the characteristic of volatility written all over it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "September 23, 2023, 07:11:08 AM",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. Satoshi is someone that has insight and was able to make this system that has been able to survive and is doing well after a long time of creation, do you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?For sure he knows that as well,Quote\"When someone tries to buy all the world’s supply of a scarce asset, the more they buy the higher the price goes. At some point, it gets too expensive for them to buy any more.\" - SatoshiSo in a hindsight he foresee that at some point, it will be traded, i.e. buy and sell, supply and demand and that it will be expensive, as just what we have seen in the last 2 halvings, and in this incoming 2024/25 bullrun, we might see for the first time the price hitting 6 digits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 23, 2023, 07:43:15 AM",
      "body": "He developed this technology with a similar concept of how \"Gold\" are used. People can use \"Gold\" as a payment option and they have done this in the old days... or they can trade with it or they can use it as a commodity. The thing with Gold id the weight ...and it became impossible to use it as a currency.. because nobody wants to walk around with heavy Gold to make payments. (They then linked promises on a piece of paper that are honored by a government that the paper were linked to Gold.... but that also did not work out)   Satoshi knew that Bitcoin would evolve ... and he designed it for that purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "September 23, 2023, 08:10:21 AM",
      "body": "The future demand cannot be controlled by anyone. Perhaps, on the day of its inception, Satoshi did not anticipate that Bitcoin would grow larger than its initial conception. Satoshi created only 21 million BTC, and this may have been intended for a more niche audience rather than a global one. The rise in BTC's value due to increasing demand, regardless of its ultimate purpose, adheres to economic theory principles.I do not blame Satoshi; although their vision may not have been realized perfectly, their pioneering adoption deserves recognition. Currently, there is no other decentralized currency that truly rivals Bitcoin in terms of popularity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 23, 2023, 08:15:47 AM",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily.The only accomplishment i see with Satoshi Nakamoto is in the successful launch of bitcoin and how he found out that everything works perfectly as he has planned, people can have other alternative means of making payments using a different technology and remain decentralized, though he may and may not have thought about these occurence so fast to where bitcoin is today, but he believes it's a digital currency everyone will love to adopt.Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMdo you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?Bitcoin was intended as a currency and you're not expected to buy or sell currency, you can only exchange for it or earn it just as you earn fiat and you don't buy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "September 23, 2023, 09:57:21 AM",
      "body": "Quote from: Stepstowealth on September 22, 2023, 06:42:14 PMMaybe we are wrong to think that Satoshi never had the thought that bitcoin was going to become very volatile and people were going to be able to make money from how the  price of bitcoins changes easily. Satoshi is someone that has insight and was able to make this system that has been able to survive and is doing well after a long time of creation, do you think that it never occurred to him that people may start investing in bitcoins instead of really using it for buying and selling?We are not him so we cannot know whether he anticipated these things or not. But as far as I remember, he never mentioned bitcoin as an asset, commodity or investment in the bitcoin's whitepaper, he just focused on explaining it as a peer-to-peer payment method. There was also a topic recently, how does Saotoshi feel about seeing bitcoin deviate from the path he intended for bitcoin. There have been a lot of mixed opinions around that topic but to me it's all just fun discussion because we're not him and no one knows where he is. So how can we know what he is thinking about bitcoin's today?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 23, 2023, 10:46:41 AM",
      "body": "The fact that Bitcoin is volatile is an indication that it is decentralized, as there is no central bank that pumps liquidity to maintain a stable exchange rate or establishes policies that encourage people to save, as the Federal Reserve does. Therefore, everyone, even Satoshi, knows that Bitcoin during the first years will be very volatile, but over time it will become more stable and volatile. Within the limits of 30%, which we can say is similar to the stock market.The behavior of individuals to buy Bitcoin to save will be matched by the intention of others not to spend it. For example, I do not plan to sell some Bitcoin during the next 10 years, and therefore you will find that many will sell about 1% to 50% in the next two years in exchange for the thousands who will buy, and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "September 23, 2023, 11:33:38 AM",
      "body": "Am sure Satoshi didn't quite think BTC would turn out to an investment option for people as opposed to the idea in mind before its creation. One thing I have always loved about new innovations is that people get to utilize it in various scenerio to ascertain which best the innovation serves. BTC to some is just money, but to others, it is a valuable asset worth investing and HODLing for a duration and if Satoshi had thought about all the possibility of having BTC, perhaps imthe idea would have failed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}