{
  "id": "topic_5464265",
  "title": "Bitcoin Smith",
  "author": "Bitcoin Smith",
  "created_time": "August 23, 2023, 08:59:51 AM",
  "content": "Even though it has been discussed already, still why people are falling for the p2p scams?Recently there is an article regarding this posted on cointelegraph : Crypto P2P scams in India show digital asset education is neededI saw some article claims that India have 150 millions crypto investors but still they are being so naive and falling for the scams especially for most obvious one.Few tips to avoid p2p scams:1. Avoid Too Good to Be True Offers, like something that offers over 30% of market price.2. Carefully review the profile of the person you're dealing.3. Don't accept payments from third party accounts4. Before releasing cryptos make sure the money credited to your account cause most p2p scammers use fake screenshots and claim that the payment stuck due to bank server issue.5. Avoid any kind of contact apart from the trading platform.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464265",
  "comments": [
    {
      "author": "elevates",
      "created_time": "August 23, 2023, 10:47:43 AMLast edit: August 23, 2023, 03:03:45 PM by elevates",
      "body": "I am sorry to say but Indians can't resist greed. They know it is risky and still, they fall for offers that offer more than the market. The community still doesn't understand how cryptocurrency taxes are calculated. I have read so many comments on various Indian telegram channels that they won't pay a 30 percent tax on crypto earnings. Whereas tax is not on earnings but it is on gains through the earnings. If they get their head right I don't think they will as the young generation lack reading skills. If they read and understand it they would stop using P2P and start using local exchanges. From 2017 to 2021 everyone who was into crypto in India earned a handsome amount of money. Now when they are being asked to pay tax only on their gains most of them are ignoring. When the Indian government comes up with regulation, the most affected exchanges would be those that encourage P2P and non-KYC services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "August 24, 2023, 02:45:30 PM",
      "body": "Quote from: elevates on August 23, 2023, 10:47:43 AMI am sorry to say but Indians can't resist greed. They know it is risky and still, they fall for offers that offer more than the market. The community still doesn't understand how cryptocurrency taxes are calculated. I have read so many comments on various Indian telegram channels that they won't pay a 30 percent tax on crypto earnings. Whereas tax is not on earnings but it is on gains through the earnings. If they get their head right I don't think they will as the young generation lack reading skills. If they read and understand it they would stop using P2P and start using local exchanges. From 2017 to 2021 everyone who was into crypto in India earned a handsome amount of money. Now when they are being asked to pay tax only on their gains most of them are ignoring. When the Indian government comes up with regulation, the most affected exchanges would be those that encourage P2P and non-KYC services. I don't think people try to avoid the tax are falling for this kind of scams because the amount they are selling is like 3K to 10K INR but definitely greed blindside them that is why their common sense doesn't kick why someone is paying too much money more than the worth of the asset without a catch.Still, 30% capital gains tax and 1% TDS is too much, so certainly it will push the users to find a way to avoid the tax which mostly end up in traps like these scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "August 25, 2023, 06:38:13 AM",
      "body": "Quote from: Bitcoin Smith on August 24, 2023, 02:45:30 PMQuote from: elevates on August 23, 2023, 10:47:43 AMI am sorry to say but Indians can't resist greed. They know it is risky and still, they fall for offers that offer more than the market. The community still doesn't understand how cryptocurrency taxes are calculated. I have read so many comments on various Indian telegram channels that they won't pay a 30 percent tax on crypto earnings. Whereas tax is not on earnings but it is on gains through the earnings. If they get their head right I don't think they will as the young generation lack reading skills. If they read and understand it they would stop using P2P and start using local exchanges. From 2017 to 2021 everyone who was into crypto in India earned a handsome amount of money. Now when they are being asked to pay tax only on their gains most of them are ignoring. When the Indian government comes up with regulation, the most affected exchanges would be those that encourage P2P and non-KYC services. I don't think people try to avoid the tax are falling for this kind of scams because the amount they are selling is like 3K to 10K INR but definitely greed blindside them that is why their common sense doesn't kick why someone is paying too much money more than the worth of the asset without a catch.Still, 30% capital gains tax and 1% TDS is too much, so certainly it will push the users to find a way to avoid the tax which mostly end up in traps like these scams.I do agree the highest tax slab and 1% TDS are killing those who are into trading. They use International exchanges to save themselves from Incometax and fall in the trap of scammers. That is why it is being recommended to not use International P2P exchanges for the time being. If still they want to use it then no one can help them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}