{
  "id": "topic_5470098",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "October 12, 2023, 04:12:56 PM",
  "content": "I recently noticed that Bitcoin Core allows you to download the entire block, or just the last blocks - allocating just one x GB for that purpose.Of course, having the complete number is always better. But, to have only the final part of the no, is it viable for the person to obtain the same confidentiality or privacy?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470098",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "October 12, 2023, 04:21:59 PM",
      "body": "In most cases you do not need all of it. A lot depends on the case use.If I want a wallet to receive my signature funds. I do not need to know more than the last month of the blockchain.Myself when I do a bitcode core down load I do it all.I just did one on a 2tb ssd along with a linux os build.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 12, 2023, 04:24:30 PM",
      "body": "Quote from: philipma1957 on October 12, 2023, 04:21:59 PMIn most cases you do not need all of it. A lot depends on the case use.So is there any kind of advantage to having the full node?But, everything together isn't taking up 2TB, is it? You are already preventing the future, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 12, 2023, 04:34:20 PM",
      "body": "Quote from: joker_josue on October 12, 2023, 04:24:30 PMSo is there any kind of advantage to having the full node?But, everything together isn't taking up 2TB, is it? You are already preventing the future, right?Many advantages, one is that you get to import a new key on the wallet, but if it is half node I think you cannot run another wallet (imported key) on it. Because an importing a wallet will need transaction history of that wallet and it might be that the few blocks there will not have all of them available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 12, 2023, 04:48:56 PM",
      "body": "Quote from: Zaguru12 on October 12, 2023, 04:34:20 PMMany advantages, one is that you get to import a new key on the wallet, but if it is half node I think you cannot run another wallet (imported key) on it. Because an importing a wallet will need transaction history of that wallet and it might be that the few blocks there will not have all of them available. In other words, it will only be useful for the wallet you currently have or that you create after having part of the node assembled. It even makes sense. If it is something older, it can no longer obtain all the transaction information.But, if you think about it, the same thing will happen in a new wallet, if it only has part of the knot. Older transactions are no longer listed in the wallet. Or am I wrong?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 12, 2023, 05:07:07 PMLast edit: October 13, 2023, 10:35:40 AM by Zaguru12",
      "body": "Quote from: joker_josue on October 12, 2023, 04:48:56 PMIn other words, it will only be useful for the wallet you currently have or that you create after having part of the node assembled. It even makes sense. If it is something older, it can no longer obtain all the transaction information.But, if you think about it, the same thing will happen in a new wallet, if it only has part of the knot. Older transactions are no longer listed in the wallet. Or am I wrong?Yeah, you know the pruned node will only have just few 100 blocks, so transaction below that few 100 blocks associated to the key will need to be updated and this can be done by downloading everything again. So if you’re just going to use a new created wallet after that hundreds it will be possible. Not much other than not having the benefit of sync the full blockchain But the other part is you using a pruned node means you’re trusting a third party",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "October 13, 2023, 05:16:19 AM",
      "body": "Quote from: joker_josue on October 12, 2023, 04:12:56 PMBut, to have only the final part of the no, is it viable for the person to obtain the same confidentiality or privacy?In terms of privacy, yes it has the same level of confidentiality and privacy as a non-pruned node.Both non-pruned and pruned node start to download and verify from block height 0, the only difference is how those store the blockchain.One keeps full and the other deletes the old blocks.Even if pruned node only saves N number of blocks, it still verified ALL the previous blocks that it downloaded (and deleted).It doesn't just download them from a server nor work like an \"SPV client\" that relies on other persons' full node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 13, 2023, 07:57:12 AM",
      "body": "Quote from: nc50lc on October 13, 2023, 05:16:19 AMEven if pruned node only saves N number of blocks, it still verified ALL the previous blocks that it downloaded (and deleted).It doesn't just download them from a server nor work like an \"SPV client\" that relies on other persons' full node.I understand. In this sense, if the person has this space availability, it is recommended to have the complete node. If you really want to operate a node, of course.In fact, if a person also wants to have an LN channel, they need the full node, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 13, 2023, 09:19:53 AM",
      "body": "Quote from: joker_josue on October 12, 2023, 04:24:30 PMSo is there any kind of advantage to having the full node?The main advantage I see is being able to open an old wallet, or import an old address (watch-only) or private key.Quoteeverything together isn't taking up 2TB, is it?It's about 550 GB now, and usually grows by around 2 GB per week.Quote from: nc50lc on October 13, 2023, 05:16:19 AMQuote from: joker_josue on October 12, 2023, 04:12:56 PMBut, to have only the final part of the no, is it viable for the person to obtain the same confidentiality or privacy?In terms of privacy, yes it has the same level of confidentiality and privacy as a non-pruned node.I'd like to add: for privacy, run Bitcoin Core through Tor, and always make use of Coin Control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 13, 2023, 09:42:48 AM",
      "body": "Quote from: LoyceV on October 13, 2023, 09:19:53 AMI'd like to add: for privacy, run Bitcoin Core through Tor, and always make use of Coin Control.Any good tutorials for this? Run Bitcoin Core via Tor?Or just click on the option that appears in Bitcoin Core?Is it viable to use a VPN system that allows SOCKS5?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "October 13, 2023, 10:19:28 AM",
      "body": "Quote from: joker_josue on October 13, 2023, 09:42:48 AMQuote from: LoyceV on October 13, 2023, 09:19:53 AMI'd like to add: for privacy, run Bitcoin Core through Tor, and always make use of Coin Control.Any good tutorials for this? Run Bitcoin Core via Tor?Or just click on the option that appears in Bitcoin Core?Is it viable to use a VPN system that allows SOCKS5?If you only want Bitcoin Core connect through Tor, you can just tick option which available on Bitcoin Core GUI. Otherwise, check this guide https://github.com/bitcoin/bitcoin/blob/master/doc/tor.md.Quote from: Zaguru12 on October 12, 2023, 05:07:07 PMBut the other part is you using a pruned node means you’re trusting a third party Did you mistype something? Pruned node download and verify whole blockchain, so it doesn't trust any 3rd party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 13, 2023, 10:34:54 AM",
      "body": "Quote from: ETFbitcoin on October 13, 2023, 10:19:28 AMQuote from: Zaguru12 on October 12, 2023, 05:07:07 PMBut the other part is you using a pruned node means you’re trusting a third party Did you mistype something? Pruned node download and verify whole blockchain, so it doesn't trust any 3rd party.Mixed up by me, only with SPV clients that one needs to full rely on other full nodes. And since it’s a third party then it is a risk trusting them. Definitely off topic on the discussion of prune nodes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 13, 2023, 10:43:21 AM",
      "body": "Quote from: joker_josue on October 13, 2023, 09:42:48 AMAny good tutorials for this? Run Bitcoin Core via Tor?There are several topics about it, for instance this one and this one. I'd like to see a full tutorial.QuoteOr just click on the option that appears in Bitcoin Core?I'm confused  I expected this to require installing additional software.QuoteIs it viable to use a VPN system that allows SOCKS5?Bitcoin Core will just work with any normal VPN service (but that's not Tor).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 13, 2023, 10:50:23 AM",
      "body": "Quote from: LoyceV on October 13, 2023, 10:43:21 AMQuoteOr just click on the option that appears in Bitcoin Core?I'm confused  I expected this to require installing additional software.QuoteIs it viable to use a VPN system that allows SOCKS5?Bitcoin Core will just work with any normal VPN service (but that's not Tor).Actually, I was hoping.  I mean, do you need to have Tor installed on your PC or not?By any chance, I have VPN that gives me onion IP. Would it be an option?Questions, to understand the various possibilities that exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 15, 2023, 10:48:57 AM",
      "body": "Quote from: ETFbitcoin on October 15, 2023, 09:54:16 AMI don't know the answer. However it's first time VPN claim they can give onion address (rather than allow or can access onion address without Tor Browser).Seriously?I have been using NordVPN which has the ability to connect to an onion server. I've already managed to access onion addresses, in Chrome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "October 15, 2023, 11:23:50 AM",
      "body": "Quote from: joker_josue on October 12, 2023, 04:24:30 PMSo is there any kind of advantage to having the full node?But, everything together isn't taking up 2TB, is it? You are already preventing the future, right?Size of the Bitcoin blockchain from January 2009 to August 21, 2023Bitcoin blockchain data size increases when new blocks added to Bitcoin blockchain and 2TB is a safe reserved space for many more years because each year, blockchain size increases about 50 GB.Currently, the Bitcoin chain size is nearly 520 GB.On 13 October 2022, chain size is 432 GB and today it is about 518 GB.With prune node, you can not rescan your wallet because your wallet in prune node does not store the complete blockchain so you have to redownload it again.Bitcoin blockchain pruningBlock file pruning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "October 16, 2023, 09:06:46 AM",
      "body": "Quote from: joker_josue on October 15, 2023, 10:48:57 AMQuote from: ETFbitcoin on October 15, 2023, 09:54:16 AMI don't know the answer. However it's first time VPN claim they can give onion address (rather than allow or can access onion address without Tor Browser).Seriously?I have been using NordVPN which has the ability to connect to an onion server. I've already managed to access onion addresses, in Chrome.But connect to/access onion address and giving onion address (also called Tor Hidden service) are two different thing though. I briefly read NordVPN's page about Tor/onion, but there's no indication they setup Tor Hidden service for their VPN users. And FWIW, accessing onion address without Tor Browser offer less privacy since your browser have unique fingerprint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 16, 2023, 09:16:39 AM",
      "body": "Quote from: ETFbitcoin on October 16, 2023, 09:06:46 AMQuote from: joker_josue on October 15, 2023, 10:48:57 AMI have been using NordVPN which has the ability to connect to an onion server. I've already managed to access onion addresses, in Chrome.And FWIW, accessing onion address without Tor Browser offer less privacy since your browser have unique fingerprint.At the risk of being slightly off-topic: I wouldn't use .onion sites on a normal browser through a third party. It has none of the benefits and all of the drawbacks of using Tor. Just Download Tor Browser for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 16, 2023, 09:36:41 AM",
      "body": "Quote from: LoyceV on October 13, 2023, 09:19:53 AMQuote from: joker_josue on October 12, 2023, 04:24:30 PMSo is there any kind of advantage to having the full node?The main advantage I see is being able to open an old wallet, or import an old address (watch-only) or private key.Quoteeverything together isn't taking up 2TB, is it?It's about 550 GB now, and usually grows by around 2 GB per week.Plus around 33 CB of testnet data if you are used ( like me) to fiddle with bitcoin transactions  using testcoins first before trying the real things on mainnet. My 1 TB NTFS formatted external SSD used exclusively to hold full blockchains from both mainnet and testnet has only ~ 367 GB left to be full , so probably in half of year I will think about acquiring new SSD drive with capacity of 2 TB. Luckily the price for such drives are steadily dropping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 16, 2023, 10:18:10 AM",
      "body": "Quote from: satscraper on October 16, 2023, 09:36:41 AMMy 1 TB NTFS formatted external SSD used exclusively to hold full blockchains from both mainnet and testnet has only ~ 367 GB left to be full , so probably in half of year I will think about acquiring new SSD drive with capacity of 2 TB.No rush: you have about 3 years left before it's full.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}