{
  "id": "topic_5452338",
  "title": "Donneski",
  "author": "Donneski",
  "created_time": "May 11, 2023, 08:48:16 AM",
  "content": "As a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum please",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452338",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "May 11, 2023, 08:52:37 AM",
      "body": "When you want to learn about Bitcoin in particular, you should visit the Bitcoin discussion board and all its related child boards so as to read and learn about Bitcoin, security, wallets, etc. For other currencies, you can use the altcoin discussion board. There are lots of altcoins being discussed there, and you can also engage in those conversations, interact, and ask questions where necessary.Then, to learn from the forum, you can use this beginner's guide to ask your question where you are confused and learn from others questions and suggestions. Wherever you have something to contribute, you can also share it with others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 11, 2023, 09:01:29 AM",
      "body": "OP this is your second thread on almost similar issue. Firstly go back to your previous thread and read replies there, it will help you answer your question. The Beginner and help board cover’s virtually 80 percent you migh need to learn at the moment, you can use the search bar if you looking for something. Once you can’t find it then proceed to ask your questions and you will most certainly get it answered. Aside the bitcoin discussion mentioned by Nwada001 you should also visit the development and technical board if you want to learn about the technical aspects of bitcoin. Here is the guidelines for every thread on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 11, 2023, 09:05:39 AM",
      "body": "OP, you are being very careful. The forum does not pose any danger to you, but your questions literally scream about it based on your past posts.You are on a forum about Bitcoin, and here is a lot of information about it. What's more, you're in the newbie section, where people like you are joining the conversation. Why don't you read the topics in this section, for starters and for general understanding? Among other things, you, with your caution, need to read the rules of the forum.https://bitcointalk.org/index.php?topic=703657.msg7955645#msg7955645I can offer a large and interesting catalog of topics from a member of our forum who has collected a lot of information.https://bitcointalk.org/index.php?topic=5277049.0But you can also learn more from other sources that users will provide you with soon.Everything depends on your efforts. It is quite easy for a beginner in the forum to grow if there is a desire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "May 11, 2023, 09:09:39 AM",
      "body": "In addition to what @Nwada001 said, you'll also be needing external material to also guide you throughout your learning process and I have tried to collate a few I could get at the moment.Mastering Bitcoin (GitHub)The Internet of MoneyMastering the Lightning NetworkMastering EthereumBeginners & Help EncyclopediaAnd don't forget to always ask questions when you have them, and if you come across a thread that you have no knowledge about, don't try to be smart by coping from another source instead make research about that topic it doesn't matter if you don't reply that post at that moment just continue your research because someone else is bound to ask that same question in the future and by that time you'll have been equipped with enough knowledge to answer the person's question. This was one of the advises I got from local boards.Lastly don't forget to always use the forum's search option Incase of any issue so that you won't end up opening a thread that has already been discussed several times. Here's a guide for you.[Guide] Searching effectivelyP.s 2 new posts were made while I was compiling mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "May 11, 2023, 09:18:53 AM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseAlthough this topic has been made by others several times, my answer for how to grow significantly?This are the steps that I think will help you and others grow are the following:Reading - this is one of the key steps for a person to grow in life and I think in the forumLearning - Learning on what you have read and understand is also a big factorApply - apply what you have read and learn without applying those things are uselessDon't rush - I see people when they came to the forum they want to be notice and achieved bigger things as a newbie that's not the case, you should take things slowlyhave a mentor, or even make a goal for a month or 6 months goal which can be achievable, and not those that are impossible to accomplish for that set timeline.I just think that this is what every newbies need, sometimes setting a target have a positive and negative output in a person, dream big but don't rush things because every high rank members surely spend lots of times just to reach their goals, so don't rush learn things and it will surely come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "May 11, 2023, 10:22:36 AM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseYou must be a helpful member, generally.Many ways to be helpful: help newbies about forum rules, how to rank up, how to search well. Help other members, not only newbies about Bitcoin technical questions, basics to advance, about security for their devices, privacy on Internet and for their Bitcoin transactions.Hidden pages/features on the forum.Bitcointalk posting etiquette[Bitcointalk sticky threads] Newbies - read before starting.It looks very hard and challenging at start but when you explore the forum and manage to rank up successfully, you will see it more easily and you will gradually become a helpful member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "May 11, 2023, 11:10:52 AM",
      "body": "Why are all newbies asking the same question over and over again without creating time to read other topics created by forum members to have an understanding of the answer to the question that they want to ask. Anyway,it is normal for a newbie to keep on asking questions than reading articles in the forum. OP, you should stick to Beginners & Help board and also on bitcoin discussion board to learn. Start by reading all pinned threads on these two boards and sub board if it has. Also read topics on these two boards created by forum members and do your own research to learn fast.  @Lovesmayfamilis has given your two important topics that you must read to feel good in learning and contributing to discussions on topics created by other forum members or by you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 11, 2023, 11:18:54 AM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseIf you're determined for this then am glad to tell you that you can accomplish it since everyone here aren't born with what they do, we all go through the process of learning them, you need to be active on the forum first, always make research onbthe internet, ask questions onnareas you're not sure of but search the forum to see if it had been discussed already, give time to investing on quality things of interest that could facilitate your quick learning, dont rush, and while onbthis forum, try to read through each board''s pinned threads, it gives you an oversight on what's expected of you from that board and what's not, finally be the type that likes reading because in doing so comes learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "May 11, 2023, 01:25:25 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseActually, to be able to understand and understand more about the crypto system, especially bitcoin, you don't need to ask questions like this. Because on the first page you enter this forum, you will definitely read a lot of boards there. Everything is complete there, there is discussion about bitcoin, development discussion, mining and of course the altcoin discussion also has its name listed. So you don't get too confused about things like this. You just have to enter the board that matches all your questions. You don't be afraid to enter any board in this forum, especially if you really want to learn and want to broaden your horizons as you said about bitcoin and about altcoins. The most important thing is that you don't forget the rules that already exist in this forum. And actually most of the boards here always contain knowledge or information about crypto, especially about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 11, 2023, 01:40:38 PM",
      "body": "There's already the descriptions for each of the boards/sections that you want to visit and so, please read that before engaging to any thread.And join those discussions and topics naturally, you don't have to be a rocket scientist for you to engage with the topics that you're interested with. It's okay to ask but please don't ask dumb questions that adds zero value to the thread.Ask meaningful and helpful questions that you truly are interested to know the answers if ever you want to know more about the topic you're interested with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 11, 2023, 02:47:02 PM",
      "body": "Personally, I recommend that you watch Andreas's[1] YouTube videos and read Mastering Bitcoin[2], it will give you a lot of useful information that is the basis for self-learning, with it all you need to know is to search Wikipedia for that information and then ask here[3][4][5] if you did not get useful information or wanted to discuss a topic that needs more details.[1] https://www.youtube.com/channel/UCJWCJCWOxBYSi5DhCieLOLQ[2] https://www.amazon.com/Mastering-Bitcoin-Programming-Open-Blockchain/dp/1491954388[3] Development & Technical Discussion[4] Bitcoin Technical Support[5] Mining",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "May 11, 2023, 02:56:09 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum please Op good day and welcome again here in our community and to tell you honestly if you are planning to be educated about Bitcoin and how it works and anything relayed to crypto then one try thing I assure you, you are in a right place because this place is a bitcoin place all you want to know about bitcoin and other related crypto currencies are already tackled al you need to do is to search it and read all the answer of your questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 11, 2023, 04:23:46 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum please You already got many good replies worth following. The Bitcoin discussion board becomes a favorite board for signature spammers. You will see the useless threads to discuss more useless shit every day. I would suggest you follow those threads suggested by others, and you are already on the right board where you can ask anything if you are confused about anything. For some specific issues like wallet, mining and other things, there are separate boards. You can visit them and read them. I suggest you follow lovesmayfamilis post, which will redirect you to Ratimov's thread where he gives a huge collection of helpful threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reizella28",
      "created_time": "May 11, 2023, 04:41:29 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseYou could actually explore the forum itself as there's a lot of topic always discussed everyday. If you want to look for a specific topic that could answer your questions then you could search it if there's already existing thread for it. If there's none you could actually post a certain concerns for the people in the forum could help you. Just check where you will post for example you ask about economic, then your thread should be input in the economic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 11, 2023, 04:52:44 PM",
      "body": "not berating you or anything but didn't you already ask the same question before and have gotten answers from many members? I even shared links from your previous thread that you can look at, and looking at the replies from some of the members, they shared almost the same links as I did on your previous thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "May 11, 2023, 04:53:14 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseOP it is good you are asking questions to learn more about the forum but your question is like asking people where you can get water when you are in a river. This forum is an information bank of Bitcoin and other cryptocurrencies. Some members have directed you to some sections of the forum that basically deals with your request but you can also get bitcoin knowledge in some other sections. The economic section of the forum exposes you to how national economic policies affect bitcoin. I also find the political section interesting because sometimes members expose us to the relationship between Bitcoin and the political space of nations. Apart from learning about bitcoin the forum also teach basic morals that can be helpful, so you should visit other sections for this information. I think it is now time for you to explore the forum and gather a lot of information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 11, 2023, 05:35:31 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum pleaseI can see that you have gotten a lot of helpful links or threads from some users here. Welcome to the forum. Don't forget to read from those links and learn; that's how you can really learn how the forum operates and also contribute positively. If you want to learn more about Bitcoin, I recommend reading Bitcoin Information and Resources.If you learn how to contribute positively on the forum, you will enjoy the advantages that come with it. You can the Advantages of engaging in quality contributions on the forum.Also read on: Bitcointalk's important historic changesMake your topic title, posts more attractiveCheers 🥂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 11, 2023, 05:56:12 PM",
      "body": "Quote from: Donneski on May 11, 2023, 08:48:16 AMAs a beginner that wants to significantly grow his knowledge about BTC in particular and cryptocurrency in general so as to be able to make meaningful contributions to the forum, which of the boards and threads am I expected to regularly visit and read about them in the forum please If you like reading. Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQWhat Is Bitcoin?Op what you to do to excel in the forum is reading and research. Read more than posting. If you want to contribute meaningfully , then you have to read and read other people post and google some new information you come across.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 11, 2023, 06:11:49 PM",
      "body": "Since they have given the answer to your question then you should try guessing the games that you can check in this thread and also test your knowledge. It will help you know how much you have learned about crypto and also this forum. You should try it out especially this one Give this bitcoin test....Here's the thread https://bitcointalk.org/index.php?topic=5367215.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}