{
  "id": "topic_5466698",
  "title": "Filicius",
  "author": "Filicius",
  "created_time": "September 13, 2023, 05:42:04 PM",
  "content": "He descubierto este hilo en Beginners & Help en el que el miembro hugeblack ofrece meritar posts en secciones locales que considere que se merecen el mérito pero que no lo hayan logrado, con lo que puede ayudar a usuarios con rango bajo como el mío.La verdad es que no tengo mucho de qué quejarme en esta sección, porque aunque no hay mucho movimiento últimamente, creo que es una de las que mejor paradas salen. Pero, como toda ayuda es buena, y me parece una gran idea por parte del OP, lo comparto por si a alguien más le sirve. ¡Suerte!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466698",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 14, 2023, 02:24:44 AM",
      "body": "Yo, comenté en el hilo de Nigeria, no noto una falta de méritos en esta sección. Volvemos a tener a DdmrDdmr que es una fuente de mérito muy activa y luego está paxmao que pasa de vez en cuando, pero para los que somos creo que está bien. A ello hay que sumar los méritos que repartimos los que no somos fuente pero tenemos méritos a enviar de los que ganamos.También es que cuando llegas a Legendary pues ya no vas a pedir méritos por ahí. En tu caso aparte del hilo de hugeblack, hay otros hilos en que te pueden revisar el historial de posts y darte méritos por ello, ayudándote a subir de rango más fácil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 14, 2023, 07:16:31 AM",
      "body": "En términos generales, por ahora estamos (nuevamente) bien por aquí en el plano general de méritos, y siempre es potestad de cada individuo poder acudir a hilos de revisión si así lo considera.Probablemente, al designar fuentes de mérito en los tableros locales, sería mejor estrategia tener varias fuentes medianas que no una grande en los tableros donde se dé la condición. Digamos que crea menos dependencia nominal, a la par que abre el abanico de diversidad en el criterio. Entiendo no obstante que ya de por sí parece complicado confiar por parte del Admin en un conjunto reducido de personas (109 actualmente, con designación dispar cada una (*)) como para cambiar la estrategia.(*) Si no recuerdo mal, yo empecé con 25 sMéritos de cuota cada 30 días.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 15, 2023, 02:57:15 AM",
      "body": "Quote from: DdmrDdmr on September 14, 2023, 07:16:31 AM... y siempre es potestad de cada individuo poder acudir a hilos de revisión si así lo considera.A veces también hay quien te ayuda a subir de rango, dándote los méritos que te faltan sin que haya una petición previa explícita por parte del interesado. Recuerdo haber visto algún que otro casos similar por el norte, aunque lo más normal es que haya petición previa en los hilos dedicados al respecto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 15, 2023, 05:16:01 AM",
      "body": "Quote from: Don Pedro Dinero on September 15, 2023, 02:57:15 AM<…>En esto de hacerlo motu proprio me prodigo poco, aunque efectivamente lo he hecho en algún caso que otro. El otro día recibí una petición de revisión de posts para aquello de los méritos y decliné: es algo que hago muy poco, y menos si la petición venía precedida de una quasi-afirmación indicando que me había ofrecido a este tipo de revisiones en el pasado de manera pública (no lo he hecho).Si miramos en el Merit Dashboard, tengo una pestaña donde se indica quienes han dado los méritos que hacían escalar de rango (en relación a la variable Méritos) a quienes:https://public.tableau.com/app/profile/ddmrddmr/viz/BitcointalkMeritDashboard/WhoRankedWhomAllí, el número uno es quien más realiza el ejercicio de otorgamiento de los méritos de la última milla de una manera muy destacada respecto de los demás en la lista.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}