{
  "id": "topic_5403128",
  "title": "nitrobetting",
  "author": "nitrobetting",
  "created_time": "June 18, 2022, 05:35:51 PM",
  "content": "Tampa Bay is 1-4 in the past 5 meetings.📊They're set as +135 underdogs against the #Avalanche.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403128",
  "comments": [
    {
      "author": "Gianluca95",
      "created_time": "June 18, 2022, 05:37:48 PM",
      "body": "I'm betting on F1 at the moment, I'm following the round of qualify team, and I've already seen that Ferrari has inserted his 4th motor for this season  . Considering the round of penalty (Leclerc will start sunday  in last place) my bet is that he will close race between 1st and 3rd place ! It isn't easy I know, but that guy is really angry and this helps me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 18, 2022, 05:46:15 PM",
      "body": "I think Tampa Bay will try their best to win so I would go for Tampa Bay on this.  They are also good at rebounding after a loss.  Aside from that, they have a goal to be the greatest dynasty in  NHL, so I think they will be well prepared for this coming game.Quote from: nitrobetting on June 18, 2022, 05:35:51 PMTampa Bay is 1-4 in the past 5 meetings.📊They're set as +135 underdogs against the #Avalanche.It is +125 now and still underdogs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worldreporter",
      "created_time": "January 18, 2023, 11:09:29 AM",
      "body": "From my experience, casino is a dubious source of income, but I don't agree. I am pretty sure that GGBet online casino https://ggbet-fi.net/ will make your life better because it's goal is not to steal money but to be honest with you. If you've been searching for the best casino it's a sign that you've found it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 18, 2023, 12:44:06 PM",
      "body": "Quote from: Gianluca95 on June 18, 2022, 05:37:48 PMI'm betting on F1 at the moment, I'm following the round of qualify team, and I've already seen that Ferrari has inserted his 4th motor for this season  . Considering the round of penalty (Leclerc will start sunday  in last place) my bet is that he will close race between 1st and 3rd place ! It isn't easy I know, but that guy is really angry and this helps me  Yes, betting on F1 racing is indeed very exciting and does not make us as bettors bored watching the race.But on the other hand, betting on F1 is a bit difficult to predict now because there are still several teams that will compete.I myself am still confused and have not been able to determine which team is really good to bet on.Maybe later after observing and researching each new race I will be able to determine which team I will bet on and hopefully bring me good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}