{
  "id": "topic_5454802",
  "title": "Shortmaster",
  "author": "Shortmaster",
  "created_time": "June 01, 2023, 09:30:59 PM",
  "content": "Im caotious about xrp ,why ?Becouse i make my financial decisions based what the big guys and whales do it.What i see ? It doesnt apply for the benchmark legimate rules to be trusted enough.I see xrp not favoured by them it's secret but If you can read the info and you know rules also of SEC then you get the idea.Instead of XRP i'll choose XLM stellar.To be honest i don't put any money on xrp it's one of the coins from what i stay out XRP does not seems to me legit project.I just don't like to take unneccesary risks.So no matter how much FOMO and hype xrp has...Im out of this project.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454802",
  "comments": [
    {
      "author": "goaldigger",
      "created_time": "June 01, 2023, 09:47:51 PM",
      "body": "Their case with SEC is still pending and still have no final resolution.Dealing with XRP right now is always a big risk, but many are still taking it since they are more optimistic about the possible arrangement or settlement with SEC and XRP. It’s good that you actually know what to do, there’s a lot of FOMO with XRP since its already June and many expect to hear the result this Month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 01, 2023, 10:30:07 PM",
      "body": "Quote from: goaldigger on June 01, 2023, 09:47:51 PMTheir case with SEC is still pending and still have no final resolution.Dealing with XRP right now is always a big risk, but many are still taking it since they are more optimistic about the possible arrangement or settlement with SEC and XRP. It’s good that you actually know what to do, there’s a lot of FOMO with XRP since its already June and many expect to hear the result this Month. And there's George who kept the people buying because he hyped the XRP's win and so his followers are hopeful XRP is going more than $3.Its crazy to think SEC will lose though. Even if XRP is about to win, a decision will have to be made and it will be delayed forever if they have to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "June 02, 2023, 02:33:18 AM",
      "body": "SEC is still at pending but many rumors said that XRP gonna win, I am not an XRP maximalist but xrp has been proven for the last decade and has been used as a settlement by some banks according to their official site. So it could be if the XRP win the case that would be crazy price up on next alt season.On the other hand XLM or Stellar Both Stellar and Ripple have been founded by the same individual, Jed McCaleb. He collaborated with Ryan Fugger in order to make Ripple and XRP. - https://www.stilt.com/blog/2021/08/stellar-vs-ripple-which-one-should-you-choose/So what happen to XRP might happen to XLM but even tho has no direct relationship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kapalmabur",
      "created_time": "June 02, 2023, 03:46:35 AM",
      "body": "Quote from: cabron on June 01, 2023, 10:30:07 PMQuote from: goaldigger on June 01, 2023, 09:47:51 PMTheir case with SEC is still pending and still have no final resolution.Dealing with XRP right now is always a big risk, but many are still taking it since they are more optimistic about the possible arrangement or settlement with SEC and XRP. It’s good that you actually know what to do, there’s a lot of FOMO with XRP since its already June and many expect to hear the result this Month. And there's George who kept the people buying because he hyped the XRP's win and so his followers are hopeful XRP is going more than $3.Its crazy to think SEC will lose though. Even if XRP is about to win, a decision will have to be made and it will be delayed forever if they have to.They should be wiser in making decisions by considering many things including the risks,XRP case with SEC has not been resolved so better not to buy it,Instead of taking a big risk it might be better to minimize the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 02, 2023, 06:23:04 AM",
      "body": "Quote from: Shortmaster on June 01, 2023, 09:30:59 PMInstead of XRP i'll choose XLM stellar.So no matter how much FOMO and hype xrp has...Im out of this project. There is no FOMO and hype around XRP. its as dead as it was after 2018 pump and dump. xlm? Why you choose XLM istead of other 25 000 projects listed on CMC. What does XLM has compared to all of others?why is your decision making process between a project no one wants because it's centralized and a project no one wants because it died a long time ago? XLM was needed in 2018. Its not needed in 2023 because there are many better alternatives, and XLM has been sleeping the last 5 years forgetting that in crypto, the world of startups and the fastest growing industry, you can't just stop developing for so long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "June 02, 2023, 06:30:33 AM",
      "body": "XRP is not even a crypto. It is a 100% premined security scam. Somehow these people know the right people in the right spots and nobody dares to stop their ponzi scheme. They actually mastered the ponzi art which Charles couldn't. XRP can buy politicians, buy crypto exchanges, buy shills, buy social media ads... and they do it for nearly 10 years now. Almost every other shitcoin ponzi scam collapsed during these years but not this one. This one knows his shit. A ponzi scheme you can trust. \\s",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 02, 2023, 07:37:10 AM",
      "body": "The reasons you provide are emotional more than being based on an investment analysis. Everything that was taken by the SEC is not final resolution, and I expect it to end with the payment of compensation or some pledges. Indeed, the price was affected by 30%, but the currency has proven to be stronger than a legal suit.It is not in defense of XRP, but it remains better than currencies that do not have any future project or roadmap, and XRP is a project for high-speed centralized transactions, and is not a fast earning cryptocurrency or high APY staking altcoin, so it is closer to investing in high-risk stocks, as the probability of profit is small and loss High.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "June 02, 2023, 11:07:46 AM",
      "body": "Currently we are still seeing the issue of XRP being legal and unpopular by some of the major players in the crypto space. That can make investing in XRP needlessly risky for you. If you want to invest in another cryptocurrency, you can refer to XLM Stellar or other coins that you feel safe and suitable for your investment strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "June 02, 2023, 11:27:13 AM",
      "body": "Never give up on XRP not because they are fighting SEC, doesn't mean they don't have progress at all. I know it's hard for them but they have good chance they will win the battle with SEC and everyone are hoping about it as well. Never discredit XRP because it's a people's crypto currency and I support XRP to win the case because they represent the all crypto community against greedy people who wants to control everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 02, 2023, 02:17:52 PM",
      "body": "Quote from: Shortmaster on June 01, 2023, 09:30:59 PMIm caotious about xrp ,why ?Becouse i make my financial decisions based what the big guys and whales do it.What i see ? It doesnt apply for the benchmark legimate rules to be trusted enough.I see xrp not favoured by them it's secret but If you can read the info and you know rules also of SEC then you get the idea.Instead of XRP i'll choose XLM stellar.To be honest i don't put any money on xrp it's one of the coins from what i stay out XRP does not seems to me legit project.I just don't like to take unneccesary risks.So no matter how much FOMO and hype xrp has...Im out of this project. But why will you move out in one you've known for long and enters into another you're not confident about their long time existance, a kown enemy is better than an open angel but enemy in disguise, XLM is not what you think is the best, it's where your mind is and if you think you're ok and good with that, you can invest and hodl the coin bit always rem that altcoins nhave same risk in common ad everyone cannot invest thesame coin at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iyeman",
      "created_time": "June 02, 2023, 04:10:23 PM",
      "body": "It has been years since the case between SEC vs ripple has been started yet no result has been achieved. Picking XRP is a red flag caused by there have been many uncertainties in this coin. I don't know why people wanna risking their money to buy this coin that may not have future. XRP could just pay fine to end the case but XRP was refusing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shortmaster",
      "created_time": "June 03, 2023, 07:58:25 AM",
      "body": "Quote from: Doan9269 on June 02, 2023, 02:17:52 PMQuote from: Shortmaster on June 01, 2023, 09:30:59 PMIm caotious about xrp ,why ?Becouse i make my financial decisions based what the big guys and whales do it.What i see ? It doesnt apply for the benchmark legimate rules to be trusted enough.I see xrp not favoured by them it's secret but If you can read the info and you know rules also of SEC then you get the idea.Instead of XRP i'll choose XLM stellar.To be honest i don't put any money on xrp it's one of the coins from what i stay out XRP does not seems to me legit project.I just don't like to take unneccesary risks.So no matter how much FOMO and hype xrp has...Im out of this project. But why will you move out in one you've known for long and enters into another you're not confident about their long time existance, a kown enemy is better than an open angel but enemy in disguise, XLM is not what you think is the best, it's where your mind is and if you think you're ok and good with that, you can invest and hodl the coin bit always rem that altcoins nhave same risk in common ad everyone cannot invest thesame coin at the same time. Big funds has Zero money in xrp while they got a lot money in XLM Stellar. I told you guys many times here follow the money this is how you Will be successful.Maybe xrp will be good i don't know but If i see the big guys who i been following years don't invest in xrp and in the years they been in profit always they never lose becouse they pretty much control the game of finances and Investment then If they don't invest in xrp then i don't invest. But yes they like xlm stellar ...those guys dont lose money so i follow their action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "June 09, 2023, 04:10:53 PM",
      "body": "Quote from: Shortmaster on June 01, 2023, 09:30:59 PMIm caotious about xrp ,why ?Becouse i make my financial decisions based what the big guys and whales do it.What i see ? It doesnt apply for the benchmark legimate rules to be trusted enough.I see xrp not favoured by them it's secret but If you can read the info and you know rules also of SEC then you get the idea.Instead of XRP i'll choose XLM stellar.To be honest i don't put any money on xrp it's one of the coins from what i stay out XRP does not seems to me legit project.I just don't like to take unneccesary risks.So no matter how much FOMO and hype xrp has...Im out of this project. I don't think you are following big guys and whales. You are following *some* selected big guys and whales. Because there are whales backing XRP as well. You can literally see that on their block explorer and trough activity. I don't think many of them are actively shilling it though. There used to be whale influencers in twitter talking about it but people are smarter now as no one with any knowledge about legal issues doesn't really wants to get sued or jailed for shillng.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "June 09, 2023, 05:40:54 PM",
      "body": "You better not make decisions based on what the big men and popes are doing because it is your money, and you must be fully responsible. You should find out more about XRP, and then you can decide because what big people and whales do is often only for their benefit. If you follow what they say, you may find it difficult to get benefits like them. Perhaps you can analyze coins besides XRP to find the right ones for your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 10, 2023, 12:57:00 PM",
      "body": "Quote from: maydna on June 09, 2023, 05:40:54 PMYou better not make decisions based on what the big men and popes are doing because it is your money, and you must be fully responsible. You should find out more about XRP, and then you can decide because what big people and whales do is often only for their benefit. If you follow what they say, you may find it difficult to get benefits like them. Perhaps you can analyze coins besides XRP to find the right ones for your investment.You need to allow him do whatever he wants since it was his money being at stake, this is not the first time people will always have to come to the forum to give their experience about investing on a particular coin which they think is the one trending just because it's a newly introduced cryptocurrencies, the issue about his own approach with xrp is not that too good or bad because he has not yet established any reason with his take on xrp base on the research he made except if he had nothing researched about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 11, 2023, 12:59:31 AM",
      "body": "Quote from: Iyeman on June 02, 2023, 04:10:23 PMI don't know why people wanna risking their money to buy this coin that may not have future. XRP could just pay fine to end the case but XRP was refusing it. ranking site like coinmarketcap appears it as the top 10 cryptocurrencies, and the local channels, when the news of cryptocurrencies blooms, will notice that the price of Ripple is always mentioned, so investors think that it is one of the best 10 cryptocurrencies.Its price is cheap and you feel that you have a lot of money when, in fact, this currency is not worth the value of investing in it. It indicates that the person did not conduct an in-depth analysis of the market, but rather relied on the emotion that it is one of the best currencies according to its market cap.they did not strive to keep pace with the changes in the market. They did not care about NFT or DeFi, yet they maintained their position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SyndicateLabs",
      "created_time": "June 11, 2023, 01:38:44 AM",
      "body": "I can understand what OP is saying about XRP. Your financial decisions depend on many factors, and you have made your decision based on what you feel is right for you. It is important that you understand and exercise caution when investing in any cryptocurrency. Stellar (XLM) is a potential coin and is favored by many for its safety and high availability. Any cryptocurrency carries risks, so your investment decision should be based on thorough research and risk assessment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 12, 2023, 03:44:39 PM",
      "body": "I am not, I know what I think about it and nothing will change that. I know that it's a fake and boring thing and nothing will ever make it better and it will always be bad and I will never invest into it. That is as clear as day for me and if anyone still thinks that they could end up with anything nice then I have to say that it's not going to be that easy, it's going to stay like this for a long time.I think it is clear that unless you have anything that is troublesome going for you, then you should feel at ease by not investing into ripple, it's just a terrible project that doesn't deserve your money. People who still have high hopes for it keeps kidding themselves and there is nothing wrong with it, it's just not that alright and shouldn't be considered good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judaspriest",
      "created_time": "June 12, 2023, 09:12:49 PM",
      "body": "It's a natural that we feel wary of Ripple, especially now that many of the top altcoins that were once revered have now become scams, especially since XRP from 2021 hasn't reached the new all time high, and it's okay to be wary of xrp because they haven't won the trial against the SEC, if they lose you know XRP will go bankrupt, but if they win XRP will rise too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}