{
  "id": "topic_5449588",
  "title": "cygan",
  "author": "cygan",
  "created_time": "April 20, 2023, 02:15:42 PMLast edit: May 10, 2023, 04:44:07 PM by cygan",
  "content": "Autor: GazetaBitcoinWątek oryginalny: What happens when your identity is stolen -- real story || Avoid CEXs!To co przeczytacie poniżej to prawdziwa historia obywatela Rumunii, który codziennie przeżywa koszmar, po tym jak jego tożsamość została skradziona. Nie stało się to po użyciu scentralizowanej giełdy, jednak żyje on tak samo jak ten, któremu hakerzy skradli tożsamość z centralnej giełdy lub z jakiegokolwiek innego źródła. Ten artykuł jest przestrogą. Wszyscy korzystający ze scentralizowanych giełd muszą być świadomi, że w każdej chwili może dojść do włamania na giełdę i ryzykować nie tylko swoje fundusze, ale również stanąć w obliczu ryzyka, że hakerzy wykradną również ich dane osobowe i wykorzystają je przeciwko nim. Albo, co gorsze, hakerzy sprzedają ich dane osobowe w dark web, gdzie przestępcy kupują je za 1-5$ i zawsze mogą złożyć wizytę tym ludziom...Niedawny artykuł w rumuńskiej gazecie Adevărul opowiada historię 36-letniego C.T., który od 8 lat mieszka w Niemczech.Choć normalnie pracuje jako kierowca w Mannheim, jest również vlogerem. To zwróciło na niego uwagę przestępców, którzy są żądni danych osobowych.Koszmar rozpoczął się w 2018 roku podczas jazdy w kierunku jego rodzinnego miasta w Rumunii, kiedy na punkcie kontrolnym policji na Węgrzech został poinformowany, że jest częścią gangu złodziei, którego celem są samochody. Jego nazwisko pojawiło się w policyjnej bazie danych w związku z kradzieżą samochodu o wartości 22 000 euro. Oczywiście natychmiast zaprotestował swoją niewinność i próbował się tłumaczyć. Policjanci kazali mu zgłosić się do sądu miejskiego.Kilka miesięcy później, po powrocie do Niemiec, skontaktowała się z nim rumuńska policja, która poinformowała o kradzieży jego danych osobowych. Twierdzili, że wiedzą, kto to jest, ale potrzebują, aby C.T. złożył kilka oświadczeń. Na posterunku policji musiał jednak oddać odciski palców, zostać sfotografowany i zmierzony, a nawet poddać się testowi na wykrywaczu kłamstw.Od tego czasu jego problem tylko się powiększył. Za każdym razem, gdy przejeżdża przez Rumunię, jest teraz zatrzymywany przez celników i ma wrażenie, że etykietują go jako przestępcę. Na dodatek za każdym razem musiał opowiadać, bo był międzynarodowym uchodźcą.Po pewnym czasie otrzymał informację od austriackiej policji, że złodziej, który wykradł jego dane, został wreszcie złapany i skazany.Jednak w lutym tego roku miał kolejne zdarzenie z niemiecką policją. Pewnego dnia, o 6 rano, kiedy był w pracy, sąsiad powiedział mu, że policja stoi u jego drzwi i chce go aresztować, ponieważ ukradł łódź o wartości 38.000 EUR. C.T. uważał, że jego dane osobowe zostały wykorzystane przez innego złodzieja. To nowe dochodzenie karne było prowadzone przez policję w Augsburgu. Pojechał tam i zauważył, że mają akta ze wszystkimi jego danymi, ale ze zdjęciem kogoś innego. Zapytali go, gdzie był w określonym dniu 2022 roku, a on udowodnił im to za pomocą swojego telefonu, za pomocą swojego konta Google, poprzez dostęp do historii lokalizacji.Prawnicy sugerowali mu zmianę nazwiska, jednak mężczyzna nie chce wykonać tego ruchu. Na końcu artykułu opisuje, jak bardzo boi się, że dowie się, że na jego nazwisko została udzielona pożyczka bankowa lub że zostanie aresztowany, gdziekolwiek się znajdzie.Wszystko to jest imponującą historią. Nie ma znaczenia, jak złodziejom udało się zdobyć dane osobowe tej osoby. Ważne jest to, że taka kradzież może się zdarzyć w każdej chwili, jeśli korzystasz z centralnej giełdy. Hakerzy mogą wykraść dane. Nawet giełdy mogą sprzedać te dane, jak to miało miejsce w przypadku Coinbase. Nie mówimy więc o szemranej giełdzie z kraju trzeciego świata, ale o jednej z największych giełd na świecie. Ale ta giełda została przyłapana na sprzedawaniu danych klientów.Czy nadal będziesz chciał korzystać z CEXów?Tłumaczenie wykonane w ramach inicjatywy AOBT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449588",
  "comments": [
    {
      "author": "GazetaBitcoin",
      "created_time": "April 20, 2023, 02:35:00 PM",
      "body": "Dziękuję Tobie cygan tłumaczący mój 13 temat na język polski! Jestem bardzo szczęśliwy, że moje pisma docierają do ludzi z całego świata! Wykonałeś kolejną imponującą pracę!Mam szczerą nadzieję, że bardzo smutna historia przedstawiona w tym wątku uświadomi wszystkim polskim użytkownikom niebezpieczeństwa związane ze scentralizowanymi giełdami. Zobaczenie tego, z czym ktoś może żyć po kradzieży własnego nazwiska, powinno sprawić, że wszyscy dwa razy zastanowimy się przed podaniem swoich danych osobowych osobom trzecim.A jak widać, w takiej sytuacji nie pomoże nawet Policja. Co możesz zrobić? Nawet zmiana nazwiska nie rozwiąże problemu, bo może wzbudzić jeszcze większe podejrzenia władz. Czy warto żyć ze strachem, że zostaniemy gdzieś aresztowani? Może się to jednak zdarzyć w przypadku korzystania ze scentralizowanych giełd, które w każdej chwili mogą zostać zhakowane. Lub co gorsza, zawsze mogą sprzedać twoje dane osobowe!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 20, 2023, 03:17:06 PMLast edit: April 20, 2023, 05:00:53 PM by cygan",
      "body": "to rzeczywiście bardzo smutna historia, która przydarzyła się C.T. nie chciałabym być na jego miejscu, bo cała jego przyszłość jest już całkowicie zrujnowana...muszę przyznać, że przeszedłem całą procedurę kyc tylko na jednej z większych giełd, aby móc wpłacać lub wypłacać kwoty w EUR lub handlować BTC/EUR.na wszystkich innych giełdach byłem w stanie zarejestrować się przy użyciu mojego adresu e-mail, aby móc handlować do pewnego limitu, który jest dla mnie wystarczający.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}