{
  "id": "topic_5445436",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "March 18, 2023, 09:14:40 PM",
  "content": "QuoteThe banks that collapsed recently faced diverse challenges that affected their operations. For instance, Silvergate faced multiple regulatory actions due to its dealings with the bankrupt FTX exchange, its founder Sam Bankman-Fried and its sister company Alameda Research. It also cited the 2022 bearish market as part of the challenges that made it insolvent.On the other hand, Silicon Valley Bank failed due to many losses in its operations and other factors. Signature Bank also faced challenges it couldn’t handle, leading to state intervention. Apart from these three banks, economists have discovered more than 186 banks in the United States are already positioned to crash. Economists Discover More Banks Set To CollapseA recent report revealed that up to 190 banks in the US are already on the brink of a crash. Analyzing the failed Silicon Valley Bank, the analysts discovered that 10% of US banks currently have more unrecognized losses than the SVB. They also discovered that SVB capitalization is higher than 10% of existing banks.However, SVB kept more share of uninsured funding since only 1% of banks had more uninsured leverage. So, the losses and uninsured leverage were enough to cause the uninsured depositors run that pulled SVB down. The analysts pointed out that if others face a similar situation where half of their uninsured depositors move to withdraw, almost $300 billion of insured deposits will be at risk. Also, if the uninsured depositors’ withdrawals cause small fire sales, many US banks will be at risk. What Happened To The US Banking Sector?The economists disclosed that they analyzed the asset exposure of the banks in the US following the interest rates hike. They aimed to gauge how the US Federal Reserve’s moves affect the sector’s financial stability.Unfortunately, the analysis revealed that the sector’s market value shows a shortage of $2 trillion on the book value of assets making up for loan portfolios held to maturity. It also showed that all the US banks recorded a 10% decline in their marked-to-market assets. In conclusion, the economists stated that the declines in the values of bank assets had exposed them to the risk of insolvency if uninsured depositors decided to withdraw at once. Notably, depositors without insurance cover usually lose more when banks fail than their counterparts. As such, any hint of a bank crisis pushes them into a frenzy to avoid losses. However, even though the situation seems dire for the US banking sector, the central bank intervention and US President Joe Biden’s assurance show the government’s readiness to support the sector. Also, a recent report disclosed that top firms in the US finance sector raised $30 billion to aid a failing US bank.https://bitcoinist.com/svb-analysis-shows-more-than-186-us-banks-might-still-collapse/....\"186 US banks may still collapse in the near future.\"   In 2019, I made a thread on this forum entitled: Report: More Than 50% of the Worlds Banks May Be Too Weak To Survive A Recession: https://bitcointalk.org/index.php?topic=5195846.0.The topic of whether banks could survive economic downturn propelled by COVID-19 has been on my mind for the last 4 years. Perhaps now we are seeing some of the unfortunate fallout.The narrative of failing banks dates back to the economic crisis of 2008. And even further back to the banking industry becoming increasingly deregulated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445436",
  "comments": [
    {
      "author": "dothebeats",
      "created_time": "March 18, 2023, 09:35:28 PM",
      "body": "Those big banks would surely be saved by the governments. We've seen that before and we'll see that again. As for the smaller ones, well good luck to them and their depositors, I guess? They are the ones who need to succumb to give way to those larger and 'more capable' banks that the governments will always save. I've always wondered how some banks made money during the pandemic given that most of what they usually invest in are also down. People didn't do much depositing too. But it seems that they (banks) never did well anyway, and took the hit without telling anyone, which is probematic because in the event of a surge in withdrawals, they can't really give out anything, can they?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 18, 2023, 09:56:01 PM",
      "body": "Quote from: dothebeats on March 18, 2023, 09:35:28 PMThose big banks would surely be saved by the governments. We've seen that before and we'll see that again. As for the smaller ones, well good luck to them and their depositors, I guess? They are the ones who need to succumb to give way to those larger and 'more capable' banks that the governments will always save. I've always wondered how some banks made money during the pandemic given that most of what they usually invest in are also down. People didn't do much depositing too. But it seems that they (banks) never did well anyway, and took the hit without telling anyone, which is problematic because in the event of a surge in withdrawals, they can't give out anything, can they?The financial standings or positions of most of these banks are shredded in secrecy. Every year they publish their balance sheet which always shows that the bank is doing well. It's now clear that these financial statements are not true and fair representations of these banks. Most of these banks are dying slowly because of bad uncollateralized debts and bad management. They present these fake financial results because they don't want their customers to withdraw their deposits. As you rightly said, the government will bail out the regional and other big banks. The smaller banks will have to merge with other banks or sell off their business. The Federal Deposit Insurance Corporation (FDIC) and th Federal Reserve will have to go the extra mile because Americans will not be allowed to suffer the loss caused by poor supervision and control of banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "March 18, 2023, 10:18:47 PM",
      "body": "Well it doesn't really come as a surprise to me that the government is pitching in to save these banks but the question is for how long? As it is, 186 banks are already in line for a possible crash so what gives?  It just amazes me how they'd do everything possible to save this dying banks when they know it'd still die. Well, I'm not surprised though that JP Morgan is amongst the list of companies coming to the rescue of these banks since he has been highly vocal of his strong dislike for Bitcoin, I guess the banks are not really to be trusted after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "March 18, 2023, 10:49:32 PM",
      "body": "From my point of view, the recession and the banking crisis have been artificially created for the purpose of reducing the number of banks globally. There are too many banks now. And another purpose of this crisis is to accelerate the transition to digital public cryptocurrencies, which will allow excellent control of the population.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 19, 2023, 12:23:28 AM",
      "body": "Quote from: dothebeats on March 18, 2023, 09:35:28 PMThose big banks would surely be saved by the governments. We've seen that before and we'll see that again. As for the smaller ones, well good luck to them and their depositors, I guess? They are the ones who need to succumb to give way to those larger and 'more capable' banks that the governments will always save. Quote from: Die_empty on March 18, 2023, 09:56:01 PMThe Federal Deposit Insurance Corporation (FDIC) and th Federal Reserve will have to go the extra mile because Americans will not be allowed to suffer the loss caused by poor supervision and control of banks. I just saw a clip where Janet Yelen responds to the question of how they would ensure that smaller banks won't lose customers since most would withdraw their money and move to big banks that are deemed \"too big to fail\", and her answer is confusing at best. I do think what you guys said is true, in the sense that they won't give any guarantee to community/small banks which is not surprising. That being said, IIRC, only deposit with amounts larger than $250k will be insured, which basically means the one who got screwed is likely retail customers. Kinda sad, considering SVB CEO's and others sold so may shares and earn more than $10 million in profits before the collapse.Quote from: Majestic-milf on March 18, 2023, 10:18:47 PM It just amazes me how they'd do everything possible to save this dying banks when they know it'd still die. Maybe because the system relies on them. I mean, as long as they can print money anytime, there is no real risk for the big players since they can just inflate their wealth, while the poor will get rekt as usual.Quote from: Unbunplease on March 18, 2023, 10:49:32 PMFrom my point of view, the recession and the banking crisis have been artificially created for the purpose of reducing the number of banks globally. There are too many banks now. And another purpose of this crisis is to accelerate the transition to digital public cryptocurrencies, which will allow excellent control of the population.Not sure about artificially created, but at the very least this shows that there is no real punishment for the big players who do dumb mistakes if your name is too big to fail, the government will likely save you. I also don't know how this help CDBC in general, I think they will use it sooner or later regardless if there is any other bailout or not. Isn't CDBC basically a printable fiat just in digital form?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 19, 2023, 01:55:09 AM",
      "body": "My personal theory is that the Biden administration will try to avoid bailing out banks in this occasion, unlike what we all lived back in 2008. Also, we must be very careful and observer the movements of the Republican party and how they will deal with the debt ceiling when the moment to vote on it comes. If the debt ceiling is not increased and the uncertainty start to grow in the United States, then it could be the spark able to ignite the gun-power cage of the Global economy.It would be a huge irresponsibility if both the Republican and Democrat party could not work together to avoid a disaster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "March 19, 2023, 02:08:14 AM",
      "body": "50% seems about right considering these banks don't hold enough cash to insure depositors in the event the economy crashes and there's a need for liquidity.Quote from: Hydrogen on March 18, 2023, 09:14:40 PMThe narrative of failing banks dates back to the economic crisis of 2008. And even further back to the banking industry becoming increasingly deregulated. There could be whatever regulation on SVB in retrospect and the bank would still fail unless the regulation were to be applied to the federal reserve themselves. It was them that created trillions of dollars of cash flowing into the economy in 2020-2021 and seemingly tech stocks is where a lot of that money was funneled to. The bubble popped and so did SVB. The treasury bonds they were holding onto only added to the complications. SVB can't control the inflation rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "March 19, 2023, 03:51:08 AM",
      "body": "Quote from: Gyfts on March 19, 2023, 02:08:14 AM50% seems about right considering these banks don't hold enough cash to insure depositors in the event the economy crashes and there's a need for liquidity.Quote from: Hydrogen on March 18, 2023, 09:14:40 PMThe narrative of failing banks dates back to the economic crisis of 2008. And even further back to the banking industry becoming increasingly deregulated. There could be whatever regulation on SVB in retrospect and the bank would still fail unless the regulation were to be applied to the federal reserve themselves. It was them that created trillions of dollars of cash flowing into the economy in 2020-2021 and seemingly tech stocks is where a lot of that money was funneled to. The bubble popped and so did SVB. The treasury bonds they were holding onto only added to the complications. SVB can't control the inflation rate.The drama of the SVB is that in terms of banking, he did everything right. In the sense that it was not the gamble of managers who were too carried away by high-risk investments that led to its collapse, and there were no high-profile corruption scandals with the loss of the bank's reputation. Just the conservative rate on the \"risk-free\" asset in the form of US Treasury bonds did not work, in conditions uncontrolled surge in inflation. And who did it? Of course, Putin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 19, 2023, 05:51:49 AM",
      "body": "This will be an interesting week. Basically right now many of these regional bank ceo are going to see Warren Buffet and see if he can help them out. Basically what happened in 2008 with Goldman Sachs.However if you remember correctly, Warren buying Goldman didn’t do much. The stock will crashed another 50% before bottoming many months later. Seems like this is a complete repeat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slashz9",
      "created_time": "March 19, 2023, 07:24:57 AM",
      "body": "It's always important for individuals and businesses to be aware of risks in the financial system and to take steps to mitigate them, such as diversifying investments and maintaining adequate emergency funds. However, it's also important to recognize that the situation is complex and nuanced, and that sweeping generalizations or predictions should be approached with caution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 19, 2023, 08:43:22 PM",
      "body": "Quote from: Hydrogen on March 18, 2023, 09:14:40 PMQuoteUnfortunately, the analysis revealed that the sector’s market value shows a shortage of $2 trillion on the book value of assets making up for loan portfolios held to maturity.  Maybe that's why they should print more than 2 trillion of usd to maintain that gap. This could cause inflation and increment in debt but also grow the economy. But in this scenario when more than 186 banks are on the verge of chaos how the USA can think of printing 2 trillion dollars because it will default those banks by defaulting loans which in result decrease the value of assets that those banks holds, (like more). Overall, these steps are in not favor of those scrambling banks. Now I am wondering what exactly the USA is thinking about, Are they planning to clear the banking system or trying to reduce the banks by defaulting them? Do they have a backup plan? How will they secure people's money? Because I see no government intervention, Regulatory changes, and Economic boost stimulus acts in favor of banks till now, Maybe they come up later. All I can say is if it is happening then the dominance of BTC is going to increase in no time because if there will be fewer banks and which means people will seek a source to invest their money and let their money earn for them while they are sleeping if it's not in banks then no doubt people will find another option, You know what I mean hehe. I hope this will not happen. because it will devalue the US dollar mainly damaging those countries that used it for national reserves like my country and we are also near to being declared as default.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 20, 2023, 11:33:03 AM",
      "body": "Quote from: slashz9 on March 19, 2023, 07:24:57 AMIt's always important for individuals and businesses to be aware of risks in the financial system and to take steps to mitigate them, such as diversifying investments and maintaining adequate emergency funds. However, it's also important to recognize that the situation is complex and nuanced, and that sweeping generalizations or predictions should be approached with caution.Which case are you referring to? SVB buying bonds or people trying to capitalize on this crisis to swing trade? I don't think diversification can help SVB this late in the game though, I don't see how it will work either since they basically have no cash, right? As for the latter, pretty sure most of them will just withdraw their cash and then use it to buy gold or BTC even further. Quote from: Faisal2202 on March 19, 2023, 08:43:22 PM Are they planning to clear the banking system or trying to reduce the banks by defaulting them? Do they have a backup plan? How will they secure people's money? Because I see no government intervention, Regulatory changes, and Economic boost stimulus acts in favor of banks till now, Maybe they come up later. I'm not an economy expert but I don't think they care about retail customers who only have a $100k deposit or less. From what I understand, it seems like they will try to keep the big ones alive while slowly but surely closing the smaller banks. Quote from: Faisal2202 on March 19, 2023, 08:43:22 PMI hope this will not happen. because it will devalue the US dollar mainly damaging those countries that used it for national reserves like my country and we are also near to being declared as default.They will just print more money at the end of the day. I won't be surprised if they even go as far as changing the law to make sure their goal is achieved, just like what happened with Credit Suisse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "March 20, 2023, 07:40:57 PM",
      "body": "Meanwhile, First Republic Bank (FRC) seems to be dead too. The fall of its shares is close to catastrophic today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "March 20, 2023, 08:05:52 PM",
      "body": "Quote from: Hydrogen on March 18, 2023, 09:14:40 PM\"186 US banks may still collapse in the near future.\"   In 2019, I made a thread on this forum entitled: Report: More Than 50% of the Worlds Banks May Be Too Weak To Survive A Recession: https://bitcointalk.org/index.php?topic=5195846.0.The topic of whether banks could survive economic downturn propelled by COVID-19 has been on my mind for the last 4 years. Perhaps now we are seeing some of the unfortunate fallout.The narrative of failing banks dates back to the economic crisis of 2008. And even further back to the banking industry becoming increasingly deregulated. It's hard to know what to believe at the moment, as there are other so-called experts who state that banks are much better capitalized in general compared to the 2008 crisis. No recession or crisis tends to be like the others, but the subprime mortgage crisis was a whole different beast and it's hard to compare. What I heard before was that central banks left rates low for far too long, instead of slowly ratcheting them up they had to rush a really sharp spike of rates and now we're seeing the fallout of that. It shows that even the policymakers make very poor decisions if it means they have a comfier job and they don't want to annoy the public. If there are any more bank failures it is going to create ever more jitters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "March 20, 2023, 08:10:21 PM",
      "body": "When it was thought that the recession had been visible during the toughest time during the pandemic wasn't really visible at all. But it was when things have come lighter and everything turned back to normal.And while most of the economies in different parts of the world relies on US' global market and economy then these collapses that might soon to happen will even be more impactful and brutal.These crashes are gonna slaughter a lot of little individuals that have put a lot of money in the stocks and bonds. While those giants and big investors that have been aware of the situation probably have gone long on a weekday and vacation took profits too early as they've anticipated it. And here we are, not problematic about it since we've got our assets in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "March 20, 2023, 08:12:44 PM",
      "body": "Not entirely that these particular 186 banks might or are showing signs of collapse (a little clickbait-ey for a title by the by), but more like vulnerabilities in their systems that are also found within SVB and are sought as the cause of its collapse. Honestly speaking, considering how for once, SVB is seen as the quintessential bank for startups in the olden days, it wouldn't be surprising for other companies to copy their business model hoping to emulate the same success that SVB once had, but that also meant they copied these armor chinks that were found in SVB's system. As investigation still rolls over and people are still at a lost with what really happened with SVB, more and more evidences will come up that would point towards the collapse of this once big bank. And since investigations are still ongoing, it wouldn't be wise to point fingers, assume shit, and whatnot all in the name of making bitcoin and crypto the better option in the people's eyes. Instigating a financial collapse is going to affect bitcoin too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "March 20, 2023, 08:41:11 PM",
      "body": "Quote from: joniboini on March 19, 2023, 12:23:28 AMNot sure about artificially created, but at the very least this shows that there is no real punishment for the big players who do dumb mistakes if your name is too big to fail, the government will likely save you. I also don't know how this help CDBC in general, I think they will use it sooner or later regardless if there is any other bailout or not. Isn't CDBC basically a printable fiat just in digital form?It's infuriating that these too-big-to-fail banks can do whatever they want and still get away with it. I'm not saying the government shouldn't bail out banks, but strict penalties should be given to these guys that mismanage people's funds. For a company to be too big to fail it should literary be too big to fail not failing and getting a bailout from the government. I believe these banks know that they have something to fall back on that's why they just keep making dumb decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "March 22, 2023, 12:25:31 PM",
      "body": "The fall of Silicon Valley is the worst since the fall of Lemon Brothers in 2008.The current crisis that the banking sector is going through cannot be considered as part of a series of crises that have recently spread and are taking place over a relatively short and close period of time. Rather, it is much deeper and more complex than that. Especially since the center of the crisis is the United States of America, which has a great weight in the global economy in terms of being the largest economy in the world in terms of output, and also the largest financial market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "April 25, 2023, 08:16:04 AM",
      "body": "Quote from: be.open on March 20, 2023, 07:40:57 PMMeanwhile, First Republic Bank (FRC) seems to be dead too. The fall of its shares is close to catastrophic today.A month has passed and the passions around the banks have subsided a little, but the problems have not gone away. The high key rate and hints of its further growth make the outflow of deposits from banks increasing and it is not clear how this can be fixed. An interesting article in Bloomberg about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}