{
  "id": "topic_5478038",
  "title": "skarais",
  "author": "skarais",
  "created_time": "December 15, 2023, 06:07:19 PMLast edit: December 15, 2023, 06:19:54 PM by skarais",
  "content": "Seperti judul threadnya, secara pribadi masalah ini terjadi pada saya. Ada banyak thread menjadi sulit dibaca dan secara umum mungkin terlihat sangat kacau. Terjemahan otomatis membuat banyak kode tidak terbaca baik dan merusak banyak paragrafnya dan bahkan menghilangkan beberapa diantaranya. Sebagai contoh kasus, lihat gambar ini:Karena umumnya orang Indo menggunakan google translate saat membaca dan membuat postingan dalam bahasa Inggris, maka saya harap masalah ini dapat terpecahkan secepatnya. Jika ini terjadi hanya pada saya, kira-kira apa masalahnya?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478038",
  "comments": [
    {
      "author": "bayu7adi",
      "created_time": "December 15, 2023, 11:42:33 PM",
      "body": "Udah nyoba beberapa cara, seperti gonta-ganti add-on di Firefox, ganti extension di Chrome, pakai translatenya Bing di Edge, tapi tetep ga nemu solusi yang sama seperti cara kerja Google Translate sebelumnya. Ane coba di android pun hasilnya tetep berantakan untuk terjemahan dari English ke Bahasa Indonesia pakai Chrome Android.Untuk hari ini buat terjemahkan bahasa Inggris, ane copy teks ke website Google Translate. Ya ini lebih ribet daripada sebelumnya yang cuma butuh klik kanan saja di halaman forum, tetapi setidaknya bisa main forum dulu sementara waktu sambil nunggu update Google Translate nya sampai fitur menerjemahkan halaman bisa berfungsi seperti sebelumnya.Ane cari-cari berita soal masalah ini, tapi belum nemu. Spekulasi ane, biang keroknya antara Google Chrome atau Google Translate yang mungkin sedang update.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arjunmujay",
      "created_time": "December 15, 2023, 11:52:28 PM",
      "body": "Quote from: skarais on December 15, 2023, 06:07:19 PMSeperti judul threadnya, secara pribadi masalah ini terjadi pada saya. Ada banyak thread menjadi sulit dibaca dan secara umum mungkin terlihat sangat kacau. Terjemahan otomatis membuat banyak kode tidak terbaca baik dan merusak banyak paragrafnya dan bahkan menghilangkan beberapa diantaranya. Sebagai contoh kasus, lihat gambar ini:Karena umumnya orang Indo menggunakan google translate saat membaca dan membuat postingan dalam bahasa Inggris, maka saya harap masalah ini dapat terpecahkan secepatnya. Jika ini terjadi hanya pada saya, kira-kira apa masalahnya?coba deh agan seting lagi untuk penggunaan bahasa di komputer/laptop dan di setting chrome. pastikan memakai bahasa indonesia semua. mungkin bisa sedikit membantu.Mengubah bahasa Chrome & menerjemahkan halamanMemperbaiki teks yang tidak ditampilkan dengan benarmemang google translate merupakan penerjemah sejuta umat, akan tetapi mesin ini sangatlah kaku untuk urusan penerjemahan. bahasanya ya seperti robot, jadi masih harus berfikir lebih untuk mengetahui maksud dari tulisan aslinya.saya sarankan pakai translator yang lain gan. saya sendiri sekarang pakai deepL, meskipun masih pakai yang mode gratis hasilnya sendiri lebih akurat dan lebih nyambung jika dibaca secara langsung.ini perbandingan DeepL vs google translate dan translator yang lain.sebelum pakai deepL saya dulu juga pernah pakai mate translate. 11-12 lah dengan deepL. tapi masih lebih unggul deepL dalam keakuratan.saran saya sih pindah dari translator sejuta umat ke yang lebih baik. semoga bisa sedikit membantu permasalahannya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 15, 2023, 11:57:52 PM",
      "body": "Saya malah bingung membacanya kalau halaman posting di board global diterjemahkan otomatis seluruhnya sekaligus seperti itu. Diantaranya karena nama akun user dan keterangan lainnya juga jadi ikut di terjemahkan; agak aneh saja akun hilariousandco menjadi 'lucu danco' :)Solusinya lainnya mungkin bisa translate per selection, bukan per page secara keseluruhan (menggunakan fitur translate berupa plugin ataupun bawaan browser-nya), contoh:  Quote from: arjunmujay on December 15, 2023, 11:52:28 PM~saya sarankan pakai translator yang lain gan. saya sendiri sekarang pakai deepL, meskipun masih pakai yang mode gratis hasilnya sendiri lebih akurat dan lebih nyambung jika dibaca secara langsung.ini perbandingan DeepL vs google translate dan translator yang lain. ~DeepL versi berbayar setahu saya belum support untuk user dari Indonesia -cmiiwVersi gratisnya tentu dibatasi, namun memang menurut saya terkadang lebih smooth hasilnya jika dibandingkan google",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arjunmujay",
      "created_time": "December 16, 2023, 12:09:53 AM",
      "body": "Quote from: Husna QA on December 15, 2023, 11:57:52 PMQuote from: arjunmujay on December 15, 2023, 11:52:28 PM~saya sarankan pakai translator yang lain gan. saya sendiri sekarang pakai deepL, meskipun masih pakai yang mode gratis hasilnya sendiri lebih akurat dan lebih nyambung jika dibaca secara langsung.ini perbandingan DeepL vs google translate dan translator yang lain. ~DeepL versi berbayar setahu saya belum support untuk user dari Indonesia -cmiiwVersi gratisnya tentu dibatasi, namun memang menurut saya terkadang lebih smooth hasilnya jika dibandingkan googlebetul sekali, deepL membatasi hanya sekitar 1.500 karakter tiap sekali terjemahan. tapi sudah cukup sih menurut saya untuk menerjemahkan per section atau per paragraf.memang sedikit ribet sih tetapi lebih enak aja bacanya. daripada bisa translate semua halaman, tapi masih kaku dan tidak nyambung. nanti malah beda dalam pemahaman maksud dari tulisan OP.pengalaman sih, pernah pakek google buat translate text dari luar, eh malah ane salah paham. jadi brabe gan tugas ane dicoret2 dosen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "December 16, 2023, 01:36:51 AM",
      "body": "Quote from: arjunmujay on December 16, 2023, 12:09:53 AMpengalaman sih, pernah pakek google buat translate text dari luar, eh malah ane salah paham. jadi brabe gan tugas ane dicoret2 dosen Emang bener, GT ga terlalu perfect buat translate, jadi terkadang kalau abis translate dari English ke Bahasa Indonesia, ane balik lagi baca versi English-nya. Ketika baca versi Bahasa Indonesia dan English, ane harap sih ga ada perbedaan makna yang signifikan antara kata yang di terjemahkan, dan hasil terjemahan ke Bahsa Indonesia ini setidaknya membantu kita buat cari inti dari topik yang ada, kalau ada hasil terjemahan yang terdengar aneh, langsung aja baca versi Englishnya buat ngecek.Karena setiap orang punya kapasitas yang beda-beda soal Bahasa, dan ane termasuk orang yang cepet banget pening ketika beberapa kosakata Bahasa Inggris ane tahan di otak untuk mencari artinya setelah baca semua. Sedangkan kalau di terjemahkan semua langsung, menerjemahkan kata yang asing bisa langsung ketemu, karena akan berhubungan dengan kata yang udah familiar juga spot nya di kalimat tertentu.Tadi juga udah nyoba deepL, tapi ga begitu nyadar perbedaanya dengan GT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "December 16, 2023, 04:19:33 AM",
      "body": "Quote from: skarais on December 15, 2023, 06:07:19 PMKarena umumnya orang Indo menggunakan google translate saat membaca dan membuat postingan dalam bahasa Inggris, maka saya harap masalah ini dapat terpecahkan secepatnya. Jika ini terjadi hanya pada saya, kira-kira apa masalahnya?Seharusnya dalam mentranslate thread itu tidak diartikan langsung secara harfiah begitu saja seperti di atas, harusnya perkalimat dan perkata dalam ejaan. Soalnya bahasa inggris dan indonesia itu beda jauh, beda dengan (misal) bahasa jepang yang bisa ditranslate begitu saja bisa. Dan, Seingat saya, google chrome juga sudah update terbaru barusan, sudah ada tampilan dimana kalau kita klik kanan ada perbedaan GUI, mungkin karena sampeyan update browsernya dan bug semacamnya. Tapi di saya tidak, sama kayak biasanya, kalau saya coba klik kanan translate, saya masih bisa mengerti maksud dari keseluruhan.Dan, seharusnya sampeyan itu tidak membiasakan menggunakan google translate (misal) perkalimat atau perparagraf, cukup translate aja kata yang sampeyan tidak tahu, lalu susun sesuai ejaan gramar dan tata bahasanya. Kalau secara langsung gitu jadinya rancu, kami di sini yang membaca pun aneh, karena gaya berbahasanya kayak dipaksakan (malaysia) gitu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "December 16, 2023, 05:40:15 AM",
      "body": "Quote from: arjunmujay on December 15, 2023, 11:52:28 PMsebelum pakai deepL saya dulu juga pernah pakai mate translate. 11-12 lah dengan deepL. tapi masih lebih unggul deepL dalam keakuratan.saran saya sih pindah dari translator sejuta umat ke yang lebih baik. semoga bisa sedikit membantu permasalahannya.Sudah pernah pakek semuanya dari Mate, DeepL, Bing translator, dan yang terakhir Lingvanex.DeepL emang yang terbaik menurut saya, karena bahasa terjemahan bisa disesuaikan mau yang untuk formal atau untuk obrolan biasa. Quote from: Husna QA on December 15, 2023, 11:57:52 PM-snip-DeepL versi berbayar setahu saya belum support untuk user dari Indonesia -cmiiwVersi gratisnya tentu dibatasi, namun memang menurut saya terkadang lebih smooth hasilnya jika dibandingkan googleYups, belum support untuk pembayaran regional indonesia om.Karena hal tersebut saya sekarang udah gak pakek DeepL lagi, rencananya pengen beli yang premium tapi gak ada opsi payment untuk indo.Tapi yang kurang dari semua Aplikasi atau plugin translate adalah tidak ada spelling atau memeriksa ejaan teks sekaligus yang suport bahasa indonesia DeepL juga gak support untuk spelling, Tapi telisik sana sini, akhirnya dapet Aplikasi \"Microsoft Translator\" yang baru, dan jadi betah pakek ini aplikasi.Gratis gak usah pakek bayar-bayar dan yang penting ada fitur spell cheker.Tau sendiri kan om gimana kalo saya lagi Typo pas Buat post, beberapa kali sampean temukan ketypoan saya  Untuk plugin yang lebih powerfull dan gak ngubah struktur teks yang asli, bisa pakek Plugin \"TWP - Translate Web Pages\" yang tersedia di firefox dan juga Chrome. Itu paling baik menurut saya dan gak ribet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 16, 2023, 02:38:49 PM",
      "body": "Quote from: taufik123 on December 16, 2023, 05:40:15 AMQuote from: Husna QA on December 15, 2023, 11:57:52 PM-snip-DeepL versi berbayar setahu saya belum support untuk user dari Indonesia -cmiiwVersi gratisnya tentu dibatasi, namun memang menurut saya terkadang lebih smooth hasilnya jika dibandingkan google-snip-Tapi telisik sana sini, akhirnya dapet Aplikasi \"Microsoft Translator\" yang baru, dan jadi betah pakek ini aplikasi.Itu fitur spell checker-nya berlaku untuk bahasa Indonesia juga atau khusus Bahasa Inggris saja? Bagaimana dengan cek Grammar atau tatabahasanya?Di Microsoft word juga sebenarnya ada fitur check grammar with spelling namun tidak tahu persis sejauhmana akurasinya dan saya lebih memilih mematikan opsi ini;Pada opsi custom dictionary, bahasanya bisa di setting menggunakan bahasa Indonesia.Quote from: taufik123 on December 16, 2023, 05:40:15 AM-snip-Gratis gak usah pakek bayar-bayar dan yang penting ada fitur spell cheker.Tau sendiri kan om gimana kalo saya lagi Typo pas Buat post, beberapa kali sampean temukan ketypoan saya  :DKesalahan dalam penulisan selama tidak menimbulkan pengertian yang bertolak belakang dengan yang dimaksud, saya kira masih bisa dimaklumi.Kata yang digarisbawahi juga sepertinya tipo :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "December 16, 2023, 03:29:38 PM",
      "body": "Quote from: Husna QA on December 16, 2023, 02:38:49 PMItu fitur spell checker-nya berlaku untuk bahasa Indonesia juga atau khusus Bahasa Inggris saja? Bagaimana dengan cek Grammar atau tatabahasanya?Spell Checker kayakya belum sempurna juga, cuman kalo untuk teks indonesia yang salah bakal ada tanda merah. dan tata bahasanya lumayan cukup baik, kalo ada yang cukup rancu bisa di benerin manual.Tapi Opsi lain buat spell Checker bisa pakek Grammerly, dan bakal berfungi untuk memberikan tata bahasa lebih baik. Quote from: Husna QA on December 16, 2023, 02:38:49 PMDi Microsoft word juga sebenarnya ada fitur check grammar with spelling namun tidak tahu persis sejauhmana akurasinya dan saya lebih memilih mematikan opsi ini;Pada opsi custom dictionary, bahasanya bisa di setting menggunakan bahasa Indonesia.Belum pernah pakek Microsoft word buat transalte dan Check Grammar, tapi bisa jadi opsi alternatif dan oini juga tergantung kebiasaan.Sekarang lebih nyaman pakek Microsoft translator. Tapi DeepL + grammerly bisa jadi perfect, tapi bayar semuanya. Quote from: Husna QA on December 16, 2023, 02:38:49 PMKesalahan dalam penulisan selama tidak menimbulkan pengertian yang bertolak belakang dengan yang dimaksud, saya kira masih bisa dimaklumi.Kata yang digarisbawahi juga sepertinya tipo wkwkwk, kadang emang ada yang tipo sampek parah, penulisan TAPI jadi TAI, karena kuranya P.nya. Tapi ya namanya tulisan manual, pasti adalah salahnya. Apalagi kalo pakek bahasa indo jarang pakek spelling, langsung tulis di board forum. Maklum bukan pakek Chat GPT or AI lainnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "December 16, 2023, 04:58:09 PM",
      "body": "Quote from: skarais on December 15, 2023, 06:07:19 PMSeperti judul threadnya, secara pribadi masalah ini terjadi pada saya. Ada banyak thread menjadi sulit dibaca dan secara umum mungkin terlihat sangat kacau. Terjemahan otomatis membuat banyak kode tidak terbaca baik dan merusak banyak paragrafnya dan bahkan menghilangkan beberapa diantaranya. Sebagai contoh kasus, lihat gambar ini:Karena umumnya orang Indo menggunakan google translate saat membaca dan membuat postingan dalam bahasa Inggris, maka saya harap masalah ini dapat terpecahkan secepatnya. Jika ini terjadi hanya pada saya, kira-kira apa masalahnya?Translate otomatisnya yang bermasalah bagi pengguna google chrome. Bagi pengguna browser lain seperti Brave, translate otomatisnya bekerja dengan baik.Kemarin malam saya menggunakan browser chrome di laptop dan menemukan keanehan saat translate otomatis. Postingan dua paragraf jadinya cuma satu paragraf. Saya reload lagi browser dan hasil terjemahan otomatis tidak berubah.Sekarang saya membuat postingan ini menggunakaan browser Brave di android dan fungsi terjemahan otomatis bekerja dengan baik sehingga memudahkan saya memahami maksud dari postingan berbahasa Inggris. Contohnya seperti gambar ini:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arjunmujay",
      "created_time": "December 16, 2023, 11:54:34 PMLast edit: December 17, 2023, 12:11:42 AM by arjunmujay",
      "body": "Quote from: taufik123 on December 16, 2023, 03:29:38 PMQuote from: Husna QA on December 16, 2023, 02:38:49 PMDi Microsoft word juga sebenarnya ada fitur check grammar with spelling namun tidak tahu persis sejauhmana akurasinya dan saya lebih memilih mematikan opsi ini;Pada opsi custom dictionary, bahasanya bisa di setting menggunakan bahasa Indonesia.Belum pernah pakek Microsoft word buat transalte dan Check Grammar, tapi bisa jadi opsi alternatif dan oini juga tergantung kebiasaan.Sekarang lebih nyaman pakek Microsoft translator. Tapi DeepL + grammerly bisa jadi perfect, tapi bayar semuanya. kalau untuk word speeling check, pertama sih harus download kamus bahasa indonesia terlebih dahulu bisa ambil dari mbah google. atau kalau mau yang lebih akurat ya buat kamus sendiri ambil dari KBBI tetapi harus diinput manual di aplikasi dictionary wordnya. wajib juga untuk selalu mengupdate data secara manual jika di KBBI jika ada perubahan kata.QuoteTapi DeepL + grammerly bisa jadi perfect, tapi bayar semuanya.ini yang saya pakai sekarang meskipun microsoft sudah terbaru dan lebih canggih pakai GPT Versi 4 yang kalau di web GPT aslinya ya masih berbayar.meskipun deepL masih pakai versi gratis, masih lumayanlah untuk translate 1 paragraf. dan masih diuntungkan dari status pekerjaan yang bisa menikmati grammarly versi education. jadi sudah bisa menikmati fitur premium secara gratis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "December 16, 2023, 11:59:00 PM",
      "body": "Quote from: taufik123 on December 16, 2023, 03:29:38 PM-snip-Tapi Opsi lain buat spell Checker bisa pakek Grammerly, dan bakal berfungi untuk memberikan tata bahasa lebih baik.-snip-Belum pernah pakek Microsoft word buat transalte dan Check Grammar, tapi bisa jadi opsi alternatif dan oini juga tergantung kebiasaan.Sekarang lebih nyaman pakek Microsoft translator. Tapi DeepL + grammerly bisa jadi perfect, tapi bayar semuanya. Mungkin maksudnya Grammarly. Kalau untuk Grammar checker pada bahasa Inggris memang banyak pilihan, selain Grammarly ada juga ProWritingAid.Di Microsoft word setahu saya tidak ada fitur terjemah, yang ada check grammar with spelling. Kalau fitur terjemah mereka dipisah di Microsoft Translator, saya belum tahu apakah ada plugin-nya untuk digunakan di Ms Word. Kalau Grammarly ada yang diperuntukkan untuk Microsoft office (https://www.grammarly.com/microsoft-office).Quote from: taufik123 on December 16, 2023, 03:29:38 PMApalagi kalo pakek bahasa indo jarang pakek spelling, langsung tulis di board forum. Maklum bukan pakek Chat GPT or AI lainnya. Spell checker, paling juga untuk mengecek secara otomatis ketika ada kesalahan pengetikan dalam bahasa Inggris, kalau digunakan untuk Bahasa Indonesia malah jadi banyak keliru.Btw, mungkin bisa sedikit-sedikit sambil belajar bahasa Inggris juga, minimalnya ketika membaca. Jadi ada pengetahuan tentang bahasa lainnya yang bisa didapat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "December 17, 2023, 02:21:34 AM",
      "body": "YA gan, sekitar 1 bulanan saya mengalami kendala yang sama, saya sering intstal dan re-instal google translate tapi tetap sama karena saya sering nya cuma ada google chrome saja, singkat cerita kenal dengan deepl versi gratisan, extension nya tidak bisa membaca halaman untuk di terjemahkan seisi halaman full, versi premium mungkin akan lebih memberikan fitur yang lebih luas, alternatif nya kalau lagi banyak waktu luang saya usahakan copas tulisan 1 user bergantian sesuai yang saya pilih per paragraf nya, memang terkadang ada miss dan memerlukan waktu yang lebih banyak, tapi lebih baik, setidak nya mengerti secara garis besar nya.Quote from: Chikito on December 16, 2023, 04:19:33 AMharusnya perkalimat dan perkata dalam ejaan.Berati ngetik langsung di halaman translator juga tidak di sarankan kah gan? selain copas 1 kalimat utuh (Subjet, predikat, object, keterangan) ?-------------------------------------------Btw jika suatu tulisan menggunakan spell checker, gramarly dan web tool paraphrase serupa Apakah tidak terindikasi buatan AI nanti nya gan setelah di perbaiki? memang beda antara pemikiran manusia dan mesin, tapi hasil nya mungkin lebih rapih? setidak nya mudah di baca diri sendiri dulu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "December 17, 2023, 06:08:54 AM",
      "body": "Ternyata bukan hanya saya yang mengalami hal ini. Sebelum melihat topik ini saya pikir mungkin aplikasi chrome saya yang telah usang dan belum di update dan membuat penggunaan google translate untuk mentranslate otomatis suatu halaman menjadi sedikit berantakan. Tapi setelah membaca topik ini dan berikut tanggapannya ternyata semuanya hampir mengalami hal yang sama. Terutama yang sama-sama pakai chrome. Tapi terima kasih kepada mas aylabadia05 yang telah memberikan solusi dengan menggunakan browser Brave. Dan ternyata memang sangat efektive sehingga translate halaman bisa berjalan lebih baik bahkan saya rasa lebih baik daripada Chrome yang sedang normal. Tapi saya cukup terkejut dengan browser Brave yang ternyata punya token kripto yang bernama BAT. Dan Saya sudah sering lihat koin ini di Binance tapi belum tahu kalau Koin ini bisa kita hasilkan dari melihat iklan di browser Brave. Dan setelah saya baca-baca di cmc ternyata memang BAT ini tujuan untuk memberikan reward kepada pengguna browser brave yang memenuhi syarat (menonton iklan). (Sumber: https://coinmarketcap.com/id/currencies/basic-attention-token/)Setelah pakai Brave jadi berasa paling kripto   soalnya browsernya juga penyedia koin kripto yang cukup terkenal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "December 17, 2023, 06:43:50 AM",
      "body": "Quote from: taufik123 on December 16, 2023, 05:40:15 AMUntuk plugin yang lebih powerfull dan gak ngubah struktur teks yang asli, bisa pakek Plugin \"TWP - Translate Web Pages\" yang tersedia di firefox dan juga Chrome. Itu paling baik menurut saya dan gak ribet. Saya sudah coba instal gan Di sini, berhubung belum punya firefox browser saya coba-coba instal dulu, dan benar saja gan ini work, saya cukup puas dengan hasil nya, ini contoh :Saya cari-cari tidak ada untuk google chrome gan, apa ada website dan link rujukan ke sana? untuk memudahkan pemasangan extencion TWP pada google chrome?Mungkin karena sudah terbiasa menggunakan browser tersebut, rasanya saya enggan untuk move on ataupun menambah browser untuk aktifitas saya saat ini, jika mengharusan memilih mungkin saya akan pilih salah satu di antara browser tersebut, tentu yang mendukung penerjemah seperti TWP, thanks gan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "December 17, 2023, 08:54:43 AM",
      "body": "Udah coba pake brave gan? ane pake brave di hape dan brave masih baik baik saja, engga berantakan saat menggunakan fitur auto translate bahasa inggris ke bahasan indonesia. Tapi kalo pake chrome memang sekitar seminggu atau dua minggu ini hasil translatenya jadi berantakan. Coba gan donlod brave, sejauh ini masih aman aman aja untuk auto translate.Ada yang tau biar dapat BAT gimana ya? kok ane ga dapet BAT, malah katanya negara Inonesia tidak kompetable dengan wallet brave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "December 17, 2023, 02:26:20 PM",
      "body": "Baik semuanya, terimakasih telah membaca dan memahami topik permasalahannya dan juga terimakasih atas solusi yang ada. Bagi saya ini bukan masalah yang amat mendesak karena masih ada banyak jalan menuju Roma, tapi diskusi seperti ini diperlukan agar pengguna lain juga bisa menemukan solusi.Masih tentang masalah yang sama, sejauh ini saya tidak menggunakan translate seluruh halaman pada setiap kesempatan dan cenderung menggunakannya saja pada saat dibutuhkan seperti pada thread yang panjang. Sebelumnya semuanya baik-baik saja tanpa andanya masalah seperti rusaknya tampilan atau hilangnya paragraf seperti yang ada di gambar. Tapi syukur, masih ada solusinya karena pada faktanya masalah ini tidak hanya terjadi di saya saja. Intinya saat ini mengaktifkan terjemahan untuk seluruh halaman tidak bekerja optimal, ini terjadi untuk pengguna android atau pengguna PC juga.Thread di tutup karena beberapa solusi yang ada sudah cukup baik untuk membantu. Terimakasih semuanya...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}