{
  "id": "topic_5432941",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "January 04, 2023, 04:49:59 AM",
  "content": "It started on 3rd January 2009. A total of 19,248,459.375 BTC has already entered in circulation which is roughly 91.66% of the entire supply ever(21 million coins).Many more glorifying birthdays to come.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432941",
  "comments": [
    {
      "author": "Venik",
      "created_time": "January 04, 2023, 04:56:39 AM",
      "body": "The main question about BTC for me is how many coins are actually available. People were getting it for completing Captcha and were just buying it a long time ago and lost their wallets or just forgot about them. It seems like that should be a huge number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "January 04, 2023, 06:27:58 AM",
      "body": "@OP what's your intention to create 2 separate thread with a same discussion? Bitcoin birthday reminder: You could have been a millionaire using this tool.I smell this is a merit fishing thread, don't get tricked everyone!It doesn't make anything to celebrate the 14th Bitcoin birthday, I would more interested to wait until the next 6 years, which mean Bitcoin already survived for 2 decades long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "January 04, 2023, 06:43:07 AM",
      "body": "Quote from: Jawhead999 on January 04, 2023, 06:27:58 AM@OP what's your intention to create 2 separate thread with a same discussion? Bitcoin birthday reminder: You could have been a millionaire using this tool.I smell this is a merit fishing thread, don't get tricked everyone!It doesn't make anything to celebrate the 14th Bitcoin birthday, I would more interested to wait until the next 6 years, which mean Bitcoin already survived for 2 decades long.The context of both threads is entirely different. If you do not agreed feel free to report the threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supianto",
      "created_time": "January 04, 2023, 01:20:04 PM",
      "body": "14 years, damn, it's really hard to believe. I heard about it about 10 years ago for the first time, but I don't remember where. Definitely somewhere on the internet, I was in school at that time.I wonder how it's gonna be for BTC when it becomes 20 y.o.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "January 04, 2023, 06:34:08 PM",
      "body": "It has already been 14 years and it has shown so much improvement.And some still thinks that crypto would die from this downfall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 04, 2023, 07:13:05 PM",
      "body": "If bitcoin were to be a human he would have been a juvenile, a kid who has all of his life ahead of him, so far and at this age Bitcoin can be talked about as greatness. I might have joined in two years ago or so but I have also experienced some of its vast functionalities. Bitcoin is the now and the future, with bitcoin at 14 it’s never late to join in now regardless of the dominance it already has.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "January 04, 2023, 10:24:03 PM",
      "body": "14 years and somehow I’ve managed to hodl only a small amount of bitcoins. I can imagine there are many people have regrets about bitcoin. Those who blame themselves for not buying bitcoin early, those who exited the market too early, or bought at the top e.t.c. It’s a lot of mixed feelings at times like this. Like I always say, it’s never too late to buy bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Emmanuelex",
      "created_time": "January 04, 2023, 10:31:51 PM",
      "body": "Quote from: GideonGono on January 04, 2023, 06:34:08 PMIt has already been 14 years and it has shown so much improvement.And some still thinks that crypto would die from this downfall.There is never a time that people wouldn’t tell you that Bitcoin is dying, it’s now like a regular thing they say and it doesn’t bother me. I think the problem with people is that they don’t understand this yet, because they feel that what makes a good market is when price is steady going up so that they can always be making profit, but which asset on earth does that? There will always be times that the market wouldn’t be in a good condition. Only those who understands this and plays their game very well will come out the winners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "January 04, 2023, 10:35:56 PM",
      "body": "Quote from: Jawhead999 on January 04, 2023, 06:27:58 AM@OP what's your intention to create 2 separate thread with a same discussion? Bitcoin birthday reminder: You could have been a millionaire using this tool.I smell this is a merit fishing thread, don't get tricked everyone!It doesn't make anything to celebrate the 14th Bitcoin birthday, I would more interested to wait until the next 6 years, which mean Bitcoin already survived for 2 decades long.Maybe he didn't get enough merits for the first thread he created that's why he create another one hoping to get another one again.Also I'm kinda not excited for bitcoin birthday to, I don't see that as need to celebrate since no action happen on this time and I'm more excited more on halving since this we can really see some great changes since bitcoin always reaching new ATH when it take effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "January 04, 2023, 10:52:43 PM",
      "body": "Quote from: Venik on January 04, 2023, 04:56:39 AMThe main question about BTC for me is how many coins are actually available. People were getting it for completing Captcha and were just buying it a long time ago and lost their wallets or just forgot about them. It seems like that should be a huge number.The actual available 21 million will not be more or less. But for the currently circulating supply, as said by Op, that is as much as 19,248,459.375 BTC. and for the rest, it is still in the mining process and will be finished mining in 2140. Indeed, not all supply is circulating because there are many wallets that have been abandoned by their owners and become immovable Bitcoin assets. No one can open the abandoned wallet if it does not have the seed key.14 years have passed, and now bitcoin is a very valuable digital asset and a digital asset that is also controversial but has future payment technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "January 05, 2023, 08:54:10 AM",
      "body": "Imagine an experiment 14 years in making, just WOW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "January 05, 2023, 09:02:18 AM",
      "body": "Quote from: krishnaverma on January 05, 2023, 05:49:27 AMThe year 2022 was little disappointing but it not going to collapse. It will now grow slowly, market is getting matured. We always have that kind of scene in the past where bitcoin is about to collapse and suddenly it recovered and most of the time it also increases its price up to new ATH. Therefore, it's not important whether they like it or not because as long as there are people who use it as their currency to buy some things and others are accepting it as a payment, it won't be over for bitcoins. It will continue to progress and even be adopted by multiple big companies worldwide because of how many people are using it as their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "January 05, 2023, 09:46:42 AM",
      "body": "Quote from: yazher on January 05, 2023, 09:02:18 AMQuote from: krishnaverma on January 05, 2023, 05:49:27 AMThe year 2022 was little disappointing but it not going to collapse. It will now grow slowly, market is getting matured. We always have that kind of scene in the past where bitcoin is about to collapse and suddenly it recovered and most of the time it also increases its price up to new ATH. Therefore, it's not important whether they like it or not because as long as there are people who use it as their currency to buy some things and others are accepting it as a payment, it won't be over for bitcoins. It will continue to progress and even be adopted by multiple big companies worldwide because of how many people are using it as their money.What do you expect in a bear market? of course it will always be disappointing, but the most important thing is that we all survived the selling pressures.As for the journey of bitcoin, it's not that easy, many question it on the beginning, Satoshi decided to go underground and not resurface anyone, but still though his invention has continued to flourished. And maybe in the next 14 years, it will be very valuable as during that time, Bitcoin is has been mine 99% already, almost everything has been mine which makes it more demanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "January 05, 2023, 09:55:06 AM",
      "body": "Belated happy birthday to the pioneer of the revolution in finances, I hope that we will see good days this year and in the near future, the prices right now signals us to buy and accumulate as much as we can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fennic",
      "created_time": "January 05, 2023, 04:03:58 PM",
      "body": "Quote from: krishnaverma on January 04, 2023, 04:49:59 AMIt started on 3rd January 2009. A total of 19,248,459.375 BTC has already entered in circulation which is roughly 91.66% of the entire supply ever(21 million coins).Many more glorifying birthdays to come. That's quite impressive that there are 14 years that have been passed and still we do not know what to do. There are some people that say that Bitcoin is a Scam and also fraud and still it's been many years and still Bitcoin is intact and there are just no any kind of these things. And I think that Bitcoin Has Given many people a way Of full Time Independence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}