{
  "id": "topic_5439296",
  "title": "albon",
  "author": "albon",
  "created_time": "February 10, 2023, 04:47:12 AMLast edit: February 10, 2023, 08:49:26 AM by albon",
  "content": "بعد أكثر من عشرة أعوام من الخدمة، منصة LocalBitcoins تعلن عن إيقاف خدماتها هذا الشهر بشكل نهائي!وشجعت جميع العملاء علي سحب الكريبتو الخاص بهم من المنصة، ووفقاً للجدول الزمني للإنهاء ستعلق عمليات التسجيل الجديدة اعتباراً من امس، وسيتم تعليق التداول في يوم ١٦ لهذا الشهر، بينما بعد هذا التاريخ لن يتمكن المستخدمون إلا من تسجيل الدخول إلى المحفظة لسحب أموالهم.المنصة كانت واحدة من أقدم المنصات التي قدمت خدمات P2P على مستوى العالم بدون حاجة إلى KYC.مستخدمي المنصة الآن لديهم 12 شهر لسحب أرصدتهم منها والمنصة شجعتهم علي سحب أرصدتهم علي الفور. [1] https://twitter.com/LocalBitcoins/status/1623714684535701504",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439296",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "February 10, 2023, 05:02:43 AM",
      "body": "نعم صحيح أخي  albon لقد قرأت الخبر هذا الصباح وشعرت بالانزعاج والاستغراب في نفس الوقت. ما الذي دفع هذه المنصة القديمة والعريقة والمعروفة لدى أغلب من يعمل بالبيتكوين للإغلاق بهذا الشكل المفاجئ؟؟؟!!حقيقة لا أعرف السبب حتى الآن لكن بغض النظر خبر مؤسف بالفعل",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 10, 2023, 07:59:23 AM",
      "body": "أعتقد أن الأمر كما متوقعا كما سبق لي ذكره في القسم الاجليزي فقط من خلال رؤية الانخفاض المستمر لعدد العروض في المنصة و الذي في رأيي سببه هو عدم تأقلم المنصة مع منافسيها في نفس المجال، مثلا:- الرسوم، سواء كان ذلك رسوم المعاملات بين المستخدمين أو رسوم الايداع و السحب عن طريق دعم شبكة البرق- دعم لعملات أخرى، خاصة العملات المستقرة - دعم طرق دفع أكثر (مثل بطاقات الهدايا)- العمل على تحسين واجهة الموقع- تسويق شبه منعدم (كما ترون في صفحات التواصل الاجتماعي الخاصة بهم)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "February 10, 2023, 04:18:34 PM",
      "body": "Quote from: OmegaStarScream on February 10, 2023, 07:59:23 AMأعتقد أن الأمر كما متوقعا كما سبق لي ذكره في القسم الاجليزي فقط من خلال رؤية الانخفاض المستمر لعدد العروض في المنصة و الذي في رأيي سببه هو عدم تأقلم المنصة مع منافسيها في نفس المجال، مثلا:- الرسوم، سواء كان ذلك رسوم المعاملات بين المستخدمين أو رسوم الايداع و السحب عن طريق دعم شبكة البرق- دعم لعملات أخرى، خاصة العملات المستقرة - دعم طرق دفع أكثر (مثل بطاقات الهدايا)- العمل على تحسين واجهة الموقع- تسويق شبه منعدم (كما ترون في صفحات التواصل الاجتماعي الخاصة بهم)شكراً لكم أخوتى على تعليقاتكم,نظراً لإستمرار السوق الهابط فإنها لم تتمكن من التغلب على التحديات خلال فصل الشتاء البارد المستمر وأوفقت خدمات التبادل على حد ذكرهم فى موقعهم الرسمى، ايضاً ما قرئته أخى أوميجا من الصحف الانجليزية أن منصة LocalBitcoins  كان يجب عليها ازالة ميزة الP2P فى 2019 لانها جذابة للمجرمين بعد سنوات من التحديات التنظمية للشركة وكان هناك ادعاءات ومزاعم بان مسخدمى منصة LocalBitcoins ينتهكون قوانين غسيل الاموال, ايضاً كانت منصة LocalBitcoins احد اكبر مرسلى البتكوين الى منصة بيتزلاتو المرتبطة بروسيا والتى اطلقت السلطات الامريكية عليها تهم تفيد بغسل الاموال وزعم تسهيل التحايل على العقوبات فى روسيا, فى حين ان الرئيس التنفيذى لLocalBitcoins قد نفى هذه التعاون وانه لم تكن معاملات مع بيتزلاتو ولا يوجد مستخدمين روسيين بمنصتهم. صراحة الأمر محير، لكن مهما كانت الأسباب فهذا خبر سئ وسيزعزع ثقة المستثمرين المتبقية فى منصات التبادل والتداول وفى العملات الرقمية.[1] https://localbitcoins.com/service_closure/[2] https://cointelegraph.com/news/localbitcoins-closes-down-the-p2p-crypto-exchange-service/amp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "February 10, 2023, 09:23:26 PM",
      "body": "على الأرجح كما ذكر الأخ أوميغا ربما قلة العروض البيع و الشراء لسبب أن المنصة رغم أقدميتها لم تقم بتطوير خدماتها على مدى عقد من الزمان كما هو الحال مع البعض المنصات التي تدعم شبكة البرق و عملات مختلفة و دائما ما تعمل إضافة خدمات جديدة مما يجعلها مقر جميل للمستخدم الكريبتو. أعتقد هذا ما حدث مع المنصة لوكال بتكوين.و لكن من المؤسف سماع خبر إعلان إغلاق المنصة خصوصاً أن المنصة كانت متواجدة منذ وقت طويل. و يبقى إعلام المستخدمين على سحب الاموال هذا طبعاً شيء جميل.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "February 10, 2023, 10:53:04 PM",
      "body": "Quote from: OmegaStarScream on February 10, 2023, 07:59:23 AMأعتقد أن الأمر كما متوقعا كما سبق لي ذكره في القسم الاجليزي فقط من خلال رؤية الانخفاض المستمر لعدد العروض في المنصة و الذي في رأيي سببه هو عدم تأقلم المنصة مع منافسيها في نفس المجال، مثلا:- الرسوم، سواء كان ذلك رسوم المعاملات بين المستخدمين أو رسوم الايداع و السحب عن طريق دعم شبكة البرق- دعم لعملات أخرى، خاصة العملات المستقرة - دعم طرق دفع أكثر (مثل بطاقات الهدايا)- العمل على تحسين واجهة الموقع- تسويق شبه منعدم (كما ترون في صفحات التواصل الاجتماعي الخاصة بهم)هذه اسباب منطقية من وجهة نظري. هذا بالاضافة الى ان منصتي Paxful و Localcrypto تمثلان اكبر منافسين و بالذات  localcrypto التي اذكر انها كانت تسمح للمتمتعين بسمعة جيدة علىو ان ينقلو تلك السمعة الجيدة الى حساباتهم الجديدة و بالتالي اصبح بامكانهم التخلي تماما عن خدمات localbitcoins.هناك سبب اخر اجده وجيها جدا هو سلسلة الكوارث التي حصلت قبل نهاية العالم الفارط و التي تسببت في تراجع اسعار السوق و تراجع الاقبال على سوق الكريبتو عموما. بصراحة لم اكن اتوقع ان يصل هذا الى حد الاقفال و المضي في هذا الخيار عوض ان يتم العمل على المزيد من التطوير. المنصة موثوقة و كان من الممكن انه يتم طرحها للبيع او الاكتتاب العام و لكن مستغرب فعلا ان يختارو الاقفال.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 11, 2023, 03:41:04 PM",
      "body": "Quote from: Kavelj22 on February 10, 2023, 10:53:04 PMهناك سبب اخر اجده وجيها جدا هو سلسلة الكوارث التي حصلت قبل نهاية العالم الفارط و التي تسببت في تراجع اسعار السوق و تراجع الاقبال على سوق الكريبتو عموما. بصراحة لم اكن اتوقع ان يصل هذا الى حد الاقفال و المضي في هذا الخيار عوض ان يتم العمل على المزيد من التطوير. المنصة موثوقة و كان من الممكن انه يتم طرحها للبيع او الاكتتاب العام و لكن مستغرب فعلا ان يختارو الاقفال.كما ترى[1]، حجم التداول 5-6 ملايين دولار في الأسبوع يعني أقل من مليون دولار في اليوم...لذلك لن أتفجأ ان علمت أنهم لم يتلقو أي عروضا تذكر لأنه بالاضافة لحالة السوق الراهنة كما ذكرت، معظم المنصات التي تملك القدرة المادية على شراءهم، هي الأخرى تملك منصات P2P  خاصة بها : Binance, Bybit, Kucoin, OKX, Huobi,  الخ[1] https://coin.dance/volume/localbitcoins/ALL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcoin",
      "created_time": "February 11, 2023, 11:25:09 PM",
      "body": "وفقاً للعديد من المقالات, هناك سبب قانوني للإغلاق لم يتم ذكره هنا وهو إمكانية وجود علاقة بين منصة LocalBitcoins ومنصة التداول Bizlato التي تم إيقافها أيضاً بشبهات غسيل أموال, حيث سمّت وزارة الخزانة الأمريكية LocalBitcoins كإحدى المنصات المتعاملة مع Bizlato, بالإضافة إلى أن الضغوط التنظيميّة المتزايدة في أوروبا كانت تعيق عملهم:LocalBitcoins Matching Exchange, Cited By U.S. In Bizlato Case, To Close After 10 Years Of Operation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "February 12, 2023, 06:29:06 PM",
      "body": "ما لا أستطيع فهمه و في غضون هذا الانتهاء هو فرض المنصة فقط بضعة اشهر من هذا تحققات اضافية.. مثل تحقق مصاضر الاموال، كشافات الحسابات البنكية، المهنة و غير ذالك ... ؟!    (بالنسبة لبعض الدول)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsada",
      "created_time": "February 12, 2023, 07:27:19 PM",
      "body": "نعم ، إنه لأمر محزن حقًا أن نراهم يذهبون. لكن السبب الرئيسي لإغلاقها هو KYC ومنافستها Binance. لدى Binance ميزات أكثر بكثير من Localbitcoins. لكن مرة أخرى ، من المحزن للغاية رؤيتهم يذهبون بعد 10 سنوات من الخدمة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "February 12, 2023, 08:39:44 PM",
      "body": "Quote from: samcoin on February 11, 2023, 11:25:09 PMوفقاً للعديد من المقالات, هناك سبب قانوني للإغلاق لم يتم ذكره هنا وهو إمكانية وجود علاقة بين منصة LocalBitcoins ومنصة التداول Bizlato التي تم إيقافها أيضاً بشبهات غسيل أموال, حيث سمّت وزارة الخزانة الأمريكية LocalBitcoins كإحدى المنصات المتعاملة مع Bizlato, بالإضافة إلى أن الضغوط التنظيميّة المتزايدة في أوروبا كانت تعيق عملهم:LocalBitcoins Matching Exchange, Cited By U.S. In Bizlato Case, To Close After 10 Years Of Operationلا أعتقد أن شبهة بيزلاطو كان السبب وراء إغلاق خدمات المنصة، لأنه في حالة ثبوت أدلة ضد المنصة سيتم متابعة أصحابها و مثولهم أمام القضاء. و تجميد أرصدة المستخدمين و مصادرتها من طرف الحكومة. و لكن تراجع العروض على المنصة خصوصاً أنها تملك أكثر من 10 مليون مستخدم و هذا التراجع لا يغطي عبء و مصاريف المنصة لذالك قاموا بتقديم هذا الإعلان للإغلاق.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "February 12, 2023, 11:51:25 PM",
      "body": "منصة lbc هي من المنصات و مقدمي الخدمات القائل الذين ضلوا صامدين لفترة طويلة و هذا في حد ذاته يعتبر إنجازا كبيرا. لا اعرف منصات اخرى أنشئت قبل 2015 و لا تزال تعمل او على الاقل لا زالت محافظة على نفس حجم المعاملات.كل الأسباب التي تم ذكرها معقولة للغاية من انخفاظ حجم المعاملات، عدم مواكبة التطور إلى التضييقات القانونية. لكن مهما كانت الأسباب فيبقى إنهاء عمل هذه المنصة أمرا محزنا خاصة انها كانت بالنسبة للعديد منا من اول المنصات التي استعملناها.ما لفت انتباهي هو حجم التعاطف في تعليقات المتابعين على تغريدة اعلان الأقفال و تفاعل المنصة مع كل تعليق!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "February 13, 2023, 12:33:29 AM",
      "body": "من اشهر واوائل المنصات التي عملت بنظام peer to peer وساهمت كثيرا على انتشار وسهلت على الاشخاص تبادل وشراء البيتكوين وهذا خبر محزن لنا بسبب ربما الذكريات في هذه المنصة والتجارب الاولى فيها تعرفنا على اشخاص من خلالها. لكن تطور وتقدم العملات المشفرة في الاونة الاخيرة جعل المنصة غير منافسة صراحة و اغلب التجار فيها استبدلوها بمنصات توفر خدمات افضل واكثر مثلا بايننصطبعا كما سمعت انه ليس السبب الرئيسي الوحيد الذي جعل مؤسسي وفريق المنصة باتخاذ قرار غلقها وايقافها للابد لكن توجد اسباب اخرى غير مؤكدة منها الضغوطات التي تعرضت اليها من طرف الحكومات بالاضافة الى اتهامات لتسهيل تبييض الاموال وهو بالامر الخطير اذا ما توجد ادلة ولن يكفيها التهرب من هذا الموقف بغلقها فقطلكن الخبر يبقى سيء ومحزن للبيتكوين بشكل عام",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}