{
  "id": "topic_5409313",
  "title": "fiulpro",
  "author": "fiulpro",
  "created_time": "August 10, 2022, 03:50:23 AM",
  "content": "When I trade I usually look for tokens which are going high up for consecutive days therefore at the end of the day I got like 300$ in Zebpay to trade, I decided to see the trend for BTTC, without even thinking I brought it it -4% then when it was +22% I decided to sell it and reinvest the money elsewhere, now what I figured out was !!! * I was actually loosing 50£* The reason was simple, they had huge difference between buying and selling price and thus at the end of the day I ended up taking all my money out and unfortunately lost a lot as well even though I should have made some profit and silly me for thinking that everywhere it's going to be fair and I have been trading with Zebpay for 5-6 years now and usually my monthly activities are way beyond the norm in there but I already wrote them tickets for what happened and uninstalled the app instantly, going to try and use Binance from now on. Would advise users to check buying and selling price in advance, even if you think that the platform is legit, they will literally scam you instantly and at last say *did you not read terms and conditions?* also they didn't even allow me to send it to binance since apparently it was an \"express\" token. Did you guys also had any experience like this in trading some new tokens ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409313",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "August 10, 2022, 01:20:26 PM",
      "body": "Are you talking about newly listed coins or token?I have experienced before I usually investing in newly listed coins/token because it increase instantly and it die later. So I exchange them after gaining profit I don't hold them for long because I can buy later for a cheaper price.Anyway, your problem is that you can't able to withdraw or transfer the token out from Zebpay? Also the rate seems not fair?I search a bit it seems its a scam exchange look at this old thread below.- https://bitcointalk.org/index.php?topic=4489462.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 10, 2022, 02:19:56 PM",
      "body": "@BitMaxz its not scam exchange actually, the problem with them is poor management team. They really don’t know what they are doing. Problem started to come up when Indian regulations were updated for the bitcoin in the pre-covid era. Zebpay was actually leading exchange in India up until WazirX jumped in. Zebpay was able to get huge crowd and it had all the payment processing infra on it. Zebpay fell apart because its founders never implemented and upgraded as per new rules. Company fell financial but stood because of its brand name. Its just coin trading site these days. Very poorly managed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "webtricks",
      "created_time": "August 10, 2022, 02:21:14 PM",
      "body": "BTTC token you are talking about is BitTorrent with the ticker BTT, don't know why Zebpay uses BTTC for it. BTT is not a new token, it has good volume on the other exchanges like Kucoin. However, Zebpay is not the best place to buy tokens like this, I explain why: the two things happened here - first, you bought a token with a very low volume. Second, the token was `Xpress Listing Token`. Xpress listing means you can't withdraw or deposit the token. Just buy or sell on Zebpay itself. Quite a shady practice but it is what it is. As long as they are disclosing that the token is Xpress before you buy it, you can't blame them for cheating. So, the low volume ensured the huge spread between buy and sell price and the Xpress listing ensured you can't withdraw it to the other exchanges. Result, you lost the money. Just be more vigilant and try to use the exchanges with more volumes.  Quote from: BitMaxz on August 10, 2022, 01:20:26 PMAnyway, your problem is that you can't able to withdraw or transfer the token out from Zebpay? Also the rate seems not fair?I search a bit it seems its a scam exchange look at this old thread below.- https://bitcointalk.org/index.php?topic=4489462.0I won't outright label Zebpay as a scam. They were the biggest Indian exchange before 2018 but then the banks in India banned crypto exchanges and they shut the operations in India and went global. They returned to India in 2020 once the ban was lifted. What OP faced is more of an exchange malpractice than a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 10, 2022, 03:39:55 PM",
      "body": "Quote from: webtricks on August 10, 2022, 02:21:14 PM-snip-Xpress listing means you can't withdraw or deposit the token. Just buy or sell on Zebpay itself. Just heard of an exchange system like this, because it's not uncommon for an exchange to want to keep coins listed while not giving them much more profit from trading commissions. They should prove their BTT reserves periodically adjusting the total cap on the exchange so as not to raise any doubts for users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 10, 2022, 05:22:41 PM",
      "body": "I would say this just a tactic from the exchange to make money but since its shady then obviously they are going to lose their customers. We can't say they scammed you because it was up there right so all we can do is trade not be able to make withdrawal so we have to accept it since we accepted to their terms.Probably this is a lesson for you to keep an attention while clicking I accept the terms of service wherever you're signing up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}