{
  "id": "topic_5409537",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "August 11, 2022, 08:44:09 PM",
  "content": "Quote from: https://twitter.com/BanklessHQ/status/1557753518282473472BREAKING:The Ethereum Merge has been scheduled for TTD 58750000000000000000000This is approximately Sept 15-16thThe Merge is officially scheduled 📆Cadê o pessoal que falava que esse dia nunca ia chegar?  Agora é apostar se vai ser um sell the news ou \"a rede não quebrou, simbora!\"...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409537",
  "comments": [
    {
      "author": "Disruptivas",
      "created_time": "August 11, 2022, 09:54:01 PM",
      "body": "É meu caro, mas que demorou isso de fato demorou muuuuuuuito, mas parece que realmente estamos próximos do momento. Mas se demorou tanto tempo só pra sair o teste, eu não sei se será tão rápido em implementação e full transição e como de fato será o processo. Imagino algumas tretas como as que tivemos quando rolou a questão do BTC vs BTC Cash. Inclusive já  tivemos né, o fork do POW com apoio de exchange e etc. Mas tomara que dê certo, apesar da nossa mineração de todo dia estar chateada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 11, 2022, 11:16:01 PM",
      "body": "Quote from: Disruptivas on August 11, 2022, 09:54:01 PMÉ meu caro, mas que demorou isso de fato demorou muuuuuuuito, mas parece que realmente estamos próximos do momento. Claro, temos que pensar que é um sistema distribuido que guarda bilhões e bilhões em valor. Ainda mais em um sistema financeiro, qualquer downtime resulta em MUITAS perdas. Lembra aquele papo da Solana caindo durante horas () e o risco da cascata de liquidações e posições subcolateralizadas?Quote from: Disruptivas on August 11, 2022, 09:54:01 PMMas se demorou tanto tempo só pra sair o teste, eu não sei se será tão rápido em implementação e full transição e como de fato será o processo. Imagino algumas tretas como as que tivemos quando rolou a questão do BTC vs BTC Cash. Inclusive já  tivemos né, o fork do POW com apoio de exchange e etc. Esse é o ponto mais importante. Pensaram nesse upgrade com calma e focando cada teste possível para que a transação seja tão fluente quanto a mineração de um bloco para o outro. Tem que ser uma simples \"troca de trilhos\" sem descarrilhar o trem e nem pedir para ele parar.Quanto a esse assunto do fork do PoW, estava vendo uma discussão interessante quanto ao poder das stablecoins e moedas lastreadas (i.e WBTC) nessa guerra de forks. O que aconteceria com a rede e todo o ecossistema DeFi se a Circle, Tether, Paxos, BitGo, etc... decidissem todos suportarem apenas o fork do PoW? Seriam bilhões de \"poder\" alavancando a outra rede. Claro que todos esperamos que eles deem suporte ao novo upgrade (a Tether eu sei que já declarou isso).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 12, 2022, 01:34:48 AM",
      "body": "Quote from: TryNinja on August 11, 2022, 11:16:01 PMQuote from: Disruptivas on August 11, 2022, 09:54:01 PMMas se demorou tanto tempo só pra sair o teste, eu não sei se será tão rápido em implementação e full transição e como de fato será o processo. Imagino algumas tretas como as que tivemos quando rolou a questão do BTC vs BTC Cash. Inclusive já  tivemos né, o fork do POW com apoio de exchange e etc. Esse é o ponto mais importante. Pensaram nesse upgrade com calma e focando cada teste possível para que a transação seja tão fluente quanto a mineração de um bloco para o outro. Tem que ser uma simples \"troca de trilhos\" sem descarrilhar o trem e nem pedir para ele parar.Quanto a esse assunto do fork do PoW, estava vendo uma discussão interessante quanto ao poder das stablecoins e moedas lastreadas (i.e WBTC) nessa guerra de forks. O que aconteceria com a rede e todo o ecossistema DeFi se a Circle, Tether, Paxos, BitGo, etc... decidissem todos suportarem apenas o fork do PoW? Seriam bilhões de \"poder\" alavancando a outra rede. Claro que todos esperamos que eles deem suporte ao novo upgrade (a Tether eu sei que já declarou isso).Já vi muita história de fork no btc.Na minha experiência,  vai ter fork de ethereum pow sim. Vai ter muito FUD e no final esse fork vai lançar valendo alguma coisa.A melhor coisa é trocar na primeira oportunidade esse ethpow por eth pos(que será a main chain, a vitalik 's chain) . Depois a chain pow vai lentamente desvalorizar igual qq outro fork.Falando  isso , meus eth estão na ledger nano. A princípio eu posso recuperar esse fork do eth pow usando apenas a metamask e selecionando a rede pow (qd sair ne). Certo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 12, 2022, 07:38:04 PM",
      "body": "Falta um mês!O que eu sei agora, é que com isso a mineração tem tido uma valorização bem interessante. É aproveitar as ultimas migalhas e depois logo se vê o que vai dar.Em relação aos fork, vai dar para ganhar algum dinheiro de inicio. Principalmente porque quem tem ETH irá acabar por ter a mesma quantidade de moedas nas duas redes.Se essa valorização vai durar muito, já duvido. Em alguns semanas ou meses, perde o interesse. A menos que todo o poder de processamento se desloque para esse fork, o que também duvido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "August 14, 2022, 01:57:12 AM",
      "body": "Quote from: TryNinja on August 11, 2022, 08:44:09 PMCadê o pessoal que falava que esse dia nunca ia chegar?  Presente!Assumo que sou um dos que jogava balde de água fria nessa ideia.Acho que o principal problema disso ter atraído tanta \"energia negativa\"foi os constantes atrasos que no meu ver (e acredit oque de muita gente) dava a impressão de que estavam arranjando desculpas para adiar com o receio de que nem eles mesmos (devs) e acreditavam que isso poderia dar certo.Sobre dar bom ou ruim... eu acredito que vai dar certo sim, não com as engrenagens rodando como deveriam, mas o ETH vai sobreviver e progredir com essa grande mudança.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 14, 2022, 06:12:31 AM",
      "body": "Quote from: alegotardo on August 14, 2022, 01:57:12 AMAcho que o principal problema disso ter atraído tanta \"energia negativa\"foi os constantes atrasos que no meu ver (e acredit oque de muita gente) dava a impressão de que estavam arranjando desculpas para adiar com o receio de que nem eles mesmos (devs) e acreditavam que isso poderia dar certo.Mas a maioria dos devs nunca deu uma data para o merge. Eles sempre deixaram tudo aberto e focaram no seu desenvolvimento. Quem adotou a ideia do \"atraso atrás de atraso\" foi o pessoal que não acompanhou o desenvolvimento e os haters que aproveitam qualquer coisa como forma de dar paulada na segunda maior cryptomoeda.Aliás, sempre deixaram claro que o tal \"ETH 2.0\" consistia de diversos upgrades, que iam saindo com o tempo. Agora chegou a vez da migração para o PoS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 14, 2022, 07:56:44 AM",
      "body": "Quote from: alegotardo on August 14, 2022, 01:57:12 AMSobre dar bom ou ruim... eu acredito que vai dar certo sim, não com as engrenagens rodando como deveriam, mas o ETH vai sobreviver e progredir com essa grande mudança.Eu também acho que vai dar certo, as coisas foram muito bem planeadas, nisso não há duvida.Apenas acho que o elemento diferenciador do ETH irá desaparecer, ficando uma coin muito idêntica a outras no mercado. E talvez por isso, acho que ela não irá valorizar tanto com muitos pensam, no mínimo mantem-se no mesmo ritmo que tem tido até agora.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 14, 2022, 08:36:42 AM",
      "body": "Quote from: joker_josue on August 14, 2022, 07:56:44 AMApenas acho que o elemento diferenciador do ETH irá desaparecer, ficando uma coin muito idêntica a outras no mercado.E qual é esse diferencial atual, que vai desaparecer?Que outra moeda tem: o network effect da ETH, a sua lista de desenvolvedores, de projetos inovadores (e não só copycats), o seu volume nas exchanges, segundas camadas com volume de transações...?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 15, 2022, 07:04:59 AM",
      "body": "Quote from: TryNinja on August 14, 2022, 08:36:42 AME qual é esse diferencial atual, que vai desaparecer?PoWÉ verdade que continuara maior que outras coins, como o Solana e afins. Mas, passa a ser PoS como outros projetos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 15, 2022, 07:08:09 AM",
      "body": "Quote from: joker_josue on August 15, 2022, 07:04:59 AMQuote from: TryNinja on August 14, 2022, 08:36:42 AME qual é esse diferencial atual, que vai desaparecer?PoWÉ verdade que continuara maior que outras coins, como o Solana e afins. Mas, passa a ser PoS como outros projetos.Ué, o único diferencial da Ethereum versus as outras coins é o fato de ela ser PoW? “Ficando muito identica às outras do mercado”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 15, 2022, 03:34:27 PM",
      "body": "Quote from: TryNinja on August 15, 2022, 07:08:09 AMUé, o único diferencial da Ethereum versus as outras coins é o fato de ela ser PoW? “Ficando muito identica às outras do mercado”Não digo que seja o único diferencial. Mas, acho que era um diferencial relevante.Talvez esteja engando, nos próximos meses saberemos como o mercado reage a mudança.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "August 15, 2022, 09:59:29 PM",
      "body": "Olha... confesso que estou ansioso para essa migração na rede da EthereumEstive comentando com alguns dos meus colegas de serviço hoje e por incrivel que pareça \"\"todos\"\" estão ansiosos para esse acontecimento!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 16, 2022, 07:48:38 PM",
      "body": "Quote from: gagux123 on August 15, 2022, 09:59:29 PMOlha... confesso que estou ansioso para essa migração na rede da EthereumEstive comentando com alguns dos meus colegas de serviço hoje e por incrivel que pareça \"\"todos\"\" estão ansiosos para esse acontecimento! Mas ansiosos em que sentido?Ansiosos na espectativa de uma mega valorização do ETH? Ou ansiosos, com medo que as coisas ocorram mal? Ou ansiosos, para ver como o mercado vai reagir?Talvez todas elas. Mas acho que todos nos estamos com alguma espectativa para ver o que vai acontecer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 06, 2022, 11:54:37 AM",
      "body": "A última etapa antes do merge foi realizada com sucesso!Quote from: https://watcher.guru/news/ethereum-successfully-upgrades-to-bellatrix-mergeThe Ethereum Merge is divided into a two-step process. The first is the Bellatrix upgrade which was successfully deployed at the counter towards a TTD threshold (terminal total difficulty) of 58750000000000000000000 in the measure of activity on the network.The next upgrade ‘Paris’ will be initiated and the technical effects of the switch from PoS to PoW will open. After Paris is triggered, the Merge is only a few days away from being complete. However, the Ethereum foundation has not given an exact date for the Merge. Their latest blog suggests that the transition might be complete anywhere between September 15 to 20.O Vitalik diz que o merge deve ocorrer entre os dias 13 e 15 desse mês: https://twitter.com/VitalikButerin/status/1566993505326710785",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 06, 2022, 01:34:46 PM",
      "body": "Quote from: TryNinja on September 06, 2022, 11:54:37 AMO Vitalik diz que o merge deve ocorrer entre os dias 13 e 15 desse mês: https://twitter.com/VitalikButerin/status/1566993505326710785Pelo que eu estou vendo nas notícias, deve rolar um hardfork.Li na coindesk que estão esperando um valor baixo, em torno de 20 USD para cada ETHPOW.QuotePotential Ethereum Hard Fork Token ETHPOW May Trade at 1.5% of Ether's Price, Futures SuggestParadigm expects the token will open at least $18....\"We can infer how much the market estimates ETHPOW will be worth from simply looking at spot-future basis, since spot = PoS + PoW, while future is just PoS,\" Paradigm said in a Merge-focused blog post published Wednesday. \"Currently, the basis is implying ETHPOW to be priced ~$18, which is ~1.5% of ETH market cap.\"Deve cair um trocado então para cada holder de ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 06, 2022, 01:40:10 PM",
      "body": "Quote from: TryNinja on September 06, 2022, 11:54:37 AMO Vitalik diz que o merge deve ocorrer entre os dias 13 e 15 desse mês: https://twitter.com/VitalikButerin/status/1566993505326710785Tem estes dois sites com previsões mais exatas: https://bordel.wtf/ e https://797.io/themerge/Quote from: bitmover on September 06, 2022, 01:34:46 PMDeve cair um trocado então para cada holder de ETH.US$ 20 o ETH oscila a cada 15 minutos.. não vejo holder nenhum se importando com esse scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 06, 2022, 03:12:52 PM",
      "body": "Quote from: bitmover on September 06, 2022, 01:34:46 PMDeve cair um trocado então para cada holder de ETH.Cai um trocado, para a malta que anda atras de dinheiro fácil e vai comprar todo esse forkETH. Que deixará de valer ao final de uma semanas.Mas, sempre dá para alguém ganhar algum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 06, 2022, 05:14:09 PM",
      "body": "Se até um tweet do Elon Musk origina uma moeda própria, imagine um fork da segunda maior moeda do mundo com o seu maior upgrade até agora... para mim, isso é só ruído de quem quer lucrar em cima do evento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 07, 2022, 06:00:00 PM",
      "body": "Quote from: joker_josue on September 06, 2022, 03:12:52 PMQuote from: bitmover on September 06, 2022, 01:34:46 PMDeve cair um trocado então para cada holder de ETH.Cai um trocado, para a malta que anda atras de dinheiro fácil e vai comprar todo esse forkETH. Que deixará de valer ao final de uma semanas.Mas, sempre dá para alguém ganhar algum.Recentemente vi essa notícia, e vi que esse fork do ethereum não deve vingar mesmo, pois ele tem uma concorrente forte: o Ethereum Classic.Quoteash rate do Ethereum Classic atinge topo históricoSegundo dados do 2miners, o hash rate do Ethereum Classic (ETC) atingiu um novo recorde nesta semana. Tal valor, de 48,7 TH/s, é quase o dobro de quando o ETC chegou a ser negociado por US$ 176 em maio do ano passado.Hash rate do Ethereum Classic (ETC). Fonte: 2minershttps://livecoins.com.br/ethereum-classic-etc-bate-novo-recorde-de-preco-com-migracao-de-mineradores/Até acho que deve existir uma demanda por um ethereum PoW, caso as coisas não andem muito bem no PoS depois de um tempo (como descentralização, resistencia a censura, e tal, os desafios já conhecidos). Mas esse espaço pode ser ocupado pelo ETC mesmo...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}