{
  "id": "topic_5410624",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "August 20, 2022, 05:54:02 PM",
  "content": "1- Çocuğunuz lise dönemine geldiğinde ve onun için askeriye ya da diğer liseler arasında bir fark yoksa sizin tercihiniz nereye gitmesi yönünde olurdu?2- Çocuğunuz üniversite sınavından tam puan alsaydı hangi bölüme gitmesini isterdiniz? (Çocuğum hangi bölümü isterse onu tercih ederdim değil sizin hangi bölüme göndermek istediğinizi öğrenmek istiyorum.)3- Size bugün 500 bin tl verseler ve harcamak zorundasınız deseler ne alırsınız ya da nereye yatırım yaparsınız?4- Çocuğunuz üniversite 3. sınıftayken okuduğu bölümü okumak istemediğini söylese cevabınız ne olurdu?5- Çocuğunuz üniversite 4. sınıfa geçtiğinde bir iş bulsa ve okul ile iş arasında tercih yapma durumunuz olsa ne yapardınız? (Burada çocuğun değil sizin düşüncenizi istiyorum.)6- Çocuğunuz üniversiteyi bitirdikten sonra ilk yılında kamuda ya da özel bir şirkette iyi bir işte çalışmaya başlıyor ve sizden habersiz üniversite sınavına tekrar giriyor ve Tıp Fakültesi'ni kazanıyor ve okumak istiyor. Cevabınız ne olurdu? (İçinde bulunduğunuz maddi durumu düşünmeden ve çocuğunuzun siz ne derseniz onu yapacağını düşünerek cevap vermeniz gerekiyor.)7- Çocuğunuz bugün size birkaç yıl önce yaptığı bir yatırım sonucunda banka hesabında 1 milyon tl'si olduğunu söylüyor, ne yaparsınız? (Burada çocuğunuzdan bağımsız düşünmenin olanaksız olduğundan dolayı istediğiniz düşüncede cevap verebilirsiniz.)8- Çocuğunuz bugün size gelip 500 bin tl yatırım yapmak istediğini, 3 yıl o parayı unutmanız gerektiğini kendinden çok emin bir şekilde söylüyor ve elinizde istediği miktarda paranız var, ne yapardınız? (Çocuğunuz size nereye yatırım yapacağını söylemiyor sadece yatırım yapacağından emin olarak cevap vermeniz lazım.)Çocuklarımızın, gençlerimizin düşünceleri hepimiz için birçok şeyin önünde geliyor. Burada bazı sorularda parantez içinde belirttiğim gibi bir önceki cümledeki durumdan bağımsız olarak cevap vermeniz gerekiyor. Yani o an siz ne isterdiniz, yapardınız. Ben böyle isterdim ama çocuğum olduğu için böyle cevap veriyorum olmamalı. Çocuğu olmayan arkadaşlar da cevap verebilir. Buradaki amaç ebeveynlik düşüncesiyle hareket etmek değil kişinin kendi görüşü. Cevaplarınız bu düşünceyle olmalı.Vaktiniz varsa bu 8 soruya cevap verebilir misiniz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410624",
  "comments": [
    {
      "author": "meser#",
      "created_time": "August 20, 2022, 06:44:49 PM",
      "body": "1- Çocuğunuz lise dönemine geldiğinde ve onun için askeriye ya da diğer liseler arasında bir fark yoksa sizin tercihiniz nereye gitmesi yönünde olurdu?Askeriye'ye gitmesini istemezdim. O yaşta disiplin kazanacaktır ancak bu ona fazla gelip telafisi zor yaralar açabilir. Fen lisesi ya da meslek lisesi isterdim. Tabi bu ikisinin hangisi olacağını çok güzel seçmek gerekir. Eğer ki o zamanda gücüm onun yurtdışına gitmesini destekleyebilecekse fen lisesini; destekleyemeyecekse meslek lisesini tercih ederdim. Bu ülkede diplomadan ziyade bileğinde altın bilezik olmalı artık. Keza yurt dışına gittiğinde altın bileziği varsa o bile etken yani rahat yaşaması için.2- Çocuğunuz üniversite sınavından tam puan alsaydı hangi bölüme gitmesini isterdiniz? (Çocuğum hangi bölümü isterse onu tercih ederdim değil sizin hangi bölüme göndermek istediğinizi öğrenmek istiyorum.)Açıkcası Türkiye'de üniversiteye gönderme taraftarı değilim. Buranın en iyisi yurtdışının en dandiğine eşittir görüşündeyim. 3- Size bugün 500 bin tl verseler ve harcamak zorundasınız deseler ne alırsınız ya da nereye yatırım yaparsınız?Dolar'a çevirip çevirdiğim mebla ile 1 sene idare edebileceğim bir ülkeye giderdim. Daha öncesinde konusunu açtığım Gizli Milyarderdeki gibi bir maceraya atılırdım. Amerikaya gitmiş olsaydım bu parayı depo satışlarında veya ikinci el alıp tamir tadilatla yeniden satma ile başlayıp ithalat ihracata yönelerek devam ederdim.4- Çocuğunuz üniversite 3. sınıftayken okuduğu bölümü okumak istemediğini söylese cevabınız ne olurdu?Sikin sağolsun derdim. Bir insanı ölmeden öldürmüşcesine yaşatan şey istemediği bir yerde durmak zorunda kalmasıdır. o 2 sene daha dayandığında 5 belki 10 sene yaşlanmış olacaktır ruhen. Önemli olan onun ruh sağlığıdır.5- Çocuğunuz üniversite 4. sınıfa geçtiğinde bir iş bulsa ve okul ile iş arasında tercih yapma durumunuz olsa ne yapardınız? (Burada çocuğun değil sizin düşüncenizi istiyorum.)Açıkcası güvenli alanın dışına çıkmamız şeklinde tembihlenerek büyütülen bir birey olarak okulunu bitirmesini isteyebilirdim. Ancak o günün şartları doğrultusunda çocuğumun fikrini destekleyeceğimdir. Düşüncelerimi tavsiye niteliğinde belirtir kararına destek olurdum. Sonuçta en azından bi 22 yaşında eşek kadar olmuş daha ne yapayım yani  6- Çocuğunuz üniversiteyi bitirdikten sonra ilk yılında kamuda ya da özel bir şirkette iyi bir işte çalışmaya başlıyor ve sizden habersiz üniversite sınavına tekrar giriyor ve Tıp Fakültesi'ni kazanıyor ve okumak istiyor. Cevabınız ne olurdu? (İçinde bulunduğunuz maddi durumu düşünmeden ve çocuğunuzun siz ne derseniz onu yapacağını düşünerek cevap vermeniz gerekiyor.)Okusun isterse üstüne birde hukuk okusun ki şiddet durumunda hakkını bilip ona göre savunsun. Hatta bir de hafta sonları dövüş sanatlarına dair kurs alsın yani. O yaştan sonra hayat onun hayatı bana tavsiye vermek ve desteklemek düşer. Hem fenamı bu gidişle doktor bulmakta zorlanacakken aile de bir doktorumuz olmuş olur  7- Çocuğunuz bugün size birkaç yıl önce yaptığı bir yatırım sonucunda banka hesabında 1 milyon tl'si olduğunu söylüyor, ne yaparsınız? (Burada çocuğunuzdan bağımsız düşünmenin olanaksız olduğundan dolayı istediğiniz düşüncede cevap verebilirsiniz.)1 liran var mı be güzel abim beeee derdim  Tabiki de sevinir tebrik ederdim. Parasını daha ihtiyatlı koruyup değerlendirmesine dair ufakta bir vaaz verirdim  8- Çocuğunuz bugün size gelip 500 bin tl yatırım yapmak istediğini, 3 yıl o parayı unutmanız gerektiğini kendinden çok emin bir şekilde söylüyor ve elinizde istediği miktarda paranız var, ne yapardınız? (Çocuğunuz size nereye yatırım yapacağını söylemiyor sadece yatırım yapacağından emin olarak cevap vermeniz lazım.)Eğer ki 500.000 TL'yi verdikten sonra ben ve ailenin geri kalanını 3 sene geçindirecek bir birikim daha varsa verirdim. Eğer ki ben onu bu dünyaya onun izni olmadan onu getirdiysem elimden geldiğince desteklemek zorundayım. Çocuklarımızın, gençlerimizin düşünceleri hepimiz için birçok şeyin önünde geliyor. Burada bazı sorularda parantez içinde belirttiğim gibi bir önceki cümledeki durumdan bağımsız olarak cevap vermeniz gerekiyor. Yani o an siz ne isterdiniz, yapardınız. Ben böyle isterdim ama çocuğum olduğu için böyle cevap veriyorum olmamalı. Çocuğu olmayan arkadaşlar da cevap verebilir. Buradaki amaç ebeveynlik düşüncesiyle hareket etmek değil kişinin kendi görüşü. Cevaplarınız bu düşünceyle olmalı.Vaktiniz varsa bu 8 soruya cevap verebilir misiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "August 20, 2022, 09:31:10 PM",
      "body": "1- Türkiye'de maalesef asker olunmaz. Bizde subaylar kesinlikle çocuklarının asker olmasını istemez mesela. Ancak düzgün ve ideal bir ülkede bence askerlik süper olurdu.2- Bilgisayar mühendisliği. Yanlış görmediysem bu senenin üniversite sınavı birincisi de itü bilgisayar müh. gitmiş.3- Gayrimenkul yatırımı.4- İyice bir konuşurdum ve mantıklı düşünüyorsa desteklerdim. Ancak 25 yaşından sonra ona para vermeyeceğimi belirtirdim.5- İstediğini yapabilir. Diyelim durum kötü oldu, telafi etmesi çok kolay.6- Doktorların süründüğünü anlatırdım ama ille de istiyorsa desteklerdim.7- Aferim lan istediğin gibi harca ya da yatırım yap derdim. Ama güzel birkaç hediye isterdim. Çok güzel şarap, tekila vs. O kadar büyüttük çocuğu.8- Hayatta yatırımı için para vermem. Zaten neredeyse 18'inde evden kovmadığıma ve yardımı kesmediğime şükretmesi gerektiğini hatırlatırım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "August 21, 2022, 06:21:23 AM",
      "body": "Quote1- Çocuğunuz lise dönemine geldiğinde ve onun için askeriye ya da diğer liseler arasında bir fark yoksa sizin tercihiniz nereye gitmesi yönünde olurdu?askeri okul.Quote2- Çocuğunuz üniversite sınavından tam puan alsaydı hangi bölüme gitmesini isterdiniz? (Çocuğum hangi bölümü isterse onu tercih ederdim değil sizin hangi bölüme göndermek istediğinizi öğrenmek istiyorum.)üniversite sınavına girecek kadar okumasına izin vermezdim. o zamanki şartlara göre değerlendirilir.Quote3- Size bugün 500 bin tl verseler ve harcamak zorundasınız deseler ne alırsınız ya da nereye yatırım yaparsınız?arabamı satıp üstüne koyup yeni bir araba alırdım.Quote4- Çocuğunuz üniversite 3. sınıftayken okuduğu bölümü okumak istemediğini söylese cevabınız ne olurdu?sınava girip bir daha kazanma kapasitesi varsa takıl ulan göt derdim. yine o zamanki şartlar her şeyi belirler.Quote5- Çocuğunuz üniversite 4. sınıfa geçtiğinde bir iş bulsa ve okul ile iş arasında tercih yapma durumunuz olsa ne yapardınız? (Burada çocuğun değil sizin düşüncenizi istiyorum.)işin durumuna bağlı. geçici bir iş bulduysa siktiri çekerdim.Quote6- Çocuğunuz üniversiteyi bitirdikten sonra ilk yılında kamuda ya da özel bir şirkette iyi bir işte çalışmaya başlıyor ve sizden habersiz üniversite sınavına tekrar giriyor ve Tıp Fakültesi'ni kazanıyor ve okumak istiyor. Cevabınız ne olurdu? (İçinde bulunduğunuz maddi durumu düşünmeden ve çocuğunuzun siz ne derseniz onu yapacağını düşünerek cevap vermeniz gerekiyor.)oku hayvan.Quote7- Çocuğunuz bugün size birkaç yıl önce yaptığı bir yatırım sonucunda banka hesabında 1 milyon tl'si olduğunu söylüyor, ne yaparsınız? (Burada çocuğunuzdan bağımsız düşünmenin olanaksız olduğundan dolayı istediğiniz düşüncede cevap verebilirsiniz.)kumar mı oynadın hayvan dedikten sonra paraya çökerdim.Quote8- Çocuğunuz bugün size gelip 500 bin tl yatırım yapmak istediğini, 3 yıl o parayı unutmanız gerektiğini kendinden çok emin bir şekilde söylüyor ve elinizde istediği miktarda paranız var, ne yapardınız? (Çocuğunuz size nereye yatırım yapacağını söylemiyor sadece yatırım yapacağından emin olarak cevap vermeniz lazım.)çiftlik banka yatıracağı için vermezdim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "August 21, 2022, 10:38:00 PMLast edit: November 21, 2022, 09:46:00 PM by Vispilio",
      "body": "1) Üniversite 1. sınıfta tanıştığımız ODTÜ'lü bir arkadaş vardı, sosyal bilimlerden birinde okuyan ideal asker görünümünde bir tip, Deniz Harp Okulu 2. senede bırakmış, ama yani herifi görseniz Amerikan filmlerinde marine rollerine başrol teklifi alabilir... Niye bıraktın fln diye sorduğumuzda, \"Yanından her geçtiğimizde Semavere hazırolda tekmil vermek gibi bir kural gelince kafayı tamamen yememek için bıraktım\" demişti...Yani Türkiye'de silahlı kuvvetler bambaşka bir mevzudur, rasyonel ve nitelikli insanları çok ama çok gereksiz ayrıntılarla oyalar, zamanında bazı reformlara gidilebilseydi belki şu an çok daha güçlü ve rekabetçi bir devlet olmuştuk...2) YKS gibi çağ dışı ve tek tip insan yetiştirmeye yönelik bir uygulamayı tamamen atlayıp yurt dışında üniversite hayatına başlaması daha sağlıklı bir seçim olur.3) Marmara bölgesinde tarla olur (yeni başlayacağımız bir iş sebebiyle).4) Olabilir, bazı ülkelerde bazı bölümlere zaten ancak master aşamasında karar veriliyor5) Girişimciliğin doğasında olan bir gelişme olur, kendi işini yapacak olan insanın standart dışı eğitim ve deneyimlere alışması gerekir. 6) Türkiye'de üniversite mezunu olup da yine Türkiye'de 2. bir üniversite okumasını tam bir enayilik olarak nitelerdim, illa standart eğitimi kafaya taktıysa en azından bir diplomasının yurt dışından olması gerektiğini vurgulardım...7) Bir kısmını kriptolara aktarsın, gerisiyle maceraya devam.8. Ben banka mıyım ulan derdim, herhalde girişimciliğin en temel kurallarından biri 1. dereceden aile fertleri dışında insanları da ikna edebilme gücüdür.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}