{
  "id": "topic_5408556",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "August 03, 2022, 08:51:14 AM",
  "content": "Decentralized visual digital Identity is a pseudo-anonymous identifier for a person, company, object, etc. Each DID is secured by a private key. Only the private key owner can prove that they own or control their identity.But the company is in control of the data though its encoded with cryptography, the DID platforms are still centralized and could be penetrated one way or another since users will have to show their private keys to prove ownership before gaining access to Binance.  What do you think?https://consensys.net/blockchain-use-cases/digital-identity/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408556",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 03, 2022, 09:22:26 AM",
      "body": "Binance is a centralized organization, we have noticed everything CZ have impact on like Trustwallet which is close source, Safepal which is close source hardware wallet that can not be recommended to anyone to use. If Binance is working on a decentralized digital identifty, we all still know that is would be centralized and Binance will have the complete control over it, I will avoid such a thing, said to be decentralized is not telling the truth about what it is. Binance will know necessary information about anyone that have such ID.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "August 14, 2022, 09:48:01 PM",
      "body": "Quote from: Accardo on August 03, 2022, 08:51:14 AMDecentralized visual digital Identity is a pseudo-anonymous identifier for a person, company, object, etc. Each DID is secured by a private key. Only the private key owner can prove that they own or control their identity.But the company is in control of the data though its encoded with cryptography, the DID platforms are still centralized and could be penetrated one way or another since users will have to show their private keys to prove ownership before gaining access to Binance.  What do you think?https://consensys.net/blockchain-use-cases/digital-identity/It's pretty easy: If you trust Binance go for it, if you don't trust them leave it. They may call it decentralized, but if it was developed by Binance, a centralized exchange, I bet it is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 15, 2022, 04:43:45 PM",
      "body": "The company in charge of the data is still considered a central authority, so I don't see why the platforms should even be termed as \"Decentralized\" visual digital Identity. I think it's one of the so many useless projects that Binance has tried to invest in and take over, and they usually even become worse with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 17, 2022, 04:53:59 AM",
      "body": "Binance is still compliant with the legal authorities, whatever decentralized system they are planning regarding privacy will not run smoothly in the end. I remember when the Binance DApp service on Safepal became centralized due to regulatory pressures, verification requests became possible one day. Binance is the only company that has received the most global regulatory attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "August 17, 2022, 04:58:23 PM",
      "body": "Every crypto exchange platform definitely has its advantages and disadvantages, it applies to all exchanges including the Binance platform, if Binance's concept of a decentralized digital identity or DID is dubious to use like you said.Quote from: Accardo on August 03, 2022, 08:51:14 AMBut the company is in control of the data though its encoded with cryptography, the DID platforms are still centralized and could be penetrated one way or another since users will have to show their private keys to prove ownership before gaining access to Binance.  What do you think?Isn't it to overcome your doubts and in terms of using digital identity on Binance for more security, shouldn't you do the method below.QuoteNotes:*For the security of your own account, we strongly recommend that you enable two-factor authentication (2FA). Binance supports Google and SMS 2FA.*Before you start P2P trading, you must first complete Identity Verification and 2FA authentication.I think it's safer if you do all that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "August 28, 2022, 11:50:30 PM",
      "body": "Quote from: bullrun2020bro on August 14, 2022, 09:48:01 PMQuote from: Accardo on August 03, 2022, 08:51:14 AMDecentralized visual digital Identity is a pseudo-anonymous identifier for a person, company, object, etc. Each DID is secured by a private key. Only the private key owner can prove that they own or control their identity.But the company is in control of the data though its encoded with cryptography, the DID platforms are still centralized and could be penetrated one way or another since users will have to show their private keys to prove ownership before gaining access to Binance.  What do you think?https://consensys.net/blockchain-use-cases/digital-identity/It's pretty easy: If you trust Binance go for it, if you don't trust them leave it. They may call it decentralized, but if it was developed by Binance, a centralized exchange, I bet it is not.Totally agree that is Binance developed it that it is definitely not decentralized.  It would be too much against Binance's own interest to develop anything decentralized, somewhere they will have a tentacle in it, even if it's supposedly \"decentralized\".  Might as well call this DINO- decentralized in name only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 29, 2022, 08:34:34 AM",
      "body": "Quote from: Accardo on August 03, 2022, 08:51:14 AMBut the company is in control of the dataThis is a problem and a central point of failure too. Binance was hacked in the past, isn't it?Even more, with so nice bunch of buzz words - private key, cryptography, blockchain, decentralized (identifier) - one will think it's as secure and decentralized as bitcoin, and it's not. It's centralized.And I also don't think that only the user can access that identity; I think that Binance and that user can access the identity. And maybe the hackers too. And maybe also those buying this info from Binance...So for now I'd be very wary about all this. It looks to me as a nicely wrapped... trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}