{
  "id": "topic_5474843",
  "title": "pakhitheboss",
  "author": "pakhitheboss",
  "created_time": "November 21, 2023, 03:43:59 AM",
  "content": "I am starting this topic to discuss Movies in any genre and any language. You can express your reasons for liking it, such as the plot, acting, and direction, without revealing the storyline. If you do want to discuss the storyline then add *Spoiler Alert* on the heading. Please do inform everyone where it is streaming online and if not when it will for those who want to watch it at home. Rules:1. Please do not recommend porn  .2. Please inform the rating as in if it can be watched with family.3. Please inform the language.4. Please share the poster if possible otherwise it is okay.5. Please ensure do not recommend any movies that hurt other's sentiment, because they talks about cast, religion, etc.6. Please do share the IMDB rating if possible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474843",
  "comments": [
    {
      "author": "cafter",
      "created_time": "November 21, 2023, 04:28:52 PM",
      "body": "Every Indian's Favorite Show, you may guessed it: Taarak Mehta Ka Ooltah ChashmahEveryone loves this family show, it's in hindi language, I like the old eposides with original actors. now there are too many actors are changed, so became less interesting then the older episodes.IMDB rating: 8.2/10",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 22, 2023, 06:45:29 AM",
      "body": "Quote from: cafter on November 21, 2023, 04:28:52 PMEvery Indian's Favorite Show, you may guessed it: Taarak Mehta Ka Ooltah ChashmahEveryone loves this family show, it's in hindi language, I like the old eposides with original actors. now there are too many actors are changed, so became less interesting then the older episodes.IMDB rating: 8.2/10It is one of my favorite shows to watch till daya bhen and the original Tapu was part of it. Now it is one of the worst shows to watch and I have stopped watching the new episodes for some time now. I still watch the old episodes whenever they are repeated. It was and til today the only comedy show in India where you will not hear fake laughs in the background. The producer of the show Ashit Modi has now made it so bad after a major chunk of the original cast left the show.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 22, 2023, 12:23:20 PM",
      "body": "I recently saw this movie on a website and found it to be very intense and something new. It is slow when it starts but gradually it becomes so intense that you won't want to skip any part. The hero of this movie is the same guy who played Erik Lehnsherr in Xmen movie. I think it was the last movie in this series where we could see this guy. I found his name as it was listed on the website and he is Michael Fassbender. The movie is a narration by the hero about his life and what are the principles he follows as an assassin. You would find him saying any dialogue as it is all about the ability to express his feelings through his narration.  I would recommend it to anyone who loves suspense, thriller, and action.IMDB: 6.8/10",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 24, 2023, 06:25:05 AM",
      "body": "This scene is just outstanding!I won't go into the story or details about the above scene. If haven't watched this movie then you should. The name of the movie is Kannur Squad. It's streaming on Disney Plus Hotstar, if you are a Mammootty fan then it is a must watch. If you like cops based action, thriller & suspense kind of movie then you should watch it once. It is available in five different Indian languages: Malayalam, Hindi, Tamil, Telugu, and Kannada.IMDB rating is 8/10",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "November 24, 2023, 01:54:01 PM",
      "body": "Name: Bhoot Police.IMDB Rating: 6.9/10I have not watched TV or movies for about three years. Recently some days ago, I started watching movies for free on Disney Hotstar. I found this horror movie for free, but instead of feeling scared, I found it really very funny. I liked the actress Yami Gautam whom I/most people just used to see in fair and lovely ads.The movie is from year 2021, but I just watched it a few days ago. I checked the IMDb rating, and it's around 7, but I actually liked it a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 29, 2023, 07:15:16 AM",
      "body": "Quote from: cafter on November 24, 2023, 01:54:01 PMName: Bhoot Police.IMDB Rating: 6.9/10I have not watched TV or movies for about three years. Recently some days ago, I started watching movies for free on Disney Hotstar. I found this horror movie for free, but instead of feeling scared, I found it really very funny. I liked the actress Yami Gautam whom I/most people just used to see in fair and lovely ads.The movie is from year 2021, but I just watched it a few days ago. I checked the IMDb rating, and it's around 7, but I actually liked it a lot.Saw this movie after your post earlier and found it to be interesting. I did like the acting of Saif Ali Khan but was not happy with the Kapoor. Then there was Ms Fernandez, her character was good but her performance as an actor was worst. No doubt Ms Gautam stole the limelight from her in terms of the character she played and as always brilliant acting. Overall the movies is okay to watch once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 30, 2023, 05:07:50 AM",
      "body": "Thanks for this thread, you made me go down memory lane to check shows/movies I enjoyed, list will be too long if I were to put them all here. Anyway in recent times these are few I liked : 1) Scam 1992  2) Criminal justice first season (hotstar one, not hollywood) 3) Death at funeral 2007 4) Bloody Daddy 5) Zara hatke zara bachke 6) Snatch 7) The PianistAll I can tell about these is I enjoyed them when I watched them. I have no idea about plot and such anymore, you can search names on Google and it'll show where these can be watched. Right now, I'm waiting for Animal to release tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "December 01, 2023, 04:36:35 PM",
      "body": "Here are few Ones that must be watched :1. The Railway Men (8.6)2. Apurva (6.2)3. Stranger Things (8.7)4. Breaking Bad (9.5)5. Mission Raniganj (7.7)6. Crushed (8.1)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "December 02, 2023, 11:16:08 AMLast edit: December 06, 2023, 05:49:42 AM by libert19",
      "body": "Quote from: libert19 on November 30, 2023, 05:07:50 AM...Right now, I'm waiting for Animal to release tomorrow. Just watched Animal, it's excellent, lived up to hype. 9/10 from me. About three and half hours long, yet engaging throughout. Rating A — better if you watch it alone. I knew Bobby's role was short beforehand, but it's even shorter than I expected it to. You keep asking for more. Part 2 also confirmed. Edit: Changed 'remake' to 'part 2', wrong choice of word.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "December 03, 2023, 07:50:43 AM",
      "body": "Quote from: CCMS on December 01, 2023, 04:36:35 PM1. The Railway Men (8.6)It's an absolute gem as an Indian series on Netflix, all others are based on woke ideology I felt. Babil's true acting came out in this series and not to forget his character played a small but convincing role. KK Menon again proved that he is better in such roles where he has to play a serious and responsible guy. If you remember there was a series on Hotstar known as Special OPs his role was similar. The character was responsible for all kinds of covert operations with dark comedy in every part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 06, 2023, 06:28:08 AMLast edit: December 06, 2023, 06:58:06 AM by pakhitheboss",
      "body": "Sam Bahadur - 8.4/10I went yesterday to see this movie which is about Sam Maneksha, I cannot explain how well Vicky Kaushal acted as Sam Bahadur. There are a couple of interviews with the legendary commander on YouTube. You can compare Vicky Kaushal's acting and dialogue delivery with the interviews. Meghna Gulzars as a director has been able to come up with the perfect storyline. What I felt that she skipped in detailing those wars that he fought throughout his career as an army man. If you are planning to watch this movie then do check about what war he fought as you won't see them in the movie and that can create a little bit of confusion in the story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "December 11, 2023, 06:25:20 AM",
      "body": "Quote from: pakhitheboss on December 06, 2023, 06:28:08 AMSam Bahadur - 8.4/10I went yesterday to see this movie which is about Sam Maneksha, I cannot explain how well Vicky Kaushal acted as Sam Bahadur.I also watched the movie and it was quite well. The story could have been directed in a better way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 12, 2023, 07:31:14 AM",
      "body": "Quote from: CCMS on December 11, 2023, 06:25:20 AMQuote from: pakhitheboss on December 06, 2023, 06:28:08 AMSam Bahadur - 8.4/10I went yesterday to see this movie which is about Sam Maneksha, I cannot explain how well Vicky Kaushal acted as Sam Bahadur.I also watched the movie and it was quite well. The story could have been directed in a better way.I do not know why the movie did not get a good response at the box office. Are people creating a new trend wherein movies like Animal( I found it to be good too) are more admired than movies about our heroes? I also felt that the only thing that made this movie good was the acting of Vicky Kaushal, the story narration could have been made better according to me. They should have informed the audience more about the wars that were discussed in the movie.I am eagerly waiting for the release of Rebel Moon by Zack Snyder, it will be released on the 22nd of this month on Netflix. I came across a few details about this movie and it is one of the costliest movies ever to be released on Netflix. There will be a sequel of the same movie that will be released next year in April.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 12, 2023, 12:52:28 PM",
      "body": "I am more into the Hollywood stuff and dabble in Bollywood from time to time. I will keep posting my picks from time to time here.Recently say The Railway Men, it was a suspenseful thriller indeed.Few older classics that I can recommend1. Memento - if you think Ghajini is the epitome of violence (which led to a lot of controversy at that time), you should see this movie by Christopher Nolan from which Ghajini was remade. Its way way more violent but a good one.2. Shutter Island For those who are into War classics:1. The Reader2. Schindler's List",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 13, 2023, 09:06:03 AM",
      "body": "Quote from: TheUltraElite on December 12, 2023, 12:52:28 PMFor those who are into War classics:1. The Reader2. Schindler's List My all-time favorite war classic is Saving Private Rayan and the mini-series Band of Brothers. Both come from the same directors and both have a cult following, the long-awaited follow-up of the series is coming to Apple+ in 2024. The name is Masters of the Air and unfortunately in India Apple+ has not yet started their streaming service. Disney Hotstar had Band of Brothers earlier but now it is on Jio cinema which is pathetic as users after paying the subscription fee still have to watch advertisement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "December 15, 2023, 04:26:59 AM",
      "body": "The FreelancerIMDB - 8.1/10The second season is out today on Hotstar, the first season was good. The ending was very abrupt which made me go crazy as I wanted to know the end. They did not disclose publically when they were planning to release the second season, now suddenly they dropped the second and final season. Hotstar has been producing some really good series on covert operations. A must-watch series if you like action, thriller, and suspense genres.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "December 16, 2023, 09:27:13 AM",
      "body": "Quote from: TheUltraElite on December 12, 2023, 12:52:28 PMFor those who are into War classics:1. The Reader2. Schindler's List I have not watched The Reader, checked Wikipedia to understand the plot and found it to be a romantic drama. I generally avoid romantic movies, so it will not go on my list of must-watch movie. No one can leave Schindler's List, it is one of my favorite movie of all time. When we are talking about War classics, these two movies are the best I feel. The first one is Patton and the second one is Guns of Navarone, both are available on prime videos. Did you watch these two gems?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 16, 2023, 11:14:18 AM",
      "body": "Quote from: elevates on December 16, 2023, 09:27:13 AMThe first one is Patton and the second one is Guns of Navarone, both are available on prime videos. Did you watch these two gems? Of course I have watched these two, but I daresay you watch The Reader too. Just reading the plot will give you a wrong impression, I also avoid rom-movies, but its not like that at all, its just a backdrop in front of which a poignant war happens. It is one of those movies which brought tears to my eyes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "December 19, 2023, 09:58:08 AM",
      "body": "You guys should watch \"The Sisu\" also. My Life with walter boys is for LoveBirds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}