{
  "id": "topic_5471116",
  "title": "Synonyms",
  "author": "Synonyms",
  "created_time": "October 21, 2023, 07:36:06 AM",
  "content": "NAIROBI, Oct 19 (Reuters) - Kenya's shilling, Zambia's kwacha, Nigeria's naira and the Ugandan shilling are forecast to lose ground against the dollar in the next week to Thursday, traders said.KENYAKenya's shilling is expected to weaken due to persistent demand for dollars from the manufacturing and energy sectors.Commercial banks quoted the shilling at 149.80/150.00 per dollar, compared with last Thursday's closing rate of 148.85/149.05. The shilling's present level - first touched on Wednesday - is a record low, according to LSEG data.\"The shilling is weakening daily. I have seen manufacturing and energy (sectors) buy (dollars),\" a trader at one commercial bank said.ZAMBIAThe kwacha will likely continue trading on the back foot against the dollar next week as demand for petroleum products weighs on the local unit.On Thursday, commercial banks quoted the currency of Africa's second-largest copper producer at 21.79 per dollar from 21.73 a week ago. source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471116",
  "comments": [
    {
      "author": "Justbillywitt",
      "created_time": "October 21, 2023, 08:03:01 AM",
      "body": "You made mention of the naira also which I don’t think it’s still need more weeks for it to start losing value as speculated in that article. Naira has already lost its value, and the value might still continue dropping down as time goes on, this is as a result of the high demand for the foreign currency (dollar $) in the country and their is the country depends too much on importation over using their own local made products which importing things means you will have to exchange your naira to which ever country currency you are buying goods from and most times the global market uses dollar as one of the most accepted currencies so doing this alone can increase the value of the dollar in the black market and reduces the value of the naira as it’s really have no much of a use right now. Nigeria currency (Naira) aside from being used on their local market I don’t think their is any demand for the currency any where as saving money on naira right now is really not a good idea for any one to take, because the amount you deposited will be same amount when you withdraw it but it’s won’t have save value again, the country whom their currency is losing value over the dollar should just increase in their productivity and reduce their over dependence on imported products, only then can they see a little change in the revival of that currency. And things which could also be needed by others from foreign countries should also be added into consideration as their target in development so as for people to also be in need of the country local currency before the can conclude a certain deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 21, 2023, 09:45:07 AM",
      "body": "And the analysts don't want to suggest - for what reasons this is happening ? Maybe because of an unbalanced economy and dubious trends like \"dedollarization\".... I hope they will be smart enough not to join such dubious alliances as BRICS or other \"anti-normal life\" alliances. African countries should create their own economic union, unite their economies to strengthen them, and enter the world market as a strong economic union. At the same time, they should cut ties with dubious \"friends\" like China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "October 21, 2023, 09:56:40 AM",
      "body": "Quote from: Justbillywitt on October 21, 2023, 08:03:01 AMYou made mention of the naira also which I don’t think it’s still need more weeks for it to start losing value as speculated in that article. Naira has already lost its value, and the value might still continue dropping down as time goes on, this is as a result of the high demand for the foreign currency (dollar $) in the country and their is the country depends too much on importation over using their own local made products which importing things means you will have to exchange your naira to which ever country currency you are buying goods from and most times the global market uses dollar as one of the most accepted currencies so doing this alone can increase the value of the dollar in the black market and reduces the value of the naira as it’s really have no much of a use right now.  a certain deal. Nigeria as a country depends too much on importation and that is why they're always affected by any little spike in the dollar. Anything that affects the dollar, affects the naira. If they can be able to produce most of the things they consume then the dollar won't have the same effect it has now on their currency.Aside from that, the demand for Naira is very low and that can reduce the price of a currency. Foreign investors do not feel safe investing in a country with very high government debt as is the case with Nigeria.The increase in the inflation rate is also another factor that devalues the currency. Then there is the political instability of the country which has always been present but got worse since the election they had this year. All these are a few factors that have made the Nigerian currency drop and at this rate, it will keep dropping against the dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 21, 2023, 10:04:32 AM",
      "body": "Quote from: DrBeer on October 21, 2023, 09:45:07 AMAnd the analysts don't want to suggest - for what reasons this is happening ? Maybe because of an unbalanced economy and dubious trends like \"dedollarization\".... I hope they will be smart enough not to join such dubious alliances as BRICS or other \"anti-normal life\" alliances. African countries should create their own economic union, unite their economies to strengthen them, and enter the world market as a strong economic union. At the same time, they should cut ties with dubious \"friends\" like China.I do align with your stance and I think they shouldn't  cut ties with just China alone but also with America and the UK and focus on a united African economy that's not based on regional economic union but on totality of the African continent just as it's found with the EU. For the relations with most of the outside world has been unequal over the years even though most of us won't admit to it.Building the African economy on a United currency will put Africa on the vanguard of international economies for Africa has all it takes to be at the limelight with all the natural resource embedded in the continent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "October 21, 2023, 11:02:56 AM",
      "body": "That’s the case everywhere. In case of African countries things have always been weakening since many years. It’s not about just now but it’s about mismanagement since so many years. They never developed their infrastructure and never utilised the resources to developers their own countries. Instead other developed countries like USA and Europe barged into their territory to take over the matters in their own hands. If African countries would have taken governance seriously then this condition would have been altered. There are so many minerals, elements found in their territory but everything goes out of their borders but they just get paid pennies and nickels. Today’s condition was supposed to happen. They still should rethink the way they operate everything around the continent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 21, 2023, 01:13:58 PM",
      "body": "Quote from: Lida93 on October 21, 2023, 10:04:32 AMQuote from: DrBeer on October 21, 2023, 09:45:07 AMAnd the analysts don't want to suggest - for what reasons this is happening ? Maybe because of an unbalanced economy and dubious trends like \"dedollarization\".... I hope they will be smart enough not to join such dubious alliances as BRICS or other \"anti-normal life\" alliances. African countries should create their own economic union, unite their economies to strengthen them, and enter the world market as a strong economic union. At the same time, they should cut ties with dubious \"friends\" like China.I do align with your stance and I think they shouldn't  cut ties with just China alone but also with America and the UK and focus on a united African economy that's not based on regional economic union but on totality of the African continent just as it's found with the EU. For the relations with most of the outside world has been unequal over the years even though most of us won't admit to it.Building the African economy on a United currency will put Africa on the vanguard of international economies for Africa has all it takes to be at the limelight with all the natural resource embedded in the continent.like it or not, Africa has every chance of becoming a very strong regional union. BUT !For that to happen:1. we must stop trying to explain and blame all the current problems on \"colonial regimes\".  We need to talk about real problems and real solutions.2. Stop contacts with rogue countries or \"black holes\" like China, at least in that these countries USE Africa for their own benefit or manipulate politicians/groups/..... for their own personal gains with no regard for the victims in African countries.3. Stop all \"customized\" military coups and creation of semi-terrorist regimes.4. unite their efforts for the sake of the FUTURE, not for momentary gain.5. Renew and build ties with leading countries, taking its place in the world economy, becoming a full-fledged part of the world economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Huppercase",
      "created_time": "October 21, 2023, 01:48:33 PM",
      "body": "Quote from: Alpha Marine on October 21, 2023, 09:56:40 AMNigeria as a country depends too much on importation and that is why they're always affected by any little spike in the dollar. Anything that affects the dollar, affects the naira. If they can be able to produce most of the things they consume then the dollar won't have the same effect it has now on their currency.Aside from that, the demand for Naira is very low and that can reduce the price of a currency. Foreign investors do not feel safe investing in a country with very high government debt as is the case with Nigeria.The increase in the inflation rate is also another factor that devalues the currency. Then there is the political instability of the country which has always been present but got worse since the election they had this year. All these are a few factors that have made the Nigerian currency drop and at this rate, it will keep dropping against the dollar. Nigerians doesn't just depend on importation that is making the naira currency to lose its value, it's because Nigerians in general all want to hold dollar to hedge against the growing inflation the economy is printing everyday. Just October here, on 4th to be precise, Naira to a doallr was trading around ₦994 to ₦1005 but I was able to buy some ₦995, it wasn't much but I did have a profit on it because if you have have bought ₦1,000,000 of dollars, you should have around + or - $1000 and if you are to sell that back into naira today, you should have roughly ₦170,000 profit. Isn't that amazing and sad? This is what everyone in nigeria are doing to survive, everyone are trying to preserve the value of their currencies with dollar because nobody knows when this madness is going to stop.When people don't believe and trust the government, you continue to have unstable economy and that's the situation of the country, we are battling with food security, human security, no employment. All these problems will continue to show negative growth of the country and negative growth means weak economy and weak economy means less valued currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 21, 2023, 02:08:30 PM",
      "body": "Quote from: Huppercase on October 21, 2023, 01:48:33 PMWhen people don't believe and trust the government, you continue to have unstable economy and that's the situation of the country, we are battling with food security, human security, no employment. All these problems will continue to show negative growth of the country and negative growth means weak economy and weak economy means less valued currency. This is typical of what the issue is that has made Naira value to drop not only against the dollar but across all currency that is used to exchange the Naira.Lately, politicians and social media influencers are hodling and spraying the dollar around which means they demand and buy dollar for no economic purpose.To make the Naira have value against other currency then the government has to increase her foreign exchange activities by producing products that will help to reduce pressure in the use of dollar because before you important a product it has to be with dollar which puts unnecessary pressure causing scarcity of it. But if there is increase exportation than importation then it would have to shield out the gains of foreign currency against Naira, so how will this be achieved when the country is suffering from epileptic power supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}