{
  "id": "topic_5470089",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "October 12, 2023, 02:36:38 PM",
  "content": "Cross addiction is as worst as the main addiction you are trying to quit and it is a terrible idea. But what is cross addiction?QuoteWhat Are Cross Addictions?Cross addiction, also known as addiction transfer or addiction interaction disorder, occurs in various ways. First, an individual may simultaneously engage in substance abuse and maladapative behavioral patterns (medically referred to as behavioral or process addictions). Second, a person may replace one addiction with another (i.e., substituting opioids with cannabis). Third, an addictive behavior may precede a chemical addiction or vice versa.https://www.choosingtherapy.com/cross-addiction/So a friend told me that a mutual friend tried to replace his gambling addiction with another another one because he has tried all everything else. The new addiction is PS4. He pays for extra on the game and he is getting more and more into it. According to my friend, this mutual friend feels that paying $20 per month its subscription is better than $100- $500 on slots where he ends up losing. Well I told him that this is basically cross addiction and what that mutual friend is trying to do is like running away from the truth. Not wanting to face the core issue. So he is justify spending $20 and not on slots when both are unhealthy addictions that can have far reaching consequences. He just has to sit and face his addiction head on without looking for a replacement addiction which is just as bad. Ever heard of cross addiction or suffered from it?What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470089",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "October 12, 2023, 02:49:44 PM",
      "body": "Yes it is easier to replace one addiction with another this will be easier compared to a 100% withdrawal al approach which may lead to a more severe situation if it hard surmarsuting bounce back,  but in addiction replacement at least the urge of return back to the main argument addiction is almost completely none existence and at the same time the friend may have to try out some other things that will help him reduce the level at which he becomes involved with the new PS4 he is currently involved in,  all though he may try playing only on none subscriptions I believe that ps4 has a card slot where it users can download the game and then play offline. More so the friend should also allocate proper timing to his gaming activities within that period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 12, 2023, 02:51:08 PM",
      "body": "He can also decide to gamble with $20 monthly if he choose to. He can use $20 to gamble 40 times and more on gambling. But if he is addicted and want to stop gambling, I think that is a good approach, but in a way nothing will take money from him and seeing it as a way to stop an addiction.Quote from: alastantiger on October 12, 2023, 02:36:38 PMEver heard of cross addiction or suffered from it?What do you think?I have not heard about it before, but it looks like something that happened to me. I was addicted to gambling before, I stopped the addiction and I have control over myself when it comes to gambling, but I later got addicted in trading. Trading is not gambling but moving from gambling to trading, I think this is an example of cross addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "October 12, 2023, 03:07:34 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMCross addiction is as worst as the main addiction you are trying to quit and it is a terrible idea. But what is cross addiction?QuoteWhat Are Cross Addictions?Cross addiction, also known as addiction transfer or addiction interaction disorder, occurs in various ways. First, an individual may simultaneously engage in substance abuse and maladapative behavioral patterns (medically referred to as behavioral or process addictions). Second, a person may replace one addiction with another (i.e., substituting opioids with cannabis). Third, an addictive behavior may precede a chemical addiction or vice versa.https://www.choosingtherapy.com/cross-addiction/So a friend told me that a mutual friend tried to replace his gambling addiction with another another one because he has tried all everything else. The new addiction is PS4. He pays for extra on the game and he is getting more and more into it. According to my friend, this mutual friend feels that paying $20 per month its subscription is better than $100- $500 on slots where he ends up losing. Well I told him that this is basically cross addiction and what that mutual friend is trying to do is like running away from the truth. Not wanting to face the core issue. So he is justify spending $20 and not on slots when both are unhealthy addictions that can have far reaching consequences. He just has to sit and face his addiction head on without looking for a replacement addiction which is just as bad. Ever heard of cross addiction or suffered from it?What do you think?The source of addiction does not matter because its all the same. The brain chemical receptors and brain chemicals of an addict, specifically dopamine, are completely abused and dysfunctional. This is what creates the feeling of addiction. Whether you use drugs or gambling to achieve this dopamine dysregulation does not matter as it all leads to the same result: Addiction.Adding different kinds of addiction will only result into a psychological addiction mess, at a later point in time. But at least unlike opioid addiction, gambling addiction is not deadly during withdrawal. Just very unpleasant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "October 12, 2023, 03:21:22 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMCross addiction is as worst as the main addiction you are trying to quit and it is a terrible idea. But what is cross addiction?QuoteWhat Are Cross Addictions?Cross addiction, also known as addiction transfer or addiction interaction disorder, occurs in various ways. First, an individual may simultaneously engage in substance abuse and maladapative behavioral patterns (medically referred to as behavioral or process addictions). Second, a person may replace one addiction with another (i.e., substituting opioids with cannabis). Third, an addictive behavior may precede a chemical addiction or vice versa.https://www.choosingtherapy.com/cross-addiction/So a friend told me that a mutual friend tried to replace his gambling addiction with another another one because he has tried all everything else. The new addiction is PS4. He pays for extra on the game and he is getting more and more into it. According to my friend, this mutual friend feels that paying $20 per month its subscription is better than $100- $500 on slots where he ends up losing. Well I told him that this is basically cross addiction and what that mutual friend is trying to do is like running away from the truth. Not wanting to face the core issue. So he is justify spending $20 and not on slots when both are unhealthy addictions that can have far reaching consequences. He just has to sit and face his addiction head on without looking for a replacement addiction which is just as bad. Ever heard of cross addiction or suffered from it?What do you think?In my honest view of what his friend did, it can be said that, literally speaking, it is fine if you compare it to 100-500 dollars with 20 dollars every month. Even though he didn't get rid of his addiction, he just applied it to playing on PS4. I think it was a wise decision, and at least he is now out of gambling.What his friend did was an exit from gambling, which can be said to be a wise decision for me. At least he doesn't get tired of 480 dollars every month that he loses just by playing gambling, compared to the current situation where he only pays 20 dollars. Though no profit comes back to him, the only thing in return is that he is entertained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 12, 2023, 03:35:43 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMEver heard of cross addiction or suffered from it?What do you think?I hadn't heard about this term but I experienced it myself but it doesn't relate to gambling.Reducing the expenditure from 100 to 20 is good from a financial perspective but still, the addictive nature of the person remains and who knows where it leads so cross-addiction is not a good thing, and the long-term remedy is to treat the addictive nature or if someone wants to treat themselves which is possible at the early stage by challenging their urge and limiting their actions gradually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 12, 2023, 04:15:43 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMEver heard of cross addiction or suffered from it?What do you think?Using the word \"crossaddiction\" might not come up often, but we do sometimes develop addictions to different things simultaneously, such as drugs, gambling, women, or food. However, no matter what you're addicted to, it's important not to lose control. For example, I used to really enjoy playing video games all the time with friends or by myself. After a while, I realized that these games were just for fun and didn't bring any benefits, so I decided to cut back on playing them. Now, I only play when I have free time. I might still consider it a form of addiction, but I haven't become addicted to anything else recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 12, 2023, 04:49:05 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMCross addiction is as worst as the main addiction you are trying to quit and it is a terrible idea. But what is cross addiction?QuoteWhat Are Cross Addictions?Cross addiction, also known as addiction transfer or addiction interaction disorder, occurs in various ways. First, an individual may simultaneously engage in substance abuse and maladapative behavioral patterns (medically referred to as behavioral or process addictions). Second, a person may replace one addiction with another (i.e., substituting opioids with cannabis). Third, an addictive behavior may precede a chemical addiction or vice versa.https://www.choosingtherapy.com/cross-addiction/So a friend told me that a mutual friend tried to replace his gambling addiction with another another one because he has tried all everything else. The new addiction is PS4. He pays for extra on the game and he is getting more and more into it. According to my friend, this mutual friend feels that paying $20 per month its subscription is better than $100- $500 on slots where he ends up losing. Well I told him that this is basically cross addiction and what that mutual friend is trying to do is like running away from the truth. Not wanting to face the core issue. So he is justify spending $20 and not on slots when both are unhealthy addictions that can have far reaching consequences. He just has to sit and face his addiction head on without looking for a replacement addiction which is just as bad. Ever heard of cross addiction or suffered from it?What do you think?Addiction is addiction and we don't have to take the responsibility light just because the other one is much cheaper compare or the past was a bad one to deal with. I mean we could replace these addictions with another one and that's entirely possible but to be honest this is curable if someone wants to lead his life out of it or someone helps him/her this addiction. I think cross addiction was like the closest thing to get out of the true addiction. It's like this individual wants to get out of it but something is missing, it's either it's on him/her or he/she wants help from others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 12, 2023, 04:50:16 PM",
      "body": "I believe that guy you mention in your story took a good first step towards getting rid of his addiction, by replacing it with something else, if we talk in purely economical sense he is saving money from being gambled away by his compulsive desires.A healthy approach to tackle addiction is to replace the problem with another less harmful habit, like what smokers try to do when replacing cigarettes with screwing gum. The only problem I see is that person has become stuck in his phase of gaming addiction and has no managed to slowly let it go for other more fulfilling activities, like playing a sport, ride a bicycle, etc. Rather than being a problem, cross addition can be helpful to improve ones life, if handed in a proper way and we do not let the addiction to move us up a hole of more serious dependence, like hard drugs or self harm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "October 12, 2023, 04:56:06 PM",
      "body": "This is the first time that I heard it, and to be honest, I'm not sure if there is such a term. Anyway, yeah, I saw this kind of addictions from my friends as well, and this  is just like a escape from their original addiction, i.e. gambling addiction. And if you look closely, they are still losing money in a bad way and I don't think they can justify it. And it's just the psychology of addiction, you try to remove yourself, but then again, shifts to other who we think is the lesser of the two evil. But still the same though, in the end you are into the losing side and it's hard to get back and cover your losses until one day if really hits you hard and then you go and become depressed and your mental health is affected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "October 12, 2023, 04:57:10 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMEver heard of cross addiction or suffered from it?What do you think?I just found out there is a method like this, changing one addiction into another. I will not talk about addictive substances because I am not a user. But if we are a gambling addict and obsessed with other games like PS4, I think this is very interesting. However, PS4 addiction will not be a serious problem because the rental costs are cheap and if we buy a PS4 there are no monthly fees. Of course this is better than a gambling addiction which can cost $100 - $500 per monthBut I'm not sure gambling addicts will be interested in PS4 because it's less challenging, there's nothing at stake like gambling where money is at stake. But there's no harm in trying it, I would recommend this to my friends who are quite addicted to gambling, I hope it works",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goxcraft",
      "created_time": "October 12, 2023, 05:09:53 PM",
      "body": "Not just for addiction, it's also true for every aspect of life. Our life, our loved one, our daily habit everything is included. In order to forget someone or something you must first make new memories. Just like the term you mentioned \"cross addiction\". It is not a permanent solution. Rather it's something like, jumping from one sinking boat from another sinking boat. Same as before. The harm is always there, maybe slightly less or more then before.OP, your friend should realize the hard truth of life. He is basically wasting his life. We all are addicted to something. I get it and it's perfectly fine. But we are also trying to free ourselves from this addiction. So rather then playing games or gambling he should focus on life. Maybe hangout with friends, meet with relatives, spend more time with families, be busy with work. And eventually, the addiction will be gone. That's the way I overcomed my previous addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 12, 2023, 05:36:32 PM",
      "body": "Quote from: Findingnemo on October 12, 2023, 03:35:43 PMQuote from: alastantiger on October 12, 2023, 02:36:38 PMEver heard of cross addiction or suffered from it?What do you think?I hadn't heard about this term but I experienced it myself but it doesn't relate to gambling.Reducing the expenditure from 100 to 20 is good from a financial perspective but still, the addictive nature of the person remains and who knows where it leads so cross-addiction is not a good thing, and the long-term remedy is to treat the addictive nature or if someone wants to treat themselves which is possible at the early stage by challenging their urge and limiting their actions gradually.I agree with you on that,  once you notice an element of addiction,  it better to treat it 100% but even that also have it own risk,  but is very easy for those who are not deeply addicted to the point of building their daily life around their addictive behaviour,  but more also I have not really hard the name given to the approach that the ops mentioned,  but more so I have practice such practice and it do work in relieving you from the strong urge and hold of your addiction. But the first and best form of addiction treatment is for the addict to first make up their mind to fight the addiction by all means and also build a strong resistance against it at some point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "October 12, 2023, 05:46:11 PM",
      "body": "Well, at least he can move on from gambling to video game.It's not easy as is look like but better cross addiction rather than gambling. It's a small money comparing to gambling while you can get a debt and more money to be deposit into the site.I still call these a win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "October 12, 2023, 06:03:31 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PM...Well I told him that this is basically cross addiction and what that mutual friend is trying to do is like running away from the truth. Not wanting to face the core issue.It is not basically cross addiction. Cross addiction is not always a voluntary action taken to reduce addiction, but it is more of a predisposition to another form of addiction, due to their indulgence in a related addictive activity. Someone who is used to taking opioids will crave the sedative and euphoric feeling in similar drugs and can use that to replace an addiction.Gambling and Gaming are not exactly related, but it can be possible for a person to use as a form of diversional therapy to fill the empty space they will have spent going through withdrawal symptoms.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 12, 2023, 06:25:10 PM",
      "body": "Quote from: ryzaadit on October 12, 2023, 05:46:11 PMWell, at least he can move on from gambling to video game.It's not easy as is look like but better cross addiction rather than gambling. It's a small money comparing to gambling while you can get a debt and more money to be deposit into the site.I still call these a win.My thoughts so. Eventually, the Slot addict will forget about his slot addiction and then will also be dealing with that PS4 addiction. It's unsure yet what else could grab the attention of that person but surely he can outgrow that PS4. Most likely the computer base games too or the Metaverse games. this is a bit better than PS4, just prevent him from discovering casinos in the metaverse or he'd slide back into the slot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "October 12, 2023, 06:30:41 PM",
      "body": "Either cross addiction or a gambling addict, I don't see any difference between the both, because I know quite well that when you are addicted with gambling, you are addicted, Either being cross addiction or not you are addicted with gambling, since both is pointing at being over interested in gambling, so basically  theirs so certain things we have to know in gambling addiction, because when you are addicted in gambling its base on you have more less job and chance, but when you being occupied you can't engage in gambling betting everyday, so when you are frustrated in financial aspects it can make you to be gambling addictive also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "October 12, 2023, 06:33:22 PM",
      "body": "Quote from: alastantiger on October 12, 2023, 02:36:38 PMSo a friend told me that a mutual friend tried to replace his gambling addiction with another another one because he has tried all everything else. The new addiction is PS4. He pays for extra on the game and he is getting more and more into it. According to my friend, this mutual friend feels that paying $20 per month its subscription is better than $100- $500 on slots where he ends up losing. Well I told him that this is basically cross addiction and what that mutual friend is trying to do is like running away from the truth. Not wanting to face the core issue. So he is justify spending $20 and not on slots when both are unhealthy addictions that can have far reaching consequences. He just has to sit and face his addiction head on without looking for a replacement addiction which is just as bad. Ever heard of cross addiction or suffered from it?What do you think?They say that the worst addiction is the one that directly affects your body, and in the illusion that they will be in a better situation, many people exchange their addiction to drugs, alcohol or cigarettes into addictions to pornography or gambling, because in this case there is no a degradation of the body, only that of the mind.However, I disagree with this, because if your mind isn't well, then your body won't be either. It is a person's brain that controls the release of hormones that keep their body healthy. Furthermore, a person who has a deep addiction to gambling will generally abstain from physical activity and even from eating something healthy, and consequently their body will suffer the consequences.Swapping one addiction for another doesn't really solve anything, you have to eliminate it until the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 12, 2023, 06:43:41 PM",
      "body": "Quote from: ryzaadit on October 12, 2023, 05:46:11 PMWell, at least he can move on from gambling to video game.It's not easy as is look like but better cross addiction rather than gambling. It's a small money comparing to gambling while you can get a debt and more money to be deposit into the site.I still call these a win.I agree with your thought process but I am also tempted to ask if there is anyone on this planet who is not addicted to something. Whether you are addicted to gambling or to PS4, the weight and mental stress that comes with fulfilling the immediate gratification of that addiction and the withdrawal symptoms that is attached to it when you try to quit is in itself very emotionally exhausting. We may say that the video game addiction is the lesser evil but addiction is bad and can anyone ever be free from it. The person who is now addicted to PS4 may spend less compared to gambling but how about the number of hours he has to spending playing the game. I don't think he will be anymore productive. Of he has to spending many hours playing the game, what happens to his relationship with his significant other and others? Anyone who is addicted should seek help and not another \"lesser\" addiction as a replacement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "October 12, 2023, 07:04:11 PM",
      "body": "When someone is addicted to gambling, the impact is not only that the person will lose financially, but also in terms of time, because gambling addiction can take up valuable time. And if someone is addicted to games then he will only lose time because financially it is not too detrimental. However, when someone tries to change this from a gambling addiction to a gaming addiction, it sounds quite good and interesting, but this will not be able to solve the real problem, namely addiction.It would be better if we were more serious about dealing with and solving the problem of gambling addiction, namely by keeping ourselves busy doing things that are more productive and useful and this must be done continuously until you don't have time to gamble. not by diverting the feeling of addiction to something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}