{
  "id": "topic_5418758",
  "title": "ppopdesk",
  "author": "ppopdesk",
  "created_time": "October 29, 2022, 06:03:47 PM",
  "content": "Hi everyone,So one of my friends the other day was asking about what I thought the most open question in tech was. Although this could have various interpretations, I feel he was asking about what problems are out there that could be solved by new technology that could change the landscape of society/economy etc etc...I feel one of the major question that Bitcoin solves is, \"How to implement a currency system without a centralised financial institution\". This should've been an open question before Satoshi Nakamoto's paper solved the problem. Although there were many algorithms to solve distributed consensus established decades back, he used these ideas to solve a fundamental problem which has now bought an enormous change in our society/economy.This concept was further extended to solve more general decentralisation problems through the introduction of Ethereum and Smart Contracts which has opened up  a variety of applications such as DeFi.So in this sense, what other open question do y'all think tech has the potential to solve?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418758",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "October 31, 2022, 09:48:59 AM",
      "body": "How to build a Decentralized System of Reward and Problem Solving that guarantees appropriate rewards to problem solvers in unfair Societies/Communities. By problem solvers, I mean those who develop useful solutions to problems without creating more problems.If this can be done right, you could have lots of people moving back to doing good works they are talented in and enjoy doing. The decentralized system will end up developing a society/community full of people serving the roles they were created for instead of the current dysfunctional system where the legs currently serve the roles of hands, ear serve the role of eyes, mouth the role of nose, other body parts the role of head etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}