{
  "id": "topic_5478346",
  "title": "AirtelBuzz",
  "author": "AirtelBuzz",
  "created_time": "December 18, 2023, 03:44:05 AMLast edit: December 18, 2023, 04:29:24 AM by AirtelBuzz",
  "content": "First Lightning Payment Acceptance at Pingu's Burgers in Vietnam.The popularity of Bitcoin has now reached its highest level across the world.Bitcoin is legal in almost many countries and in those countries where it is legal, Bitcoin is used as payment for various things in their country.As is often the case in El Salvador we see that there they buy various things with bitcoins and pay bitcoins as payment.I saw on Twitter that after eating ice cream at a shop in El Salvador, people were paying for that ice cream with bitcoins.Similarly, today I saw people paying for burgers with bitcoins in a shop in Vietnam.A new homemade-style hamburger restaurant located in Ho Chi Minh City, Vietnam, is in the neighborhood of Thao Dien. This place is famous for their excellent food and friendly atmosphere and good service. A few days ago, the restaurant decided to accept Bitcoin as payment through the Lightning Network, even with customers choosing NeutronPay as their payment provider. If you ever visit Ho Chi Minh City, Vietnam, don't miss out on Pingu Vietnam for a juicy and delicious burger and keep some Satoshi in your Lightning Wallet.      picture from",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478346",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "December 18, 2023, 04:50:43 AM",
      "body": "This is illegal, how can they accept Bitcoin as a medium of exchange?Quote from: https://en.wikipedia.org/wiki/Legality_of_cryptocurrency_by_country_or_territory#VietnamVietnam    Legal to trade and hold / Illegal as payment toolThe State Bank of Vietnam has declared that the issuance, supply and use of bitcoin and other similar virtual currency is illegal as a mean of payment and subject to punishment ranging from 150 million to 200 million VNDEven though they're use payment provider, but it doesn't change the fact that they're actually accepting Bitcoin as payment tool regardless they convert it to local fiat etc.The government might warn or cracking down their restaurant sooner or later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}