{
  "id": "topic_5440335",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "February 18, 2023, 04:20:17 PM",
  "content": "Wow, I considered this topic interested because we should have clarity in the mist of sugar. You know sugar taste sweet but abuse of it can leads to diabetes. Cryptosystem is wide spread sugar that has good and bad effect, but how you approach it matters a lot.Bitcoin in particular has put so many smiles and tears in the faces of so many people, to some is a loss investment, to some a great investment project, to some regrettable moment, to some most serene project.From my little experience, knowledge, news and learning cryptosystem has it own advantage and disadvantages, we will be looking at them below:Advantages of Cryptocurrency;*it gives you choice* it gives you money* it gives you knowledge of trading* it gives you risks management attitude* exposure, links you to the worldDisadvantages;* it can be time consuming* the losses are irreversible* it prone to scammers* its discouraged seeking further career* it can cause shocks and death",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440335",
  "comments": [
    {
      "author": "UchihaSarada",
      "created_time": "February 18, 2023, 04:49:01 PM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PMAdvantages of Cryptocurrency;*it gives you choiceChoice to take risk, be degen and have loss.Quote* it gives you moneyNone of them give you money. You have to work, get money and use money to buy them. If you buy Bitcoin, you gain. If you buy altcoins, you lose.Quote* it gives you knowledge of tradingKnowledge must be learned from trading books, courses, not from cryptocurrencies.Awesome crypto trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "February 18, 2023, 05:04:39 PM",
      "body": "Any thing can be time consuming.  Any thing can be prone to scammers.  It can cause shock and death if you are not responsible and put in more than you can afford.  Losses are reversible if you have the right investment and do not exit desperately out of panic.If you think these are the disadvantages.  You are probably investing in the wrong things or read too much news about hacks and scams.  If you invest in Bitcoin, hold on to your investment and keep your Coins stored safe, there is no time to waste, no scam to be a victim of, no death, no loss and after only a few market cycles the only shock you will have is how much purchasing power you have earned.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blisszi",
      "created_time": "February 18, 2023, 06:18:34 PM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PMWow, I considered this topic interested because we should have clarity in the mist of sugar. You know sugar taste sweet but abuse of it can leads to diabetes. Cryptosystem is wide spread sugar that has good and bad effect, but how you approach it matters a lot.Bitcoin in particular has put so many smiles and tears in the faces of so many people, to some is a loss investment, to some a great investment project, to some regrettable moment, to some most serene project.From my little experience, knowledge, news and learning cryptosystem has it own advantage and disadvantages, we will be looking at them below:Advantages of Cryptocurrency;*it gives you choice* it gives you money* it gives you knowledge of trading* it gives you risks management attitude* exposure, links you to the worldDisadvantages;* it can be time consuming* the losses are irreversible* it prone to scammers* its discouraged seeking further career* it can cause shocks and deathAnything pertain of life has its own bad and good side, people may have experience worst aspects of trading experience does not make bitcoin of disadvantage except for those who wants quick profit or even trying to cheat the system. Bitcoin project is not buying and selling products of quick returns, is long term with proper understand and patients.Scammers are in every business, not really the business itself but the people involved. Bitcoin is not a scam project, only if you involved with wrong people",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "February 18, 2023, 08:11:16 PM",
      "body": "One of the disadvantages of investing on cryptocurrency is that it causes a high blood pressure to some people who have invested their entire life savings into crypto, thais is one of the reason we make it plain and clear that no one should ever use his entire capital or money on crypto investment, some shitcoins ended up looting away the entire investment from it investors without prior notice and people were left with no choice than to develop heart attacks, high blood pressure, or even sudden death as a result  of this huge lost at once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "February 18, 2023, 08:57:34 PM",
      "body": "With the so much advantages that Crypto-currency has its funny those are the once you choose to give out. Come to think of it Crypto-currency doesn’t actually give anyone the knowledge of trading you need to actually have that knowledge already by yourself.One of the biggest Crypto-currency advantage is the simplicity it brings to the financial system where you can make transactions snappy, secured and have no government interference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "February 18, 2023, 11:17:01 PM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PM* it can be time consumingCryptocurrency is not time consuming, I don't really know why you said it's time consuming, you can be anywhere and you will still be trading, to buy a coin or to sell a coin those not really take any time, so I don't know why you think cryptocurrency is time consuming if you can explain. Quote from: JamesBorn on February 18, 2023, 04:20:17 PM* it can cause shocks and deathHow those cryptocurrency causes shock and death? When investing in Cryptocurrency, don't take loan to invest and also always invest any amount you can afford to lose, don't invest all your money, if you invest any amount that won't really affect you when you lose it, how is it going to cause shock and death?I don't believe most of the disadvantages you mentioned above, most of then are not really valid, but I will be glad if you can explain more better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zorigi",
      "created_time": "February 18, 2023, 11:32:47 PM",
      "body": "in the crypto world there are indeed many surprises because if we are involved in the crypto world, there must be a risk of profit and loss,that's why if we dive into the world of cryptocurrency, we must have basic knowledge first, so we can control our emotions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "February 19, 2023, 07:09:16 AM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PMDisadvantages;* it can be time consuming* the losses are irreversible* it prone to scammers* its discouraged seeking further career* it can cause shocks and deathAlmost all of these disadvantages are possible in any business not only in Cryptocurrency trading or investment.I don't agree with you that cryptocurrency is time-consuming because someone needs to take his time on whatsoever he/she wants to do just to get it right, some people take years planning the type of business they will venture into is that also time-consuming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 19, 2023, 07:29:58 AM",
      "body": "I can see the advantage of cryptocurrency as less hassle and very convenient to do some transactions. Not on everything but probably makes the hard process easier.Also you could learn some ways on how to earn online, and manage your skills on doing trading. Many ways on how to benefit on cryptocurrency like savings or foing staking that gives you higher % than banks.What I dont like are the growing pain the in ass of scammers which literally abusing the wonderful effect on blockchain just to earn money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "February 19, 2023, 07:51:53 AM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PMDisadvantages;* it can be time consuming* the losses are irreversible* it prone to scammers* its discouraged seeking further career* it can cause shocks and deathIf you have stayed in the bank from morning till night because of a single transaction, you will know that cryptocurrencies transaction is not time consuming. To open an a bank account, you will need to fill different forms and go through many processes. It is true that cryptocurrency transactions are irreversible, that is why we need to check and recheck before we click the send button. We should be extra careful before we carryout any transaction.Banks are more prone to scams and attack than bitcoin. All we need to do is to used decentralized wallets and never keep your funds in exchanges because they are prone to attack of hackers and government.I don't see how the cryptocurrency sector discourages people to seek opportunities in other areas. Most people in this sector use the cryptocurrency sector as a side hustle or part-time job. Apart from Bitcointalk I am not engaged in any other platform. If I can invest in the sector, hold my coins and sell them when the price goes high, then I am okay. I don't need to spend all my time in the sector. And it is also good to diversify your income source.Please always invest what you can afford to loose. Don't borrow to invest in Bitcoin and don't put all your funds in Bitcoin because the sector is also unpredictable. Investors must also understand that losing funds is not the end of the world. As long as there is life, there is hope and more opportunities will also come..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 19, 2023, 11:45:06 AM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PMDisadvantages;* it can be time consuming* its discouraged seeking further career If by time consuming you mean the transaction period it takes to complete the transactions then I would tell tell you that there are method to fasten the transaction. There is a replace by fee method which is supported by some wallets or the double spending method. In each method you just need to increase the network fee higher for faster confirmation. This gives you the ability to control your transaction time and not the local fiat banks where you need to wait for the banks. Cryptocurrency actually encourages diversification because people from other professions could easily venture into cryptocurrency and blockchain technology, and still keep practicing their other profession. Those who stick only to cryptocurrency trading only are even prone to make bad/panic investments since they relay on its profits only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "February 19, 2023, 02:18:16 PM",
      "body": "Almost investment kinds have each side from advantage and disadvantage exactly in cryptocurrency, have mistake mindset when some one investing in cryptocurrency know with advantage only and have mindset easy to earn profit soon. There are less mindset possibility losing investment in cryptocurrency when wrong time or wrong altcoin kinds for investing.When have much experienced I think every one will face advantage only by investing in cryptocurrency because they have managed well with losing or mistake about investment kinds and right moment for entrying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "February 19, 2023, 04:48:01 PM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PM...Disadvantages;* it can be time consuming* the losses are irreversiblebeing in cryptocurrency (as a trader - developer or otherwise) is not time-consuming, rather cryptocurrencies open up new opportunities for anyone. besides that losses anywhere (not only in cryptocurrency) are things that cannot be irreversible, so what you say here is not correct.Quote from: JamesBorn on February 18, 2023, 04:20:17 PM* it prone to scammersscammers are not only in cryptocurrency, scammers have been in this world for a long time even long before cryptocurrency, it was just the trick - the era and also the targets were different.Quote from: JamesBorn on February 18, 2023, 04:20:17 PM* its discouraged seeking further career* it can cause shocks and deathdiscouraged seeking a further career? If you've heard the story of CZ (founder of Binance) then you wouldn't have thought he'd come this far and so far I have never heard of someone who died or committed suicide because of cryptocurrency but because of bank loans (non-payment of debt) I have heard a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "February 19, 2023, 05:23:48 PM",
      "body": "Well, every one is entitled to their own opinions about cryptocurrency and while the op mentioned some advantages, I'd like to also note that these cryptos have granted a sort of freedom from central banks as one can conduct transactions without it being monitored and transaction fees are low they can be ignored. Also, crypto transactions can be done night or day and no limit to withdrawals or purchases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "February 19, 2023, 05:31:19 PM",
      "body": "Quote from: JamesBorn on February 18, 2023, 04:20:17 PMFrom my little experience, knowledge, news and learning cryptosystem has it own advantage and disadvantages, we will be looking at them below:Advantages of Cryptocurrency;*it gives you choice* it gives you money* it gives you knowledge of trading* it gives you risks management attitude* exposure, links you to the worldDisadvantages;* it can be time consuming* the losses are irreversible* it prone to scammers* its discouraged seeking further career* it can cause shocks and deathThankfully your experience isn't advance yet because it would had been shocking that with your advance experience and you're coming up with this poorly structured points of yours. Yes cryptocurency gives you choice since it offers a different kind of investment opportunity different from the traditional investment vehicles we know but cryptocurrency doesn't automatically gives you money. You have to know how to take advantage of the opportunity here and have the capital before you'll be able to make money from the industry. No the industry doesn't give you knowledge on trading although it could motivate you to learn since trading has been made very easy with the introduction of the cryptocurrency industry. Basically most of your advantages are what been engaged in the industry can motivate you to do.As for the disadvantage, the industry is even less time consuming compared to other financial markets and I doubt how your involvement in the industry will hinder your educational career instead it could motivate you into picking interest in other careers related to the industry. Everything can cause shock or death so I don't see that as a disadvantage to the industry. Using general disadvantages of life that has nothing to do with the industry directly doesn't qualify to be a disadvantage to the industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "February 19, 2023, 05:44:58 PM",
      "body": "- It is not time-consuming if people would just HODL their bitcoins for the long term. - All losses are irreversible either in betting or trading. All l losses are irreversible either in investing in stocks, bonds, and establishing businesses.- There are more scammers in the old fiat system than in decentralized cryptocurrencies.- Some people are discouraged upon hearing big names telling us to avoid cryptocurrencies.- People are shocked and are dying of any causes. Is there a high chance of dying when you are a crypto believer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "February 19, 2023, 05:46:07 PM",
      "body": "Crypto doesn't give knowledge, it's not a knowledge ORB sent down from heaven, everything about Crypto must be acquired through learning only, this is the only way to know how to manage risk and make money out of your investments. * Is there any money making ways that's not time-consuming? Every human in the world will be rich if it's easy to make money.* Once you lose your key or fall victim to scam traps your fund is gone forever, but you can still make back all you've lost, I fell for scam years ago and I lost all my ETH but as time goes on I earned more than I've lost. * You are right about how easy it is to lose your private key to scammers, but it still all comes down to your knowledge, learning is the most important part of cryptocurrencies, you need to know how to keep your private keys safe or just buy a hardware wallet instead. * Crypto doesn't stop anyone from furthering their career, this is a wrongful thought, I have my own business, and I'm into crypto investment too, I do trading twice a week and I take my business very seriously. * Crypto investment can only cause shock and death if you invest all your life savings, investing money in crypto is very risky because of the volatility aspect, a smart investor only invest with what they are ready to lose, if you lose five percent of all the money you have in this life to crypto it won't kill you, because you still have 95% left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "February 19, 2023, 06:47:06 PM",
      "body": "It cannot be time consuming when you are doing a proper research.With proper research you can avoid Scam coins.In Crypto you can gain and lose both are reversible, but there are higher chances of gaining when you focus on what works for you best.The reason why one is advice to invest what they can only afford to lose is to avoid Mental unrest which may lead to death or any other health issues.Cryptocurrency has some advantage and disadvantage but your point are not properly statedSome Advantages are :1 Transaction Speed2 Transaction Fee3 Privacy and Security 4  Accessible to allSome Disadvantage are:1 Volatility2 Lost Wallet Pass key cannot be retrieve3 Crypto Exchange security4 Retrieval of stolen coin is hard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "February 19, 2023, 07:07:15 PM",
      "body": "Quote from: Doan9269 on February 18, 2023, 08:11:16 PMOne of the disadvantages of investing on cryptocurrency is that it causes a high blood pressure to some people who have invested their entire life savings into crypto, thais is one of the reason we make it plain and clear that no one should ever use his entire capital or money on crypto investment, some shitcoins ended up looting away the entire investment from it investors without prior notice and people were left with no choice than to develop heart attacks, high blood pressure, or even sudden death as a result  of this huge lost at once. A person with zero/low knowledge about investment or the thing they are investing will be more likely to fail in the end and it's their fault for not doing their own research. Investment is different from gambling and these people who failed are probably gambling because they risk everything hoping it will change their future but unfortunately, only few people was lucky enough to surpassed this.There's a lot of pros and cons of investment especially in cryptocurrency since it's too volatile it's hard to predict the price but one thing I'm certain is that once it's bull run it's time for a profit and bear market is for accumulation period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}