{
  "id": "topic_5437760",
  "title": "trustcoinom",
  "author": "trustcoinom",
  "created_time": "February 02, 2023, 11:33:32 AM",
  "content": "Website | Instagram | Twitter | Discord | Telegram Group | Telegram Channel | Medium | YouTube | Facebook Welcome to WEB3 TASK Official AnnouncementIntroductionWeb3 Task is a crypto-based freelance marketplace exclusively for web 3.0 services. This marketplace helps freelancers and employers make deals with crypto payments. We will solve the current transaction problem between a buyer and a freelancer on a traditional marketplace. Web3 Task supports a range of popular tokens on Ethereum and BNB Chain, including W3T, providing fast, efficient settlement between customers and freelancers anywhere in the world. Customers and freelancers will get a lot of extra benefits when they make a deal with W3T. The extra benefits that customers and freelancers get with W3T include lower transaction fees, faster settlements, and more security. Web3 Task will also work on adding new features to the platform that will make it even more convenient and user-friendly for both parties. With all these advantages, there's no doubt that using Web3 Task is the best way to go for anyone looking to hire or be hired for web 3.0 services.The ProblemThe main problem with traditional marketplaces is that the marketplaces deduct high commissions from the money earned by the sellers. In some cases, this commission fee is 15-25%. Another major problem is the scarcity of payment gateways for buyers and sellers. In most cases, there are 1-3 payment gateways in the marketplaces to withdraw the money earned by the seller, and those gateways are not supported all over the world. Popular traditional marketplaces do not support crypto payment yet, but as you know, crypto is now a very popular medium of transaction. And they are the marketplace for all kinds of services.The SolutionWeb3 Task will take a 0% fee from the buyer and seller when they make a deal through W3T. In addition, when they use other payment methods, they will pay a very low fee of up to 5%. This marketplace will have the facility to pay in many more crypto and fiat currencies, including W3T. Since W3T is a cryptocurrency and will be listed on decentralized and centralized exchanges, people in any country can easily access this marketplace through W3T transactions. The low fees and easy access to the marketplace make W3T an attractive option for buyers and sellers looking for a safe and convenient way to make deals.BenefitsThe Web3 Task marketplace and W3T Token will come with a lot of benefits for outsourcing buyers, freelancers, and community members, including passive income scope. For buyers, the marketplace will provide a convenient and cost-effective way to source quality freelancers for their projects. For freelancers, the marketplace will offer a range of interesting and challenging tasks to choose from, as well as the opportunity to earn passive income through the W3T Token. For community members, the marketplace will provide a valuable service that can help to grow and sustain the Web3 ecosystem.W3T Token DetailsToken Smart Contract: 0x10D50141BB3c5A6074b9eE424C225951bb51065ERoadmap Website | Instagram | Twitter | Discord | Telegram Group | Telegram Channel | Medium | YouTube | Facebook",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437760",
  "comments": [
    {
      "author": "trustcoinom",
      "created_time": "February 02, 2023, 11:54:55 AM",
      "body": "Project Bounty Coming soon!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}