{
  "id": "topic_5461967",
  "title": "teoliya33",
  "author": "teoliya33",
  "created_time": "August 03, 2023, 04:26:24 PM",
  "content": "Hello everybodyi have some questions i hope someone can help1- Is wallet have to do something with transaction speed? i have a trust wallet ( but in another topic that i open, someone says that I can pick a high fee to make it fast but there isn't ) 2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell me3 - what is the best wallet for Bitcoini hope you find this topic useful and gain some knowledge from the experts here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461967",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "August 03, 2023, 04:29:26 PM",
      "body": "1. No. It doesn't matter which non-custodial wallet you're using. The speed will depend on the mempool state and the fees you pay[1].And yes, you should be able to increase the fees when using Trustwallet as explained here[2]2. Not really, no. Not in a decentralized way like you would see with ETH or some other coins anyway. I can't vouch for any services, but if you were to use a legitimate service that offers these services, you would still be giving them full control over your funds, which is not something you should be doing.3. If we're talking about security, then (open source) hardware wallets would be the best choice.[1] https://mempool.space/ [2] https://community.trustwallet.com/t/how-to-change-the-btc-network-fee/67205",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 03, 2023, 04:31:48 PM",
      "body": "Wallet has nothing to do with transaction speed. The fee paid and the mempool congestion will determine how fast your transaction would be. Trustwallet is close source. Use open source wallet for bitcoin. There is no bitcoin staking. The ones you see like wBTC and others are not bitcoin but pegged with bitcoin.For multicoins with bitcoin, use Unstoppable wallet.The best wallet for bitcoin are Electrum, Sparrow, Bluewallet, Bitcoin Core, Specter, Samourai...Hardware wallet like Passport or Trezor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 03, 2023, 04:47:27 PM",
      "body": "Quote from: teoliya33 on August 03, 2023, 04:26:24 PM1- Is wallet have to do something with transaction speed? i have a trust wallet ( but in another topic that i open, someone says that I can pick a high fee to make it fast but there isn't ) No, but you can use electrum wallet, it support the RBF function whereby you can adjust your transaction fee, pump it to speed up the confirmation time, bit know that you have higher transaction fee rate in doing that except on occassions when the mempool is less busy, you can as well always check mempool.space for more information, you can also use the mining pool to boost up your transaction confirmation time.Trust wallet is not a cold storage which is completely decentralized, you may not have the opportunity to adjust your transaction fee with trust wallet.Quote from: teoliya33 on August 03, 2023, 04:26:24 PM2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell meMaybe you're referring to bitcoin trading here?Naturally nothing like bitcoin staking on bitcoin network if am not mistaking, but some exchanges or crypto organizations make provisions for that in their own context at your own risk.Quote from: teoliya33 on August 03, 2023, 04:26:24 PM3 - what is the best wallet for Bitcoinbitcoincorehttps://bitcoin.org/en/bitcoin-core/Passport ElectrumSparrow BluewalletOpen Source Hardware Walletshttps://bitcointalk.org/index.php?topic=5288971.0 you can choose from the ones that supports bitcoin only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "August 03, 2023, 04:57:31 PM",
      "body": "The transaction speed is dependent on the network congestion and what's the fees going on at that time.So if you set it to priority basis like in Mycelium wallet or any other it will be confirmed fast but you can always check what's the average fees going on to set it according to your fees.Most wallets support RBF so that it doesn't remain in memepool and can make changes in fees to confirm it.But in all cases wallets don't have any role in confirming it fast or slow.Staking platforms as you expect them are scam just setup with lucrative offers so you should avoid them completely.You have many choices like Electrum which is good choice and non custodial wallet which keeps your keys safe with you.Quote from: _act_ on August 03, 2023, 04:31:48 PMHardware wallet like Passport or Trezor.Ledger has lost significant share after their announcement after sharing this news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "August 03, 2023, 05:03:45 PM",
      "body": "Quote from: Dunamisx on August 03, 2023, 04:47:27 PMTrust wallet is not a cold storage which is completely decentralized, you may not have the opportunity to adjust your transaction fee with trust wallet.Cold storage or hot wallets has nothing to do with adjusting your transaction fee, Electrum is also a hot wallet but you can adjust your transaction fee in Electrum, just the way you can do so in trust wallet as shared above by OmegaStarScream. The thing is, trust wallet is closed source, thus it is not a good choice of Bitcoin wallet because their code cannot be verified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 03, 2023, 05:04:07 PM",
      "body": "Many people have already answered your questions so here is my version. 1. Wallets do not have something to do with transaction speed instead its the features that a wallet provide. For example in your scenario if you are using Trustwallet to send BTC then the transaction fee will be selected automatically lets say its 2$ but after sometime a person made another transaction and his transaction fee is $5 so the blockchain processing the transaction will make that higher fee transaction a top priority and will put your transaction at the bottom of the list. Which means your transaction will be getting late and late. So, if you would use a BTC wallet like Electrum Where you could manually increase the transaction fee to increase the priority level of your transaction to make it faster. But the drawback is you have to pay more for your transaction. 2. No, BTC has no staking feature. Why? Because BTC based on Proof of Work (POW) mechanism and for staking purpose the token must be based on Proof Of Staking (POS) mechanism. 3. There are two types of Wallets Custodial and Non Custodial and there are also two forms of wallets Soft (Hot) wallet or Hardware wallets (Cold). For BTC the best is Electrum as it has the RBF (manual fee feature) in Hot wallets and in Cold wallets i prefer you to not to use Ledger other than that you could use Trezor etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "August 03, 2023, 05:04:43 PM",
      "body": "1. The last I used trust wallet, I didn't check the bump fee because the transaction fee was already high so the transaction was very fast.2. You can use bitcoin to stake if the gambling website is accepting bitcoin. But ordinarily, bitcoin itself can't be used to stake.3. You ask the best wallet and not wallets so I am also using the singular form. The best wallet for bitcoin is Electrum wallet which answered your first question. You can bump you transaction fee in the Electrum wallet to make it faster to confirm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "August 03, 2023, 05:16:51 PM",
      "body": "Since everything has been answered above, I will only try to add a few words so you understand what you are talking about.Quote from: teoliya33 on August 03, 2023, 04:26:24 PM2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell meThere are two terms you should know. Proof of work and Proof of stake. In PoW, you don't need to hold any coins, instead setting up a device that will work for getting the next block and eventually getting you block reward.In PoS, you have to hold some coins in your wallet and keep your wallet online (allow staking). If your coin's weight is high enough (considering the total network weight), you will get a block and eventually getting block reward.BTC is a PoW coin so, no, there's no staking option there. Then what are those staking we see? It's the same as banks holding your money, using them for their profit, and promising to pay you interest. It is worth noticing that bank promise, they don't guarantee. They may fail to pay you the principle amount even.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "August 03, 2023, 05:45:14 PM",
      "body": "Quote from: teoliya33 on August 03, 2023, 04:26:24 PMHello everybodyi have some questions i hope someone can help1- Is wallet have to do something with transaction speed? i have a trust wallet ( but in another topic that i open, someone says that I can pick a high fee to make it fast but there isn't ) 2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell me3 - what is the best wallet for Bitcoini hope you find this topic useful and gain some knowledge from the experts hereNo, the wallet doesnt really have a thing to do with the transaction speed, the transaction speed would just depend on the network you're going to use, It would depend on the cryptocurrency and its network. Like for example on Bitcoin there are some networks that you could use like lightning network or just the normal Bitcoin network. The speed of the transaction would depend on how congested the network of Bitcoin is, you could see that on the mempool since there are only 7 transactions the Bitcoin can process per second the network can be congested if there are so many people want to make a transaction and that is where the transaction fee is going to matter since if you have high transaction fee your transaction is going to be processed first in the network.Bitcoin staking? I mean there are a lot of platforms or exchange that offer interest if you're going to stake your Bitcoin on their platform it wasn't really a good amount of interest but it was way higher than the banks is offering. probably up to 10% depending on the platform.The best wallet that I use is Electrum since it was software I can easily access on my computer it's convenient, open source, and decentralized. It wasn't the best wallet that's for sure but wasn't bad at all, its better than putting your cryptocurrency or investment on a centralized platform or exchange like for example Binance even though it was a popular platform you doesnt have any control on your Bitcoin at any moment they could easily freeze or lock your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 03, 2023, 05:55:34 PM",
      "body": "One small misconception, many are saying that the speed of the transaction depends on the transaction fees but it actually depends on the ferrate;• The fee is the flat amount you pay to have the transaction confirmed. For example someone paying $1.5 to confirm their transaction.• The feerate is the fee paid in relation to the transaction size. So someone paying $1.50 for a large transaction is paying a smaller feerate than someone paying the same amount for a much smaller transaction and the latter transaction will be confirmed faster.You should also note that trust wallet is a closed source wallet and is not recommended. You should opt for an open source, reputable and non custodian wallet like Electrum or Passport if you're looking to use a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "August 03, 2023, 06:00:02 PM",
      "body": "Quote from: teoliya33 on August 03, 2023, 04:26:24 PMHello everybodyi have some questions i hope someone can help1- Is wallet have to do something with transaction speed? i have a trust wallet ( but in another topic that i open, someone says that I can pick a high fee to make it fast but there isn't ) 2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell me3 - what is the best wallet for Bitcoini hope you find this topic useful and gain some knowledge from the experts here1. AFAIK, most wallets have a way to adjust the fees so if a wallet doesn't allow to adjust the fee then that will affect the speed of your transaction. We don't want our txs to get stuck so use wallets that allows you to adjust fees.2. Don't get into it, you knew it that they're likely a scam. Bitcoin is a POW and not a POS.3. Electrum if you don't have an hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 03, 2023, 08:11:40 PM",
      "body": "Quote from: boyptc on August 03, 2023, 06:00:02 PM1. AFAIK, most wallets have a way to adjust the fees so if a wallet doesn't allow to adjust the fee then that will affect the speed of your transaction. We don't want our txs to get stuck so use wallets that allows you to adjust fees.Wallets may not estimate the fee correctly, it is good to use the mempool to check the fee. https://mempool.space is an example.Quote from: boyptc on August 03, 2023, 06:00:02 PM3. Electrum if you don't have an hardware wallet.Electrum as an online wallet for low amount of bitcoin. If you want to use Electrum for more amount, use it on an airgapped devicehttps://electrum.readthedocs.io/en/latest/coldstorage.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "August 03, 2023, 09:55:22 PM",
      "body": "Wallets are more or less like bags for safe keeping - depending on how long you wanna HODL. They don't guarantee rapid transactions... But in this case, the LIGHTNING NETWORK comes into play  Lastly, you haven't specified your utility measures and as long as that is unclear, peeps will only make Thier suggestions on how best they understand - cold wallets are the best for long term HODL. I can see above that you mentioned TW already Which is a hot wallet and can - at some point - endanger your coins if privacy policies are not prioritized.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 04, 2023, 03:31:02 AM",
      "body": "Quote from: OmegaStarScream on August 03, 2023, 04:29:26 PM3. If we're talking about security, then (open source) hardware wallets would be the best choice.[LIST] Open Source Hardware Wallets. Open source hardware wallets are best choices if having enough money to buy one to use.If does not have enough money, we can use open source wallets like Bitcoin Core or Electrum wallets. If we don't have enough disk space for Bitcoin full node or prune node, we can use Electrum wallet and can set up different wallet types: Single signature wallet, multi signature wallet or cold wallet.Creating a cold storage wallet in ElectrumCreating a multisig wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "August 04, 2023, 04:54:46 AM",
      "body": "1. There's no relation between wallet and the transaction speed, but choosing a good wallet which wouldn't charge you additional fee and given you a choice to bump your fee are indirectly affect the transaction speed.2. Bitcoin is POW coin, not POS. There are many sites offer staking option for Bitcoin, but it's scam.3. Bitcoin Core, Electrum or Bluewallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "August 04, 2023, 05:04:47 AM",
      "body": "Quote from: teoliya33 on August 03, 2023, 04:26:24 PM2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell meYou can not stake your bitcoin because Bitcoin is a Proof of Work coin. It is not a Proof of Stake coin so staking is impossible on Bitcoin blockchain.Proof of Stake blockchains work with validators and stakers and different than Bitcoin blockchain with nodes and miners.Strong warning that you must be well informed that there are Wrapped Bitcoin tokens on other blockchains like Ethereum, Binance Smart Chain, Solana and more chains but they are not bitcoin. They are tokens on those altcoin blockchains which are centralized and staking is possible with those chains.However, it's big risk with centralized blockchains and those Wrapped tokens can be de-pegged too. You don't have bitcoin by buying those Wrapped Bitcoin tokens so staking rewards from those tokens will not worth anything if those tokens depeg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "August 04, 2023, 06:33:14 AM",
      "body": "The speed of transaction actually depends on the Blockchain on which you are dealing with, sending or receiving a transaction. According to the data on this website (https://bitpowr.com/blog/blockchains-with-the-highest-transaction-speeds), Solana is the fastest with a transaction speed of 3,000 TPS though it can process up to 24,000 transactions per second.TPS = Transactions per Second",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 04, 2023, 08:14:33 AM",
      "body": "Quote from: Sandra_hakeem on August 03, 2023, 09:55:22 PMWallets are more or less like bags for safe keeping - depending on how long you wanna HODL. They don't guarantee rapid transactions... But in this case, the LIGHTNING NETWORK comes into play  Bitcoin network is not that slow if you pay good fee. The network is not congested and transactions can be confirmed even with low fee. 7 to 10 sat/vbytes transactions are getting confirmed daily. But the use of lightning network makes transaction faster. I agree with that. Quote from: ImThour on August 04, 2023, 06:33:14 AMThe speed of transaction actually depends on the Blockchain on which you are dealing with, sending or receiving a transaction. According to the data on this website (https://bitpowr.com/blog/blockchains-with-the-highest-transaction-speeds), Solana is the fastest with a transaction speed of 3,000 TPS though it can process up to 24,000 transactions per second.Did you know that this thread is about bitcoin not solana or any other altcoin? It is good for you to know that bitcoin lightning network transaction is very fast.If comparing other altcoins with solana, there are many other coins that their transactions are almost instantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Good_Doctor",
      "created_time": "August 04, 2023, 09:10:03 AM",
      "body": "Quote from: teoliya33 on August 03, 2023, 04:26:24 PM2 - is their BTC staking? i saw some website offering that but mostly are scam so i prefer someone from here tell meThere're existing Bitcoin block delegators and hash power boosters perhaps that's what you are thinking is staking of BitcoinYou can check this out to see what I mean about bitcoin block delegation stake.coredao.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}