{
  "id": "topic_5477382",
  "title": "adaseb",
  "author": "adaseb",
  "created_time": "December 11, 2023, 04:14:39 AM",
  "content": "So one reliable indicator is when the Coinbase app is #1 downloaded app on the App Store.It has very reliability predicted pretty much the 2 tops in 2021 and the top in 2017.So on Dec 8th 2017, Coinbase app was #1 on the App Store, about a week before bitcoin topped.In early May 2021, it topped #1 and Bitcoin already topped $65K about 2 weeks prior.Then in late October 2021, it became #1 and basically 2 weeks later Bitcoin topped.It follows the consensus that when too many retail pile into Bitcoin, it means the smart money is getting out.Currently Coinbase is ranked as 20 in the Finance category but it’s gaining rank, very rapidly. Something to watch out for.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477382",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "December 11, 2023, 06:58:41 AM",
      "body": "Great find. Definitely a good indicator to estimate who is on the buying side and who is selling. The only question is whether it will still be effective in 2023 after you can now use Robinhood and Revolut for crypto purchases, but definitely when Coinbase is in the top 5, it is worth looking for profit taking levels. Thanks for a new good bull market top indicator next to google trends, spam of newbie threads on bitcointak \"what coin to buy below 1$\" and jim cramer screaming \"buy buy buy\".Do you have access to historical coinbase ranking data in the app store? where do you check it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 11, 2023, 07:23:09 AM",
      "body": "Indicators like that serve as a reference until they stop working. Just because it has happened twice does not mean that it will happen indefinitely in the future. There will be a time when for people having the Coinbase app will be like having a bank app on their phone, and they won't need to download it. Maybe it will even come installed by default in the future when you buy a new phone. So I give it limited importance as an indicator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 11, 2023, 08:17:59 AM",
      "body": "To call an indicator reliable, I think we have to subject this observation to many tests, as the dates you mentioned are biased, and if they give an indicator, they are an indicator of the desire of buying bitcoin, which is a strong indicator of selling.If Coinbase announces that it will launch an airdrop or that it will give everyone who downloads the application $10, I expect that there will be millions of downloads without these downloads affecting the price of Bitcoin.This is a chart of app downloads for about two years, and it is far from being similar to Bitcoin's chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 11, 2023, 09:51:57 PM",
      "body": "Quote from: Yamane_Keto on December 11, 2023, 08:17:59 AMTo call an indicator reliable, I think we have to subject this observation to many tests, as the dates you mentioned are biased, and if they give an indicator, they are an indicator of the desire of buying bitcoin, which is a strong indicator of selling.If Coinbase announces that it will launch an airdrop or that it will give everyone who downloads the application $10, I expect that there will be millions of downloads without these downloads affecting the price of Bitcoin.This is a chart of app downloads for about two years, and it is far from being similar to Bitcoin's chart.The chart you posted is delayed by almost 4 quarters. The latest is 23Q1 which is pretty much a year ago. From what I understand the rank went up from I think around #300 to #30 or so for Coinbase in the last couple of weeks, so there is obviously some type of effect. Go to the Coinbase reddit and you can see almost everyday there are almost 100 new topics created. Currently about 500 people are browsing that reddit alone. Seems that they will need to hire more personnel to handle all this retail load. Sure there is also Robinhood but that also existed in 2021 and Coinbase still was #1 app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "December 12, 2023, 06:37:08 AM",
      "body": "Yes I do agree with you about that. When we see a crypto app like Coinbase with the high ranking it does mean to me that there is people buying crypto. This means the crypto app is higher then some popular social media apps like Instagram, Facebook, and Tiktok. I do think it is a 'bullish' sentiment when this does happen. I do think when we see the next ath the Coinbase app will rank much higher again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 12, 2023, 01:24:57 PM",
      "body": "Quote from: adaseb on December 11, 2023, 09:51:57 PMQuote from: Yamane_Keto on December 11, 2023, 08:17:59 AMTo call an indicator reliable, I think we have to subject this observation to many tests, as the dates you mentioned are biased, and if they give an Go to the Coinbase reddit and you can see almost everyday there are almost 100 new topics created. Currently about 500 people are browsing that reddit alone. Seems that they will need to hire more personnel to handle all this retail load. Sure there is also Robinhood but that also existed in 2021 and Coinbase still was #1 app.What I tried to say is that relying on download numbers as an indicator for predicting the price will give inaccurate results due to the ease of influencing the download numbers compared to the price of Bitcoin. Launching rumors such as that Coinbase will have big airdrop will make the number of downloads jumping quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 12, 2023, 03:34:00 PM",
      "body": "Quote from: adaseb on December 11, 2023, 04:14:39 AMCurrently Coinbase is ranked as 20 in the Finance category but it’s gaining rank, very rapidly. Something to watch out for.Coinbase already have this level of trust because if it's high standard reputation on global recognition, so if they even ranked it as the best of them all, it deserves it, but we can go to the other aspects of the reality in trading that indicators are only what gives us the signal to what is about to happen, but they don't have the hundred percent assurance of them happening, we can trade and still fall on losses after which we might have gone through several indicators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 12, 2023, 04:33:36 PM",
      "body": "I can agree that it makes sense for someone to consider the number of downloads as some kind of indicator that retail customers are becoming more active, but all of these people are very likely not familiar with the risks that arise from trading and storing cryptocurrencies on smartphones. If we assume that most people will keep what they buy on their \"smart devices\" and that the app doesn't have great ratings (at least when it comes to the Android version), it can be concluded that there will be a lot of disappointed users in one way or another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 12, 2023, 05:22:03 PM",
      "body": "I just read an article highlighting the growth of Coinbase’s app as a metric to gauge the crypto market. While seeing that more people are buying crypto isn’t a bad thing, I think we’re still a ways away from everyone having fomo and smash buying their way to a Bitcoin god candle. Seeing this much interest at this point in the cycle is positive though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "December 12, 2023, 07:21:18 PM",
      "body": "Quote from: Yamane_Keto on December 12, 2023, 01:24:57 PMWhat I tried to say is that relying on download numbers as an indicator for predicting the price will give inaccurate results due to the ease of influencing the download numbers compared to the price of Bitcoin. Launching rumors such as that Coinbase will have big airdrop will make the number of downloads jumping quickly.I have the Coinbase app downloaded on my mobile device but I rarely open it. Doing a quick search on the internet about the market is my preference. And there are others like me all over the world do the same thing too. Therefore, the number of downloads is not a strong indicator of the market. This is why I think you are correct because not just airdrops but also free NFTs minting could also cause the app download numbers to increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 12, 2023, 11:00:11 PM",
      "body": "Actually, it's a good indicator when you're gathering information for what it is going to be like when the bull run comes. If that's the peak and they have some strong numbers during those peaks during the bull run then I might take a look at it closely every time I think that we're already at the top.Quote from: OgNasty on December 12, 2023, 05:22:03 PMI just read an article highlighting the growth of Coinbase’s app as a metric to gauge the crypto market. Can you drop the link of that article? it seems that this type of sign are also getting attention from the others as well. Using the Coinbase App as the sign if we're already on high or not is very new to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "December 12, 2023, 11:14:47 PM",
      "body": "Quote from: adaseb on December 11, 2023, 04:14:39 AMSo one reliable indicator is when the Coinbase app is #1 downloaded app on the App Store.It has very reliability predicted pretty much the 2 tops in 2021 and the top in 2017.(...)Thanks. I was looking for reliable indicators of determining whether or not we're at the top (started a topic somewhere) and this one is actually pretty good. I wouldn't use it as a sole indicator, but combined with a few others, it could work pretty well.It's essentially a better version of the taxi driver rule (\"if your taxi driver starts talking about crypto - we reached the peak\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "December 12, 2023, 11:55:50 PM",
      "body": "Quote from: Don Pedro Dinero on December 11, 2023, 07:23:09 AMIndicators like that serve as a reference until they stop working. Just because it has happened twice does not mean that it will happen indefinitely in the future. There will be a time when for people having the Coinbase app will be like having a bank app on their phone, and they won't need to download it. Maybe it will even come installed by default in the future when you buy a new phone. So I give it limited importance as an indicator.But we don't live in that future, we live in the present where Bitcoin adoption is still very low, it's owned by 1-10% of the population depending on the country, and unless there will be a sudden exponential growth in adoption or Coinbase falls from grace, this could still be an indicator for a long time. You just shouldn't use it as the only indicator and instead use it together with many others to analyze this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minor Miner",
      "created_time": "December 13, 2023, 03:19:19 AM",
      "body": "Quote from: Yamane_Keto on December 12, 2023, 01:24:57 PMQuote from: adaseb on December 11, 2023, 09:51:57 PMQuote from: Yamane_Keto on December 11, 2023, 08:17:59 AMTo call an indicator reliable, I think we have to subject this observation to many tests, as the dates you mentioned are biased, and if they give an Go to the Coinbase reddit and you can see almost everyday there are almost 100 new topics created. Currently about 500 people are browsing that reddit alone. Seems that they will need to hire more personnel to handle all this retail load. Sure there is also Robinhood but that also existed in 2021 and Coinbase still was #1 app.What I tried to say is that relying on download numbers as an indicator for predicting the price will give inaccurate results due to the ease of influencing the download numbers compared to the price of Bitcoin. Launching rumors such as that Coinbase will have big airdrop will make the number of downloads jumping quickly.But currently, coinbase has no airdrops and the number of downloads of the coinbase app is still increasing strongly. At the same time, we are experiencing extremely optimistic months about the market when bitcoin sometimes increased up to 44k$. I never knew about this before but as far as I know Coinbase has restricted users in some countries, but the number of downloads is still increasing despite the restriction. So I think that's a very important indicator that we need to pay attention to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "December 13, 2023, 04:21:21 AM",
      "body": "When there's really no one that's competing on the service that you're providing and you've got a really good advertising team behind you then it should come as no surprise that they're going to be in that position and not to mention that Coinbase is also a good app and website for all news that's cryptocurrency related. I hope that they're going to continue doing good and keep innovating as a crypto news website, that's my only wish for them since they're doing good so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "December 13, 2023, 04:46:43 PM",
      "body": "Just a thought regarding this indicator, it might not be as reliable as it was in the past for the reason of Binance losing US market as well as big chunks of Europe. Also Kraken seems to be bullied by SEC, so it looks like the Coinbase is being set to have an almost monopoly in the US.So, in theory, by taking over customers from other exchanges, and with all new people not being able to use services of any big competitor, they could achieve the #1 downloaded app long before we reach the peak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 14, 2023, 05:22:06 AM",
      "body": "From what I can tell the app wasn’t #20 last week, it was just that number in the Finance section. The overall free app section it was 300 something.Now however you would think it would be 100 or 200 but it actually fell back to #400. So according to this we are very far away from using this app as a top indicator. However things can quickly change if and when the ETF is approved and Bitcoin price goes vertical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "December 16, 2023, 11:59:29 PM",
      "body": "Great call, simple, fluctuating, reflecting wider mainstream non specific demand.  Cant be used all by itself but its so simple to check on why wouldnt we reference it in a wider judgement call.     The 2021 top was a double top with the second top failing to surpass the first, it was relatively normal indicating a possible sell from there.  The wider market also topped about there, I sold a tech fund about 1% from its top price around a similar time to BTC ATH and I was lucky to do so but a few prices topping here wasnt in isolation.  Having another simple thing to check for a top would be some use I think.  In 2013 I can remember BTC being discussed for about 20 minutes on mainstream news, that was kind of mind blowing and again that was the top then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 17, 2023, 01:56:53 AM",
      "body": "Quote from: adaseb on December 14, 2023, 05:22:06 AM However things can quickly change if and when the ETF is approved and Bitcoin price goes vertical. I read somewhere that QuitenBiz will be the broker that will provide crypto services for ETF funds, and if this is true, the art of the application will increase the probability of downloading it and the company’s share price will increase, which will give a real boost to Bitcoin. Then we can consider it a leading platform, and any changes in its growth reflect, in one way or another, changes in the price of Bitcoin. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}