{
  "id": "topic_5467540",
  "title": "Riginac111",
  "author": "Riginac111",
  "created_time": "September 21, 2023, 05:54:47 AM",
  "content": "Sometimes we are suppose to make a research before engaging in discussion properly, but I want to read and understand what is a coin and what is a token, because some of our people doesn't know and also care to read up the difference between token and a coin, because some of our people misunderstood and also contradict the difference between a token and coin, for English board many other people do same mistakes of contradictory what is a coin and token, for any discussion that relates with coin or token you will see it like say it is a token, so with this threads it will be helpful for all of us who is a newbie that is trying to know about cryptocurrency to know a cryptocurrency and it's Categories.A coin :According to my research and what I have being reading in Internet about coin, now it breaks it down that a coin is a cryptocurrency and it's independent in blockchain technology. While A token is not independent in blockchain technology, a token can say to be a digital currency that only operates in existing blockchain instead of standing out on their own, and token can stand on their  own when the project have become massive and have influence in the market and it's the time it will become a coin and it will be independent on a blockchain technology. Some people doesn't know that some of the altcoins we know now was once a token and some people wasn't aware of it, some of the tokens that later get their grand as a coin is, ethereum, BNB even tron. sources Let us be aware of coins we invest, because so many of altcoins we invest and believing that they are recognised to invest, most of them is a token that have never own it's ownership in blockchain so they liable to die young in the market of crypto as world health says smokers are liable to die young, just be aware before a token turn to a coin is hard and some of the altcoins we buy is a token, we have to  be serious for investigation of altcoins before we buy, this topic brought you the difference between a coin and a token because some people uses token as a coin which is improper, why token is not independent on its blockchain.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467540",
  "comments": [
    {
      "author": "Smartgoat",
      "created_time": "September 21, 2023, 06:27:05 AM",
      "body": "from my understand in cryptocurrency, I have never accepted the fact that a coin is a token, because I know already that a coin is supportive in Blockchain and their independent. why token is not supportive fully in a Blockchain and that is my little knowledge I can expatiate of a coin and a token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "September 21, 2023, 07:42:33 AM",
      "body": "Quote from: Riginac 111A token is not independent in blockchain technology, a token can say to be a digital currency that only operates in existing blockchain instead of standing out on their own, Normally they depends on Coins that has a blockchain to function since they don't have a blockchain,  however they can also support transaction since they are used to power Dapps(decentralized applications), specific  product by a company could be purchase using tokens if specified  and some use it as a means of payment of service  but they don't seem fruitful as they might dissappear later because those payment are inform of smart contract and are open and very transparent  . I had one last two years I was little then no experience about crypto currency  but I had the chance of a smart contract worth of $2,000 on my Atomic wallet  I waited over the years  only to find out everything  was gone lolzz. Example of tokens :- ERC-20 depends on Ethereum  block chain to function- BRC-20 uses Bitcoin blockchain ,anyone can deploy this based on nfts after  confirmation  you can mint it- BEP-20 uses Binance smart chain which is designed by smart chain itself so the token only work on the Bep 20 wallet which also support   ERC -20 tokens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 21, 2023, 09:28:05 AM",
      "body": "@Riginac111Your source link is just an online search about the difference between coins and tokens. You can correct that. Quote from: Riginac111 on September 21, 2023, 05:54:47 AMLet us be aware of coins we invest, because so many of altcoins we invest and believing that they are recognised to invest, most of them is a token that have never own it's ownership in blockchain so they liable to die young in the market of crypto as world health says smokers are liable to die young, just be aware before a token turn to a coin is hard and some of the altcoins we buy is a token, we have to  be serious for investigation of altcoins before we buy, this topic brought you the difference between a coin and a token because some people uses token as a coin which is improper, why token is not independent on its blockchain.Altcoins generally are risky. Example is the old Luna (now called Lunc), it was not a token but has its own blockchain, its all-time-high was $119, but now at $00005709. There are many coins that has its own blockchain that are now shitcoins. If you are dealing with altcoins, know that you are gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "September 21, 2023, 10:39:44 AM",
      "body": "Mate, altcoins no get guarantee o. I want make you be careful of the kind altcoin wey u wan invest in sha. Because plenty of them too dey volatile and e no get guarantee. Wetin person fit even advise you on be say make you try some of the stablecoins wey dey ground. If you search for  Which Stable coin is the Best for Investment This Year (2020). It's a 2020 thread on this forum but you can still revert to it for your solutions.Overall, try make you research on these stablecoins before you make your final decision.As for the differences. Coins dey always get them own Blockchain and you fit use them as your form of investment and other payments wey you get. Whereas, tokens are built on existing Blockchain and dem fit represent our assets and functionalities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}