{
  "id": "topic_5472865",
  "title": "CLS63",
  "author": "CLS63",
  "created_time": "November 04, 2023, 10:25:06 PM",
  "content": "Bugün Cumhuriyet Halk Partisi seçimli olağan genel kurultaya gitti açıkcası bundan 2-3 ay önce Atatürk aday olsa kazanamaz mevcut delege sistemi çok sıkıntılı deniliyordu ancak bugün yapılan ilk oylamada değişimciler olarak nitelendirilen grubun adayı Özgür Özel 682 Kılıçdaroğlu 664 oy aldı ve seçim ikinci tura kaldı.Kemal Kılıçdaroğlu bu seçimi de kaybederse tarihin gördüğü en büyük loser olacak.Kazandığı savaş yok galiba bir tek Muharrem İnce'ye karşı seçim kazandı.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472865",
  "comments": [
    {
      "author": "meser#",
      "created_time": "November 05, 2023, 12:57:57 AM",
      "body": "İstikrarlı dedemiz bu yarışı da kaybederek bizleri yine şaşırtmadı https://www.youtube.com/shorts/5GWUrCsIm_I   Zamanında bu adam kazansın diye 2 turda da toplamda 2 gün yolda geçirdim harcadığım parayı saymıyorum bile. Darısı artık kökleşmiş bir işe yaramayan siyasetçilerin başına. Gerçekten de tek düze olan bu sistem değişsin hanemize artılar yazsın eksiler değil...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "November 05, 2023, 10:28:10 AM",
      "body": "Quote from: meser# on November 05, 2023, 12:57:57 AMİstikrarlı dedemiz bu yarışı da kaybederek bizleri yine şaşırtmadı https://www.youtube.com/shorts/5GWUrCsIm_I   Zamanında bu adam kazansın diye 2 turda da toplamda 2 gün yolda geçirdim harcadığım parayı saymıyorum bile. Darısı artık kökleşmiş bir işe yaramayan siyasetçilerin başına. Gerçekten de tek düze olan bu sistem değişsin hanemize artılar yazsın eksiler değil...Kendini aday göstererek zaten kaybetmişti o seçimde de. Bu seçimde İmamoğlu aday olsaydı herhalde o da alırdı. İmamoğlu açıktan Özgür Özel’i desteklemişti. Sanırım kazanan o oldu. Kendi atadığı delegeler bile KK’yı kurtaramadı. Artık CHP için daha iyi bir dönem olmasını bekliyordum ki Özgür Özel konuşmasında Kavala’ya, Demirtaş’a selam göndererek daha şimdiden rengini belli etti. CHP başında birisinin böyle açıklamalar yapmaması gerekiyor. Böyle oy toplayamaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 05, 2023, 10:46:28 AM",
      "body": "Kemal Kılıçdaroğlu tam bir looser oldu. Bir insan her girdiği seçimi kaybeder mi? Cumhurbaşkanlığı seçimine girdin hem de çok iddialı girdi hatta RT için ortam epey olumsuz iken girdi yine kaybetti. Tamam de çekil kenara. Milletim beni istemedi gençlere yol açıyorum de çekil abi çok mu zor. Dün kaybetti ve kaybederek gitti milletin gözünde koltuk sevdalısı olarak kaldı.Değdi mi bu duruma? Bence değmedi.Yolu bahtı açık olsun. Ben iyi bir insan olarak hatırlayacağım her zaman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "November 05, 2023, 10:53:34 AM",
      "body": "Quote from: ajanwalker on November 05, 2023, 10:46:28 AMKemal Kılıçdaroğlu tam bir looser oldu. Bir insan her girdiği seçimi kaybeder mi? Cumhurbaşkanlığı seçimine girdin hem de çok iddialı girdi hatta RT için ortam epey olumsuz iken girdi yine kaybetti. Tamam de çekil kenara. Milletim beni istemedi gençlere yol açıyorum de çekil abi çok mu zor. Dün kaybetti ve kaybederek gitti milletin gözünde koltuk sevdalısı olarak kaldı.Değdi mi bu duruma? Bence değmedi.Yolu bahtı açık olsun. Ben iyi bir insan olarak hatırlayacağım her zaman.Koltuk sevdalısı olmayan siyasi mi var ülkede? Devlet bahçeli kaç yıldır MHP başında? Tayyip Erdoğan kaç yıldır akp başında? Her partide var bu ve Türkiye’de siyaset diye bir şey yok. Bizde partizanlık var siyasette ise babadan oğula geçer gibi milletvekilliği devrediliyor. Yeni birileri geliyorsa onlar da 7-8 dönem milletvekilliği yapıyor ki bu çok yanlış bir şey. Partilerin özeleştiri yaparak Türkiye’ye katkı vermek için bazı şeyleri değiştirmesi lazım. Kemal Kılıçdaroğlu’nun yapması gereken istifa ederek gitmesiydi, onu da beceremedi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 05, 2023, 12:18:57 PM",
      "body": "Sevgili Özgür Özel’e yeni görevinde başarılar dilerim, onu zor bir dönem bekliyor, 49 yaşında CHP’nin başına geçti, kimileri hülleci olacak, başkanlığı İmamoğlu’na veya başkasına bırakacak diyor ama ben inanmıyorum, parti başında başarılı bir siyaset yapmasını dilerim, chp’yi gerçekten isminde geçen gibi halkın partisi olarak yapmasını istiyorum, terör ile arasına mesafe koyarsa partiye %4-5 oy kazandırabilir bence, anti Kılıçdaroğlu durumu da artık sona eriyor,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 05, 2023, 12:36:12 PM",
      "body": "bir koltuk sevdalısıda siktir olup gitti. bu şeref yoksunlarının koltuk sevdası yüzünden mahvolduk defalarca seçim kaybetmişsin insan koltukta oturmaya utanır.Omurga önemlli bir organ. Koltuk sevdası olmasa kaç seçim önce bu düzen bitecekti. Seçim gecesi adam gibi çıkıp istifa edecekti. ettimi?AKP İLK DEFA SEÇİM KAYBETTİ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "November 05, 2023, 12:52:06 PM",
      "body": "Sonunda dede gitti ama ben bu Özgür Özel'den de bir cacık olacağını sanmıyorum.@meser# hocam da belirtmiş hala Kavala, Demirtaş peşinde koşuyorlar, valla artık soğutuyorlar partiden beni gitgide. Teröriste selam yollamak nedir şaka gibi.Bu partinin bu kafayla seçim kazanabileceğini düşünen var mı cidden, bunlar kaybetmeye mahkumlar.Yerel seçimlerden sonra bir daha oy atmayı düşünmüyorum eğer ki ciddi bir değişim olmaz ise. He başkan değişti daha nasıl bir değişim bekliyorsun diyenler olursa ilk açıklamalar ve önceki açıklamalarda adamların pek birbirinden farkı olmadığını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 05, 2023, 01:04:08 PM",
      "body": "pirrlooooo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "November 05, 2023, 05:23:17 PM",
      "body": "Kemal Kılıçdaroğlu dede kaybetmeyi kazanmak sanıyor eğer sanmasa bu kadar fazla kaybetmezdi. Türkiye hangi partide koltuk sevdası yaşamayan bir kimse yok ki tam anlamıyla partizanca hareketlerle varlıklarına devam eden partiler bunlar. Bu tarz siyasetçiler tek tek siyaset arenasından silinir giderler umarım tez zamanda gerçekten işini layıkıyla yapmak isteyenler gelsin bir an önce siyaset meydanına.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 05, 2023, 05:50:02 PM",
      "body": "Hayırlı olsun yine muhalefette kalmayı başardılar gibi geliyor bana  Ölmeden önce önce ülkeyi şöyle hakkıyla yöneten güzel bir devlet büyüğü görebilecek miyiz? acaba çok merak ediyorum. Önceki seçimlerde 4-5 ayda daha altılı masadan aday bile seçemeyenler ülke yönetecekti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "November 05, 2023, 09:58:44 PM",
      "body": "Özgür Özel çok başarılı bulduğum biri değil ama başka güçlü bir aday çıkmadığı için benim de düşündüğüm gibi değişim isteyenler Kılıçdaroğlu karşısında kim varsa ona oy verecekti öyle de oldu. CHP ve ülkemiz için hayırlısı olsun. Ana muhalefet partisinin çok daha güçlü olması gerekir ancak CHP şu an bu durumdan çok uzakta. Özgür Özel bir şeyleri değiştirebilir mi emin değilim. En büyük artısı İmamoğlu'nun desteği. Bakalım süreç bize neler gösterecek. Yerel seçimlerde sandığa gitmeyi düşünmeyenleri belki oy vermeye ikna edebilirler, tabi bunun için çıkarılacak adaylar da çok önemli. İlk yerel seçim bu kadar kısa bir sürede yapılacak olmasına rağmen yeni genel başkan için büyük bir sınav olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 06, 2023, 05:53:00 AM",
      "body": "Parti içi tüzükler bürokrasiyle boğulmuş durumda, delegelerden oy almak için binbir türlü kulis çeviriyorlar, Özgür Özel'in listesinde bulunan ve Atatürkçülükle, Türklükle, kurucu öğelerle uzaktan yakından ilgisi olmayan isimleri bu yüzden koymak zorunda kaldığını umarız, Sezgin Tanrıkulu vs gibi. Kamuoyunda büyük tepki ve alerji uyandıran, Cumhuriyetin kurucu ilkeleriyle bağdaşmayan bu ve benzeri bazı sabotör isimler CHP'den nihayet temizlenirse, o zaman parti önümüzdeki seçimlerde en avantajlı konuma gelir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "November 06, 2023, 06:07:56 AM",
      "body": "Quote from: LGD2Business on November 05, 2023, 09:58:44 PMÖzgür Özel çok başarılı bulduğum biri değil ama başka güçlü bir aday çıkmadığı için benim de düşündüğüm gibi değişim isteyenler Kılıçdaroğlu karşısında kim varsa ona oy verecekti öyle de oldu. CHP ve ülkemiz için hayırlısı olsun. Ana muhalefet partisinin çok daha güçlü olması gerekir ancak CHP şu an bu durumdan çok uzakta. Özgür Özel bir şeyleri değiştirebilir mi emin değilim. En büyük artısı İmamoğlu'nun desteği. Bakalım süreç bize neler gösterecek. Yerel seçimlerde sandığa gitmeyi düşünmeyenleri belki oy vermeye ikna edebilirler, tabi bunun için çıkarılacak adaylar da çok önemli. İlk yerel seçim bu kadar kısa bir sürede yapılacak olmasına rağmen yeni genel başkan için büyük bir sınav olacak.Recep Tayyip Erdoğan gitsin diye Kemal Kılıçdaroğlu’na oy ver, sonra Kemal Kılıçdaroğlu gitsin diye Özgür Özel’e oy ver. Kemal Kılıçdaroğlu seçimlerde fake destek almış bu belli. Gerçek bir cumhurbaşkanı adayı olarak gösterilseydi ne olursa olsun partisinde kalırdı ki Ak Partinin en kötü döneminde bile onu deviremedikleri için tek sorumlu o görüldü ama onun karşısına da Cumhuriyet ile bağlı, başlı başına Atatürkçü , partideki terör sevicileri ekarte edecek bir isimi aday gösteremediler. Gerçi bu özelliklerde partide adam kalmadı ki sağolsunlar hepsini çıkarıp yerine hep Atatürk’ten uzak kişiler getirildi. Atatürk’ü sadece pazarlık malzemesi olarak kullanıyorlar. Atatürkçü partiye oy atmış birisi olarak yönetim kadrosu beni çok rahatsız ediyor. Özgür Özel bu delegeleri bertaraf edip gerçek Atatürkçüleri partiye koyamadıkça, terör bağlarından uzak kalmadıkça değişen bir şey olmayacak maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "November 06, 2023, 10:12:49 AM",
      "body": "En azından böyle bir seçimi kaybettikten sonra Kemal Kılıçdaroğlu'nun genel başkanlık koltuğundan kalktığını ve siyasetten tasfiye edildiğini gördük.Birilerinin kaybedilen seçim sonrası bedel ödemesi gerekiyordu tarihin en önemli seçimi son seçim v.s diye kafa ütüleyeceksin sonra hiçbir şey olmamış gibi çıkıp devam edeceksin.Bu senaryo 13 yıldır uygulandı ve bu haftasonu son buldu.Özgür Özel beni heyecanlandıran bir isim değil ancak bir değişimin olması açısından bu değişikliği olumlu buluyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 06, 2023, 02:38:30 PM",
      "body": "Chp geleneklerine uygun şekilde itişmeli kakışmalı çekişmeli bir genel kurulu daha geride bırakt. Bu genel kurulun diğerlerinden en büyük farkı ise delegelerin istekleri doğrultusunda genel başkan değişikliği oldu. Bundan önceki yıllarda olduğu gibi genel başkanın başına bir iş gelmeden seçim ile değişmesi olmuştur. Keşke bu seçim için kalan iki lider adayından büyük olanı yine büyüklüğünü gösterip seçime girmeden diğeri lehine çekile bilseydi. Sanırım bunu da yine delegeler istedi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 06, 2023, 02:49:40 PMLast edit: November 06, 2023, 03:10:36 PM by Vispilio",
      "body": "Bir de bir sahne var Kemal Kılıçdaroğlu'nun eşi Özgür Özel'i yanına çağırıyor \"Bağırmanız hiç hoş olmadı\" diye bir kaç kez sitem ediyor,bunlar ailece akıl tutulması yaşıyorlar, kocası Türkiye Cumhuriyeti tarihinin uzak ara en çok kaybeden lideri ünvanına sahip, döve döve indirilmediğine şükretmesi lazım o kürsüden, böyle durumlarda partiye üye belli sayıda kişinin imzalı dilekçesi, talebi olursa olağanüstü kongreye falan gidilmesi lazım, KK'nın 15 sene önce falan indirilmesi gerekirdi, hangi güçler ve hangi yabancı istihbarat servisleri tarafından finansal ve networking yollarıyla on yıllarca desteklendi, ülkenin bekası için ilerde soruşturulması gereken konulardan...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "November 06, 2023, 04:03:48 PM",
      "body": "Quote from: CLS63 on November 04, 2023, 10:25:06 PMBugün Cumhuriyet Halk Partisi seçimli olağan genel kurultaya gitti açıkcası bundan 2-3 ay önce Atatürk aday olsa kazanamaz mevcut delege sistemi çok sıkıntılı deniliyordu ancak bugün yapılan ilk oylamada değişimciler olarak nitelendirilen grubun adayı Özgür Özel 682 Kılıçdaroğlu 664 oy aldı ve seçim ikinci tura kaldı.Kemal Kılıçdaroğlu bu seçimi de kaybederse tarihin gördüğü en büyük loser olacak.Kazandığı savaş yok galiba bir tek Muharrem İnce'ye karşı seçim kazandı.  Seçimin ilk turunu takip ettim sonra X'e farklı farklı sayılar atıldı tabi bu sayılar atılırken herkes ne olduğunu da belli etti. Aynı seçim zamanında olduğu gibi doğru sayıları verenler azınlıkta idi. Aralarında sözde çok iyi gazeteciler de var. Durum iyi netleşince sayıları düzeltip seçimin ikinci tura gideceğini yazdılar. Tabi saatler de 00:00'a geliyordu. Yeter bu kadar diyip yatmaya karar verdim. Şu seçimde bile ne kadar eksiklerinin olduğunu görmüyorlar. Söylenecek çok söz var ama söylenen sözlerin bir şeyi değiştirdiği yok. A gider B gelir köklü bir değişim olmadıkça hepsi aynı. Seçimi kaybeden siyasetçinin hatırlanacağı tek şey aday olma diyenleri dinlememesi olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin-Turkiye",
      "created_time": "November 06, 2023, 06:23:07 PM",
      "body": "Atatürk'ün kurduğu chp'nin geldiği nokta",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ILuckyGuyI",
      "created_time": "November 06, 2023, 07:38:24 PM",
      "body": "Kemal Kılıçdaroğlu'nun cumhurbaşkanlık seçimi sonrasında görevi bırakıp gitmesi lazımdı asıl zaten. Seçim sonuçları belli olduktan sonra dalga geçer gibi sırıtarak eline tutuşturulmuş kağıdı okuyup ortadan kaybolmuştu. İşte o günden sonra kendisine karşı sinir seviyem o kadar arttı ki. CHP genel başkanlığı seçimi öncesinde halkın umudu Kılıçdaroğlu falan diye slogan atanlar vardı ona da çok güldüm bu arada. Halk Kılıçdaroğlu'nun istifa etmesini istedi ama siz bilirsiniz tabi.Genel başkanlık seçimini de iyi ki kaybetti. Değişim iyidir. Tabi şöyle bir şey de var ki Özgür Özel de aslında benzer zihniyette birisi o yüzden çok büyük bir değişim beklemiyorum. Ancak en azından artık 10 seneden fazla süredir kaybeden birisini ana muhalefet partisinin başında görmeyeceğiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}