{
  "id": "topic_5402615",
  "title": "pauliesub",
  "author": "pauliesub",
  "created_time": "June 14, 2022, 07:03:46 PM",
  "content": "I hope I'm posting in a right section of board. I'm interested to partner up on what I got running. Long story short, I'm able to do money transfers that cause no chargeback or harm to receiving accounts - meaning it's possisble to maximize possible return out of each account as long it lasts. Doesn't really matter if account is freshly opened personal account or aged business one with big transaction history, I can adjust accordingly. Countries I listed in thread title, well, apart from ACH payment type of transfer (fedach,fedwire...), IBAN->EU, instant SEPA's, Revolut (both internal and to rev IBAN), iDeal (NL payment processor), direct deposits to CAD and domestic wires in AUS, I'm also able to work with some payment processors (wise,xoom) which are funded the same way: meaning no harm is caused to receiving account.What I'm looking for: serious people who are willing to form some sort of partnership that is going to last. I want ongoing transfers, hopefully I'll find here what I'm looking for. How I work? I want my part in $BTC after it's completed, received & cashed out. If you think we can work together - xmpp: claudie@jabb3r.de (msg+require auth) | wickr: claudie777@protonmail.com | mail:  CLD777@protonmail.com - Preferably contact me via wickr please.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402615",
  "comments": [
    {
      "author": "examplens",
      "created_time": "June 14, 2022, 09:21:33 PM",
      "body": "Quote from: pauliesub on June 14, 2022, 07:03:46 PMI'm able to do money transfers that cause no chargeback or harm to receiving accounts - meaning it's possisble to maximize possible return out of each account as long it lasts. I think you still need to give a slightly longer explanation of what kind of transactions this is. when you say \"as long it lasts\", it doesn’t sound to me like a scheme that is in line with the law. correct me if I am wrong.Quote from: pauliesub on June 14, 2022, 07:03:46 PMHow I work? I want my part in $BTC after it's completed, received & cashed out. You will be paid with anonymous and untraceable Bitcoin while your \"partner\" will risk his personal accounts and bear full responsibility when things stop working and go the wrong way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}