{
  "id": "topic_5522353",
  "title": "seoincorporation",
  "author": "seoincorporation",
  "created_time": "December 11, 2024, 03:30:14 AM",
  "content": "Some days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.I would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5522353",
  "comments": [
    {
      "author": "EluguHcman",
      "created_time": "December 11, 2024, 04:28:01 AM",
      "body": "Quote from: seoincorporation on December 11, 2024, 03:30:14 AMSome days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.I would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?I guess you mean something like bonuses as rewards from being an active user of Bitcoin to pay your bills or purchases, right?If such exists, I think it should be literally exercised in the countries that the government has adopted Bitcoin to leverage their economical system like the El Salvador where concerts that is connective to Bitcoin is practice without significance breaking the TOS that governs your regional with no potential threats of risks of any entity in the region that practices the use of Bitcoin for payments or exchange of goods and services.We know how attractive Bitcoin has so much been and users are mostly holding on anonymous identities for safety sake. So much I still can not find an entitlement to be able carry on this event. Perhaps... Bitcoin is a decentralized digital currency for payment alternatively also assets which does not requires marketing strategies as running personal ADs to attract clients such as the physical concepts to drag the attentions of the public.But if there means be. It should be the crypto casinos that is an entities enterprise strictly involves of cryptocurrencies to process their stakes also the exchange for randomly or constantly patronizing them as their transactions is there being sticked to Bitcoin or Cryptocurrencies.If you also mean some % returns of your expenses in a particular source of enterprise such as companies or stores that accepts Bitcoin, I will still be in doubt if it exists knowing that cryptocurrencies is volatile for them to be able to return you a specified % in a due time without affecting them (companies) profits as eventually the value of Bitcoin could fluctuates against their portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 11, 2024, 04:33:20 AM",
      "body": "This has been discussed before and it is not worth it. If you want to make money with bitcoin, buy and hold, and when it goes up you sell partially. It will easily go up more than 40% on average over the next 4 years. You can sell 15% of what it goes up in fiat and you still have 25% of accumulated profitability that will continue to compound. The downside will be the bear market year. The closest thing to what you are looking for would be a bitcoin backed loan, which you can refinance as the price goes up. But all these types of solutions involve losing control of the bitcoins with your keys, and risking losing everything to get a bit of liquidity, when bitcoin is the most profitable asset in the world doesn't make much sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "December 11, 2024, 07:29:20 AM",
      "body": "To my knowledge, there hasn’t been any higher return option that’s risk-free, and it’s too risky because crypto is volatile. Locking it in for a certain period might earn you interest, but what if the price drops? You’d lose the opportunity to sell because of the lock-up.The best option is what you’ve shared, 14% max per year is already a significant return. If you’re comfortable, you could go aggressive with that investment.However, since you are looking for another way,  then I'll share you a way to increase your Bitcoin or any crypto you’re holding beyond 14% per year, and it is by running a lending service here. From what I’ve noticed, the minimum rate is around 10% per month. That’s about 120% annually. so yeah, try to evaluate the risk, maybe you'll consider it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "December 11, 2024, 07:47:52 AM",
      "body": "Quote from: seoincorporation on December 11, 2024, 03:30:14 AMSome days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.the most common way of earning in crypto is literally holding which allows you to earn money passively buying crypto is an investment that about anyone can do while bitcoin has now reached really high prices you can still buy smaller units of bitcoin depending on what you can afford, hold it, and let it grow over the years you can think of it as an interest rate same with other centralized banks or services except it's just the value of bitcoin that you are holding that is increasing and no one is issuing that interest rate for youQuoteI would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?no need for anyone else to hold your money matehold your own bitcoins hold your own keys and watch it grow over the next few years simple as that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 11, 2024, 07:56:59 AM",
      "body": "Staking is a way to generate money using your Bitcoin but it’s incredibly risky in the sense that you are earning money by allowing a company to take control of your Bitcoin whilst you earn money. It’s not a good idea because not your keys, not your coins. We have seen multiple exchange & other crypto companies go bankrupt or get hacked & if that happens your money is gone. The yield you earn by staking is not worth the risk of allowing a third party to have control of your Bitcoin. Simply holding Bitcoin & regularly buying is a much more fool proof way of making profits. Patience is required but at least you are the master of your own money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 11, 2024, 08:08:48 AM",
      "body": "Defi could be an answer for this question. Its just staking or provide liquidity to the community. This could be something that a  person would want to do to make money while not risking too much.  Trusted platform however has to be chosen carefully. AAVE I think sti is running ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "December 11, 2024, 08:47:08 AM",
      "body": "Quote from: seoincorporation on December 11, 2024, 03:30:14 AMSome days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.I would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?Still good return for fiat investment, if you can spend some amount for that option I guess its still a good option rather than letting your money seat on your bank account getting more lesser return per annum.But if you are really seeking for good profit return then I guess we should not go anywhere else. Bitcoin already offer that to us and the only thing we do is to buy consistently using DCA then hold it for 4 - 10 years time span.If you are seeking for passive returns on other crypto I think its risky to say that there's something out there could give you a passive income since there's so many scams out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "December 11, 2024, 09:32:22 AM",
      "body": "Quote from: bittraffic on December 11, 2024, 08:08:48 AMDefi could be an answer for this question. Its just staking or provide liquidity to the community. This could be something that a  person would want to do to make money while not risking too much.  Trusted platform however has to be chosen carefully. AAVE I think sti is running ?Defi, pools, and staking.Some analysis should be put in work though for the pools just to be sure everything will go smoothly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 11, 2024, 09:33:57 AM",
      "body": "There's no other option except lending, you can lend your coins in lending platform or you directly find the lender, we have a lending board in this forum. But, I don't think it will be successful because there might be only 1 from 1K people who willing to take a loan with collateral, while the rest of them are asking loan without collateral.I think lenders are in loss by lending without collateral in this forum.Quote from: bittraffic on December 11, 2024, 08:08:48 AMDefi could be an answer for this question. Its just staking or provide liquidity to the community. This could be something that a  person would want to do to make money while not risking too much.  Trusted platform however has to be chosen carefully. AAVE I think sti is running ?You need to convert your Bitcoin to altcoin (Bitcoin run on other network), so it's not Bitcoin anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 11, 2024, 09:37:20 AM",
      "body": "Quote from: AltcoinAdvent on December 11, 2024, 08:54:15 AMQuote from: ultrloa on December 11, 2024, 08:47:08 AMQuote from: seoincorporation on December 11, 2024, 03:30:14 AMSome days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.I would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?Still good return for fiat investment, if you can spend some amount for that option I guess its still a good option rather than letting your money seat on your bank account getting more lesser return per annum.But if you are really seeking for good profit return then I guess we should not go anywhere else. Bitcoin already offer that to us and the only thing we do is to buy consistently using DCA then hold it for 4 - 10 years time span.If you are seeking for passive returns on other crypto I think its risky to say that there's something out there could give you a passive income since there's so many scams out there.i agree with the idea that keeping money in a bank account isn't the best way to grow wealth especially with low interest rates.bitcoin still stands out as a solid long tem investmentYep, it can be done with other coins, but with BTC - just keep it, other options would be a bit risky-ish.Though, it's always wonderful to get some new ways to work around with what you've got. Staking on CEXes - not much profit would be done there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 11, 2024, 09:40:23 AM",
      "body": "Two risks at play here.1. Crypto is generally volatile.2. The platform you staking isn't foul proof or hack proof, run by humans, anything can happen to them. If I have to take this risk I will stake on a platform that has a higher chance of paying back for any damages, Binance seated so well with me for example, because they have the balls to take responsibility for any damages like breaches and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "December 11, 2024, 09:42:20 AM",
      "body": "Quote from: Outhue on December 11, 2024, 09:40:23 AMTwo risks at play here.1. Crypto is generally volatile.2. The platform you staking isn't foul proof or hack proof, run by humans, anything can happen to them. If I have to take this risk I will stake on a platform that has a higher chance of paying back for any damages, Binance seated so well with me for example, because they have the balls to take responsibility for any damages like breaches and others. Did you experience such cases or had someone that was in the one, and Binance helped?Just interested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "December 11, 2024, 09:48:54 AM",
      "body": "Quote from: seoincorporation on December 11, 2024, 03:30:14 AMSome days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.I would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?You mean staking? That's a better word to use for this. Though staking might have been helpful to some investors, I still think it's better to hold your coins your self and keep the keys. the only thing that might make staking a bit assuring is that you get to leave the coin for a very long time as they are being locked up. While for hod!ing you can decide to come and take from it to cover up something if need be there by reducing your returns after holding your coins. For me I still prefer holding mate it's gives you a better way to enjoy your BTC freedom as you don't need to depend on a third party to help you with your money when needed..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "December 11, 2024, 12:07:20 PM",
      "body": "Quote from: Hatchy on December 11, 2024, 09:48:54 AMQuote from: seoincorporation on December 11, 2024, 03:30:14 AMSome days ago i get my Nu card, it has a feature called boxes, you can freeze there your money to get a passive income, something between 12% and 14% each year.And i was wondering if something like this exists with Bitcoin or the crypto world in general.I would like from the community if any of you to know some ways to generate a passive income with the cryptos, i know staking is one way, but for sure there are some platforms that offers a passive income while they hold our money, so, whats best options for this 2025?You mean staking? That's a better word to use for this. Though staking might have been helpful to some investors, I still think it's better to hold your coins your self and keep the keys. the only thing that might make staking a bit assuring is that you get to leave the coin for a very long time as they are being locked up. While for hod!ing you can decide to come and take from it to cover up something if need be there by reducing your returns after holding your coins. For me I still prefer holding mate it's gives you a better way to enjoy your BTC freedom as you don't need to depend on a third party to help you with your money when needed..I agree with you.When you are in power of your BTC, you are the king.When you enter the deal with a third party - you lose your autonomy. So it's really about the risks involved.Simple as that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 11, 2024, 12:53:23 PM",
      "body": "The point is whether you can even stake your bitcoin because of the risk of losing it totally. I can stake some low level altcoins and not bitcoin. The one way I know you can gain some additional bitcoin apart from lending is either you hodl and sell or you trade it if you can but that has it own personal risk too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 11, 2024, 12:56:52 PM",
      "body": "Quote from: seoincorporation on December 11, 2024, 03:30:14 AM~That's just staking in a nutshell no? Or yield platforms for something similar, but I reckon they're pretty close to being the same. If we were talking about Bitcoin specifically I'd say holding it is better and if the market is down, go look for other alternatives instead while DCAing. Quote from: Sanitough on December 11, 2024, 07:29:20 AMHowever, since you are looking for another way,  then I'll share you a way to increase your Bitcoin or any crypto you’re holding beyond 14% per year, and it is by running a lending service here. From what I’ve noticed, the minimum rate is around 10% per month. That’s about 120% annually. so yeah, try to evaluate the risk, maybe you'll consider it.  Is the loaned amount based on BTC amount instead of the reflected USD price when the loan was given out? Sounds like hell to pay during bull markets like what we have lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 11, 2024, 02:12:11 PM",
      "body": "Thanks for your answers guys.As you mentioned, there is a big risk involved in the crypto investments, and that's the volatility, the fact that it can goes down 50% or more for the next year is a signal that we can't invest and always see benefits. Just as it can go up as it did in the past months, it can go to the other way, and if we invest in any altcoin chasing a 14% annually and the coin crash on the market, then that 14% will be negative. Maybe the buy low / sell high strategy is the best way to go with cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "December 11, 2024, 02:32:40 PM",
      "body": "Quote from: seoincorporation on December 11, 2024, 02:12:11 PMThanks for your answers guys.As you mentioned, there is a big risk involved in the crypto investments, and that's the volatility, the fact that it can goes down 50% or more for the next year is a signal that we can't invest and always see benefits. Just as it can go up as it did in the past months, it can go to the other way, and if we invest in any altcoin chasing a 14% annually and the coin crash on the market, then that 14% will be negative. Maybe the buy low / sell high strategy is the best way to go with cryptos. Just buy BTC on the dips, and especially on the future correction, and you will be totally fine.And, believe me, with enough patience - you will get the best results out of this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 11, 2024, 02:34:45 PM",
      "body": "Quote from: Wexnident on December 11, 2024, 12:56:52 PMQuote from: seoincorporation on December 11, 2024, 03:30:14 AM~That's just staking in a nutshell no? Or yield platforms for something similar, but I reckon they're pretty close to being the same. If we were talking about Bitcoin specifically I'd say holding it is better and if the market is down, go look for other alternatives instead while DCAing. BTC is the only thing I wouldn't stake due to what can be done to it on such platforms. You should be the only one having control over it.It's really that much better with BTC. Along with continuing to DCA it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}