{
  "id": "topic_5460641",
  "title": "leslie4u",
  "author": "leslie4u",
  "created_time": "July 22, 2023, 05:22:56 AM",
  "content": "When it comes to Masternodes what are the projects you guys are currently investing in or reviewing? I know some name such as Dash, Divi, Pivx, Prenodes etc. Other than these are you guys looking into any low cap coins?Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460641",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "July 22, 2023, 06:41:48 AM",
      "body": "This is one of the sources that I've loved to have before but not anymore today. While those that have you mentioned are the most popular in the masternodes scene. The return of having those will take time and I have seen how expensive most of them before. Instead of getting into masternodes, just avail a coin that has a POS feature and have it staked. Although they are likely similar but it's easier to stake because you don't need  to go through the required amount in setting up a MN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leslie4u",
      "created_time": "July 22, 2023, 08:44:41 AM",
      "body": "Quote from: livingfree on July 22, 2023, 06:41:48 AMThis is one of the sources that I've loved to have before but not anymore today. While those that have you mentioned are the most popular in the masternodes scene. The return of having those will take time and I have seen how expensive most of them before. Instead of getting into masternodes, just avail a coin that has a POS feature and have it staked. Although they are likely similar but it's easier to stake because you don't need  to go through the required amount in setting up a MN.Thank you for your response. Any specific staking project that you are looking into and would like to recommend?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 22, 2023, 11:05:29 AM",
      "body": "Quote from: leslie4u on July 22, 2023, 08:44:41 AMQuote from: livingfree on July 22, 2023, 06:41:48 AMThis is one of the sources that I've loved to have before but not anymore today. While those that have you mentioned are the most popular in the masternodes scene. The return of having those will take time and I have seen how expensive most of them before. Instead of getting into masternodes, just avail a coin that has a POS feature and have it staked. Although they are likely similar but it's easier to stake because you don't need  to go through the required amount in setting up a MN.Thank you for your response. Any specific staking project that you are looking into and would like to recommend?The most known is Ethereum although the need is around 32 ETH, you can join pools that won't require you that much and you can stake any amount but I have no list of that as I don't stake ETH. Btw, for other altcoins that you can stake. You can check resources like this link[1] below for your own reference.[1] https://coinranking.com/coins/staking",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leslie4u",
      "created_time": "July 24, 2023, 12:53:12 PM",
      "body": "Quote from: livingfree on July 22, 2023, 11:05:29 AMQuote from: leslie4u on July 22, 2023, 08:44:41 AMQuote from: livingfree on July 22, 2023, 06:41:48 AMThis is one of the sources that I've loved to have before but not anymore today. While those that have you mentioned are the most popular in the masternodes scene. The return of having those will take time and I have seen how expensive most of them before. Instead of getting into masternodes, just avail a coin that has a POS feature and have it staked. Although they are likely similar but it's easier to stake because you don't need  to go through the required amount in setting up a MN.Thank you for your response. Any specific staking project that you are looking into and would like to recommend?The most known is Ethereum although the need is around 32 ETH, you can join pools that won't require you that much and you can stake any amount but I have no list of that as I don't stake ETH. Btw, for other altcoins that you can stake. You can check resources like this link[1] below for your own reference.[1] https://coinranking.com/coins/stakingThank you. I will take a look at the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 24, 2023, 05:35:36 PM",
      "body": "Quote from: leslie4u on July 24, 2023, 12:53:12 PMQuote from: livingfree on July 22, 2023, 11:05:29 AMThe most known is Ethereum although the need is around 32 ETH, you can join pools that won't require you that much and you can stake any amount but I have no list of that as I don't stake ETH. Btw, for other altcoins that you can stake. You can check resources like this link[1] below for your own reference.[1] https://coinranking.com/coins/stakingThank you. I will take a look at the list.You're welcome, leslie. Now that everything on this thread is probably have done the purpose, you may lock the topic if you think that there's no need to continue this discussion anymore. But if you think that you still want to see other members discuss about masternodes on this topic then, you can let the topic remain open until if a mod closes it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 24, 2023, 05:38:22 PM",
      "body": "Give me back my 2019. The trend with masternodes is long dead, it is not relevant at all and all the projects that were once on the wave of hype, no longer bring such profitability as before. In general, I do not see the point of looking for any masternodes, especially with low capitalization. It's like looking for bitcoin faucets to earn bitcoin in 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "July 24, 2023, 07:25:49 PM",
      "body": "I don't know why people still feel investing into Master nodes is a good thing in 2023, MNs have passed their time, I will rather stack my coins/tokens than put in Masternoes, most of these MNs coins have their rewards slashed over time and the reward can only worth it if the price is greatly pumped like that of Dash in 2018. If you buy BNB and keep participating in Launchpool and Launchpad will be better off then investing into MNs coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 24, 2023, 07:38:16 PM",
      "body": "Quote from: jacafbiz on July 24, 2023, 07:25:49 PMI don't know why people still feel investing into Master nodes is a good thing in 2023, MNs have passed their time, I will rather stack my coins/tokens than put in Masternoes, most of these MNs coins have their rewards slashed over time and the reward can only worth it if the price is greatly pumped like that of Dash in 2018. If you buy BNB and keep participating in Launchpool and Launchpad will be better off then investing into MNs coinsYes, I also agree with you. Masternodes is no longer profitable today, it is better to stack  Ethereum in well-known platforms such as Bybit , Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 25, 2023, 04:15:22 AM",
      "body": "Yeah I had to double check the date and was surprised this wasn’t posted back in 2017 or so. Been a while since I heard about Pivx or even masternodes in general. They were huge back in the day but now people moved on to staking ETH instead. I remember at first masternodes were highly risky because you had to keep the tokens on the wallet and many ended up losing their tokens due to poor security issues. And then the fad just died off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}