{
  "id": "topic_5404073",
  "title": "RahulBaria1987",
  "author": "RahulBaria1987",
  "created_time": "June 25, 2022, 07:34:45 PM",
  "content": "Hey guys, I am building new nft project on SOLANA blockchain. So I want to grow my new twitter account. How to do this ? Need your suggestion.Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404073",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "June 25, 2022, 07:53:40 PM",
      "body": "First advice, is to consider hiring a Social Media Manager, especially if you have no prior skills in digital marketing or managing professional social media accounts.Tips I can share on managing and growing an account;• Have a worthy product; work majorly on building your project, website, art, etc. It's easier to market a product when it actually exists.• Grow your knowledge of the industry your product is related to; with this you can share useful content and make your page relevant to visitors,• Be consistent; being active gets attention to your project as it would keep popping up,• Engage with profiles related to your niche, this can be through comments, joining spaces or sending a dm. Avoid spamming however,• Repeat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 26, 2022, 04:32:34 AM",
      "body": "There are a number of ways. If you want to do it for free, you could promote it on various platforms and social media sites and put your Twitter link. There's a lot of them. I'm sure there are many groups focused on NFT projects. You could also make it a little more exciting with freebies and discounts. And since you're already here, why not open a thread in the Alternate Cryptocurrencies section and present your project? There might be some who want to take a look at it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 26, 2022, 04:46:37 AM",
      "body": "Quote from: RahulBaria1987 on June 25, 2022, 07:34:45 PMHey guys, I am building new nft project on SOLANA blockchain. So I want to grow my new twitter account. How to do this ? Need your suggestion.Thanks All your attempts to use your business here will most likely be deplorable.You are currently violating the ban rule on the forum. Your first account has been suspended, and you should no longer post on the forum today.Quote from: mprep on July 21, 2014, 05:27:51 PM25. Ban evasion (using or creating accounts while one of your accounts is banned) is not allowed.[e]====================================================Ban evasion.RahulBaria Autoban userRahulBaria1987Quote from: RahulBaria on March 22, 2018, 03:40:35 PM0xe4123f89c79dC32d1eD698c060f99b9E3D29EEC1Quote from: RahulBaria1987 on July 01, 2021, 10:38:17 AMERC-20 Wallet Address: 0xe4123f89c79dC32d1eD698c060f99b9E3D29EEC1[ archive ]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danbrezovsky",
      "created_time": "June 27, 2022, 07:02:06 AM",
      "body": "What I can recommend, you'd better do a plan with some scheduled posts (Twitter allows you to do that without any tool) and have some manual posts randomly through the month. I usually do this and set up all hashtags, links and images.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josesv",
      "created_time": "June 28, 2022, 08:56:09 PM",
      "body": "I could promote it on various platforms and social media sites comment telecharger une video youtube and put your Twitter link. There's a lot of them. I'm sure there are many groups focused on NFT projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ClutchNixon",
      "created_time": "July 06, 2022, 03:02:40 PM",
      "body": "You can try to use an email service provider. It's hard to send emails by yourself and I usually use this service unione.io which was recommended to me by a good friend of mine. These guys provide excellent transactional emailing services and have the best prices in my opinion. Also, they support customers 24/7.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}