{
  "id": "topic_5455282",
  "title": "cygan",
  "author": "cygan",
  "created_time": "June 06, 2023, 10:23:38 AMLast edit: June 07, 2023, 09:50:01 AM by cygan",
  "content": "this thread is intended to be a discussion around ptlcs which are an upgrade to the existing payment mechanism in the lightning network called 'hash time locked contracts (htlcs)'simply put, this contract enables trustless, atomic routing of payments on the network by guaranteeing that the sender agrees to send money to the recipient only if the recipient reveals a secret that has generated a specific hash. if the recipient does not reveal the secret, the sender can get his coins back after a certain time. since the schoor upgrade the implementation of ptlcs became possible.to make it easier to see and understand, here are 4 slides that explain the whole process very well:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455282",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "June 06, 2023, 10:34:21 AM",
      "body": "Great infographic, but you might want to post the banners for Adaptor Signatures and Wormhole Attack so that people have a greater chance at understanding of what exactly is at play here. Maybe even link the infographic for HLTCs as well for newbies to cross-reference.Do you have an idea of when this stuff is hitting the Lightning Network standards officially? or maybe when LN clients will decide to implement it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "June 07, 2023, 09:49:38 AM",
      "body": "@NotATetheras you wished here are 4 more slides about the topic you mentioned 'wormhole attack' also the slides for the 'hashed timelock contracts (htlc)' to see the difference to ptlc i have added as well more information on the two topics in question can be found here: Wormhole Attack & Hashed Timelock Contracts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}