{
  "id": "topic_5406112",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "July 13, 2022, 11:23:26 AM",
  "content": "Seré breve:Una encuesta reciente de N26, llega a la conclusión, sin tapujos, de que un 39% de las mujeres españolas ya invierten en criptomonedas, y un 27% adicional está considerando la opción de hacerlo en lo que resta del año.Es decir, que 2 de cada tres ha invertido o lo está pensando hacer a lo largo de este año. Ahora es cuestión de preguntarles a vuestras madres, hijas, sobrinas, tías, conocidas, y ver qué 2 de cada 3 están al tanto de estos temas. Como digo yo, es cuestión de ir a la plaza del mercado, hacer la misma pregunta, y ver si se sostienen las cifras presentadas en el estudio. A buen seguro que discrepan tremendamente, denotando el sesgo que deben tener los datos de la citada encuesta …Ver:https://www.criptonoticias.com/comunidad/espanolas-invierte-bitcoin-seguridad-financiera-familia/https://n26.com/es-es/encuesta-mujeres-e-inversion",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406112",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "July 13, 2022, 01:29:19 PM",
      "body": "Me pregunto a que viene que las encuentas que tengan que ver con productos financieros (en especial con cripto activos) muestren resultados que no corresponden con la realidad percibida. Podría ser que la población de muestra resulte ser bastante favorable a las criptomonedas sobre el promedio o que efectivamente exista un sesgo informativo.La estadística al ser una rama de la matemática debería tratar de presentar datos frios y sin tapujos de lo que sucede en la realidad, pero ya sabemos como funciona la guerra de la (des)información en este siglo. Si realmente existe un sesgo en estos casos es para vender una realidad alternativa, ficticia en pro de intereses mezquinos. Se podría divagar de cuales serían tales intereses pero no creo que sea productivo desviar el tema de este hilo. Por ahora daré el beneficio de la duda y trataré de no ser tan paranoico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 14, 2022, 08:56:01 PM",
      "body": "Quote from: Hispo on July 13, 2022, 01:29:19 PMSe podría divagar de cuales serían tales intereses pero no creo que sea productivo desviar el tema de este hilo. Por ahora daré el beneficio de la duda y trataré de no ser tan paranoico.¿Quizá intereses hacia la generación de un sentimiento de FOMO entre las lectoras? Alguna mujer que no posea criptomonedas y lea que casi un 40% ya invierte, y otro 30% está en camino, probablemente se angustie...Claramente los resultados no se corresponden ni ligeramente con la intuición que podemos tener sobre el tema. En los próximos años quién sabe, igual se superan esas cifras, pero a día de hoy parecen ridículamente infladas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 14, 2022, 11:47:49 PM",
      "body": "Quote from: Porfirii on July 14, 2022, 08:56:01 PMQuote from: Hispo on July 13, 2022, 01:29:19 PMSe podría divagar de cuales serían tales intereses pero no creo que sea productivo desviar el tema de este hilo. Por ahora daré el beneficio de la duda y trataré de no ser tan paranoico.¿Quizá intereses hacia la generación de un sentimiento de FOMO entre las lectoras? Alguna mujer que no posea criptomonedas y lea que casi un 40% ya invierte, y otro 30% está en camino, probablemente se angustie...Claramente los resultados no se corresponden ni ligeramente con la intuición que podemos tener sobre el tema. En los próximos años quién sabe, igual se superan esas cifras, pero a día de hoy parecen ridículamente infladas. Bueno, ahora que lo pienso quizá esto no se trate de un asunto específico sobre cripto activos, ahora mismo no se me viene a la mente alguna mujer que tenga una posición de bastante respeto dentro del mundo de las inversiones o finanzas, por ejemplo, cada vez que vemos una noticia de un millonario alabando o despotricando contra Bitcoin, siempre resulta ser un hombre (las pocisiones gubernamentales no cuentan). Y por supuesto, estas son personas que hicieron sus fortunas mucho antes de la aparición de Bitcoin, así que si las mujeres en sí no tienen una amplia representación en el mundo financiero, las criptomonedas son una capa más que tienen que atravesar para alcanzar la visibilidad, creo que tambien aplica en las ciudadanas de a pie.Corrijanme si me equivoco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 15, 2022, 05:32:48 AM",
      "body": "Lo anterior no obstante no quita que los autores del estudio no sean capaces de ver que está claramente sesgado respecto de la realidad (o yo muy equivocado), y que con toda tranquilidad, publican la información. Es más, luego (algunos de) los medios van y hacen eco del estudio sin ningún cuestionamiento.El estudio dice que eligieron las personas con \"representatividad equitativa entre los que invierten y los que no\". Mi hipótesis sería que la respuesta medía los resultados de aquellas mujeres que ya invierten en productos de algún tipo (financieros, cripto, etc.), donde aún los resultados me parecerían sorprendentes al posicionar cripto sobre todo lo demás de largo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 15, 2022, 09:04:20 AM",
      "body": "Quote from: DdmrDdmr on July 15, 2022, 05:32:48 AMEl estudio dice que eligieron las personas con \"representatividad equitativa entre los que invierten y los que no\".Mi hipótesis, vistos los resultados, es que para la muestra han optado por elegir un perfil muy determinado de encuestadas. No me gusta pensar mal, pero pareciera que ya iban buscando el sorprendente resultado de antemano.Es lo malo de las estadísticas en estos tiempos que nos toca vivir, y que no todo el mundo tiene el tiempo o la capacidad para juzgar la idoneidad de la metodología empleada, quedándonos normalmente solo con el titular, reforzando sesgos de todo tipo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "July 29, 2022, 01:26:48 PM",
      "body": "Un 39% ya invierte, y un 27% adicional está considerando la opción.Pero que coño?Ni haciendo la encuesta en el baño de la facultad de informática durante una convención sobre blockchain salen esos datos.Y no lo digo por ser féminas, esto mismo aplicado a la población general tampoco se sostiene por ningún lado.Noticias de hace unos meses:https://www.eleconomista.es/ecoaula/noticias/11542253/12/21/El-9-de-la-poblacion-espanola-4-millones-de-personas-ya-usa-o-posee-criptomonedas-como-el-bitcoin.htmlSiquiera partiendo de que la encuesta se limita a mujeres con inversiones, se sostiene. Es absurdo.3 veces más inversoras en criptomonedas que en inmuebles... en España, pero que broma es esta, ni el borracho de la esquina de abajo de mi casa se lo creería, no entiendo que pretenden publicando estos sinsentido.O son muy tontos, o piensan que nosotros lo somos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 29, 2022, 02:47:41 PM",
      "body": "Esta encuesta es un chiste... al final de el artículo encontramos que:QuoteLa encuesta se realizó entre un total de 16030 mujeres y hombres en... y España (3005 participantes de Barcelona, Madrid, zona centro, Levante, noreste, noroeste, norte y sur), con una división equitativa entre aquellas personas que invierten y aquellas que no.Así que si encuestando a 3000 mujeres creen que pueden hablar de porcentajes y de las Mujeres españolas en general, desde mi punto de vista es una broma de mal gusto.Mejor que le preguntes solo a 2 mujeres y que digan que el 100% hace inversiones en criptos. Fuente:https://n26.com/es-es/encuesta-mujeres-e-inversion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 29, 2022, 05:13:21 PM",
      "body": "Atendiendo solo al número, 3.000 mujeres sí constituirían una muestra representativa como para el margen de error no se situara por encima por encima del 2%. (Calculadora)Yo creo que aquí el problema no está en el número de mujeres que dicen que han encuestado, sino en lo que dice dominguero, y más bien en la segunda de las opciones.Quote from: dominguero on July 29, 2022, 01:26:48 PMO son muy tontos, o piensan que nosotros lo somos.Lo más triste es que probablemente no andan muy desencaminados.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 29, 2022, 06:17:07 PM",
      "body": "En términos generales, la mayor parte de las encuestas que estamos viendo reportadas en el foro tienen el volumen suficiente para ser estadísticamente representativas, pero donde muchas suelen pecar es en evitar el sesgo a la hora de seleccionar el público objetivo, el cual ha de ser diverso bajo múltiples factores (edad, educación, zona geográfica, uso de las tecnologías, etc.). Es habitual que una entidad realice la encuesta entre sus clientes (y puede que esté abierto a invitados). Esto provoca un sesgo de partida notorio, de manera que los datos sirven para perfilar el cliente de dicha entidad, pero no la población en general. Es como si Binance hace una encuesta acerca de las criptomonedas entre sus clientes, y extrapolamos los datos a toda la población de un país o a nivel mundial. Sesgo al canto. En su descargo, no siempre es la encuesta que extrapola los resultados, sino el medio que no contextualiza la encuesta a los cliente de una entidad, luego el medio que se basa en el medio, el posteador que se basa en el medio que se basa en el medio, el posteador que cita al posteador que se basa en el medio que se basa en el medio, y así en cadena se va propagando el dato sin el contexto. De ahí que me guste intentar encontrar la fuente original y ver qué se cocina allí.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}