{
  "id": "topic_5400770",
  "title": "Wiwo",
  "author": "Wiwo",
  "created_time": "May 30, 2022, 06:36:48 PM",
  "content": "Warning Only invest what you can afford to lose at whatever time.At whatever point as a newbie in cryptocurrency one needs to eliminate the tendency for fear and greed, these two bad personalities can affect your total well being in the cryptocurrencies market, if you noticed a lot of investors who jump on a coin just for the sake of making a quick buck are the ones who mostly cry when the price goes against their prediction. This situation has placed most newbies in an unrecoverable condition so I feel it important we all get some things straight before putting our eggs in any basket if not the basket will wider the chances of making any profits from putting our egg in them. Don't get greedy always move within your limit, and grow along the line. Don't be quick to make a decision just because a coin did 10x.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400770",
  "comments": [
    {
      "author": "Coyster",
      "created_time": "May 30, 2022, 07:02:19 PM",
      "body": "It is safe to say newcomers should only invest in Bitcoin, let us be honest, it is best for them, Bitcoin is not going to dump on you and not rise again, but quite a lot of altcoins would do that to you, altcoins are short term projects that you must have to time to perfection so you can pull out at the right time, newbies 9/10 will prolly get this timing wrong and lose their funds, with Bitcoin all they have to do is to choose the Dollar Cost Averaging strategy, grow a Bitcoin portfolio from scratch and hodl well for the long run, they would definitely make profits.I know quite a lot of people call it diversification, investing in Bitcoin and other altcoins, some call it not putting your eggs in one basket, all of that is wrong, and investing in two intrinsically similar things is wrong (or at least cannot be called diversification), if you want to diversify, then buy Bitcoin as your crptocurrency investment, then look outside the crypto market to diversify, there is real estate, you can buy gold, stocks, you can invest in short-term government bond funds, etc, then only are you truly diversifying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "May 30, 2022, 07:45:48 PM",
      "body": "The rule of investing what you are able to lose is not applicable to only newbies. It is a rule for all and I believe the rule is popular and resounding as well.While greed is sacrosanct for losing in trade and/or investment, same cannot be said of fear. Fear can only make one miss out some opportunities, again fear can make someone sell before profits. This could be understandable and most times the severity of losses induced by fear is less compared to the one perpetrated by greed.It is always necessary to DYOR before you invest in any coin (especially altcoins).The idea of diversification is always misconstrued in this space. I came here with same confusion that if I'm investing in any other coin apart from bitcoin, that I'm diversifying. But this forum taught me that I was wrong and now I have learnt the correct thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kasabus",
      "created_time": "May 30, 2022, 09:42:58 PM",
      "body": "Quote from: Wiwo on May 30, 2022, 06:36:48 PMWarning Only invest what you can afford to lose at whatever time.At whatever point as a newbie in cryptocurrency one needs to eliminate the tendency for fear and greed, these two bad personalities can affect your total well being in the cryptocurrencies market, if you noticed a lot of investors who jump on a coin just for the sake of making a quick buck are the ones who mostly cry when the price goes against their prediction. This situation has placed most newbies in an unrecoverable condition so I feel it important we all get some things straight before putting our eggs in any basket if not the basket will wider the chances of making any profits from putting our egg in them. Don't get greedy always move within your limit, and grow along the line. Don't be quick to make a decision just because a coin did 10x. That is always a big mistake if you are investing for quick profits, and since those shitcoins and meme coins are sometimes giving profits 5x or 10x, then you end up investing on them. The result is there is no sustainable profits because they are just good in the beginning but lose their value afterwards. Most newbies' mistake is that they fail to see the long term vision of the coins because they are tempted with what is profitable in the present. To avoid that, invest in bitcoin. Its value will appreciate every now and then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 30, 2022, 10:52:15 PM",
      "body": "Not only for the newbies but also for everyone.There are investors that always see bitcoin as an expensive asset and they don't want to have it. Rather than having it, they're betting on the new projects and altcoins that they think they're on a winning side. But they're wrong with that choice and it's always bitcoin to be a safe haven for most of it. Because they don't have it yet and that's why they think that there's a better choice to make aside from owning bitcoin.Well, they'll eventually learn that owning it is much better than altcoins. When the streets are full of blood, it's actually the time that they should be greedy, not when it's peaking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 30, 2022, 11:05:04 PM",
      "body": "Quote from: Wiwo on May 30, 2022, 06:36:48 PMAt whatever point as a newbie in cryptocurrency one needs to eliminate the tendency for fear and greed, these two bad personalities can affect your total well being in the cryptocurrencies marketJust like prostitution which is almost as old as mankind, fear and greed are necessary ingredients in human endeavour. They're the driving force for whatever man does. Fear keeps the timid away from business while greed attracts them to it. There's no way these two can be eliminated. However, they can be properly monitored or checked.QuoteDon't get greedy always move within your limit, and grow along the line. Don't be quick to make a decision just because a coin did 10x.Yeah, that should be a more balanced and objective dissection of the fear and greed factor and how to apply them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaculin",
      "created_time": "May 30, 2022, 11:47:05 PM",
      "body": "Quote from: Wiwo on May 30, 2022, 06:36:48 PMWarning Only invest what you can afford to lose at whatever time.At whatever point as a newbie in cryptocurrency one needs to eliminate the tendency for fear and greed, these two bad personalities can affect your total well being in the cryptocurrencies market, if you noticed a lot of investors who jump on a coin just for the sake of making a quick buck are the ones who mostly cry when the price goes against their prediction. This situation has placed most newbies in an unrecoverable condition so I feel it important we all get some things straight before putting our eggs in any basket if not the basket will wider the chances of making any profits from putting our egg in them. Don't get greedy always move within your limit, and grow along the line. Don't be quick to make a decision just because a coin did 10x. Invest in coins that will give you long term profits, not just profitable only for short term. Because if you do that, there is more opportunity that your investment will last longer so that means too that you'll make more profits than it, rather than investing on new coins that makes 10x profits but end up as a low value coin after some time and lose your future profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "May 30, 2022, 11:56:38 PM",
      "body": "It's a constant reminder to all newbies or to the ones who think crypto currency market is just for a quick profit. You haven't stayed long in the market yet you need to know how deep it is if you want to completely understand and how does it work. Mostly of these who invested in the wrong coins would end up played by the people top of them e.g. developers/whales/early investors etc.I suggest to invest in knowledge, the more knowledge you have the more you won't lose too much and OP was right, don't invest on something that you can't afford to lose because you are most likely going to suffer in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 31, 2022, 03:14:50 AM",
      "body": "Its the hardest part of being a trader/investor that you need to endure when you enter this space.Manya have already been in a big losses and some even losses their hard earned money. Invest on something you ought to understand than something youll earn quick money at. These kind of projects are gonna get you excited and when your at the top od that then they will drop a bomb called rug or exit scam. Im sure you dont want that kind of feeling to be something constant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 31, 2022, 03:29:50 AM",
      "body": "Quote from: Wiwo on May 30, 2022, 06:36:48 PMa lot of investors who jump on a coin just for the sake of making a quick buck are the ones who mostly cry when the price goes against their prediction.Newbies should never touch altcoins under any circumstances but what you explained is the only working strategy for altcoins. We all know that altcoins don't have long term potential but they always get big pumps in short term which makes them excellent ways to make a quick buck. The problem is that pump and dump is a market manipulation and is unpredictable, so the risks are very high and if you don't know how to ride the manipulation you will lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "May 31, 2022, 03:37:21 AM",
      "body": "I believe in the saying that \"Experience is a great teacher\" so usually don't mind things like this for newbie on cryptocurrency because most of them will focus on quick buck profit and ignore this kind of suggestion until they suffer losses by not following this rule. Only a few newbie is very eager to learn and patiently do research before they commit any investment in any cryptocurrency out there.I have many friends that I encouraged to enter crypto and I have already explained do's and don't but still, they are so cocky to do risky investments just because they saw someone post on social media about earning a huge amount on a certain investment. They keep clouding their judgement for the sake of quick-buck profit even though the process is not feasible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "May 31, 2022, 07:26:02 AMLast edit: June 01, 2022, 05:50:23 PM by Wiwo",
      "body": "Quote from: pooya87 on May 31, 2022, 03:29:50 AMQuote from: Wiwo on May 30, 2022, 06:36:48 PMa lot of investors who jump on a coin just for the sake of making a quick buck are the ones who mostly cry when the price goes against their prediction.Newbies should never touch altcoins under any circumstances but what you explained is the only working strategy for altcoins. We all know that altcoins don't have long term potential but they always get big pumps in short term which makes them excellent ways to make a quick buck. The problem is that pump and dump is market manipulation and is unpredictable, so the risks are very high and if you don't know how to ride the manipulation you will lose money.Pump and dump is indeed a market manipulation and should not be relied on for long term gain since it is not predictable as to when a coin we are pumped, some will not get pumped when it is dumped at a certain time that is why newbie needs to stay away from that idea of getting into investing in a coin with the aim that it will get pumped sooner or later. Newbies can rather invest more in Bitcoin and keep building their knowledge and experience as events keep happening in the spur of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}