{
  "id": "topic_5455736",
  "title": "HmmMAA",
  "author": "HmmMAA",
  "created_time": "June 08, 2023, 09:28:17 AM",
  "content": "A transaction of 1432.92 btc happened today https://blockchair.com/bitcoin/address/1E6nViR5Xv1wyNXg87SamvtLJ5TyXuksLC .The odd thing about this address is it ( almost ) contains block rewards from early days , specifically first reward is from block #2718 which is less than a month since launch . Only 2 transactions are not block rewards , a 0.01 btc and a 32.91 btc . All the other are coinbase rewards of 50 btc . Did satoshi came back to spend his coins ? A very early miner or an early OTC buyer decided to take profits ?Time will tell . I'll try to dig more to see if i can find anything . Any opinions or findings are appreciated .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455736",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "June 08, 2023, 09:41:46 AM",
      "body": "Maybe this could actually be someone who has long lost access to the wallet but just recently recovered it and decided to move the funds to a safer destination. It might just be an upgrade in wallet security since all funds are moved into a single address that does not belong to an exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 08, 2023, 09:48:22 AM",
      "body": "Oh Jonny walker finally opened s/he wallet. Most old wallets are being abandoned by the owners long ago. Maybe they kept it as a long term investment which finally paid off.  I think new generation investors should learn from this as it can be a good teacher or point to learn from. Atbthe early stage these investors bought or mined and kept for a longer time believing their investment to pay back after a long time and here this particular investor took profit not just profit but a good amount of money for holding a long time. OP your points are quite alright maybe a good follow up might reveal more to the wallet activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "June 08, 2023, 09:57:57 AM",
      "body": "I'm waiting for what you dig further, it's of interest to me but I don't believe this is Satoshi or any of the first sets who have a history with Bitcoin. The first transaction to that address was 10 years ago, which is 2023, Bitcoin has existed 4 years before then. This might be an early adopter that fortunately has enough coin kept, it could be anybody and will remain unknown.What I also noticed is that before the last transaction of 1,432.93416847BTC about 4 hours ago, the address has been receiving a regular 0.00000547BTC and more every month for years for reward. An old person indeed and the person knows what he is doing, it's time to change wallet...lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 08, 2023, 10:03:20 AM",
      "body": "Probably an early miner, we’ll never know if Satoshi is moving coins unless they’re from his well publicised address(es). I’m inclined to believe it is an early miner. I mean there are active users on here who registered in 2010 so it’s not that crazy that there are really early adopters amongst us.Sometimes early coins moving could just be early adopters moving coins to another type of wallet or device due to paranoia over a breach of their OPSEC or security etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "June 08, 2023, 10:06:34 AM",
      "body": "So what happens if Satoshi is trying to spend some of his coins? I mean we can't expect him to abandon his coins for the rest of his life, he has to spend them sooner or later, the former is better IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 08, 2023, 10:17:43 AM",
      "body": "Quote from: HmmMAA on June 08, 2023, 09:28:17 AMA transaction of 1432.92 btc happened today https://blockchair.com/bitcoin/address/1E6nViR5Xv1wyNXg87SamvtLJ5TyXuksLC .The odd thing about this address is it ( almost ) contains block rewards from early days , specifically first reward is from block #2718 which is less than a month since launch . Only 2 transactions are not block rewards , a 0.01 btc and a 32.91 btc . All the other are coinbase rewards of 50 btc . Did satoshi came back to spend his coins ? A very early miner or an early OTC buyer decided to take profits ?Time will tell . I'll try to dig more to see if i can find anything . Any opinions or findings are appreciated .If we go back to the history of bitcoin, when Satoshi Nakamoto first invented bitcoin, the first transaction he made was to the Hal Finney, who knows maybe his family had taken over the bitcoin after his demise to perform a transaction now that they needed to, who knows maybe it's also part of the early users who adopted bitcoin and hodl, the truth is that we cannot know everyone's stand and holdings on bitcoin, we have many whales who have been holding over a long time.Some decided to keep mute and go private, we only see these kind of moves occasionally through the whales alert system on the blockchain since the blockchain technology itself is an open distributed ledger, we can see everything going on even though we can't alter them, let's not be too curious about all these moves because it may be Satoshi and it may not be from his end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "June 08, 2023, 10:19:18 AM",
      "body": "Quote from: HmmMAA on June 08, 2023, 09:28:17 AMA transaction of 1432.92 btc happened today https://blockchair.com/bitcoin/address/1E6nViR5Xv1wyNXg87SamvtLJ5TyXuksLC .The odd thing about this address is it ( almost ) contains block rewards from early days , specifically first reward is from block #2718 which is less than a month since launch . Only 2 transactions are not block rewards , a 0.01 btc and a 32.91 btc . All the other are coinbase rewards of 50 btc . Did satoshi came back to spend his coins ? A very early miner or an early OTC buyer decided to take profits ?Time will tell . I'll try to dig more to see if i can find anything . Any opinions or findings are appreciated . 218,941.38USD worth of bitcoins was just transferred from this wallet to a new wallet, pretty sure this is the old holder's wallet and for some reason he is trying to move his bitcoins to a safe place.what's interesting is that he's moving his bitcoins to a self-custody wallet instead of the one linked to an exchange, meaning that he wants to hold his bitcoins for a much longer period of time or is he just making this wallet a temporary shelter before he deposits to the exchange? because 218,941.38USD is quite a lot of money and he can live peacefully with this much money. no one knows what he will do with his bitcoin but this wallet is very interesting to monitor its activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 08, 2023, 10:20:43 AM",
      "body": "Does it really worth doing investigation of the address transaction and bitcoin movement, Let say after dig to know about the address what benefits do you derived from it or what is the result for doing that?People may decides to take precaution to get a very solid hardware wallet that may store firm their bitcoin since hack is common nowadays, so I don't think is something worth killing oneself, unlike bank, have you ever go to bank to asked why so so million or billion was transferred to some certain account?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "June 08, 2023, 10:24:57 AM",
      "body": "Quote from: HmmMAA on June 08, 2023, 09:28:17 AMDid satoshi came back to spend his coins ? A very early miner or an early OTC buyer decided to take profits ?Take profit in a bear market when Bitcoin price drops to more than half of its all time high. It does not make sense.QuoteTime will tell . I'll try to dig more to see if i can find anything . Any opinions or findings are appreciated .Many times, it is confirmed as manipulators, whales chose good times to move old bitcoins when market has fud and they did it to create more massive panic in the market.Time well tell but I don't think this time, it will be different.Hal Finney (Bitcoin and me)Payment No. 1: A Closer Look at the Very First Bitcoin TransferHal Finney is a very first person who mined Bitcoin around block #70 and received first Bitcoin transaction from Satoshi Nakamoto. He passed away but his wife still have access to his Bitcoin wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Who is John Galt?",
      "created_time": "June 08, 2023, 10:27:25 AM",
      "body": "Quote from: digaran on June 08, 2023, 10:06:34 AMSo what happens if Satoshi is trying to spend some of his coins? I mean we can't expect him to abandon his coins for the rest of his life, he has to spend them sooner or later, the former is better IMO.Satoshi is a visionary, he created a new monetary system because he foresaw that humanity needed it. If he just wanted to make money on it, he could have done it for a long time and repeatedly. If he hasn't been selling his bitcoins all these years, then why would he suddenly start doing it?If he's still watching bitcoin evolve, he's probably happy that his brainchild has survived and is in such high demand. For a creative person, such recognition is often much more important than money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 08, 2023, 10:33:15 AM",
      "body": "I don't think this guy has any connection to satoshi. He's just probably one of the earliest people that get to know bitcoin and supported it through mining with his potato pc.Quote from: SmartGold01 on June 08, 2023, 10:20:43 AMDoes it really worth doing investigation of the address transaction and bitcoin movement, Let say after dig to know about the address what benefits do you derived from it or what is the result for doing that?I think it's just for pleasure and like being a detective that's been started and done by some other folks in the past. There's the interesting part on these finds because they're the early bitcoins that have been mined and it's like always a news when they've been monitored if they ever move and transfer those BTCs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "June 08, 2023, 10:36:56 AM",
      "body": "Quote from: digaran on June 08, 2023, 10:06:34 AMSo what happens if Satoshi is trying to spend some of his coins? I mean we can't expect him to abandon his coins for the rest of his life, he has to spend them sooner or later, the former is better IMO.I want to know if satoshi come to spend it's coins will it cause a challenge, definitely everyone has purpose of storing its coins, does it mean that if I should have larger coins of different domination and I happened to make up my mind to sell my coins will it cause a traffic in cryptocurrency market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 08, 2023, 10:42:56 AM",
      "body": "Quote from: HmmMAA on June 08, 2023, 09:28:17 AMDid satoshi came back to spend his coins ? A very early miner or an early OTC buyer decided to take profits...I don't think Satoshi came back, maybe some person found his forgotten wallets, or came to know that he/she has the BTC in his wallets but this possibility can not be applied here as i can see wallet was taking transaction till May, 2021. So i think the owner was aware of this wallet and do know the potential of BTC but question is why he didn't book any profits back in 2021 when BTCwas ATH and why he transfered the funds now. I hope he is not wishing to sell hem now, or maybe he wants to moe them to another safe place who knows. There could be many if. Quote from: CryptSafe on June 08, 2023, 09:48:22 AMI think new generation investors should learn from this as it can be a good teacher or point to learn from. Atbthe early stage these investors bought or mined and kept for a longer time believing their investment to pay back after a long time and here this particular investor took profit not just profit but a good amount of money for holding a long time. OP your points are quite alright maybe a good follow up might reveal more to the wallet activities.You are totally right about getting lesson from this wallet's owner. But still, many investors can't do the same as this wallet owner did Like no output in the last 13 years. Only money going in. Like he was a miner back then and not now. And I don't have a rough idea about how much it cost back then in mining l, but i do know he must have another way of earning money from where he face the expenses of mining. Point is, holding do pay off and make people rich but this person would be more rich when BTC was at ATH, well maybe as i said earlier he must have some other plans. I am wondering if he keep them hold more and sell even close to new ATH then he will make more than enough money (haha i know money is never enough)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 08, 2023, 10:43:30 AM",
      "body": "Quote from: livingfree on June 08, 2023, 10:33:15 AMQuote from: SmartGold01 on June 08, 2023, 10:20:43 AMDoes it really worth doing investigation of the address transaction and bitcoin movement, Let say after dig to know about the address what benefits do you derived from it or what is the result for doing that?I think it's just for pleasure and like being a detective that's been started and done by some other folks in the past. There's the interesting part on these finds because they're the early bitcoins that have been mined and it's like always a news when they've been monitored if they ever move and transfer those BTCs.Well, let me take it the way you said for pleasure otherwise I don't see anything interesting in doing a detective task without someone being assigned to it. Besides I don't think Satoshi would do such transaction knowing the vision & Mission of bitcoin, or even if it was Satoshi there is no offense because I believe might also wants to secure & safeguard his assets. Anyone who is holding enough of bitcoin would likely act the same to move their bitcoin to a better place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "June 08, 2023, 10:48:05 AM",
      "body": "According to the block time average of 10 minutes, block #2718 would be around 454 hours after Bitcoin was created, which is about 18-19 days. I do not think that Satoshi was alone in the initial creation. There were records of the invention being talked about in boards and the idea being floated before its deployment. So, it could be any early developer or someone who was watching the idea from well before the first release. Since Satoshi believe in decentralization, there was likely a large following before Bitcoin was deployed. It is quite unlikely that the transaction belongs to Satoshi himself, rather an individual who was mining and following the creation before it was deployed and participated shortly after deployment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 08, 2023, 11:04:04 AM",
      "body": "Quote from: SeriouslyGiveaway on June 08, 2023, 10:24:57 AM~snip~Take profit in a bear market when Bitcoin price drops to more than half of its all time high. It does not make sense.Maybe it doesn't make sense for some people, but put yourself in the position of someone who mined BTC practically at the very beginning with his personal computer and actually spent only a little electricity and his time. Maybe he needs that BTC at this very moment, and maybe it's just that he wants to move it to a more secure storage. Be that as it may, you shouldn't worry too much about the fact that transactions are taking place with coins from the earliest blocks, because we know that there are people who have control over these private keys even today. The fear that Satoshi will suddenly dump his coins is completely unjustified in my opinion, because if he created BTC only for his own profit, he would have profited long time ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "June 08, 2023, 11:19:31 AM",
      "body": "Quote from: Nwada001 on June 08, 2023, 09:41:46 AMMaybe this could actually be someone who has long lost access to the wallet but just recently recovered it and decided to move the funds to a safer destination. It might just be an upgrade in wallet security since all funds are moved into a single address that does not belong to an exchange.I don't think it's a lost wallet that was recovered because the address has been constantly receiving a monthly reward of 0.0000547BTC. If it were other tokens I would have probably thought that the owner staked it in a kind of staking program that generates reward and when the time has elapsed, he/she decided to withdraw it to a different address. Quote from: 348Judah on June 08, 2023, 10:17:43 AMwho knows maybe it's also part of the early users who adopted bitcoin and hodl, the truth is that we cannot know everyone's stand and holdings on bitcoin, we have many whales who have been holding over a long time.Well... These are just speculations but the first deposit of 1,432.92 was made to this address on 8th April 2013. So I don't think it's an early adopter except if it was sent by an early adopter from another address to this one and the owner decided to move it again today to another address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 08, 2023, 12:08:48 PMLast edit: June 08, 2023, 01:00:30 PM by franky1",
      "body": "before anyone asks. no this is not one of satoshis addresseslooking at the satoshi analysishttps://bitslog.com/2013/04/17/the-well-deserved-fortune-of-satoshi-nakamoto/you can see the charts of the nonces of miners are in the chart asl = satoshi/ = othersthe block noted hereQuote from: HmmMAA on June 08, 2023, 09:28:17 AMA transaction of 1432.92 btc happened today https://blockchair.com/bitcoin/address/1E6nViR5Xv1wyNXg87SamvtLJ5TyXuksLC .The odd thing about this address is it ( almost ) contains block rewards from early days , specifically first reward is from block #2718 is in one of the / = others line not the satoshi line....its also worth noting that none of the 50btc amounts moved straight from 2009 to today..they were all actually moved in from 2009 into 2013.. thus its a 2013 holder that moved today not a 2009 holderim going to have a guess and say that someone put his mined coins into mtgox. and those coins have been stuck at the MTGox stash of cold wallets until this year, whereby the administrators of mtgox are now shifting mtgox stash this year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "June 08, 2023, 12:47:53 PM",
      "body": "No need to investigate any further mates, I confess now I did that transaction  .Well for one reason I don't see why we want to investigate about other people funds, I thought the whole essence of this decentralized system is to remain anonymous from the government system and control our funds. But I do agree though, its either an old miner trying to move his funds for safety purpose or an old investor who totally abandoned his BTC allowing it to grow and now back to move it out to safety, well it could be anyone and I don't think knowing him would make  any difference instead I intend to hold such BTC as he did one day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}