{
  "id": "topic_5467964",
  "title": "HighHash",
  "author": "HighHash",
  "created_time": "September 24, 2023, 10:12:41 PM",
  "content": "I know it’s not highly recommended to advertise yourself as a HODLer but I’m interested in getting a cool BTC flat rim. Does anyone have any recommendations on merch stores that are highly reputable/support the ecosystem as well? Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467964",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "September 25, 2023, 02:18:38 AM",
      "body": "Quote from: HighHash on September 24, 2023, 10:12:41 PMI know it’s not highly recommended to advertise yourself as a HODLer but I’m interested in getting a cool BTC flat rim. Does anyone have any recommendations on merch stores that are highly reputable/support the ecosystem as well? Thanks!I see a lot of crypto channels on YouTube that have their own designs and put links to those stores, so I'm not sure if they are as good as they say they are, but I can say that https://bitcoinmerch.com and https://btcmerchshop.com are the best, but it is still an option to use them. Paying for traditional services using cards charged with Bitcoin is an option.Being a HODLer does not mean that you will not spend money, but you will spend it wisely. Bitcoin should be used to buy some things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "September 25, 2023, 08:53:16 AM",
      "body": "Quote from: HighHash on September 24, 2023, 10:12:41 PMI know it’s not highly recommended to advertise yourself as a HODLer but I’m interested in getting a cool BTC flat rim. Does anyone have any recommendations on merch stores that are highly reputable/support the ecosystem as well? Thanks!Hi, the stores mentioned above are indeed reputable. Don't you think this thread should be opened in another board though?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 26, 2023, 02:07:52 AM",
      "body": "How about this website?Cryptwerk - Directory of merchants accepting crypto as paymenthttps://cryptwerk.com/Where to spend Bitcoin?https://spendbitcoins.com/https://spendabit.co/https://lightningnetworkstores.com/https://coinmap.org/https://spending-bitcoin.com/https://cryptoemporium.eu/https://mooningmarket.com/https://usebitcoins.info/https://purse.io/shophttps://mobazha.com/https://www.overstock.com/https://www.newegg.com/https://bitcoin.directory/shophttps://www.acceptedhere.io/https://btcdir.net/https://bitwit.cash/https://bitpr0.com/shopshttps://shopinbit.com/https://debitpay.directory/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 27, 2023, 09:36:32 AM",
      "body": "Quote from: hd49728 on September 26, 2023, 02:07:52 AMHow about this website?Some of these sites are either closed, such as https://www.acceptedhere.io/, or are in maintenance, or need to update the list, but I think what @OP is looking for are services that design or print Bitcoin-related things, such as T-shirts, clothes, pens, books, artwork, and other accessories that you can find under the links to stores of YouTube channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 27, 2023, 12:05:08 PM",
      "body": "I don't know a reputable store that sells that type of merch that's helping them to support the ecosystem if ever you purchase a merch from them. I've tried to look on the Goods section but found none. So my suggestion is just look to your local online e-com stores and maybe there could be some merch available on them or try etsy. Just a reminder that I know that we're proud to be investors or holders of Bitcoin, but don't you forget that you're exposing yourself to the others that you own it and might be targeted by bad people that can do a wrench attack to you. Just as what happened on this news; Armed robbers hold up UK cryptocurrency trader in latest bitcoin heist",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 27, 2023, 12:53:19 PM",
      "body": "Since we are dealing with online stores, there are many merchant that accepts bitcoin which we can make use of, some have this well stated on their websites and we can also get some recommendations from our friends or colleagues we know that uses bitcoin as well in merchant sites, but i think the whole recommendation given from this thread is a good take to choose from the list given, bitcoin has gone far beyond the limitations we can see, it's adoption keep increasing everyday in making payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 27, 2023, 01:06:14 PM",
      "body": "Quote from: HighHash on September 24, 2023, 10:12:41 PMI know it’s not highly recommended to advertise yourself as a HODLer but I’m interested in getting a cool BTC flat rim. Does anyone have any recommendations on merch stores that are highly reputable/support the ecosystem as well? Thanks!Spending Bitcoin doesn't mean you advertise yourself as a hodler, although it can definitely expose the amount of coins you have if you spend from an address that hodls a large amount of your coins. Thus do not reuse addresses, and if you want to use Bitcoin to make online payments, use a newly generated address and send coinjoined/mixed coins to it inorder for you to make the purchase, and afterwards don't use the address anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "September 27, 2023, 01:47:55 PM",
      "body": "Quote from: HighHash on September 24, 2023, 10:12:41 PMI know it’s not highly recommended to advertise yourself as a HODLer but I’m interested in getting a cool BTC flat rim. Does anyone have any recommendations on merch stores that are highly reputable/support the ecosystem as well? Thanks!https://www.bitcoin.com/find-crypto-merchants/ has a database of what you are looking for. I think you must be in the US though because I don't know if these stores offer shipping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 29, 2023, 02:00:40 AM",
      "body": "Correct me I am wrong But I don't think there is a merch shop that supports the project like Bitcoin in Altcoin yes there are a lot like Pancakeswap or Coingecko but didn't hear any store that support directly to Bitcoin. Tho you can find a bunch of merchants that accept Bitcoin as payment or use debit card that use bitcoin as the source of money like people mention above me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 29, 2023, 02:05:39 AM",
      "body": "Quote from: Yamane_Keto on September 25, 2023, 02:18:38 AMhttps://btcmerchshop.comThat's some unexpectedly sick bitcoin-related designs right there. If only the designs were a bit less in-your-face with the \"Bitcoin\" wordings, as to at least not expect everyone to know that I know about Bitcoin — but rather only the enthusiasts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "September 29, 2023, 06:57:10 AM",
      "body": "Quote from: mk4 on September 29, 2023, 02:05:39 AMThat's some unexpectedly sick bitcoin-related designs right there. If only the designs were a bit less in-your-face with the \"Bitcoin\" wordings, as to at least not expect everyone to know that I know about Bitcoin — but rather only the enthusiasts.Indeed, but I wasn't able to find \"pay with BTC\" option, either on-chain or LN. Have you been able to find this option?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 30, 2023, 07:33:31 AM",
      "body": "Quote from: apogio on September 29, 2023, 06:57:10 AMIndeed, but I wasn't able to find \"pay with BTC\" option, either on-chain or LN. Have you been able to find this option?Well that's awkward; I couldn't find any BTC option as well. A bitcoin merch shop not accepting bitcoin despite the likes of BTCPay and even the monstrosity that is BitPay are readily available. Nice catch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "September 30, 2023, 07:35:44 AM",
      "body": "Quote from: mk4 on September 30, 2023, 07:33:31 AMQuote from: apogio on September 29, 2023, 06:57:10 AMIndeed, but I wasn't able to find \"pay with BTC\" option, either on-chain or LN. Have you been able to find this option?Well that's awkward; I couldn't find any BTC option as well. A bitcoin merch shop not accepting bitcoin despite the likes of BTCPay and even the monstrosity that is BitPay are readily available. Nice catch.   In fact I tried to order a t shirt and a mug and I was gonna pay with LN . I even told myself \"ok, no worries, even if it's on-chain, I will buy despite the fees\". Haha but none of these options. Anyway",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}