{
  "id": "topic_5425748",
  "title": "atuzai660619",
  "author": "atuzai660619",
  "created_time": "December 04, 2022, 07:17:05 PMLast edit: December 05, 2022, 09:15:02 AM by atuzai660619",
  "content": "Within 20 years, its financial status and role exceeded that of gold, and it became the most important international currency in the world within 50 years.To me, these two things are about as certain as the Earth will still be orbiting the sun in 50 years。What's the reason?There is no better international currency than Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425748",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "December 04, 2022, 07:28:31 PM",
      "body": "Bitcoin vision is to be a peer to peer network which would remove the need for an intermediary between transactions and give its holders the freedom to handle their finances while remaining pseudo anonymous.Any other vision can be said to be ones personal expectation of the network and how adoption would improve with time.A lot is still yet to be seen about the future of Bitcoin; with the current rate of growth it looks very optimistic, and I would expect more use ases for Bitcoin being discovered and improvements being made to make it more suitable for daily purchases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "December 04, 2022, 07:54:09 PM",
      "body": "The Bitcoin vision is one that is set in stone and has no plans to be changing in the future, the only thing looking to change is price which will certainly get favorable for both hodlers and investors. Bitcoin has a vision to also create a new form of money without the necessary appraisal of a central issuer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "December 04, 2022, 08:03:27 PM",
      "body": "The Government and Bank's are nothing to write about regarding how harassing it is when one finds out about the harm done by both unknowingly to people using bank's. Satoshi saw the flaw's in the usage of fiat currencies which lead to him creating Bitcoin, meant to be used for Peer to Peer transactions and everyone is meant to his own custody which we know that using exchange has defeated that vision of self custody alone.One reason I see Bitcoin gives is liberty, The bigger thr government grows the lesser then for libertos. Usage of Bitcoin without any middle man reduces the harm and ambush caused by banks and governments. The increments in the usage of Bitcoin causes harm to government plans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "December 04, 2022, 08:03:48 PM",
      "body": "First of all things gets changed with the passage of time and you know everything has an expiry date you can consider this concept in the Bitcoin vision.Is Bitcoin Vision also Time dynamic?I don't know, Still, my observation is in the financial time line the store value concept is dynamic always until the Bitcoin vision is considered, But sometimes dynamic nature changes itself to the static one may be this can be the same kind of shift.The dynamic Store of value concept is changing into the static Bitcoin Vision",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 04, 2022, 08:17:54 PM",
      "body": "Quote from: atuzai660619 on December 04, 2022, 07:17:05 PMWithin 20 years, its financial status and role exceeded that of gold, and it became the most important international currency in the world within 50 years.To me, these two things are about as certain as the Earth will still be orbiting the sun in 50 years。Is this what the whitepaper says or are you saying this from your own assumptions and expectations?It's all good by the way, we all want bitcoin to achieve height as well as good success, 50 years from now is a very long time and I believe that before that time, alot of things might have changed. By then, it is either bitcoin and cryptocurrencies are dead and replaced with another undeveloped technology or bitcoin and cryptocurrencies have taken over the entire financial system and have become the dominant source of exchange/payment for goods and services. Which ever it is, it is my prayer that we all be alive to indeed the witness the very end of this fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 04, 2022, 09:34:53 PM",
      "body": "That prediction will be right if people lose trust in fiat currencies and if fiat currencies continue losing value accelerated. Then we might see a notable increasement in bitcoin adoption, turning it into the main currency in the world, although volatility will be still present, unless whales lose domain by spliting the coins they currently hold among more investors' hands.All the scenarios are totally unclear and uncertain. There are a lot of economical and social factors which will impact the future of finances in the world and the future of bitcoin as currency. 20-50 years is a very long time period to make correct assumptions. The fact is that only time will tell what the future holds for bitcoin and its adopters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "December 04, 2022, 09:48:52 PM",
      "body": "Quote from: atuzai660619 on December 04, 2022, 07:17:05 PMWithin 20 years, its financial status and role exceeded that of gold, and it became the most important international currency in the world within 50 years.To me, these two things are about as certain as the Earth will still be orbiting the sun in 50 years。Not sure where you get this statement though, I don't think that bitcoin will exceed gold in the next 50 years. I know that it has been compared many times already even in this community and it's more evident way back in 2017 when we are about to hit the bull run.But then again do we really need to compare the two assets?Let bitcoin run it's course in the next 20 or 50 years and see how it does as an assets to us enthusiast. We don't need it to balance it against gold or any other assets or commodities that we have right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 04, 2022, 09:51:20 PM",
      "body": "Technology had such a quick progress and advance in the last five decades that it is extremely hard to predict what is going to happen over the next five decades.  Blockchain exists already and a considerable number of developers are actively working on building a better version of what is currently known as Blockchain.  In the next five decades, we may get to see a much better version of Bitcoin.I am thinking of this because I believe Bitcoin has some missing fragments that are going to be solved in the future.  Bitcoin currently relies on the Internet and on Electricity for example.  Maybe with the future technology advancement we can fix that and bring Bitcoin to the offline world.Things will change.  If nothing better ever comes out, then I agree.  Bitcoin will be unbeaten.  Otherwise, we are looking at a replacement and it could bring dire consequences if people lose interest.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "December 04, 2022, 09:54:38 PM",
      "body": "Quote from: uneng on December 04, 2022, 09:34:53 PMThat prediction will be right if people lose trust in fiat currencies and if fiat currencies continue losing value accelerated. Then we might see a notable increasement in bitcoin adoption, turning it into the main currency in the world, although volatility will be still present, unless whales lose domain by spliting the coins they currently hold among more investors' hands.All the scenarios are totally unclear and uncertain. There are a lot of economical and social factors which will impact the future of finances in the world and the future of bitcoin as currency. 20-50 years is a very long time period to make correct assumptions. The fact is that only time will tell what the future holds for bitcoin and its adopters.20-50 years is indeed too long when it comes to crypto. we are not very sure if in the future something will be created as better and more innovative. we can't guarantee the lifespan of btc to anyone. so yeah, just be grateful for what we have today, and make the most out of it while it has still value in the market. no one can exactly tell us what's gonna happen next. we are just waiting for what's next...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "December 04, 2022, 10:02:07 PM",
      "body": "Quote from: Fivestar4everMVP on December 04, 2022, 08:17:54 PMQuote from: atuzai660619 on December 04, 2022, 07:17:05 PMWithin 20 years, its financial status and role exceeded that of gold, and it became the most important international currency in the world within 50 years.To me, these two things are about as certain as the Earth will still be orbiting the sun in 50 years。Is this what the whitepaper says or are you saying this from your own assumptions and expectations?It isn't stated on the whitepaper but the lines stated by @OP may happen.  I don't consider it a vision but rather the result of Bitcoin Vision.ThisQuoteA purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.and thisQuoteThe cost of mediation increases transaction costs, limiting theminimum practical transaction size and cutting off the possibility for small casual transactions,and there is a broader cost in the loss of ability to make non-reversible payments for nonreversible servicescan make Bitcoin the most important international currency in the world because of these characteristicsBoundlessCheaper transaction (international transfer)Frictionlessnon-reversible transactionand does not need a financial institution to complete the transfer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 04, 2022, 10:12:23 PM",
      "body": "Quote from: PrivacyG on December 04, 2022, 09:51:20 PMMaybe with the future technology advancement we can fix that and bring Bitcoin to the offline world.I've seen news about sending bitcoin just through bluetooth and radiowaves. Well, yeah we don't know what's with the future and it's certainly unpredictable. But it's possible that we might see transactions going offline and there will be an alternative with the need of internet. There could be solutions on this one and we all agree that within the next years that bitcoin is hard to be beaten by any other projects and payment processors as majority of them have started to join.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "December 04, 2022, 10:37:16 PM",
      "body": "Things are really possible regarding its development in the future. But what's crucial is to know at the present if the demand would be still high in the future if this technology would be regulated by governments (which is necessary for adoption to take place; as in line with the goal of cryptocurrencies). Right now, more countries are trying to allow the usage of this blockchain on transactions but also, there are still many countries who are doubting the benefit of using Bitcoin and other cryptos as a mode of payment given that volatility is present with its market value which could endanger the money of non-crypto users if they'd choose to also engage. Another thing is taxation which is a concern by governments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S A KHAIR",
      "created_time": "December 04, 2022, 10:48:19 PM",
      "body": "Quote from: Rigon on December 04, 2022, 10:16:12 PM  But if Bitcoin survives for the next 5 decades then our current use of paper money will almost stop.The use of paper money may stop in the future but what about CBDC, if bitcoin can survive by then then CBDC or another government coin will also exist then. I never dared to think that bitcoin could replace fiat as long as the government exists, it never will or it will happen unless the government finds a way to control it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizhixinxjny",
      "created_time": "December 05, 2022, 03:27:29 AMLast edit: December 05, 2022, 07:50:16 PM by lizhixinxjny",
      "body": "you are right?  Maybe! I don't think governments will allow that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "December 05, 2022, 03:49:00 AM",
      "body": "I wouldn't say this. A couple of decades from now, Bitcoin will definitely be a respected asset and currency. But will it surpass gold in its role in finance, economics, and wealth management? I won't say it is certain. It is possible though. 50 years from now, Bitcoin will also be respected more as an international and borderless currency, but will it become the most important international currency? It is possible but I won't claim it as certain as the sun would rise in the east tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "December 05, 2022, 05:28:28 AM",
      "body": "OP, that is pure speculation and you are giving zero reasons to motivate why you are saying that it will happen. Bitcoin has only been accepted as a currency in a few countries, so I cannot see why it will suddenly change in the near future.  Also, most governments are working on their own \"digital\" currencies that are built on Blockchain technology, so it is clear that they are not going to accept Bitcoin as a currency. Let's posts facts or reasons for our predictions, when we post something like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ilovealtcoins",
      "created_time": "December 05, 2022, 05:49:23 AM",
      "body": "Your prediction is too far, it is better to focus on the present. If I were you, I would focus on accumulating bitcoin from now on and hold until the time is good enough to get the best profit. What the future of bitcoin will look like, let it prove and time will tell. Don't try to predict the future when nothing is certain, it may be true as you say or it will also disappear when something better takes its place. The future is unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "December 05, 2022, 05:53:53 AM",
      "body": "Good to see as optimistic as you on the future of Bitcoin. We know for sure that Bitcoin is here to see despite the many hurdles of challenges thrown into it to make it ineffective, unattractive and just futile to be with. There are many people who are against Bitcoin and am sure that there are those who are funding a campaign to make this whole deal unpalatable to as many possible users as possible. There are platforms which are openly not in favor of Bitcoin and there are governments refusing to acknowledge it even as an asset. Despite the increasing attacks against Bitcoin, the future can still be looking good for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "liyikecoco",
      "created_time": "December 06, 2022, 10:19:27 AM",
      "body": "Are you being too optimistic? I think it's almost impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}