{
  "id": "topic_5401086",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "June 02, 2022, 08:34:22 AM",
  "content": "El gobernador del Banco de España ha alertado nuevamente de los riesgos que ve con las criptomonedas, destacándose las siguientes reflexiones:-   Son un riesgo de inversión debido a su enorme fluctuación (-40% en 5 meses).-   No son adecuados para inversores minoristas debido a lo anterior y a su complejidad.-   Son un riesgo para el sistema financiero, dado que arrastran las bolsas tradicionales al estar cada vez más entrelazados.-   Riesgo con los EFTs, fondos de inversión y la aceptación de las monedas virtuales como medios de pago.-   Desinformación por parte de los inversores.-   Dimensión del mercado cripto superior al de las hipotecas de alto riesgo pre-crisis 2008.Lo anterior lo indicó en la clausura del curso académico en Esade. Lo interesante sería conocer precisamente la opinión de los alumnos de Esade que asistieron al evento, los cuales, además de tener un mayor potencial para invertir a nivel particular, son propensos a ser ejecutivos de grandes corporaciones en los años venideros.Ver: https://www.diariobitcoin.com/negocios/verticales/bancos-y-pagos-verticales/gobernador-del-banco-de-espana-dice-que-criptomonedas-y-bolsa-de-valores-estan-cada-vez-mas-entrelazados/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401086",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "June 02, 2022, 02:52:21 PM",
      "body": "Del OP:-   Si, es verdad. -   Bueno, es aquí lo que las hace tan accesibles y populares, con WS era un alcance de pocos.-   Bueno, son un riesgo para todos, aunque si se jode el sistema financiero se jode siempre más el de a pie-   Es algo ya mencionado...en todo caso quien lo administre debería saber que es lo que hace.-   Esto es verdad, lea los puntos anteriores mencionados por usted hay medias verdades, medias mentiras, eso es desinformación también.-   Esa crisis es lo que nos tiene afortunadamente discutiendo si las criptomonedas pueden ser una solución.....No soy alumno pero diría eso,fM, saludos profe, esos son mis dos satoshis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "June 02, 2022, 07:48:47 PM",
      "body": "Quote from: DdmrDdmr on June 02, 2022, 08:34:22 AM-   Son un riesgo de inversión debido a su enorme fluctuación (-40% en 5 meses).Si bien (varios lo saben) creo que la volatilidad del Bitcoin es un problema, siempre me molestó ese particular tipo de argumentación.Uno podría creer que el Bitcoin siempre valió más de $50.000 - ¡y de repente cayó 40%! La información que se pierde en tal afirmación es que en los 6 últimos meses de 2021, el Bitcoin subió por un porcentaje similar al que cayó en los primeros meses de 2022. Es decir, que los $50-70K eran precios muy altos comparados con el desarrollo anterior.Para tener una idea más completa de lo que pasa con el precio, es muy aconsejable mirar más las medias móviles (SMA y EMA) de 200 días para arriba. Ni el SMA-200 ni el EMA-200 superaron los $50.000 por ejemplo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 10, 2022, 09:47:01 PM",
      "body": "Que se alerte sobre determinados riesgos está bien, y yo diría que es necesario dado lo nuevo que es esto (ya va más 13 años, pero bueno) y lo desinformada que está la población general.Pero de ahí a hacer determinadas afirmaciones, a mí me surge la duda de si se las cree de verdad, o sencillamente van con el cargo y no tanto con la persona. En todo caso mis respetos, oye. Si exigimos tolerancia también tendremos que ofrecerla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 11, 2022, 12:02:01 AM",
      "body": "Quote from: Porfirii on July 10, 2022, 09:47:01 PMQue se alerte sobre determinados riesgos está bien, y yo diría que es necesario dado lo nuevo que es esto (ya va más 13 años, pero bueno) y lo desinformada que está la población general....//...,,,Creo que lo mencione hace tiempo, la poblaciòn siempre estará desinformada, la gente no sabe todavía a estas alturas que es un swift (e.g.) y si lo conoce no tiene NPI de como funciona e incluso a veces no tiene claro que fees paga solo sabe que los \"clavan\" en el banco emisor(su banco) un banco intermediario y el banco que recibe, y de paso el que recibe le puede decir, el monto màs los fees.Una vez, le envíe a un amigo un monto, redondeamos a $100 para hacer el ejemplo fàcil y entonces sacando los fees \"normales\" que mencione antes le llegaron a su cuenta $84, respuesta de esa persona, entiéndase que cambia amigo por persona; ey, no enviaste completo, le dije debes tener $100 si tienes menos es tu banco, resulto que el banco le estaba cobrando mantenimiento de cuentas atrasados, ya que la cuenta estaba o tenias varios meses por debajo del limite mensual, primero èl pudo estar haciéndose el \"willis\" o realmente no sabia y de mi parte debì tenerlo en cuenta en la conversaciòn previa.El asunto con lo anterior es, que todavìa hoy en dìa las personas tienen cuentas y no manejan la informaciòn correspondiente, están desinformados. Estamos hablando de Fiat por si acaso",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 11, 2022, 07:38:46 AM",
      "body": "A ver, riesgo por descontado que lo hay, y no creo que sea la gente tan ilusa de no conocer que existe. Ahora bien, también existe la posibilidad de poder ganar lo suyo según juegue unos sus cartas, y este es el atractivo para la mayoría, más allá del uso operativo que tiene para otros.Exagerando un tanto, es como si se tuviese que estar avisando día si día no de los riesgos de jugar a las loterías del estado, donde la probabilidad de perder es casi del 99,999….%. Los avisos son sobre todo para los adictos al juego, pero la mayoría de las personas no lo son y no se les da la tabarra con las probabilidades de perder lo \"invertido\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 11, 2022, 09:47:25 PM",
      "body": "Quote from: famososMuertos on July 11, 2022, 12:02:01 AM...Aunque cierto esto nunca ha dejado de ser un misterio para mí. Dado nuestro tiempo y energía limitados es de esperar que no podamos dedicar nuestro tiempo a absorber todo el conocimiento que podamos y por lo tanto siempre tendremos que tomar atajos.Por ejemplo, en el caso de los automóviles la mayoría de las personas están contentas tan solo con saber conducirlos, aunque no tengan ni la más mínima idea de cómo funcionan o como reparar uno.Sin embargo, en el caso de nuestras finanzas existe un claro desconocimiento de la población en general acerca de cómo funciona el dinero en sí, la economía, los intereses y sus cuentas bancarias, cosa que es de extrañarse debido a que las personas pasan una gran cantidad de sus vidas intercambiando su tiempo, esfuerzo y conocimiento por dinero para cubrir sus necesidades.Y por lo tanto un aprovechamiento más efectivo de ese dinero parecería ser casi obligatorio para así llevar vidas más llevaderas, cosa que no es así, y aunque el desconocimiento es auspiciado desde las más altas esferas nunca has existido una época donde sea más fácil adquirir este conocimiento y aun así la mayoría de la población permanece ignorante ante la realidad enfrente de ellos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 11, 2022, 11:09:10 PM",
      "body": "Quote from: Silberman on July 11, 2022, 09:47:25 PMQuote from: famososMuertos on July 11, 2022, 12:02:01 AM...Aunque cierto esto nunca ha dejado de ser un misterio para mí. Dado nuestro tiempo y energía limitados es de esperar que no podamos dedicar nuestro tiempo a absorber todo el conocimiento que podamos y por lo tanto siempre tendremos que tomar atajos.,,,,...//...,,,,Sin embargo, en el caso de nuestras finanzas existe un claro desconocimiento de la población en general acerca de cómo funciona el dinero en sí, la economía, los intereses y sus cuentas bancarias, cosa que es de extrañarse debido a que las personas pasan una gran cantidad de sus vidas intercambiando su tiempo, esfuerzo y conocimiento por dinero para cubrir sus necesidades.Y por lo tanto un aprovechamiento más efectivo de ese dinero parecería ser casi obligatorio para así llevar vidas más llevaderas, cosa que no es así, y aunque el desconocimiento es auspiciado desde las más altas esferas nunca has existido una época donde sea más fácil adquirir este conocimiento y aun así la mayoría de la población permanece ignorante ante la realidad enfrente de ellos.  Con lo anteriormente de tu cita, es el punto no podemos saberlo todo, bien dicho, y es lo que expreso en mi post anterior, estamos ahì en el punto de las realidades, pero cuando menciono fees, swift, etc, no estoy hablando de escenarios técnicos, ni siquiera entender que significan, por ejemplo, cada uno de los nùmeros que lo componen (x.e. Swift) que no es tan difícil, es simple informaciòn. Quote from: Silberman on July 11, 2022, 09:47:25 PMQuote from: famososMuertos on July 11, 2022, 12:02:01 AM......//...,,,Por ejemplo, en el caso de los automóviles la mayoría de las personas están contentas tan solo con saber conducirlos, aunque no tengan ni la más mínima idea de cómo funcionan o como reparar uno....///...:::Es decir, que no tienen ni las mas mínima idea de como funcionan, correcto, pero si deberían (deben) saber que tienen que usar una licencia de conducir, un seguro que cubra su vehículo y el de terceros, los papeles de el vehículo, el mantenimiento del vehículo y dirás es obvio, bueno hay gente que conduce sin licencia y el mantenimiento o cambio de aceite del motor les da igual cuando lo hacen.Esa parte es el equivalente de lo que hablamos aquí en el comparativo de saber la información básica relacionada, asì que la parte técnica es como funciona el vehículo. (Traigo en referencia el automóvil porque es tu ejemplo,es tu coche    )Entonces! no es cuestión de absorber o perder tiempo, es lo básico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 17, 2022, 11:10:09 PM",
      "body": "Supongo que la gente en general sigue el método de vida convencional y se guía por lo que ve en su alrededor, sin complicarse más allá la vida. La gente se hipoteca hasta la edad de jubilación, y para nadie debe ser plato de buen gusto, pero como todo el mundo lo hace... es un ejemplo como otro cualquiera pero denota que la mayoría prefiere seguir el camino marcado, aunque involucre el trabajo de toda su vida, antes que pararse a pensar en si tiene sentido.Y como decís, el conocimiento está ahí. Pero el problema no es la disponibilidad de la información, sino la actitud de los ciudadanos. Pan y circo, influencers, y dios me libre de tener que leer o pensar en cosas extrañas como eso de las criptomonedas y ser mi propio banco, aunque esté hasta el gorro de pagar comisiones por todo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 18, 2022, 09:50:29 AM",
      "body": "Yo pensaba que, a estas alturas, los bancos ofrecerían productos y servicios entorno a bitcoin y otras criptomonedas de una manera casi generalizada. Aunque hay escaramuzas en este sentido, es un tanto restringido por parte de la banca en términos geográficos y del nicho de población al cual se lo ofrecen. Probablemente, las presiones regulatorias están detrás de echar el freno de mano a algo que parecía podría coger impulso. Una vez establecida una legislación clara, es probable que veamos un impulso a este tipo de servicios por parte de la banca (para el tipo de público objetivo que no quiere ni sabe nada acerca de la autocustodia).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}