{
  "id": "topic_5418119",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "October 24, 2022, 07:19:54 AMLast edit: October 24, 2022, 01:14:10 PM by Oshosondy",
  "content": "Know that leverage trading is highly risky. This is not about leverage trading though, but about using leverage as an investment. Be it trading or investment using leverage, it is highly risky. The more the leverage, the more would be the risk. I remember in 2020, I knew bitcoin would hit at least $30000, but surprisingly it goes above. When bitcoin got to $20000, I opened a long position from 50 to 125x using BTC/USDT perpetual future and all got liquidated as bitcoin price fall slightly most of the time before it continues its bull market. Leverage trading can be profitable but not advisable because it is highly risky and can turn a rich man to a poor man in minutes, hours or days.In future trading, I can open a perpetual position using leverage, because it is not a week, a month or quarterly, this type of position opened do not close at any specific date. It has been the best I can use during bull run. Quarterly is not also bad, but I prefer perpetual which most traders are using.The problem is that it is not good to leave your coin on exchanges, the best and safe place your coin can be are on wallets, noncustodial wallet to be specific, which you can hold and protect its private key.During bull run, some people may decide to leverage their coins and go on like 2x which is still safe to some people in a way bitcoin can still not get to liquidation price or the chance to get to liquidation price is still low. You can not hold 2x on a wallet, you have to leave your coins on exchanges and this may be up to a year or more that you want to hold your coins using like 2x leverage. What ways can use maximally protect your coins if you are a leverage holder?This question is funny though, but just want to see the opinions of others about this. Or someone should not hold using leverage because of the reason of risks of going for leverage trading for maximising profit?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418119",
  "comments": [
    {
      "author": "mk4",
      "created_time": "October 24, 2022, 07:34:18 AM",
      "body": "Using exchanges is fine despite the risks; just use the ones that are already very reputable to start with. It's not like you're going to put in 50%+ of your total capital into the exchange for leverage, as obviously that's a very irresponsible amount to risk for most cases.On the other hand you can use non-custodial DEXs — but that proposes other risks such as smart contract exploits so I really can't recommend this option for significant amounts of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 24, 2022, 11:30:08 AM",
      "body": "Wow leverage trading in cryptocurrency and also storing in exchanges that's too way risky.Personal it depends on the amount. I would suggest it been splitted into two or more reputable exchanges since it would quite be rare to have 2+ exchanges suffering hacks or maybe centralization issue at the same time. At least with maybe one exchange having issue it gives you little time to access to the funds in the other exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 24, 2022, 11:40:41 AM",
      "body": "Quote from: Zaguru12 on October 24, 2022, 11:30:08 AMWow leverage trading in cryptocurrency and also storing in exchanges that's too way risky.I think 'storing' in this case refers to how your fund is locked since you're opening a position. I don't think that's unavoidable unless you use a dex, but the volume would then be an issue. IMO just keep this in mind and avoid opening a very long time-locked position if you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 24, 2022, 02:17:49 PM",
      "body": "My experience and issue with trading on exhcnsges for holding positions is that the fees are normally too high if you're doing something like that.I opened at 20x long around the $20k region on the way up and held it for a few months, I sold at $63k for about 150% of the value (in bitcoin) I put in (the fees ate up the rest). It did perform better than the spot market but based off the risk and how bored I was checking the position I don't think I'll be trying it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 24, 2022, 07:57:23 PM",
      "body": "I use to recommend never go with the future trade even if you are 100% sure about Market still try to avoid it as its toxic for the your funds. My point of view is play it safe why playing the Wide Ball to be Caught Out haha and its the case in the future trade. Your Points are valid. New dears be careful dont get trap in the greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "October 24, 2022, 08:55:16 PM",
      "body": "Quote from: Oshosondy on October 24, 2022, 07:19:54 AMThis question is funny though, but just want to see the opinions of others about this. Or someone should not hold using leverage because of the reason of risks of going for leverage trading for maximising profit?Well, when you know what the risks are then of course you will be very careful before making a decision. Not only can you expect profit where the potential loss is so real by adopting this trading strategy, so if it's known properly then I don't think you need to put a lot of money on something high risk like this.I tend to recommend you to invest without a very high leverage strategy, it clearly proves to be risky. So you just need to consider investing normally without expecting multiple multiplier for big profits even though the risk will be worth the payoff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 24, 2022, 11:31:55 PM",
      "body": "Quote from: Oshosondy on October 24, 2022, 07:19:54 AMI remember in 2020, I knew bitcoin would hit at least $30000, but surprisingly it goes above. When bitcoin got to $20000, I opened a long position from 50 to 125x using BTC/USDT perpetual future and all got liquidated as bitcoin price fall slightly most of the time before it continues its bull market.That was so much exposure there. Even at 50x, it's still considered to be high risk let alone the 125x you increased it to. Once it comes to trading, you've to remember that nothing is certain. Even when you know price is going to get to a certain level and you're very sure of it, it's still not advisable to take unmitigated risk. With 50x price wouldn't have liquidated you at the level it did with 125x. Perhaps, you still would've been safe (and saved) and in profit on that trade.QuoteThe problem is that it is not good to leave your coin on exchanges, the best and safe place your coin can be are on wallets, noncustodial wallet to be specific, which you can hold and protect its private key.No serious minded trader will agree to that and say they won't keep their money on exchanges. Whenever I read about those advising against keeping money on exchanges, I know who truly doesn't trade for a living or who doesn't even trade at all or that often.QuoteThis question is funny though, but just want to see the opinions of others about this. Or someone should not hold using leverage because of the reason of risks of going for leverage trading for maximising profit?I just came into this leverage trading in cryptos newly and I haven't done much trading with it. For the few I've done I leveraged on 5x or 10x and that's with short time trades. I haven't held a future trade for more than 36hrs. If I'm to hold a trade on leveraging, it certainly won't be more than those parameters I've been using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 25, 2022, 12:07:19 AM",
      "body": "Quote from: Oshosondy on October 24, 2022, 07:19:54 AM(....)This question is funny though, but just want to see the opinions of others about this. Or someone should not hold using leverage because of the reason of risks of going for leverage trading for maximising profit?If you are just planning to have a long position with leverage and you plan to hold or not close the trade for a long time, better to do it on spot trading. But if you are catching the bottom with leverage, then it's good for you. Wicks during the bull market or bear market are insane, lot of traders are being stop-loss hunted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 25, 2022, 02:31:56 AM",
      "body": "I don’t understand the post of this.You opened a 100x leverage position on perp futures and got liquidated. So you are saying you won’t get liquidated with the monthly future expires? If you use 100x on the future monthly or quarterly contracts you will still get liquidated. Only difference with those and perps is that the futures contracts have no funding rate while perps do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 25, 2022, 07:19:21 AM",
      "body": "Quote from: Zaguru12 on October 24, 2022, 11:30:08 AMPersonal it depends on the amount. I would suggest it been splitted into two or more reputable exchanges since it would quite be rare to have 2+ exchanges suffering hacks or maybe centralization issue at the same time. At least with maybe one exchange having issue it gives you little time to access to the funds in the other exchanges This is a very good idea, I have also thought of it times without number. It may bring some inconvenience, but it is actually worth it. Even wouldn't be that inconvenience for leverage holders.Quote from: GreatArkansas on October 25, 2022, 12:07:19 AMIf you are just planning to have a long position with leverage and you plan to hold or not close the trade for a long time, better to do it on spot trading. But if you are catching the bottom with leverage, then it's good for you. Wicks during the bull market or bear market are insane, lot of traders are being stop-loss hunted. If I get you correctly, you meant instead of using derivative trading, to open a margin trading position using the bitcoin spot price is better? Any detailed explanation about margin trading over derivative trading in a position opened over long time period?Quote from: adaseb on October 25, 2022, 02:31:56 AMYou opened a 100x leverage position on perp futures and got liquidated. So you are saying you won’t get liquidated with the monthly future expires? This is about opening a position for a long time using the perpetual trading pairs, it has nothing to do with weekly or monthly pairs.Quote from: adaseb on October 25, 2022, 02:31:56 AMIf you use 100x on the future monthly or quarterly contracts you will still get liquidated.It depends on if the position open before it closes favour you or not. Also know that this is about holding position for a long time using perpetual trading pair which makes your post like off topic to what we are discussing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 27, 2022, 03:02:42 PM",
      "body": "I am not really a kind of person who takes high risks because the returns can be higher than conventional, I just go with the spot trading cause even if I lose still its from my hand not the money of others that may help us to keep more calm even when the market is not doing really good still we can hold our nerve until the good days arrive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 27, 2022, 08:30:50 PM",
      "body": "Quote from: Oshosondy on October 24, 2022, 07:19:54 AM...During bull run, some people may decide to leverage their coins and go on like 2x which is still safe to some people in a way bitcoin can still not get to liquidation price or the chance to get to liquidation price is still low. You can not hold 2x on a wallet, you have to leave your coins on exchanges and this may be up to a year or more that you want to hold your coins using like 2x leverage. What ways can use maximally protect your coins if you are a leverage holder?..If you trade on a centralized exchange, then you must approach the choice of an exchange for trading with full responsibility. But I think that the best solution in your case is to take a loan from a traditional bank, which in any case will be lower than you will have to pay on the stock exchange. In this case, you will not need to store your money on the exchange and you will be able to withdraw your coins to your personal wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 28, 2022, 06:57:38 AM",
      "body": "Quote from: Ratimov on October 27, 2022, 10:54:03 PMAny leverage above x2 is the death of the deposit at a distance. I do not understand those gamblers who try to trade with leverage, for example x25, x50, x75. This is madness. It is because they are newbies, or maybe some people just want to gamble. Any trader that wants high return of equity should be seen as a gambler. Even going 10x is higher.Quote from: Ratimov on October 27, 2022, 10:54:03 PM- If you received a losing trade, do not try to increase the risk in order to return the deposit to the previous values ​​as soon as possible (this is a martin gale strategy, and it is unprofitable)I have naturally known this, I do not know it is called martin gale strategy until now. Just like trading could be a failure for new traders, also the strategy can be a failure for those that did not appropriately discipline themselves while using it. I can see this strategy useful in cases like having plan to trade with certain amount of money, but dividing it and using just lower amount to trade. Example is you having $1000 to trade, but you always trade with 0.5x of it which is $500, if the trade fail, you can then increase it to $1000 to bring the entry price closer whenever indicators told you to do so. But if done wrongly, it would result to maximum losses after also bringing the liquidation price closer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "October 28, 2022, 12:40:18 PM",
      "body": "I disagree if anyone recommends leverage investment. You can not use leverages and keep your positions too long. Pressure of loan repayment, forced liquidations will not allow you to actually invest.Investment means using your own money to buy an asset and invest in it. The investment should be opened for a long time and without risk or pressure of using that money for other purposes like electricity, water bills, health care bills ...Before you invest with your money, you should have another money resource for electricity, water bills and other regular bills as well as sudden expenses for health issues, accidents ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "October 29, 2022, 06:28:03 AM",
      "body": "Quote from: tvplus006 on October 27, 2022, 08:30:50 PMQuote from: Oshosondy on October 24, 2022, 07:19:54 AM...During bull run, some people may decide to leverage their coins and go on like 2x which is still safe to some people in a way bitcoin can still not get to liquidation price or the chance to get to liquidation price is still low. You can not hold 2x on a wallet, you have to leave your coins on exchanges and this may be up to a year or more that you want to hold your coins using like 2x leverage. What ways can use maximally protect your coins if you are a leverage holder?..If you trade on a centralized exchange, then you must approach the choice of an exchange for trading with full responsibility. But I think that the best solution in your case is to take a loan from a traditional bank, which in any case will be lower than you will have to pay on the stock exchange. In this case, you will not need to store your money on the exchange and you will be able to withdraw your coins to your personal wallet.We are only responsible for our own funds or whatever happens with it but a good exchange must also have a robust security so that it won't be penetrated by hackers easily. It's important if we will store our funds there for a long time but it wasn't really recommended though so it's better if we can just follow your idea.One of the ways to protect our coin is by of course setting up a strong password and then setting up a 2fa. @Findingnemo I think it's okay to take a high risk as long as the return is also high. If you are still scared then it's okay to stay with your comfort zone. Leverage trading are only for those who are looking for an extreme way of making money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "October 29, 2022, 06:31:38 AM",
      "body": "Quote from: Oshosondy on October 24, 2022, 07:19:54 AMThis question is funny though, but just want to see the opinions of others about this. Or someone should not hold using leverage because of the reason of risks of going for leverage trading for maximising profit?Using leverage during bull markets is way to risky for my own risk appetite. There are a few factors which make it a not a good idea in my opinion. First of all, markets are not rational during bull markets. You are right that you can maximise your profits using leverage, but it's much harder to predict market movements when investors are irrational. One bad news could send prices flying again. Another factor is that volatility is higher during bull markets, which means price jumps are larger and the chances to get wiped out and your positions being liquidated is also much higher.  The third factor which is against using leverage during bull markets, is that the borrowing cost are rising. At the moment we are seeing interest rates being hiked by central banks all around the world, that increases borrowing cost on loans. The last factor for me is that the opportunity cost have risen during bull markets. With higher interest rates on your bank account you need to make a higher profit in trading to compensate for that. In my opinion it’s better to limit your downside risk during bear markets, I would rather focus on preserving my portfolio than try to maximise profit. During bull markets it’s better to focus on maximising returns as they are more opportunities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 29, 2022, 09:41:24 AM",
      "body": "Quote from: justdimin on October 29, 2022, 06:28:03 AMWe are only responsible for our own funds or whatever happens with it but a good exchange must also have a robust security so that it won't be penetrated by hackers easily. ..Now almost any exchange can be hacked, but in this case it is very important how the exchange will react to such theft of coins and at whose expense this loss will be compensated. Two years ago, Binance returned the stolen funds after hacking at the expense of SAFU funds. The KuCoin exchange reacted in a similar way, which also compensated losses to its participants. That's why I chose these cryptocurrency exchanges for trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "October 29, 2022, 07:56:15 PM",
      "body": "Quote from: tvplus006 on October 29, 2022, 09:41:24 AMQuote from: justdimin on October 29, 2022, 06:28:03 AMWe are only responsible for our own funds or whatever happens with it but a good exchange must also have a robust security so that it won't be penetrated by hackers easily. ..Now almost any exchange can be hacked, but in this case it is very important how the exchange will react to such theft of coins and at whose expense this loss will be compensated. Two years ago, Binance returned the stolen funds after hacking at the expense of SAFU funds. The KuCoin exchange reacted in a similar way, which also compensated losses to its participants. That's why I chose these cryptocurrency exchanges for trading.Exchange hacks are very common in our modern era with crime and fraud increasing by the day. Alot of people have fall victims of this situation, but we are not to be blame, rather is the exchange that's support to be blame for having a weak security wall. Everyday hackers tries to penetrate and invade exchanges securities but with strong decode walls, many have not succeed on their mission. I'm safely using Binance and it's very important to trust the exchange security you're using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}