{
  "id": "topic_5443681",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "March 06, 2023, 08:36:26 AM",
  "content": "Health is the total well-being of the body system. The cells controls the body from action of organisms and bacteria's, when the cells in your body begins to die then the body system begins to die automatically. Any intake of substance, drugs, food and Herm's have an effects in our body system. This consumption determined the protozoans and cholesterol in the blood cutline and that's control the body system from being healthy or unhealthy.Now many people suffer diseases because of lifestyle, if you're a chain smoker or drugs baron or addicted to ill habitats that are detrimental to your health, you're advice to always see a doctor for counseling and recommendations of anti-dead drugs and substance.For those who Smokes, drugs, herms or any harmful substance goes a long way destructing the heart, livers, intestine and lungs. Sometimes affect our neurons (brains). It can leads to insanity, brain disorder like tumor. It can leads to dehydrogenase, anaemia, skin cancer, sleep apnea, damage lungs. That's why the whites or those who are sensitive and rich always go for checkup, eat good foods and go for holidays treatment to subsidies their system after taking all this substance. Consequently many die of ignorance, lack of money and abuse of drugs and smokes. Some healthy tips but you will pay, lol is a joke!After taking all this substance do the following:* Adjust little by little or reduce the lifestyle* Regular exercise helps burn the products* Drink water regular at least Four bottles a day* Sleep 8-10 hours everyday, at least 2 hours during the day* Eat balance diet I recommend enough banana* Avoid high cholesterol food or gastric.* Go for regular checkup* Avoid hard work, excess sexual activities* Always think of your future These are few things I shared with you, because I wish to see you live long, enjoys sound health and make the work proud of you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443681",
  "comments": [
    {
      "author": "Jet Cash",
      "created_time": "March 06, 2023, 10:23:02 AM",
      "body": "I believe that hard work and an active sex life are fundamental to a long and healthy life.Diet is more important than getting health checks in my opinion. These days doctors and so-called health workers are mainly sales people for the pharma companies. Would you go to a car salesman for an opinion on the mechanical condition of your daily driver?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SosSpagetti",
      "created_time": "March 06, 2023, 11:56:46 AM",
      "body": "Nowadays, a lot of people do all or nothing. When they decide to be fit and start to, e.g., go to the gym, they start a new diet and change their whole lives for this. I see this attitude as being so demotivating. And in short time they will get rid of it and come back to their old habits. I would recommend to all people who would like to be healthy that they slowly change their daily routine. I like the 80/20 rule; for example, when it comes to eating, you don't need to eat 100% healthfully if you want to be fit. Eat something unhealthly from time to time ( or even every day—one cookie). Your mental state is also important. And don't try to change your life the way that it's hard for you. You like to run; great, do it. You don't need to go to the gym or swim. Find your way and take little steps, try to choose better options for yourself. Knowing your choice is important here.\"Hard choices make easy lives,\" as someone once said, and \"Easy Choices make a Hard Life.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Car22",
      "created_time": "March 10, 2023, 04:38:52 PM",
      "body": "Yes ofcourse agree with your viewpoint as there is all activities depends upon your health .IF your health is good you did work well .If you had not good health you do not work well and not to earn money like a healthy person. So your first priority is to maintain good health .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 10, 2023, 09:01:02 PM",
      "body": "Some great advice there OP. I agree if you can’t look after your health then you really will have problems. I took up walking when the pandemic started & there was nothing else to do.I think regular exercise & eating well plus drinking plenty of water is a good starting point for a healthy life.My advice is not to get too obsessed with calorie counting etc but try your best to eat well, exercise & drink water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "March 12, 2023, 06:39:52 AM",
      "body": "My health and wellbeing are important because I want to live long after I retireme. I have seen so many people who have passed that did not put their health number one on their list.  The value of your health is a part of your daily routine. From your daily intake of food and choosing a salad over junk food. Knowing that smoking can give you lung disease or having that daily happy hour can cause over drinking alcohol. Being healthy can reduce diseases and give you a longer and happier life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Car22",
      "created_time": "March 19, 2023, 05:36:08 PM",
      "body": "Yes offcourse our health is very important to us because if our health is good then we do work great and have good input for our work .If we have not good health then our input reduces and we did not earn good money . As it is old saying \" Health is wealth\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "francescoPeruzzi06",
      "created_time": "April 07, 2023, 02:21:39 PM",
      "body": "The tips above your shared are really helpful, from adjusting our lifestyle gradually to getting regular exercise and eating a balanced diet. So, it's all about making small changes that add up to a healthier overall lifestyle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "April 08, 2023, 03:45:03 AM",
      "body": "health is life, so i cant see any reason why we must consider health is not important ,we are the one who must act for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Qiubell5",
      "created_time": "April 10, 2023, 02:16:36 PM",
      "body": "Smoking too much is dangerous for health. especially health is something that really must be maintained. we sometimes get carried away by lust, so we want to do whatever we want. overeating, staying up late, and not exercising. is a bad condition. so we have to fight our bad desires and get used to living healthy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jimboishere",
      "created_time": "April 13, 2023, 02:42:37 PMLast edit: April 20, 2023, 02:16:24 PM by Jimboishere",
      "body": "This is not rocket science folks, all you gotta do is:1) Eat well(just eat good foods and not junk filled with sugar)2) Sleep well(7-8h is baseline for adults, but everyone is different in this regard)3) Exercise(doesn't need to be hardcore(i.e you don't need to run half marathon, even tho in my experience those are pretty fun to prep for - I've done 2 organized by RunUnited so far), just walk a few miles/do some yoga or job lightly anything that you like honestly)That's it. It's THIS easy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smail778",
      "created_time": "April 21, 2023, 08:10:19 PM",
      "body": "the most important thing in our life! we all need a healthy lifestyle) and more water of course",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}