{
  "id": "topic_5462384",
  "title": "DrBeer",
  "author": "DrBeer",
  "created_time": "August 07, 2023, 05:25:06 PM",
  "content": "As you know, on the initiative of the Crown Prince of Saudi Arabia Mohammed bin Salman, a summit was organized in Jeddah. The aim of the issue is to find ways and adopt agreements to stop the terrorist war unleashed by Russia in Ukraine. The summit is attended by :From Europe came representatives from Bulgaria, Britain, Denmark, Estonia, Spain, Italy, Latvia, Lithuania, Netherlands, Germany, Norway, Poland, Romania, Slovakia, Czech Republic, Finland, France, Spain, Sweden and the EU as a union;From the Middle East and Asia - Saudi Arabia, Australia, Bahrain, India, Jordan, Kuwait, Kuwait, Qatar, Union of Comoros, China, Korea, Turkey, Japan;Africa - Egypt, South Africa;North America - Canada and the United States;From South America - Argentina, Brazil, Chile, and the UN as an organization.Russia tried to \"ask\" to the summit, but was expectedly sent on an erotic journey\", which is expected - who will discuss and agree with the criminal on ways to punish him ?!! Before the summit, some invited countries began to openly show their role as \"the Kremlin's lapdog\" and tried to extort an invitation from Russia. The answer was simple - \"either you silently come or do not participate\". Everyone who tried to be hysterical came The results, was adopted UNANIMOUSLY: Territorial integrity of Ukraine ! Diplomats agreed to form working groups on the key topics of President Vladimir Zelensky's 10-point peace formula. This means that the summit reached agreement on respect for Ukraine's territorial integrity and sovereignty, as well as the supremacy of the UN Charter. And now, the 10 points themselves:1. Radiation and nuclear safety;2. Food security;3. Energy security;4. release of all prisoners and deportees;5. Implementation of the UN Charter and restoration of territorial integrity and world order;6. Withdrawal of Russian troops and cessation of hostilities;7. Return of justice, i.e. tribunal for those guilty of aggression and compensation for damages;8. Countering ecocide;9. Security guarantees for Ukraine to prevent escalation;10. Fixing the end of the war.I emphasize that all participants of the summit voted for it, including those who a couple of days ago tried to somehow save the Kremlin idea and their \"face\".Read carefully the 10 points presented, the list of participants - and share your expectations on the development of the situation ? The key nbans is that even his \"friends\" are tired of russia's idiocy and terror. Plus, Saudi Arabia has experience in the 80s when they collapsed the world price of oil, in addition to sanctions against the USSR, which killed that vile under-imperialized empire in literally 10 years. I also assume that this is a great chance for Mohammed bin Salman to shed some unpleasant \"status\". He can go for a \"world deal\" where he will \"pay back\" some of his deeds of the recent past with the right actions, and return as a full-fledged participant of the world community ! Your opinion ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462384",
  "comments": [
    {
      "author": "DrBeer",
      "created_time": "August 08, 2023, 09:23:15 PM",
      "body": "Interesting information, or rather a statement of facts, why China abandoned its \"keeper\" Russia and took part in the summit:1. China bought grain from Ukraine a year before the war for a record 2 years.2. China ate the grain during this time, but the war did not end, Putin did not destroy the AFU as he promised \"in 2-3 weeks\". Apparently with plans to seize agro-resources, including grain3. In China, the largest flood in 140 years has caused an irreparable blow to the economy, and critically - to agriculture and food reserves.4. China faces its biggest famine if Ukraine does not help.Why does China need a raw materials appendage Russia, if it is necessary to solve really important problems with Ukraine?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "August 08, 2023, 09:38:46 PM",
      "body": "Quote from: DrBeer on August 07, 2023, 05:25:06 PMAs you know, on the initiative of the Crown Prince of Saudi Arabia Mohammed bin Salman, a summit was organized in Jeddah. The aim of the issue is to find ways and adopt agreements to stop the terrorist war unleashed by Russia in Ukraine. The summit is attended by :From Europe came representatives from Bulgaria, Britain, Denmark, Estonia, Spain, Italy, Latvia, Lithuania, Netherlands, Germany, Norway, Poland, Romania, Slovakia, Czech Republic, Finland, France, Spain, Sweden and the EU as a union;From the Middle East and Asia - Saudi Arabia, Australia, Bahrain, India, Jordan, Kuwait, Kuwait, Qatar, Union of Comoros, China, Korea, Turkey, Japan;Africa - Egypt, South Africa;North America - Canada and the United States;From South America - Argentina, Brazil, Chile, and the UN as an organization.Russia tried to \"ask\" to the summit, but was expectedly sent on an erotic journey\", which is expected - who will discuss and agree with the criminal on ways to punish him ?!! Before the summit, some invited countries began to openly show their role as \"the Kremlin's lapdog\" and tried to extort an invitation from Russia. The answer was simple - \"either you silently come or do not participate\". Everyone who tried to be hysterical came The results, was adopted UNANIMOUSLY: Territorial integrity of Ukraine ! Diplomats agreed to form working groups on the key topics of President Vladimir Zelensky's 10-point peace formula. This means that the summit reached agreement on respect for Ukraine's territorial integrity and sovereignty, as well as the supremacy of the UN Charter. And now, the 10 points themselves:1. Radiation and nuclear safety;2. Food security;3. Energy security;4. release of all prisoners and deportees;5. Implementation of the UN Charter and restoration of territorial integrity and world order;6. Withdrawal of Russian troops and cessation of hostilities;7. Return of justice, i.e. tribunal for those guilty of aggression and compensation for damages;8. Countering ecocide;9. Security guarantees for Ukraine to prevent escalation;10. Fixing the end of the war.I emphasize that all participants of the summit voted for it, including those who a couple of days ago tried to somehow save the Kremlin idea and their \"face\".Read carefully the 10 points presented, the list of participants - and share your expectations on the development of the situation ? The key nbans is that even his \"friends\" are tired of russia's idiocy and terror. Plus, Saudi Arabia has experience in the 80s when they collapsed the world price of oil, in addition to sanctions against the USSR, which killed that vile under-imperialized empire in literally 10 years. I also assume that this is a great chance for Mohammed bin Salman to shed some unpleasant \"status\". He can go for a \"world deal\" where he will \"pay back\" some of his deeds of the recent past with the right actions, and return as a full-fledged participant of the world community ! Your opinion ?I expect exactly zero to be achieved by any peace initiative conducted by Saudi Arabia. Let's not forget they're currently conducting a war against their neighbor to the south and the Houthi's residing there, maybe they should focus their attention to resolving this war of their own making. Let's also remember that Saudi Arabia contributed to the lowering of dignity worldwide by conducting an assassination of a journalist in their embassy in Turkey, in one of the most barbaric ways possible. They have zero moral high ground and nobody pays them the slightest bit of attention except for the vast reserves of cheap oil they can produce. They have very little in the way of respectable culture and while they are welcome to try for peace, it would be much better if they came out and declared that they are completely against this invasion caused completely by Russia and assist in the sanctions against it, including pressuring the emirates which have become a base for lots of Russian money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "August 09, 2023, 06:57:51 AM",
      "body": "Quote from: Fortify on August 08, 2023, 09:38:46 PMI expect exactly zero to be achieved by any peace initiative conducted by Saudi Arabia. Let's not forget they're currently conducting a war against their neighbor to the south and the Houthi's residing there, maybe they should focus their attention to resolving this war of their own making. Let's also remember that Saudi Arabia contributed to the lowering of dignity worldwide by conducting an assassination of a journalist in their embassy in Turkey, in one of the most barbaric ways possible. They have zero moral high ground and nobody pays them the slightest bit of attention except for the vast reserves of cheap oil they can produce. They have very little in the way of respectable culture and while they are welcome to try for peace, it would be much better if they came out and declared that they are completely against this invasion caused completely by Russia and assist in the sanctions against it, including pressuring the emirates which have become a base for lots of Russian money.I suggest we remember one of the most beautiful projects of Saudi Arabia, during the cold water times, when their joining the fight against the under-imperialized USSR, accelerated the collapse of this pustule on the face of the earth !Regarding \"Let us also remember that Saudi Arabia has contributed to the debasement of dignity around the world by carrying out the murder of a journalist in its embassy in Turkey in one of the most barbaric ways.\" - I agree. But as I said - they have a chance to \"redeem it\", by helping with more evil !You see, that's what happens in life. For example - when treating cancer, use harsh chemotherapy, and other, absolutely not useful solutions, but they help to destroy a more complex problem. The Russian world today is a real cancerous tumor of the modern world, with metastases like DMR, DNR, LNR, Abkhazia, .... Therefore, I think it is acceptable to use \"drugs with side effects\" when fighting such evil",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}